[{"date": "Mar 10, 2024", "text": "I never have to hear about Raid Shadow Legends again!!!!!!!!", "stars": 5}, {"date": "Mar 9, 2024", "text": "Ajay and the community have done a great job with curating the service and making this browser extension a life-saver for viewing videos!", "stars": 5}, {"date": "Mar 8, 2024", "text": "Not working anymore?", "stars": 4}, {"date": "Mar 2, 2024", "text": "Super !!!!", "stars": 5}, {"date": "Feb 22, 2024", "text": "Love using this to skip sponsorships.\nI never have to hear about Raid: Shadow Legends again!", "stars": 5}, {"date": "Feb 21, 2024", "text": "I have been using SponsorBlock for ages now and I love it! It's so seamless that I generally forget I even have it. In fact, the only time and reason I remember about this is when I have to manually skip a sponsor because I didn't have this extension installed on whatever browser I'm in.", "stars": 5}, {"date": "Feb 20, 2024", "text": "just tested this out and it works surprisingly great! the only thing i found was that it could mess up sometimes but it mostly works great and saves time.", "stars": 4}, {"date": "Feb 20, 2024", "text": "Unbelievably good. Like, scarily good. It'll skip sponsors so seamlessly you'll not even realize it's done it. The skip to highlights feature is also awesome. \n\nA must-have for added features.", "stars": 5}, {"date": "Feb 18, 2024", "text": "if you don't have it already. its time", "stars": 5}, {"date": "Feb 17, 2024", "text": "Amazing! I just discovered this and it made my day.", "stars": 5}, {"date": "Feb 14, 2024", "text": "One of the best extensions I use. I've submitted ad skips, and it works like a charm, and if I get to a video late, other users skip the ads for me. 100% 5/5 extension.", "stars": 5}, {"date": "Feb 10, 2024", "text": "Amazing, it's avoiding all the sponsors!", "stars": 5}, {"date": "Feb 10, 2024", "text": "sucks, had to uninstall it to regain my audio", "stars": 1}, {"date": "Feb 9, 2024", "text": "Once I figured out how to edit the settings it started working on all my browsers. But has been down for 18 minutes. My entire life is now over", "stars": 5}, {"date": "Feb 9, 2024", "text": "Goat app. Works well and saves time", "stars": 5}, {"date": "Feb 7, 2024", "text": "It's great while it lasts, but after a while Youtube wont let you watch any more videos until you take it off.", "stars": 3}, {"date": "Feb 7, 2024", "text": "This is so nice because now i can just enjoy videos without any interruptions.", "stars": 4}, {"date": "Feb 6, 2024", "text": "So far so good. It works exactly as described. I wouldn't even have known it was a think if Linus didn't try to circumvent it in a recent video.", "stars": 5}, {"date": "Feb 3, 2024", "text": "There are problems with the application. Now, after submitting the advertising data, a pop-up window appears “confirm the action on the page”, this is very annoying and there is no way to disable it. Because of this, I will no longer send ad flags because this notification minimizes the video if it was opened in full screen.", "stars": 3}, {"date": "Jan 31, 2024", "text": "This is exactly what you need to make YT watchable again. If Unblock is the chocolate, this is the peanut butter to it.", "stars": 5}, {"date": "Jan 31, 2024", "text": "Simply put you need this now, on everything.", "stars": 5}, {"date": "Jan 29, 2024", "text": "Fantastic", "stars": 5}, {"date": "Jan 29, 2024", "text": "Perfect", "stars": 5}, {"date": "Jan 28, 2024", "text": "Does PRECISELY what the app tells you it does. If you aren't a fan of ads, yes, there is alternative ways to prevent them from showing, but having the ability to skim past some less interesting parts of videos, it helps allow me to get a little bit of extra entertainment between things! Cheers for this amazing creation", "stars": 5}, {"date": "Jan 28, 2024", "text": "There's no app that blocks YouTube ads   \nDon't believe the app that says it blocks ads on YouTube", "stars": 1}, {"date": "Jan 28, 2024", "text": "Best creation ever!", "stars": 5}, {"date": "Jan 27, 2024", "text": "Glad I saw some YouTuber talk about this. Could always tell when others were sponsored since they say it clearly. But it's good to know. I have it turned off to skip for now. But I like that I can !! It's amazing how many green symbols you see on LTT, wow. Thanks so much for your time in making this !!", "stars": 5}, {"date": "Jan 23, 2024", "text": "It works really well and I feel spoilt to have this", "stars": 5}, {"date": "Jan 23, 2024", "text": "Not working anymore.", "stars": 3}, {"date": "Jan 22, 2024", "text": "Decided to try this with some of the sponsor-iest videos and it's wild how natural the playback feels, I don't even notice the jump at all when it skips overs something.", "stars": 5}, {"date": "Jan 19, 2024", "text": "Execution is unreasonably amazing. I'm genuinely surprised this works as well as it does.", "stars": 5}, {"date": "Jan 19, 2024", "text": "Such a brilliant extension! Sponsored sections in videos - BE GONE! This extension is becoming a must-have for me. I highly recommend it!", "stars": 5}, {"date": "Jan 18, 2024", "text": "I love this extension! Now I don't have to be interrupted by sponsors!", "stars": 5}, {"date": "Jan 17, 2024", "text": "I know this might be nitpicking, but in the past this extension worked flawlessly on Android browsers (Kiwi, Yandex) but now it doesn't unless Desktop mode is on, which is clearly not the way to enjoy the mobile version of YouTube. Can this be fixed as well, please?", "stars": 5}, {"date": "Jan 16, 2024", "text": "Works great when it does, but rn (as of 1/15/24) the sponsors don't get blocked.", "stars": 4}, {"date": "Jan 16, 2024", "text": "Please Fix IT!!! ❤️🔥", "stars": 5}, {"date": "Jan 15, 2024", "text": "Like the other commenters today - this is the greatest invention on youtube. Unfortunatly the main server has been down for a few hours today. Hopefully they can fix it soon :) :) https://status.sponsor.ajay.app/", "stars": 5}, {"date": "Jan 15, 2024", "text": "This extention is really a good one.but its not working now pleaseee fixxxx", "stars": 5}, {"date": "Jan 15, 2024", "text": "Brilliant extension, but can confirm that it's now getting a Server 504 error and not working.", "stars": 5}, {"date": "Jan 15, 2024", "text": "Stopped working for me as well today. I'm leaving 5 stars because this app has been a literal game changer for years now, I can't in good conscience rate it low because it's not working for one day out of the 500 I've used it for. However I do want to leave a comment just so other people know it's not just you, seems like everybody is having problems.\n\nHopefully this isn't youtube cracking down like they are doing with adblockers.", "stars": 5}, {"date": "Jan 15, 2024", "text": "hey brother I am an old user and confirm that this has stopped working for sure. I tried reinstalling it, tried to use on another laptop but sadly it has stopped working. It shows error 504 \n\nUpdate: It has started working now you can use the extension back now", "stars": 5}, {"date": "Jan 15, 2024", "text": "It used to work before, but currently it's not working; it's not detecting the sponsor segments or highlight segments. (already reinstalled it and its still not working)", "stars": 5}, {"date": "Jan 15, 2024", "text": "top", "stars": 5}, {"date": "Jan 14, 2024", "text": "Great extension, great idea, but recently it doesn't work. When I click on submit nothing happens, it won't save the settings. Also, the extension doesn't allow you to edit your submissions, so if you've made a mistake, you can't correct it.\nIt used to work great a couple of days ago, idk what happened. Until then, 2 stars from me, otherwise it would be 5 since i like the concept and the extension.", "stars": 2}, {"date": "Jan 13, 2024", "text": "So far, so good.  I like the many options they allow you to select. Hopefully YT does not mess with this one.", "stars": 5}, {"date": "Jan 12, 2024", "text": "Currently it works great and I have no issues with the extension. A few days ago for some reason when this extension is enabled it slows my browsing (both chrome and opera gx) and it slows youtube in particular horrendously. After disabling it, both browsing and youtube work great. \n\nI don't want to give it a 1 star review so please be kind and check the issue.", "stars": 5}, {"date": "Jan 10, 2024", "text": "Essential...", "stars": 5}, {"date": "Jan 9, 2024", "text": "I have been getting a screen with a non-video ad with a skip button. usually games. the app is very nice thank you", "stars": 5}, {"date": "Jan 7, 2024", "text": "Great except for the fact that it ALWAYS skips filler/tangent even when i have that setting off.", "stars": 4}, {"date": "Jan 7, 2024", "text": "Best extention ive ever used!", "stars": 5}, {"date": "Jan 5, 2024", "text": "this extension is amazing", "stars": 5}, {"date": "Jan 3, 2024", "text": "Stops working randomly... \n\nEdit:Still not fixed.. then the 1 star is given.", "stars": 1}, {"date": "Jan 1, 2024", "text": "without you we are not premium", "stars": 5}, {"date": "Dec 31, 2023", "text": "Half the time the \"Start segment now\" button doesn't do anything, making it impossible to add any new segments. Please fix this, it's been broken for ages!", "stars": 1}, {"date": "Dec 31, 2023", "text": "nice... very nice work.", "stars": 5}, {"date": "Dec 23, 2023", "text": "This thing is awesome.", "stars": 5}, {"date": "Dec 22, 2023", "text": "epic time saver", "stars": 5}, {"date": "Dec 21, 2023", "text": "baba addon", "stars": 5}, {"date": "Dec 19, 2023", "text": "I personally watch a lot of Youtube, mostly minimized when doing other tasks on my computer. The most annoying thing to me is having someone take 2-3 minutes of my time selling another scam product or service that I will never buy. SponsorBlock has skipped 24 hours of ads over the year or so I've had it installed. Superb! ", "stars": 5}, {"date": "Dec 19, 2023", "text": "This is amazing", "stars": 5}, {"date": "Dec 19, 2023", "text": "extremely helpful and saved me 3 hours and 30 minutes of my life", "stars": 5}, {"date": "Dec 17, 2023", "text": "Love it", "stars": 5}, {"date": "Dec 17, 2023", "text": "best extension ever made  i give a little every now and then", "stars": 5}, {"date": "Dec 15, 2023", "text": "one of the best extensions that I've added, idk how I've made it this far on yt without this", "stars": 5}, {"date": "Dec 14, 2023", "text": "Simply brilliant idea and execution.", "stars": 5}, {"date": "Dec 14, 2023", "text": "Best extension of all time.", "stars": 5}, {"date": "Dec 12, 2023", "text": "I have been using this YouTube ad blocking extension for quite a long time and it does an amazing job. I like that it even detects the in-video self-promotions by content creators and allows you to block those as well. Watching YouTube without this extension sucks.", "stars": 5}, {"date": "Dec 10, 2023", "text": "I have to admit i was a little skeptical about this, than i try it, and forgot about it, I didn't know why my youtube experience improved so much until i switched and realized that this was the key, it actually changed the experience and the overall feeling for the better, in a way you can't understand until you actually try it, so it's definitely a recommended and a mast have addon. Thank you.", "stars": 5}, {"date": "Dec 10, 2023", "text": "the best of the best", "stars": 5}, {"date": "Dec 9, 2023", "text": "Working great! It is a must have!", "stars": 5}, {"date": "Dec 7, 2023", "text": "If automatic skip is enabled, it can trigger the anti-adblock detection on YouTube.", "stars": 5}, {"date": "Dec 6, 2023", "text": "just about died when i read the subscription begging, which is what google is pretty much doing, working fine on the Brave Browser", "stars": 5}, {"date": "Dec 6, 2023", "text": "best ever", "stars": 5}, {"date": "Dec 3, 2023", "text": "Stop AD!", "stars": 5}, {"date": "Dec 3, 2023", "text": "Must have if you want to save time", "stars": 5}, {"date": "Dec 3, 2023", "text": "Must have <3", "stars": 4}, {"date": "Dec 3, 2023", "text": "Does not work. \n\nBaked in sponsors are skipped, but all other ads are still playing.", "stars": 1}, {"date": "Dec 3, 2023", "text": "Thanks for your hard work!", "stars": 5}, {"date": "Nov 30, 2023", "text": "so usefull its a legit life saver 100% get it", "stars": 5}, {"date": "Nov 30, 2023", "text": "I've been using this only somewhat recently but I honestly think I can't go back without this extension, I can't recommend enough to use it.", "stars": 5}, {"date": "Nov 29, 2023", "text": "Works great.", "stars": 5}, {"date": "Nov 29, 2023", "text": "Works great. I have youtube premium but the hosts still want to waste my time even though they're already getting money from me", "stars": 5}, {"date": "Nov 28, 2023", "text": "Wow this works amazingly well with an intuitive interface. Already marked and submitted sponsor segments on a video, which is incredibly satisfying! It's a must have!!", "stars": 5}, {"date": "Nov 28, 2023", "text": "One of the best things the internet has to offer, timesaver more like lifesaver!", "stars": 5}, {"date": "Nov 27, 2023", "text": "absolute bonkers! working like charm and saves me a lot of time!!!!!\nespecially my energy... im not skipping manually anymore lol", "stars": 5}, {"date": "Nov 26, 2023", "text": "Saved a LOT of time", "stars": 5}, {"date": "Nov 23, 2023", "text": "good and great", "stars": 5}, {"date": "Nov 21, 2023", "text": "stopped working for some reason?", "stars": 3}, {"date": "Nov 20, 2023", "text": "Adblockers are not allowed on YouTube.\nSaved so much time.", "stars": 5}, {"date": "Nov 20, 2023", "text": "Love this extension but in randomly stopped working? any fixes?", "stars": 4}, {"date": "Nov 20, 2023", "text": "This hasnt been working for the past few days.  11/20/23", "stars": 5}, {"date": "Nov 19, 2023", "text": "Awesome extension, saving so much time", "stars": 5}, {"date": "Nov 19, 2023", "text": "This extension is a freakin life/time saver for real. Keep up the good work dev!", "stars": 5}, {"date": "Nov 17, 2023", "text": "Saves me so much time W app", "stars": 5}, {"date": "Nov 16, 2023", "text": "Uploaded this today. It doesn't work, still getting the ads. I did have another ad blocker for Youtube I downloaded from the Chrome store but it 's disappeared.\nSomeone please stop these damn ads or I'll stop subscribing to Youtube channels!", "stars": 1}, {"date": "Nov 14, 2023", "text": "essential for yt in 2023", "stars": 5}, {"date": "Nov 13, 2023", "text": "Useful tool. Can't wait to contribute", "stars": 5}, {"date": "Nov 13, 2023", "text": "Great application. I don't know how it works technically, but skipping the placements has enhanced my viewing experience once again. If you could also skip the prompts for subscriptions, comments, and notifications, you could enjoy YouTube again 100%. (translated)", "stars": 5}, {"date": "Nov 12, 2023", "text": "This combined with uBlock is excellent", "stars": 5}, {"date": "Nov 11, 2023", "text": "Great way to block sponsors. Thanks Devs", "stars": 5}, {"date": "Nov 10, 2023", "text": "This is GREAT, Easily one of the \"must have\" extensions, It makes me  so mad that even paying YT premium I have to watch Sponsor ads, not anymore, I also bought deArrow, wich is also great", "stars": 5}, {"date": "Nov 10, 2023", "text": "Must have for youtube, along with ublock", "stars": 5}, {"date": "Nov 10, 2023", "text": "Works great for skipping stupid raid shadow legends sponsors, but sometimes just decides not to work randomly. Like some videos, it auto skips fine, and others it just takes the day off. And yes, I have the settings set to auto skip and sometimes it does or it doesn't skip the same \"type\" of skip.\nRegardless of the minor inconvenience/bugs, 1000% would recommend since I can't harp enough about how annoying integrated sponsor segments of YT videos have become.", "stars": 5}, {"date": "Nov 9, 2023", "text": "Works very well!", "stars": 5}, {"date": "Nov 9, 2023", "text": "Awesome app! Saved me 11 hours of my life so far, and looking forward to saving more with it!", "stars": 5}, {"date": "Nov 7, 2023", "text": "Amazing", "stars": 5}, {"date": "Nov 5, 2023", "text": "i used to love this, but lately, false sponsorblock show up at even the slightest mention of the sponsor.. take the \"PS5 Slim First Look and TEARDOWN!!\" video from LTT. TWO of all the segments marked as sponsor, are actually sponsor, the rest is a slight mention about D-brand(who is not the sponsor of the video) quite some time ago, i asked on the support discord, if it could be disabled somehow, so it would only show the actual sponsored segments(in response to another LTT video, but this on... Show more", "stars": 2}, {"date": "Nov 4, 2023", "text": "one of THE most useful extensions to have !", "stars": 5}, {"date": "Nov 4, 2023", "text": "Perfect! Thanks :)", "stars": 5}, {"date": "Nov 3, 2023", "text": "Chance that this is malware because when i download it and leads to bad websites. Instead of 5 i give this a 3", "stars": 3}, {"date": "Nov 1, 2023", "text": "Love it, thank you", "stars": 5}, {"date": "Nov 1, 2023", "text": "Desember, 1st – quit working. Hope fix soon.", "stars": 5}, {"date": "Nov 1, 2023", "text": "the extension is great, but as many others have said, i am  currently getting the error, A connection error has occurred. Error code: 502.", "stars": 5}, {"date": "Nov 1, 2023", "text": "Hey the Extensionis just awesome but it is not working from a few days . It shows \"A connection error has occurred. Error code: 502\" Can you please resolve this problem so that we can once again use till best tool.", "stars": 5}, {"date": "Nov 1, 2023", "text": "Copying someone else's perfect comment: \"Generally this is a 10/10 extension for me, however with the newest YouTube update it's stopped working properly. I'm simply reviewing as a means of asking for the team to please update the extension as soon as they can, and otherwise to advocate for this fantastic tool for YouTube\"\n\nCurrent errors receiving:\nThe server seems to be overloaded. Try again in a few seconds. Error\nCode 502\nCheck status...\n\nOR\n\nWarning: The server hasn't responded with segm... Show more", "stars": 5}, {"date": "Nov 1, 2023", "text": "This is perfect for skipping any sponsor messages, self promotions, credits, intro animations, and a few other things; Even if a video hasn't been evaluated, I can submit the segments myself!", "stars": 5}, {"date": "Oct 31, 2023", "text": "great work. thanks for sharing", "stars": 5}, {"date": "Oct 30, 2023", "text": "amazing. love it", "stars": 5}, {"date": "Oct 30, 2023", "text": "Make watching YouTube a little more barrable. Tis is amazing", "stars": 5}, {"date": "Oct 25, 2023", "text": "Excellent", "stars": 5}, {"date": "Oct 25, 2023", "text": "Perfect", "stars": 5}, {"date": "Oct 25, 2023", "text": "Simply amazing. Makes YT much more watchable. The only improvements I can think of are to have the option for auto-skip to activate anytime during the segment (I tend to skip around my videos using the arrow keys) because it only activates at the beginning of the segment and for the manual-skip ability to be available throughout the segment (not just in the time after the notice fades). I think that if it worked like Preview/Intermission segments, it would be just a touch more convenient. I j... Show more", "stars": 5}, {"date": "Oct 25, 2023", "text": "Generally this is a 10/10 extension for me, however with the newest YouTube update it's stopped working properly. I'm simply reviewing as a means of asking for the team to please update the extension as soon as they can, and otherwise to advocate for this fantastic tool for YouTube", "stars": 5}, {"date": "Oct 23, 2023", "text": "nothing. what is this ??", "stars": 1}, {"date": "Oct 21, 2023", "text": "I can't use youtube without it now. This is such a nice quality extension for youtube.", "stars": 5}, {"date": "Oct 20, 2023", "text": "A must have addon", "stars": 5}, {"date": "Oct 20, 2023", "text": "This is a no brainer for a developer that watches youtube a lot. Auto skipping sponsored messages saves hours a month worth of time. This should be build in browsers by default. 6 ouf ot 5 stars.", "stars": 5}, {"date": "Oct 20, 2023", "text": "Amazing. The creators I appreciate, I already know how to support them directly. I don't need to listen to them shill because YouTube reduces the rate of return.", "stars": 5}, {"date": "Oct 17, 2023", "text": "This is one of the best add-ons I've ever used, it works. Now I would like them to make an app for Android users, I already have it on my Android TV but it doesn't work on my phone.", "stars": 5}, {"date": "Oct 15, 2023", "text": "Amazing Extension. I love it ♥. This extension literally helps to saves so much time.", "stars": 5}, {"date": "Oct 15, 2023", "text": "Awesome, nice work dev!", "stars": 5}, {"date": "Oct 10, 2023", "text": "This is an amazing extension", "stars": 5}, {"date": "Oct 9, 2023", "text": "Never reviewed an extension before. This so good I had to. Save yourself literal hours of time.", "stars": 5}, {"date": "Oct 8, 2023", "text": "Sadly a must-have to watch videos on YouTube today. You don't have to think about it for even a second, just install it, and it'll take take of itself.", "stars": 5}, {"date": "Oct 6, 2023", "text": "Saved me from countless 1+ minute long embedded ads.", "stars": 5}, {"date": "Oct 4, 2023", "text": "It's very good and saves a lot of times but could you make it togglable for shorts please?", "stars": 5}, {"date": "Oct 3, 2023", "text": "this extension saves so much time its insane", "stars": 5}, {"date": "Oct 2, 2023", "text": "i thought youtube would detect it but no i loved it!!11111", "stars": 5}, {"date": "Sep 30, 2023", "text": "I installed this out of curiosity, and can't live without it now :) Helpful especially on music videos that have sponsor parts", "stars": 5}, {"date": "Sep 29, 2023", "text": "adblock for people who already have adblock", "stars": 5}, {"date": "Sep 24, 2023", "text": "Absolutely amazing\nI would love to contribute but everything I watch already has the sponsors segment set already\nprops to the community for making this happen :) <3", "stars": 5}, {"date": "Sep 24, 2023", "text": "This actually works and I can never go back not using it. Thank you devs frfr", "stars": 5}, {"date": "Sep 23, 2023", "text": "Sponsored by LTT \nthey made me get this \nDont sub to them anymore tho but awesome extension", "stars": 5}, {"date": "Sep 23, 2023", "text": "works great, popular videos have them and u barely even notices that it skips. great time saver", "stars": 5}, {"date": "Sep 23, 2023", "text": "Fundamental to the modern YouTube watching experience.", "stars": 5}, {"date": "Sep 22, 2023", "text": "very useful <3", "stars": 5}, {"date": "Sep 18, 2023", "text": "Wish I found this sooner!  I recommend it to all my friends!", "stars": 5}, {"date": "Sep 17, 2023", "text": "Very nice, thanks for this extension!", "stars": 5}, {"date": "Sep 16, 2023", "text": "Works perfectly.", "stars": 5}, {"date": "Sep 15, 2023", "text": "harika awesome love it", "stars": 5}, {"date": "Sep 15, 2023", "text": "Amazing never going back. When I highlight a sponsor segment I feel like I am saving the world. Together we will work together to block all sponsors while feeling badass. I salute you my brothers may we bring peace to the internet.", "stars": 5}, {"date": "Sep 15, 2023", "text": "First found out about this from the original Vanced Youtube and still using it now with Revanced Youtube. You all the real MVPs. Appreciate your work!", "stars": 5}, {"date": "Sep 14, 2023", "text": "wow, its actually really cool. idk what to say tbh, it skips \"subcribe\"  stuff youtubers say and sponsored adds from youtubers too, which is cool. mr beast stuff gets messed up tho", "stars": 5}, {"date": "Sep 14, 2023", "text": "Seriously, humans getting together and building open source extensions, and then crowdsourcing the data for it to work. Every time I auto skip a sponsor spot, it feels like I'm getting a collective bro-fist from others.", "stars": 5}, {"date": "Sep 13, 2023", "text": "woah guys", "stars": 5}, {"date": "Sep 12, 2023", "text": "amazing how well it works", "stars": 5}, {"date": "Sep 9, 2023", "text": "have been using this for months, one of my absolute favorite extensions especially if you watch a lot of youtubers. one of the only extensions i feel passionately enough about to go back and add a review, makes watching youtube feel divine. love that it has a total time counter as well and that there's markers for when an entire video is sponsored", "stars": 5}, {"date": "Sep 5, 2023", "text": "This app is great! Can't use YouTube without it anymore!", "stars": 5}, {"date": "Sep 5, 2023", "text": "I used to never mind sponsers cuz they were easy to skip, about a minute so just a few right arrow keys, but seeing Anson Belt ads that are hard to find the end of with no transition, and 2 minutes long (minimum) I drew the line.", "stars": 5}, {"date": "Sep 5, 2023", "text": "Phenomenal! I hate it when an ad breaks the immersion of a great video", "stars": 5}, {"date": "Sep 3, 2023", "text": "I dont know what would I ever do if this didnt existed", "stars": 5}, {"date": "Aug 30, 2023", "text": "It has saved me a lot of time", "stars": 5}, {"date": "Aug 30, 2023", "text": "Perfect", "stars": 5}, {"date": "Aug 30, 2023", "text": "get it its op", "stars": 5}, {"date": "Aug 28, 2023", "text": "I love this extension.", "stars": 5}, {"date": "Aug 28, 2023", "text": "This extension works glad to not hear about world of tanks and Raid Shadow Legends thank you !!!", "stars": 5}, {"date": "Aug 28, 2023", "text": "This add on is just amazing?!?? I have no idea how it works so well but dang, as long as it does!", "stars": 5}, {"date": "Aug 27, 2023", "text": "This is the greatest extension known to mankind. I could not possibly imagine returning to the plebian YouTube experience. \n\nShoutout to the userbase as well, every time I watch a brand new video I am excited to submit a segment, and every time somebody has already done it.\n\n Bravo on all fronts.", "stars": 5}, {"date": "Aug 26, 2023", "text": "I'd give it 4.5/5 if I could, cause it doesn't always skip everything that should be skipped, but it is a fantastic highly recommended extension.", "stars": 5}, {"date": "Aug 24, 2023", "text": "i love this extension. does a great job and it really is a well-designed app.", "stars": 5}, {"date": "Aug 22, 2023", "text": "its great, with a big community of people blocking sponsors, makes you wanna be the one to make the segment", "stars": 5}, {"date": "Aug 20, 2023", "text": "best ad blocker, life saver.", "stars": 5}, {"date": "Aug 19, 2023", "text": "W extension", "stars": 5}, {"date": "Aug 17, 2023", "text": "I don't normally write reviews but it's hard not to when an extension consistently saves you time. I find myself wanting to create new segments for videos where there are not any just to contribute. No more awkward advertisement transitions.", "stars": 5}, {"date": "Aug 15, 2023", "text": "Very useful for getting rid of pesky sponsorships.", "stars": 5}, {"date": "Aug 14, 2023", "text": "works stunningly well. one of the best extensions i use on youtube. can't imagine youtube without it and actually makes youtube bearable now. make sure to adjust your settings to your preference for the best result.", "stars": 5}, {"date": "Aug 14, 2023", "text": "Amazing", "stars": 5}, {"date": "Aug 12, 2023", "text": "Wonderful. I wouldn't watch youtube without it anymore.", "stars": 5}, {"date": "Aug 11, 2023", "text": "I can't imagine going back to the time when this awesomeness didn't exist!", "stars": 5}, {"date": "Aug 11, 2023", "text": "It's like the concept of sponsors never existed! though, i'm worried that some sponsors have content of the video blended in. Good extension overall!", "stars": 4}, {"date": "Aug 9, 2023", "text": "Blew my mind how easy this is to use, how much time it saves, and how much time my contributions have saved other people.", "stars": 5}, {"date": "Aug 8, 2023", "text": "Favorite Chrome extension along with uBlock. Game-changer while watching youtube.", "stars": 5}, {"date": "Aug 5, 2023", "text": "Best thing on here....Can't even count how often it gets used, or the amount of times I've submitted info for skips for others to use.\n\n(update)...you can see how much you've used/submitted lol....\n\n\"You've saved people from 1,004 segments\n( 7h 28.3 minutes of their lives )\"", "stars": 5}, {"date": "Aug 5, 2023", "text": "Works wonderfully, when it loads. Often it seems to forget to load in, requiring a refresh. When there are no sections, I'm able to create them as needed, so no issue there. But it also often forgets to skip sections it does have, again, requiring a refresh. I just wish it loaded in a bit better.", "stars": 5}, {"date": "Aug 4, 2023", "text": "Good actually works on most videos which is surprising  download", "stars": 5}, {"date": "Aug 4, 2023", "text": "Thank you for the fix. I love you for actually updating your extension when it stops working.", "stars": 5}, {"date": "Aug 2, 2023", "text": "its so good i saved like a year of my life literally using this", "stars": 5}, {"date": "Aug 2, 2023", "text": "Amazing, truly the best extension I've ever used. So glad so many people use this as there is hardly ever an instance of a video without user submitted segments. Have recommended this to multiple friends and family members IRL.", "stars": 5}, {"date": "Aug 1, 2023", "text": "This was amazing. Now it doesn't work at all. It will not let me submit sections and sections aren't being skipped. I have went back to videos I know it worked on to check this and yeah it's not doing anything.", "stars": 3}, {"date": "Jul 29, 2023", "text": "This extension is awesome and saves a lot of time when watching videos- when it works. A lot of the time, actually, settings other than sponserblock don't even block parts of the video I want skipped, like self promotion or interaction reminders. Sometimes it'll miss sponsors as well, although very rare. I don't know how it finds which is which but it messes up a lot, especially with specific channels which is the only reason I'm not giving it 5 stars.", "stars": 3}, {"date": "Jul 28, 2023", "text": "I rarely comment/leave review on extensions. The extension default settings are very useless, so the first thing you need to do is mess with them BUT once you do that this extensions works and it works so well its incredible, honestly just downloaded about 2 weeks ago, and it already made my top 5. It took some of those extentions years to climb up my list to get there. . Top 5 extensions for me: 1. ublock origin, 2 sponsor block 3. superdark mode 4.keepa 5. fakespot", "stars": 5}, {"date": "Jul 26, 2023", "text": "It's magic. Perfect score, best extension I've ever used.", "stars": 5}, {"date": "Jul 25, 2023", "text": "one of the best inventions ever, just after adblock for youtube lol :D", "stars": 5}, {"date": "Jul 20, 2023", "text": "Holy cow this actually works! I just checked three youtubers I watch that hock energy drinks at the beginning of their videos and this extension skipped right over that bit perfectly. You're a gentleman and a scholar dev!", "stars": 5}, {"date": "Jul 20, 2023", "text": "Incredible. The hotkeys for unskipping ads that I may extremely rarely want to check out is a nice touch too. Simple, seemless, super effective. Set and forget. It literally saves the youtube experience for me because I listen to most content away from my computer.", "stars": 5}, {"date": "Jul 19, 2023", "text": "Absolutely amazing extension, works like a charm. Also, love the shortcuts, wish there were more so I could just use the keyboard for everything. No complains from my part 👍", "stars": 5}, {"date": "Jul 18, 2023", "text": "I can not remember the last time I reviewed a extension but this one works flawlessly and does everything I want. Even on new uploads it still does it what it is supposed to.", "stars": 5}, {"date": "Jul 17, 2023", "text": "Easily one of the best extensions I use. This + uBlock origin is the bomb. The power of crowd-sourcing is amazing.", "stars": 5}, {"date": "Jul 17, 2023", "text": "One of the must haves!", "stars": 5}, {"date": "Jul 17, 2023", "text": "Great extension, i don't have to manually skip things nobody cares about.", "stars": 5}, {"date": "Jul 16, 2023", "text": "A hidden gem. A must have.", "stars": 5}, {"date": "Jul 16, 2023", "text": "Amazing", "stars": 5}, {"date": "Jul 13, 2023", "text": "Awesome tool! Also fairly good UI for submissions. Kudos!", "stars": 5}, {"date": "Jul 12, 2023", "text": "Excelent extension!", "stars": 5}, {"date": "Jul 12, 2023", "text": "Honetly the best extension i have it is super useful", "stars": 5}, {"date": "Jul 11, 2023", "text": "What a relief to get rid of the annoying interruptions. Thank you Ajay!", "stars": 5}, {"date": "Jul 10, 2023", "text": "This extension is amazing! It's definitely a must have you spend a lot of time on YouTube", "stars": 5}, {"date": "Jul 8, 2023", "text": "Best extension on the entire chrome store", "stars": 5}, {"date": "Jul 7, 2023", "text": "Best extension for youtube, by far!", "stars": 5}, {"date": "Jul 5, 2023", "text": "doesn't block anything for me I may be doing something wrong have no idea", "stars": 1}, {"date": "Jun 27, 2023", "text": "Fantastic, but likes to crash edge. There was an issue with this a few months back and I had to disable this extension- enabled it after the dev said it was fixed, and it worked great for awhile. Broken again tho- please fix!", "stars": 5}, {"date": "Jun 27, 2023", "text": "Causes black flashing artifacts to appear when playing videos. Windows 11, Microsoft Edge 117.0.2045.31, RTX 3050 laptop", "stars": 5}, {"date": "Jun 26, 2023", "text": "great extension, works flawlessly.", "stars": 5}, {"date": "Jun 25, 2023", "text": "USEFUL but currently broken", "stars": 3}, {"date": "Jun 23, 2023", "text": "Opening a video in a tab or window makes the page unresponsive.\n\nEdit: It seems to be caused by a different extension as pointed out by Ajay.", "stars": 5}, {"date": "Jun 20, 2023", "text": "Very easy to use and very handy", "stars": 5}, {"date": "Jun 18, 2023", "text": "this is a brilliant extension, must have for everyone", "stars": 5}, {"date": "Jun 18, 2023", "text": "Man I really love this extension, Very useful and I love how he jumps directly on the part when the sponsor ended I highly recommend this extension to everyone who doesn't like watching video sponsor!", "stars": 5}, {"date": "Jun 14, 2023", "text": "makes using this website a little less painful.", "stars": 5}, {"date": "Jun 13, 2023", "text": "best", "stars": 5}, {"date": "Jun 12, 2023", "text": "I hate when it cleanly misses paid sponsorships! Yup, just plays smoothly through the green part of the bar. Nice!", "stars": 1}, {"date": "Jun 11, 2023", "text": "Love it, please support ajay. I think 13 active users causing a lot of server costs!", "stars": 5}, {"date": "Jun 10, 2023", "text": "This is a VERY good and unique extension and I really love it, but it does need some fixing because sometimes it just doesnt work or simply mutes the sponsor instead of skipping it. But thank you for making this anyway, I'm very happy it exists!", "stars": 4}, {"date": "May 31, 2023", "text": "Amazing features auto skips sponsors and if you go into the settings you can skip self/unpaid promos, had for like a year or so and have saved 10 hours using this and have skipped 1,299 segments.", "stars": 5}, {"date": "May 29, 2023", "text": "This is awesome. at first it wasn't working but restarted youtube and it starting working, so im happy  now i don't have to be bothered with people mentioning sponsor's all i can say is thanks. This extension is great, never thought you could skip those sponsor stuff people always mentions just for money", "stars": 5}, {"date": "May 29, 2023", "text": "I disabled the buttons but it would be nice to use them. At the very least add a secondary optional place for the buttons, perhaps above, in between the search box and the player... As is, the current position adds too much clutter to the player ui and interferes with normal operation.", "stars": 3}, {"date": "May 22, 2023", "text": "This is the greatest invention in human civilization", "stars": 5}, {"date": "May 20, 2023", "text": "Almost every youtube video has a sponsor now... This extension greatly improves the youtube viewing experience", "stars": 5}, {"date": "May 19, 2023", "text": "Great extension, though recently has been the source of my youtube videos 'lagging' when clicking play or switching tabs. It was driving me nuts until I disabled it and my videos worked fine and were nice and responsive. Great extension, but not sure what's happening with this. It seems to be a very sporadic thing.", "stars": 4}, {"date": "May 18, 2023", "text": "It works really well, and I was genuinely surprised by how seamless it is. I had forgot I installed it for a while, because it was skipping sponsorships without me even noticing.", "stars": 5}, {"date": "May 16, 2023", "text": "sometimes i'm unable to submit a segment, but eventually someone else will do it and it works great. so happy i discovered this extension i've been using it for ages :)", "stars": 5}, {"date": "May 15, 2023", "text": "Recently, I began to be unable to submit new submissions to ajay.sb - and a couple days ago, the extension stopped skipping. I'm not sure if it's something on my end, or might be related to some recent changes announced by YouTube but figured I'd leave a message.\n\nOther than that, this is the best extension for Chrome you can get. Awesome support from Ajay. He rocks.", "stars": 5}, {"date": "May 14, 2023", "text": "Ambiguous controls - I can't tell if [ Disable ] disables the filter or disables what the filter is intended to disable.  I'd recommend the programmers show us a sample YouTube video display and toggle the effect of changing the filter controls so we can see what the controls actually do.", "stars": 3}, {"date": "May 13, 2023", "text": "Works as advertised.", "stars": 5}, {"date": "May 12, 2023", "text": "Awesome. Works without issues, very easy to use both when watching and when submitting segments. :)", "stars": 5}, {"date": "May 12, 2023", "text": "Awesome ❤", "stars": 5}, {"date": "May 9, 2023", "text": "I have the new YouTube ui and sometimes the sponsor block doesent always work its only happening since the new ui", "stars": 4}, {"date": "May 8, 2023", "text": "good but when i was watching t3rror it skips a expatiation of scratch can you fix it plz", "stars": 4}, {"date": "May 6, 2023", "text": "This is an amazing extension that can replace YouTube Premium subscription! Despite being backed by community, everyone plays a part to help removing sponsorship video segments as much as possible to save each other's watching time. Thanks Ajay for creating this extension for us! I would rate 5-star if the extension gets a better UI design.", "stars": 4}, {"date": "May 6, 2023", "text": "Very good i use this Because i have youtube prenium and i feel like we should be abled to skip sponcers thats why i have this extention!", "stars": 5}, {"date": "May 6, 2023", "text": "Awesome. Hundreds of hours of my life has been saved. To the developers and people who create the submissions, I wanted to let you know that you've been making a positive difference in all our lives' so we can focus on things that matter to us, rather than wasting hundreds or even thousands of hours watching ads. Little by little, it all adds up.\n\nThank you.", "stars": 5}, {"date": "May 1, 2023", "text": "A must-to-have if you want to save your time and sh.it on youtube.", "stars": 5}, {"date": "May 1, 2023", "text": "this extension is useless, it does not work, the sponsor skip feature is not working and the highlight feature is not working and all the features dont work, please fix this", "stars": 1}, {"date": "Apr 30, 2023", "text": "Best extension ever! Especially if your tired of the same sponsors", "stars": 5}, {"date": "Apr 29, 2023", "text": "Really makes youtube a much more streamlined and to the point experience. Wonderful.", "stars": 5}, {"date": "Apr 28, 2023", "text": "Hi, I find the problem. I can mark the chapters to upload but I can't edit them. I can't click part edit button. It doesn't work. I clicked but nothing happens. Can you help me? Chapters to be skipped do not show up in color, they are as if invisible. I use Windows 10 and browser Brave. It was working before but now it's not working anymore.", "stars": 3}, {"date": "Apr 27, 2023", "text": "The best thing since AdBlock", "stars": 5}, {"date": "Apr 27, 2023", "text": "it ok", "stars": 2}, {"date": "Apr 23, 2023", "text": "first review ever, fantastic add-in", "stars": 5}, {"date": "Apr 22, 2023", "text": "Excellent !", "stars": 5}, {"date": "Apr 20, 2023", "text": "Truly the greatest extension ever made, no more are shameless ads and 10 minute videos just to have a five second conclusion", "stars": 5}, {"date": "Apr 14, 2023", "text": "Thanks I'm Now Ad Free", "stars": 5}, {"date": "Apr 12, 2023", "text": "Where has this been all my life?", "stars": 5}, {"date": "Apr 7, 2023", "text": "This is absolutely god-sent. This works so bloody freaking well and it's actually fun that, I myself, can contribute to \"mark\" the parts of commercial or intros so that other people with this add-on don't have to watch.\n\nSponsorBlock works WONDERS on my Android which I have Youtube Revanced. Sponsorblock seems to be built in bus has to be activated in the settings to be able to contribute when you've found a video where it doesn't skip commercials.\n\nLove this app to the moon and back ❤", "stars": 5}, {"date": "Apr 2, 2023", "text": "In todays bloated version of YT ... it's one of the undenieable essentials.", "stars": 5}, {"date": "Apr 2, 2023", "text": "Doesn't work on Chromebook with Chrome OS :(", "stars": 1}, {"date": "Mar 28, 2023", "text": "improve your life", "stars": 5}, {"date": "Mar 23, 2023", "text": "Very good !", "stars": 5}, {"date": "Mar 23, 2023", "text": "Great time saver", "stars": 5}, {"date": "Mar 19, 2023", "text": "It works perfectly normally but it self destructs itself on Mark Rober videos by randomly marking things as sponsors and self promotions.", "stars": 4}, {"date": "Mar 16, 2023", "text": "i really wish i could block certain users. while it's amazing that i can automatically skip large sponsor blocks, it's really annoying when people use sponsorblock to mark really short section when the name of a sponsor was mentioned. someone does this with LTT videos and it turns them into an unenjoyable choppy mess. i also think sponsorblock can be abused to falsely cut up videos like the that. yes you can downvote individual sections, but the same user's cuts are just going to show up in t... Show more", "stars": 4}, {"date": "Mar 15, 2023", "text": "its good when using it on linus tech tips vids", "stars": 5}, {"date": "Mar 9, 2023", "text": "Gets the job done", "stars": 5}, {"date": "Mar 8, 2023", "text": "It is just amazing!", "stars": 5}, {"date": "Mar 8, 2023", "text": "Best extension on the entire chrome extensions catalog. Not just the YouTube ones, all of them.", "stars": 5}, {"date": "Mar 7, 2023", "text": "Best extension, however YouTube Shorts can't be played totally when this extension is on", "stars": 4}, {"date": "Mar 5, 2023", "text": "It's an interesting extension. It requires a lot of customizations, can be complex, and most of the features you would want to use aren't automatic and needs your manual intervention. For instance, there are sponsorship (ads) imbedded in a YT video. This extension will identify it (but not skip even though you set it in the options). You must stop the video, click on the Extension icon, find the offending sponsorship portion, and manually select it, then choose \"hide\" the sponsorship part of ... Show more", "stars": 2}, {"date": "Mar 4, 2023", "text": "Best extension", "stars": 5}, {"date": "Mar 4, 2023", "text": "This is what humanity want in the internet, thanks you", "stars": 5}, {"date": "Mar 4, 2023", "text": "Thank you so much, no longer will I have to spam the right arrow key whenever I hear a sponsorship.", "stars": 5}, {"date": "Mar 2, 2023", "text": "Thanks! Works perfect! 3 Minutes of Aviation with 20 sec intro/outro everytime are skipped perfectly! :)", "stars": 5}, {"date": "Mar 2, 2023", "text": "Video detection is rigged. Not using and hasn't been fixed a year later.", "stars": 1}, {"date": "Mar 1, 2023", "text": "works well on alot of videos. atleast 80% of videos on yt with sponsors will work with this amazing extension", "stars": 5}, {"date": "Feb 28, 2023", "text": "Amazing extension", "stars": 5}, {"date": "Feb 19, 2023", "text": "I can watch those Linus Tech Tips videos with their sponsor block being automatically being skipped. Incredible extension.", "stars": 5}, {"date": "Feb 16, 2023", "text": "Best extension ever!! Right up there with adblock extension!!", "stars": 5}, {"date": "Feb 14, 2023", "text": "Amazing", "stars": 5}, {"date": "Feb 11, 2023", "text": "it works and does everything it is designed for, i havent experienced any bugs or errors. Very good extension, worth installing.", "stars": 5}, {"date": "Feb 11, 2023", "text": "This app and it's interface with the community improving user experience for YT is simply amazing! I found it by accident, I didn't actually think there would be a way to block ads in the videos much less the stupid call to act and basically everything else that has gotten to be the norm. People advertise even when they are wildly financially successful and that is ridiculous. Thank you so much! 5 stars all day every day. So well done and easy to submit if it hasn't already been done.", "stars": 5}, {"date": "Feb 11, 2023", "text": "best", "stars": 5}, {"date": "Feb 10, 2023", "text": "You're wasting time NOT having this extension.", "stars": 5}, {"date": "Feb 10, 2023", "text": "this extension is a very good idea however my experiences with the moderation team and community have been fairly toxic and I believe makes the product much worse than it could be", "stars": 1}, {"date": "Feb 3, 2023", "text": "One of the greatest inventions of our time.", "stars": 5}, {"date": "Feb 3, 2023", "text": "Wish it had a \"Helper\" area that shows if your segments you submit are actually being skipped by other people or not", "stars": 5}, {"date": "Jan 25, 2023", "text": "Thankfully I will never see another \"Raid Shadow Legends\" advert.", "stars": 5}, {"date": "Jan 25, 2023", "text": "i haven't seen this kind of ad blocker before and it is very useful and i have ran into no problems", "stars": 5}, {"date": "Jan 22, 2023", "text": "Love it!", "stars": 5}, {"date": "Jan 22, 2023", "text": "It actually does everything it says it will do. Very good extension, definatelly worth installing.", "stars": 5}, {"date": "Jan 22, 2023", "text": "Incredibly helpful", "stars": 5}, {"date": "Jan 21, 2023", "text": "like it, but having issues in shorts", "stars": 4}, {"date": "Jan 20, 2023", "text": "works amazingly well..", "stars": 5}, {"date": "Jan 19, 2023", "text": "Greatly improves the YouTube user experience.  Better than most commercial software.", "stars": 5}, {"date": "Jan 18, 2023", "text": "Marvelous", "stars": 5}, {"date": "Jan 18, 2023", "text": "Incredibly useful. Annoying sponsorships will haunt my viewing experience no more.", "stars": 5}, {"date": "Jan 17, 2023", "text": "absolutely ESSENTIAL extension. I use it in conjunction with \"AdBlock\" and \"Adguard\", two very good ad blockers. Also \"YouTube nonstop\", \"return youtube dislike\" \"unhook\" and \"no youtube shorts\". Makes for the perfect YouTube experience.", "stars": 5}, {"date": "Jan 14, 2023", "text": "I'm so over YouTubers talking about different men's razors, VPN software, website-building services, wallets, meal delivery services, and other products. It is quite annoying that the same corporations are usually involved. Even after paying for YT Premium, I am made to listen to this drivel over and over and over and over again. Urghh. This addon is incredible. I feel as though I've returned to the good ol' early days of YouTube, when nobody was attempting to become wealthy. Without a VPN, I... Show more", "stars": 5}, {"date": "Jan 12, 2023", "text": "not a single problem with it.", "stars": 5}, {"date": "Dec 31, 2022", "text": "It works sometimes but what happened to the controls on the YouTube videos to submit segments that havent been submitted yet? I dont see those controls anymore. It would also be useful to have a report abuse button for videos where people submit segments like every 10-15 seconds on the video for things that they find controversial instead of being actual sponsors.", "stars": 4}, {"date": "Dec 27, 2022", "text": "best thing ever run this and adblock smoothest YouTube ive ever had", "stars": 5}, {"date": "Dec 26, 2022", "text": "Thanks a lot guys. You are great !", "stars": 5}, {"date": "Dec 26, 2022", "text": "The present augmentation bestowed upon us, with its inherent functional versatility and substantial efficacy, transcends the realms of mere convenience, beckoning us into a profound state of experiential enrichment and operational optimization.", "stars": 5}, {"date": "Dec 26, 2022", "text": "Community driven extension. Saves so much time. No more in video distractions! Thank u so much.", "stars": 5}, {"date": "Dec 24, 2022", "text": "This works so well that I don't even know how it works so well.\nIt's really handy and nice and convenient.\n\nThis is one of the best things I've found in a while. So nice to have.", "stars": 5}, {"date": "Dec 21, 2022", "text": "I wish I had known this sooner", "stars": 5}, {"date": "Dec 21, 2022", "text": "best", "stars": 5}, {"date": "Dec 20, 2022", "text": "One of the essentials for anybody who spends an elevated amount of time on Youtube.", "stars": 5}, {"date": "Dec 12, 2022", "text": "Probably the best extension on YouTube. Fantastic community and premise.", "stars": 5}, {"date": "Dec 12, 2022", "text": "great", "stars": 5}, {"date": "Dec 7, 2022", "text": "works perfectly", "stars": 5}, {"date": "Dec 7, 2022", "text": "Easy 5 star. Extension is a huge live saver, even if you have premium. 200% worth getting.", "stars": 5}, {"date": "Dec 5, 2022", "text": "its good but unfortunately often there are server issues. that way the segments won't be loaded and you can't send segments yourself. Essentially you can't use the extension then...", "stars": 3}, {"date": "Dec 2, 2022", "text": "Excellent idea, working well very good job", "stars": 5}, {"date": "Dec 1, 2022", "text": "God i hate ads and this is a godsend fr", "stars": 5}, {"date": "Nov 30, 2022", "text": "Sponsors are awful, generic youtuber filler is awful, getting to skip those is amazing. Now we just need an addon that auto-downvotes videos with any amount of \"sponsor\" content in it.", "stars": 5}, {"date": "Nov 29, 2022", "text": "Works really well and most transitions are seamless and detects almost all sponsors, makes watching Linus Tech Tips very enjoyable", "stars": 5}, {"date": "Nov 22, 2022", "text": "Works like a charm and every video seems to have already gotten analyzed.", "stars": 5}, {"date": "Nov 21, 2022", "text": "Servers crash very often", "stars": 4}, {"date": "Nov 21, 2022", "text": "It WAS a good app and worked correctly, now it will slow your YouTube tab to the point of breaking the entire video and tab itself. Clearly not enough maintenance and until a good update, DO NOT DOWNLOAD.", "stars": 2}, {"date": "Nov 18, 2022", "text": "It's 5 stars for now. I got used to  those options in YT Vanced.\n\nThe problem is, it works, than doesn't. It worked on a couple of videos, than it stopped. Not skipping anything, no colors on a search bar. I tried with the same video that I watched, choosing it from watching history, to be sure that it's not some copy of that video. I restarted browser, still nothing.\n\nMaybe it works out. I don't know. Same thing happened to me with Vanced for a couple of times. Lost functionality for a day, ... Show more", "stars": 5}, {"date": "Nov 18, 2022", "text": "Doesn't work. Can not communicate with the block list server. Only returns an error", "stars": 2}, {"date": "Nov 18, 2022", "text": "It randomly opens a new tab to a facebook post by Google Chrome", "stars": 1}, {"date": "Nov 14, 2022", "text": "pls figure out the 502 error thing cause this extension is really helpful for skipping sponsored segments in podcast videos", "stars": 5}, {"date": "Nov 14, 2022", "text": "cool extensions mate, hope it works long", "stars": 5}, {"date": "Nov 13, 2022", "text": "I give up \n\nThe servers go down at least 3 times a week for several hours. I'm sick of this. what's the point in supporting a service that's offline every time i go to use YouTube. \n\nThis used to be a good service. I couldn't stand YouTube with all the ads and sponsors, and adblock and Sponsorblock made YouTube more useable. But not now. I'm done with this extension and i'm done with YouTube. I gave you 2 months to fix this bs and you didn't.", "stars": 1}, {"date": "Nov 13, 2022", "text": "If you want to submit a segment, don't expect it to go through as there's been continuous server outages since October. I'd still recommend it if you're just here to skip sponsors.", "stars": 3}, {"date": "Nov 13, 2022", "text": "Even with the server issues it still works most of the time . 👌", "stars": 5}, {"date": "Nov 12, 2022", "text": "Great sponsor blocker however the consistent server issues is kind of disappointing other than that I love it", "stars": 4}, {"date": "Nov 12, 2022", "text": "Worked really well, although for the last few weeks there has been major server issues. https://status.sponsor.ajay.app/", "stars": 3}, {"date": "Nov 12, 2022", "text": "Stopped working. Gives error when trying to block sponsors!!!!!!!!!!!!!!", "stars": 1}, {"date": "Nov 11, 2022", "text": "Server issues from 2022 seems to be over and this has been working brilliantly for a long time now. Great to see practically all videos have annotations. Highly recommended.", "stars": 5}, {"date": "Nov 11, 2022", "text": "Sponsorblock is literally the best thing since AdBlock. Now if they could just keep their servers up more often lol", "stars": 5}, {"date": "Nov 10, 2022", "text": "Top essential in category = (QOL) Quality Of Life. Take it and save your sanity pills.", "stars": 5}, {"date": "Nov 9, 2022", "text": "Raid Shadow Legends can no longer \"raid\" my videos and bring on a \"legendary shadow\" upon my life.", "stars": 5}, {"date": "Nov 8, 2022", "text": "get it", "stars": 5}, {"date": "Nov 7, 2022", "text": "this and adblock saves my sanity, thanks", "stars": 5}, {"date": "Nov 7, 2022", "text": "this man is doing the lords work. good job.", "stars": 5}, {"date": "Nov 5, 2022", "text": "This is a great browser add-on. I don't know who created it, but respect to him", "stars": 5}, {"date": "Nov 3, 2022", "text": "Man I love it, but I haven't been able to post skips or even have anything skip for the last week it seems. Idk what is going on, but you guys need to fix it please! *As others have said - if it's a money thing, throw up a donation link and I'll happily donate to get this thing working again. Obviously, don't make one if that is not the problem, but I've had more than a few dollars worth of value out of this thing and I will give it back!", "stars": 5}, {"date": "Nov 2, 2022", "text": "Servers are very unreliable, YouTube is completely unwatchable when the servers are down", "stars": 2}, {"date": "Nov 2, 2022", "text": "When's the server coming back up?", "stars": 3}, {"date": "Nov 1, 2022", "text": "to the devs, thanks for making such an awesome software. If you are having money issues, you can open a donation and I will donate some.", "stars": 5}, {"date": "Oct 29, 2022", "text": "Been using it for a couple of years now. Fantastic extension, highly recommended, I hope it lasts as long as the Internet does.", "stars": 5}, {"date": "Oct 28, 2022", "text": "I love this extension, however since I've downloaded it I have this really annoying glitch where audio from multiple videos play on one video. I can fix it by hitting the back button once or twice, but it's still super disrupting. If this issue can be fixed I'd gladly change my review to 5 stars easy!", "stars": 3}, {"date": "Oct 27, 2022", "text": "Great extension. Really liked it in the past. Now the servers are down most of the time. Needs fixing asap", "stars": 2}, {"date": "Oct 27, 2022", "text": "It was a good extension, but lately it doesn't work most of the time. Constant server errors. Can we at least know when it will be fixed, because there is no information about it on the official site?", "stars": 3}, {"date": "Oct 26, 2022", "text": "So insanely good it is beautiful.", "stars": 5}, {"date": "Oct 25, 2022", "text": "Constant server issues. Pretty much useless.", "stars": 3}, {"date": "Oct 25, 2022", "text": "Stopped working. Hasn't worked in about a week.", "stars": 3}, {"date": "Oct 25, 2022", "text": "Connection Error 502 on PC last 3 days (chrome and firefox)\nBut on the phone (Vanced) it still works fine.", "stars": 2}, {"date": "Oct 24, 2022", "text": "the extension is great... when it works; servers have been down for the last day or so; no update from the creator", "stars": 1}, {"date": "Oct 24, 2022", "text": "Doesn't work at all", "stars": 1}, {"date": "Oct 24, 2022", "text": "Doesn't work...", "stars": 1}, {"date": "Oct 24, 2022", "text": "I really like when I'm not too fast to watch video and someone already managed to mark the sponsor part :D Really nice community!", "stars": 5}, {"date": "Oct 23, 2022", "text": "No longer works", "stars": 1}, {"date": "Oct 23, 2022", "text": "Works great, only if server issues werent such a huge pain. But I believe in the dev, so giving it 5 stars", "stars": 5}, {"date": "Oct 23, 2022", "text": "No longer works", "stars": 2}, {"date": "Oct 23, 2022", "text": "not working error code 404, 503", "stars": 5}, {"date": "Oct 23, 2022", "text": "Amazing in concept, but doesn't work 90% of the time anymore due to server errors.", "stars": 2}, {"date": "Oct 22, 2022", "text": "works great. not compatible with enhancer for youtube afaik. :/", "stars": 5}, {"date": "Oct 20, 2022", "text": "A must have extentension these days with youtubers merging their unnecesary sponsorships in their videos (looking at you Linus Sebsatian) that not only waste your time, but also your watching experience.", "stars": 5}, {"date": "Oct 20, 2022", "text": "Give the devleoper a medal", "stars": 5}, {"date": "Oct 20, 2022", "text": "Great app but constant server connection issues hinder the experience a lot.", "stars": 3}, {"date": "Oct 20, 2022", "text": "You sir are a mad man! I love it.,", "stars": 5}, {"date": "Oct 19, 2022", "text": "it was good but is now unreliable and always has a stupid connection error.", "stars": 2}, {"date": "Oct 19, 2022", "text": "Enhancer and sponsorblock are the best extensions for youtube web", "stars": 5}, {"date": "Oct 18, 2022", "text": "Simply awesome.\nThanks a lot for your hard work.", "stars": 5}, {"date": "Oct 15, 2022", "text": "Very useful and Excellent Extension ❤", "stars": 5}, {"date": "Oct 15, 2022", "text": "Massive user experience improvement for youtube, share it with friends", "stars": 5}, {"date": "Oct 14, 2022", "text": "youtube should come with this built in", "stars": 4}, {"date": "Oct 12, 2022", "text": "I am so sick and tired hearing YouTubers wh**ring themselves out to various mens razors, VPN apps, web building services, wallets, food delivery services etc. It is always the same companies and it is incredibly irritating. Over and over and over and over and over I am forced to hear about this garbage, even after subscribing to YT Premium. Urghh.  This extension is amazing. I feel like I am back in the good ol' early days of YouTube where everyone isn't trying to get rich. I have gone 40 yea... Show more", "stars": 5}, {"date": "Oct 12, 2022", "text": "The Best thing since Adblockers. Enough said.", "stars": 5}, {"date": "Oct 11, 2022", "text": "Best thing for daily youtube viewer", "stars": 5}, {"date": "Oct 7, 2022", "text": "I love you", "stars": 5}, {"date": "Oct 5, 2022", "text": "Absolutely Exceptional !!!\nand any rare downtime is quickly resolved.\nMarvellous stuff.", "stars": 5}, {"date": "Oct 4, 2022", "text": "I thought this was going to be full of trolls but it is actually working very well!", "stars": 5}, {"date": "Oct 3, 2022", "text": "Necessary until certain sponsors get nuked by YouTube's TOS for enabling the bypassing of copyright.", "stars": 5}, {"date": "Oct 3, 2022", "text": "Such an underrated extension, I always recommend it to my friends.", "stars": 5}, {"date": "Sep 30, 2022", "text": "5/5 love it! use this with ublock origin and ur good.", "stars": 5}, {"date": "Sep 28, 2022", "text": "Must use for YouTube these days!", "stars": 5}, {"date": "Sep 28, 2022", "text": "With sponsorships taking up an obnoxious amount of time on videos, this is a GREAT add-on to have. Ads and sponsorships begone!", "stars": 5}, {"date": "Sep 26, 2022", "text": "AMAZING, a must have!!!!", "stars": 5}, {"date": "Sep 20, 2022", "text": "Used to be good, but lately they have constant server issues, which means it doesn't work at all...", "stars": 2}, {"date": "Sep 20, 2022", "text": "Excellent work", "stars": 5}, {"date": "Sep 19, 2022", "text": "the blocking feature works like a charm but sadly i can never submit any new sponsor segments as the servers are always down. i keep getting 502 errors no matter how long i wait.", "stars": 4}, {"date": "Sep 17, 2022", "text": "Had it for a long while, it is a must these days with youtubers shoving in sponored ads in middle of videos and with the skip to highlight feature is just amazing.", "stars": 5}, {"date": "Sep 16, 2022", "text": "GOAT", "stars": 5}, {"date": "Sep 16, 2022", "text": "I'm paying for YouTube premium, and I don't care about who's is sponsoring which video. AFAIK I'm sponsoring their videos by watching them. So this extension is a huge time and nerve saver. I'm just sorry I didn't find it earlier :)", "stars": 5}, {"date": "Sep 16, 2022", "text": "Good Good save me lotta time", "stars": 5}, {"date": "Sep 12, 2022", "text": "Can't whitelist channel for MONTHS now. So, that's annoying.\n\nBut, other than that, it works great.", "stars": 4}, {"date": "Sep 11, 2022", "text": "edit: Now working again; never read the notice to check the server status site. I think usage of YT at peak times lead to me mostly trying to submit segments in overlap with server downtime. Thanks!", "stars": 5}, {"date": "Sep 8, 2022", "text": "Amazing extension", "stars": 5}, {"date": "Sep 6, 2022", "text": "502 Bad Gateway", "stars": 1}, {"date": "Sep 4, 2022", "text": "Really great plugin, that does everything I could want.\nI happily pay for youtube premium, and don't mind *some* sponsored pieces - but this plugin gives me the \"skip\" button for those I wish to bypass. \nSure it's nice that you can configure this to auto-skip everything that you might not consider quality content - but I really appreciated the granularity. Choose which things you dislike, choose whether they're ignored, flagged on the timeline, trigger a manual skip - or the \"full auto\"\nAlso ... Show more", "stars": 5}, {"date": "Sep 2, 2022", "text": "I'm really sad to give this review. Love the idea; it's brilliant, but ONLY WHEN it works. Maybe it's because I watch YouTube videos in higher speed, but for me, it's a hit and miss (with the miss being way higher than hits)\n\nSo unfortunately, as much as I love the amazing idea, it's not doing what it's supposed to and I have to play the video around the time the sponsor starts (rewinding multiple times) until it picks it up and skips.", "stars": 2}, {"date": "Aug 30, 2022", "text": "Saves me from a couple hours of brainwashing content a week, over a hundred hours a year, and assuming I use youtube for at least another couple decades, it would save me from at least 90 FULL DAYS of brainwashing content! WOOOWWW!", "stars": 5}, {"date": "Aug 29, 2022", "text": "Been using it for around 5 months or so. I have skipped nearly 600 sponsorships and saved over 6 hours of time!! Program has probably skipped incorrectly three times in all of my times using it. Sometimes it will skip like a second too much but I dont really mind.", "stars": 5}, {"date": "Aug 29, 2022", "text": "You'll really miss this extension when using the YouTube on your phone!", "stars": 5}, {"date": "Aug 25, 2022", "text": "A must have extension. Thank you Dev 🖐️", "stars": 5}, {"date": "Aug 21, 2022", "text": "Excellent extension!", "stars": 5}, {"date": "Aug 20, 2022", "text": "very useful saves time", "stars": 5}, {"date": "Aug 20, 2022", "text": "Amazing addon! I can't believe how much time I've saved by using it! I also love how easy it is to use, setup, and submit to when I find some things that are missed. I am amazed at the speed at which contributions are made to new videos.", "stars": 5}, {"date": "Aug 20, 2022", "text": "Connection error, so no segments are downloaded and I can't submit either.", "stars": 2}, {"date": "Aug 19, 2022", "text": "\"Submission Server is now operational!\"\nWELL NO IT ISN'T, SUBMITTING GIVES A 404 ERROR WITH RANDOM HTML!\n\ntl;dr: the submission server is down even though status.sponsor.ajay.app says it's operational", "stars": 2}, {"date": "Aug 19, 2022", "text": "It's amazing...when it wants to work 😐", "stars": 4}, {"date": "Aug 19, 2022", "text": "Can't submit new segments to block. Not very useful.", "stars": 1}, {"date": "Aug 15, 2022", "text": "Love it ong", "stars": 5}, {"date": "Aug 14, 2022", "text": "amazing extension. Love it", "stars": 5}, {"date": "Aug 8, 2022", "text": "Extension is dead. Because some bad actors have begun abusing the reporting mechanisms, the dev has locked everybody out of submitting segments without getting explicit permission on discord. Most people won't do this, so very little new segments will be submitted. Basically, the dev has played into the vandals' hands and is giving them exactly what they want. Too bad.", "stars": 1}, {"date": "Aug 6, 2022", "text": "One of the best extensions. I want to give it a 5. Unfortunately it's been getting laggier and now seems to keep crashing my browser when I surf YouTube? Could be a conflict with other apps (Unhook, Improve YouTube, also great apps) however this is the only extension which broke just now and needed me to 'Repair' it. Once I did, all my submissions were wiped. Disappointing to see my contributions erased from record again but I'll give it another chance.", "stars": 4}, {"date": "Aug 6, 2022", "text": "Extremely powerful, simple and transparent extension", "stars": 5}, {"date": "Aug 6, 2022", "text": "Instantly started all youtube videos stuttering and lagging. Might be a conflict with another addon, but removing the addon instantly fixed the issue. Disappointing as the functionality is great.", "stars": 1}, {"date": "Jul 28, 2022", "text": "I've never been happier with an extension! My primary source of entertainment is YouTube, and for me, this extension is comparable to ad-free television! I feel bad for anyone who hasn't already discovered this yet! I'd rate it 6 out of 5 stars if i could!", "stars": 5}, {"date": "Jul 26, 2022", "text": "one word.....\nexcellent", "stars": 5}, {"date": "Jul 26, 2022", "text": "PERFECT EXTENSION ! thanks to its awesome community and brilliant developer , its literally a time saver", "stars": 5}, {"date": "Jul 21, 2022", "text": "Good for cutting down filler in videos.", "stars": 5}, {"date": "Jul 21, 2022", "text": "You made youtube watchable again", "stars": 5}, {"date": "Jul 16, 2022", "text": "I was premature complaining about a server outage. This app is genius and I will always have it installed on my devices as long as I am able to. Kudos to the developer", "stars": 5}, {"date": "Jul 15, 2022", "text": "great extension, although today the drop down/ options menu says connection error and the extension does not work😥😥😥😥😥😥😥😥", "stars": 5}, {"date": "Jul 15, 2022", "text": "saved hours of my time", "stars": 5}, {"date": "Jul 15, 2022", "text": "Awesome extension, does exactly what I hoped it did. I already pay for Youtube premium to support my favorite channels so seeing baked-in ads isn't something I want to sit through. Any channel with a respectable average viewership tends to already have its baked-in ads time-tagged by another kind user of this extension.\nThe UI is minimal and thoughtfully put together.\n\nI'd love if the developer added an extra category to tag and skip for various sensitivities such as gross stuff (sucks to com... Show more", "stars": 5}, {"date": "Jul 15, 2022", "text": "Very great extension, it has saved me a lot of time. It's just been a bit buggy for me. I turned off the icons on the youtube player, but they still come up and hide icons from another extension I use. That aside, I highly recommend this because there's really no reason why you shouldn't.", "stars": 4}, {"date": "Jul 13, 2022", "text": "Whoever made this really cares about the human experience, and believes we shouldn't live in a forcefully monetized world. Thank you for this, and please keep doing what you're dong. It really is meaningful.", "stars": 5}, {"date": "Jun 26, 2022", "text": "Always notify \"server is overload\". Dumbass", "stars": 1}, {"date": "Jun 24, 2022", "text": "The only thing that works is the seek box, it kinda works I guess?? The automatic skip doesn't seem to work on videos. Can you fix it please?", "stars": 3}, {"date": "Jun 24, 2022", "text": "Best thing ever to be made is this add on it saves us from ads all hale this add on", "stars": 5}, {"date": "Jun 22, 2022", "text": "I only just found this extension today thanks to seeing it on GreasyFork.\nI'ts honestly amazing so far and has saved me tons of time in stupid ads.\nF*** Ads Forever!!!", "stars": 5}, {"date": "Jun 22, 2022", "text": "Love it, Love it, Love it", "stars": 5}, {"date": "Jun 21, 2022", "text": "Why did I not know about this earlier! This is amazing. Thanks to the devs!", "stars": 5}, {"date": "Jun 17, 2022", "text": "Works like a charm! This extension provides a lot of customization for skipping all sorts of sponsors found in a YouTube video. Highly recommend it!", "stars": 5}, {"date": "Jun 7, 2022", "text": "Works great! Nothing else really needs to be said, just automatically skips segments that some people may not like, and is extremely customizable.\n\nWould recommend to anyone that browses YouTube regularly", "stars": 5}, {"date": "Jun 6, 2022", "text": "Works really well and 95% of the time. Latest UI change has made submitting segments really clunky, the extension takes focus priority over video, ie after clicking the \"start\" box you have to click the video player again to make sure that is now focus. I use the spacebar to pause and resume play and it toggles the \"start\" box to \"end\" instead of resuming playback.", "stars": 4}, {"date": "Jun 6, 2022", "text": "Very great extension, works as advertised and really saves you time.\n\nI actually don't mind the sponsored content however in 11 out of 10 cases, the promotions are only valid for US customers which I'm not so they are totally irrelevant for me.", "stars": 5}, {"date": "Jun 2, 2022", "text": "This is simply amazing. Works like charm!", "stars": 5}, {"date": "May 30, 2022", "text": "Sometimes there are some bugs but they are fixed really quickly. Most of the time it works perfectly", "stars": 4}, {"date": "May 28, 2022", "text": "I really wish there to be a description for every skip or mute etc.. and a custom block like i could name a custom one called scary part and if someone has custom on with skipping for a custom segment it would skip the \"scary part\" this is the only suggestion I have and would really love it you can have any finishing touches to it, please", "stars": 5}, {"date": "May 27, 2022", "text": "It's awesome, you are given a lot of options, the community is very dedicated, so I also started adding into it. Great job everyone, keep it on.", "stars": 5}, {"date": "May 26, 2022", "text": "Works like a charm", "stars": 5}, {"date": "May 26, 2022", "text": "Amazing add-on", "stars": 5}, {"date": "May 24, 2022", "text": "It doesn't always skip items previously marked by other users.  Can't give you 4 or 5 stars if the product doesn't perform correctly all the time.", "stars": 3}, {"date": "May 22, 2022", "text": "This extension is just awesome! Adblock is taking care of the regular advertisement spam on the internet, including YouTube, but I've been quite annoyed for a long time with videos that just put the advertisement inside of the actual video. Sponsorblock removed that big annoyance and together with Adblock is makes YouTube fun again.\n\nRecently, the plugins started to miss some of the sponsor segments even though they are tagged as such and then it skips just fine if I restart the video slightl... Show more", "stars": 5}, {"date": "May 22, 2022", "text": "Sadly week ago it stopped working at all. Thought that YT changed something and it will be fixed in update but i can see \"Last update 20.05.2022\" so reinstalled but it still doesn't work. Sad.", "stars": 1}, {"date": "May 21, 2022", "text": "This is amazing, almost magic.", "stars": 5}, {"date": "May 20, 2022", "text": "Loving it! the discord support is very bad though. They will be bashing you instead of taking on suggestions.", "stars": 4}, {"date": "May 19, 2022", "text": "I used to complain about sponsor segments in videos even with YT Premium subscription on, but after installing this extension it definitely has enhanced my watching experience by a lot. YouTube should really have this as Premium feature.", "stars": 5}, {"date": "May 11, 2022", "text": "This extension is a dream! I'm one of those saps who actually pays $10 per month for Youtube Premium specifically because I loathe ads of any kind. The proliferation of these long, obnoxious sponsored segments infuriated me, drove me to just give on watching some channels all together and seriously reconsider continuing to pay for Youtube (my only hesitation was over losing my extra Drive storage). Then I found the miracle of SponsorBlock! Google/Youtube should thank you for doing their job f... Show more", "stars": 5}, {"date": "May 9, 2022", "text": "very good", "stars": 5}, {"date": "May 7, 2022", "text": "5 stars, i mean it works", "stars": 5}, {"date": "May 5, 2022", "text": "Amazing extension. Free, open-source and helps you save a ton of time. What more can you ask for?", "stars": 5}, {"date": "May 4, 2022", "text": "works again :)", "stars": 5}, {"date": "May 4, 2022", "text": "Awesome feature, thanks!\n\nQuestion, I don't know how to search it: \nIs it possible to autoplay after it skips? I don't like having to get up and press play again. I don't know if that's already the default and I just have another extension overlapping with it.", "stars": 5}, {"date": "May 3, 2022", "text": "The best youtube experience is this + adblock", "stars": 5}, {"date": "Apr 29, 2022", "text": "SO NICE", "stars": 5}, {"date": "Apr 28, 2022", "text": "Amazing good job", "stars": 5}, {"date": "Apr 20, 2022", "text": "Greatly useful and rather necessary. I use it on Firefox most of the time, but I'm cetainly gonna install in on every single browser in my computer where it's available.", "stars": 5}, {"date": "Apr 18, 2022", "text": "I been in IT for over 25 years .. how did I not know about this! I found this by using Newpipe X /SponsorBlock for Android ! You can also use it with Android/Firefox Nightly !", "stars": 5}, {"date": "Apr 15, 2022", "text": "This is the best plugin since Adblock. As someone who watches/listens to youtube while I work, this plugin saves me from a bunch of frustration. A lot of content creators will bury sponsor reads several minutes into the video which effects my productivity as I have to stop what I'm doing to fast forward. The idea to crowdsource where to skip forward in a video is ingenious and I am very happy it exists.", "stars": 5}, {"date": "Apr 12, 2022", "text": "Soooooooooo good, one of the best extensions. I've saved an hour and a half and have saved people from a little under a minute (almost nothing)!", "stars": 5}, {"date": "Apr 11, 2022", "text": "This is so helpful, youtube is full of sponsored videos now and this automatically skips every sponsor. Super useful and super smart. I am glad people made this", "stars": 5}, {"date": "Apr 9, 2022", "text": "With all the crazy spam littered across all videos on YouTube, this is an absolutely mandatory extension. However, the current version has a bug that makes it suddenly stop skipping stuff by itself. It highlights, but does nothing. I was tolerant of just going back a bit to get it to recognize the segment to skip, but that stopped working as well. The only current way to fix this is to reinstall. If this bug is fixed, it will be a 5-star extension.", "stars": 2}, {"date": "Apr 6, 2022", "text": "Keeps undoing settings on YouTube like theater mode. You have to disable/uninstall and change a setting and then re-enable/install to get around this which is annoying.", "stars": 4}, {"date": "Apr 2, 2022", "text": "Surprisingly good!", "stars": 5}, {"date": "Mar 31, 2022", "text": "I wish I had known this extension way sooner.  This is just amazingly awesome. Makes youtube much much more enjoyable. Now this extension certainly belongs in my top 5 list.", "stars": 5}, {"date": "Mar 27, 2022", "text": "Great extension that saves me a ton of time.", "stars": 5}, {"date": "Mar 26, 2022", "text": "One of the best extension for the youtube.", "stars": 5}, {"date": "Mar 22, 2022", "text": "Works better than I expected.", "stars": 5}, {"date": "Mar 21, 2022", "text": "what youtube should be", "stars": 5}, {"date": "Mar 16, 2022", "text": "Now youtubers should pay attention to the videos content instead of converting YouTube into a market, thank you", "stars": 5}, {"date": "Mar 16, 2022", "text": "Can't believe I did not know about this sooner. This is a game changer.", "stars": 5}, {"date": "Mar 15, 2022", "text": "Awesome, mostly for the unexpected ads!", "stars": 5}, {"date": "Mar 13, 2022", "text": "Easily the best extension if you watch YouTube. Makes watching videos much more enjoyable.", "stars": 5}, {"date": "Mar 13, 2022", "text": "Randomly whitelisting channels.", "stars": 4}, {"date": "Mar 10, 2022", "text": "You freak'n genius(es)!\nIt works great and is very easy to use. Lots of different options for what to block and submitting blocks is easy too.", "stars": 5}, {"date": "Mar 10, 2022", "text": "This is literally the best extension ever had, loved it man", "stars": 5}, {"date": "Mar 9, 2022", "text": "Great extension to get through the annoying sponsor segments on modern videos.", "stars": 5}, {"date": "Mar 7, 2022", "text": "Amazing", "stars": 5}, {"date": "Mar 6, 2022", "text": "The most GOD TIER extension on the internet along with Return Youtube Dislike, Adblocker, and Channel Blocker. PLEASE keep developing this! Hopefully Susan Dumbshit doesn't take it down.", "stars": 5}, {"date": "Mar 5, 2022", "text": "absolutely crazy extension that makes youtube more enjoyable. download now or regret it later", "stars": 5}, {"date": "Mar 5, 2022", "text": "Never imagine I would need this add-on this bad.\n\nI have Youtube Premuim that helps with the ads but now every video has sponsor ads plugged in. I am actually ok with those that put it in the beginning or the end. Not too long. I want to support youtubers. But now they put them in the middle of vids, and some are insanely long. 6 mins vid and you plug in 3 mins sponsor ad?! with your intro and outro, the actual content is like 1 min..", "stars": 5}, {"date": "Mar 4, 2022", "text": "A neat chrome extension that skips sponsors, intros and end credits on youtube.", "stars": 5}, {"date": "Mar 3, 2022", "text": "i love this so much", "stars": 5}, {"date": "Mar 3, 2022", "text": "amazing, pretty much the only thing i can say about this extention, its like adblock on steroids, the seamless integration makes it that much better. really nothing bad to say about it.\n\nanyone reading who uses, be sure to contribute to listing videos you find with sponsors!", "stars": 5}, {"date": "Mar 3, 2022", "text": "SponsorBlock + uBlock Origin + Unhook - Remove YouTube Recommended Videos = chef kiss emoji", "stars": 5}, {"date": "Feb 28, 2022", "text": "the best addon I've ever used!", "stars": 5}, {"date": "Feb 27, 2022", "text": "Simply brilliant", "stars": 5}, {"date": "Feb 25, 2022", "text": "Amazing extension. I used this with Youtube Vanced on my phone, and I was blown away at how good it is, and how many customization options it has. It does mess up on some Linus Tech Tips videos, but, quite frankly, their sponsorships can be confusing for anyone watching it because of how they appear out of thin air. It would be nice if there was a feature to auto skip a sponsorship only if it was longer than 1 second", "stars": 5}, {"date": "Feb 24, 2022", "text": "This is extension is a godsend. Would put it next to only ublock origin for it's uselfulness.", "stars": 5}, {"date": "Feb 24, 2022", "text": "It should've stopped at sponsor block only. The filler addition (enabled by default) really ruined the my impressions on this extension.", "stars": 3}, {"date": "Feb 20, 2022", "text": "this extension is one of the many much needed extensions for youtube today to make it like how youtube was in the old days, before Susan made it all about money and greed. i am utterly delighted someone made this extension, it makes me very happy and it makes for a great pc companion to vanced on my android.", "stars": 5}, {"date": "Feb 20, 2022", "text": "very useful, save the world time", "stars": 5}, {"date": "Feb 18, 2022", "text": "Best extension EVER !!!", "stars": 5}, {"date": "Feb 18, 2022", "text": "MUST F HAVEE", "stars": 5}, {"date": "Feb 18, 2022", "text": "Works great for me", "stars": 5}, {"date": "Feb 18, 2022", "text": "Best thing on the Internet since sliced bread. Where has this been. So well made too. Thank you!", "stars": 5}, {"date": "Feb 17, 2022", "text": "Patricians' choice. Works just perfectly fine.", "stars": 5}, {"date": "Feb 17, 2022", "text": "Excellent time saver", "stars": 5}, {"date": "Feb 15, 2022", "text": "Please make an update so this extension works on Youtube Miniplayer too.", "stars": 5}, {"date": "Feb 14, 2022", "text": "Take that Linus", "stars": 5}, {"date": "Feb 11, 2022", "text": "simple & brilliant", "stars": 5}, {"date": "Feb 10, 2022", "text": "Great app and like that I cant add my own sections to the database to help others :)", "stars": 5}, {"date": "Feb 9, 2022", "text": "There's an issue. If you whitelist a channel, it still autoskips parts of some videos, most notably if the start of the video has an intermission. Also. I've encountered a bug. Sometimes, when you whitelist a channe, it'll stay whitelisted for a while, but then at a random time, that channel will no longer be whitelisted, and I have to whitelist the channel again", "stars": 3}, {"date": "Feb 8, 2022", "text": "amazing", "stars": 5}, {"date": "Feb 8, 2022", "text": "Necessary.", "stars": 5}, {"date": "Feb 5, 2022", "text": "works", "stars": 5}, {"date": "Feb 4, 2022", "text": "it does what is claims to with many more options", "stars": 5}, {"date": "Feb 2, 2022", "text": "Literally the best extension other than uBlock Origin that I've ever downloaded", "stars": 5}, {"date": "Feb 2, 2022", "text": "i never rate anything but this really deserves it, thank you", "stars": 5}, {"date": "Feb 1, 2022", "text": "Everyone should use this!", "stars": 5}, {"date": "Jan 29, 2022", "text": "Perfect idea to develop this extension.", "stars": 5}, {"date": "Jan 26, 2022", "text": "I had this exact idea years ago, to make an addon that skips sponsors in videos and people self report where they are, I don't know how to develop addons but I'm super happy this is a thing, just found out about it now\nI have another idea for an addon, basically it adds it's own dislike button and you dislike through the addon and it shows how many people also done this, if everyone who used youtuber used an addon that done that, we'd basically have the dislike button back, anyone who knows h... Show more", "stars": 5}, {"date": "Jan 25, 2022", "text": "This is amazing", "stars": 5}, {"date": "Jan 24, 2022", "text": "great intiative,lots of love for creator!!!", "stars": 5}, {"date": "Jan 22, 2022", "text": "Frankly this was much better than I expected, even after hearing people rave about it for ages before downloading myself.", "stars": 5}, {"date": "Jan 22, 2022", "text": "Great! Much thanks!", "stars": 5}, {"date": "Jan 21, 2022", "text": "I'm having some issues that are a bit annoying but I still think this deserves 5 stars. It has definitely saved me from much more annoyance than it has caused me annoyance lmao. But here's my problem: for some reason it will remove my whitelisted channels after a while. Sometimes it's a few hours and sometimes it's a few days to weeks. Also I haven't figured out yet how to see a list of my whitelisted channels (if there even is an accessable list?). And sometimes the extension doesn't load/de... Show more", "stars": 5}, {"date": "Jan 19, 2022", "text": "Works perfectly on Brave. Had a few issues with not being able to submit data, because a moderator thinks it has every section, even though it doesn't. It also seems the \"highlight or point of video\" is based on the most liked comment's timestamp and NOT user data.", "stars": 5}, {"date": "Jan 18, 2022", "text": "Thank you so much for this!", "stars": 5}, {"date": "Jan 17, 2022", "text": "Fake over dramatic reviews.. This is pretty useless. only allows you to skip ads after 5 seconds. but still get 2+ ads in like every video. Also tells you when adds will pop up. but doesn't block them like its supposed to.", "stars": 2}, {"date": "Jan 16, 2022", "text": "can't thank enough for this awesome extension.", "stars": 5}, {"date": "Jan 15, 2022", "text": "Great most of the time, however on some videos it claims a moderator has approved all segments and no more can be added yet the segment is maybe 1-2 seconds at the start or end?\nI dont know if this is deliberate but it seems a way to prevent sponsor segment skips on some videos?", "stars": 3}, {"date": "Jan 15, 2022", "text": "Stopped working.", "stars": 2}, {"date": "Jan 14, 2022", "text": "I found an unexpected bug when creating a segment: the video I was watching had just been released as a \"Premier\", so the timeline of the video lengthens as the video is played. If you try to create a segment before the Premier is finished, the time on the segment will be wrong. The preview looks correct, but the submitted segment is not the same as the preview. If this happens, the only way to delete the segment is to select the segment you made from the SponsorBlock area by clicking the \"Op... Show more", "stars": 5}, {"date": "Jan 13, 2022", "text": "A dream come true. Fascinating extension!", "stars": 5}, {"date": "Jan 12, 2022", "text": "Works perfectly, can block all you could ever want", "stars": 5}, {"date": "Jan 12, 2022", "text": "This is a great extension and everybody should have. It will save you so much time by skipping those boring YouTube sponsor segments, interaction reminders and press the bell icon bs.", "stars": 5}, {"date": "Jan 10, 2022", "text": "best.", "stars": 5}, {"date": "Jan 10, 2022", "text": "Amazing, saved me over 11 hours so far, and feels like an extension of an adblocker. However, recently I have noticed sometimes upon first loading a video the extension does not load segments but this is always solvable by reloading (This has been on Opera GX).", "stars": 5}, {"date": "Jan 7, 2022", "text": "this extension has many features and works perfectly! i love that u can customize time for the skip notice, etc.", "stars": 5}, {"date": "Jan 1, 2022", "text": "Absolutely wonderful!", "stars": 5}, {"date": "Dec 30, 2021", "text": "This used to be one of the best extensions out there.\n\nHowever, the server is down most days and for several hours.\nWhat's the point of having an extension that only works for a few hours?", "stars": 2}, {"date": "Dec 30, 2021", "text": "Oh my God! I Absolutely love this extension. Youtube become more and more painful to watch last few years, even with premium. Only now I actually realized why, and how big part of most videos is an embedded sponsor/ad. This extension just solves the problem seamlessly.", "stars": 5}, {"date": "Dec 28, 2021", "text": "Came bundled with cercube I sideloaded on my phone and i loved it glad to see I can get it on chrome too", "stars": 5}, {"date": "Dec 26, 2021", "text": "Does exactly as advertised, no bs. Would recommend!", "stars": 5}, {"date": "Dec 24, 2021", "text": "Seems to work perfectly after checking the latest vids on my feed. ¯\\_(ツ)_/¯", "stars": 5}, {"date": "Dec 20, 2021", "text": "Amazing if you want to skip YouTube ads on well trafficked channels.", "stars": 5}, {"date": "Dec 17, 2021", "text": "Perfect. Does exactly what it says, always skips the sponsor segments perfectly and I have never had any problems with it. the skipping is seamless, and I often cannot tell that there was any sponsor to begin with. Download immediately", "stars": 5}, {"date": "Dec 12, 2021", "text": "big helper!", "stars": 5}, {"date": "Dec 11, 2021", "text": "A banger for saving time", "stars": 5}, {"date": "Dec 9, 2021", "text": "this is amazing !", "stars": 5}, {"date": "Dec 8, 2021", "text": "Awesome! YT ads have just gone too far. \n\nI encourage everyone I know to use this. Now if someone can just add the downvote feature back via extension somehow...  \n\n:thinking_face:", "stars": 5}, {"date": "Dec 6, 2021", "text": "wonderful. wish it worked in the miniplayer (i), and the chrome Picture in Picture extension.", "stars": 3}, {"date": "Dec 5, 2021", "text": "AMAZING! We need more Promotion of this Extension. Just like how almost everyone uses Adblock, I see a future [probably next 5 years] where SponsorBlock will become a common extension downloaded by everyone on everything! This extension is a must, it not only blocks Cringe Sponsored Segments, it also skips intros, fillers, outros, reminders to subscribe and all that useless stuff. The best feature hands down has to be the \"Highlight\" feature, where you can click on \"Skip to Highlight\" and you... Show more", "stars": 5}, {"date": "Dec 5, 2021", "text": "WHAT THE HELL THIS IS WHAT I NEEDED MY WHOLE LIFE THANKS", "stars": 5}, {"date": "Dec 3, 2021", "text": "A quick tip: Try to help the submeters to save some time by modifying the segment submission time. For example:\n\nsegmentStart = segmentStart - 1 Second or two;\nsegmantEnd = segmantEnd -  1 Second or two;\n\nThis applies for any unrealted things in the video for the sake of time consumption while submeting.\n\nOverall, excellent work and you have my deepest respect for doing such a useful tool.\n\n~Peter", "stars": 5}, {"date": "Dec 3, 2021", "text": "Make the percentage of dislikes display based solely on the data you collect. When they turn off the ability to get dislikes through the youtube api, then you'll only display the dislikes from your database. But will cause the number of dislikes to become severely underestimated, because your extension is not installed by all youtube users. I'm more interested in the ratio of likes and dislikes, not the absolute value of the dislikes. Therefore, make the percentage of dislikes, which will be ... Show more", "stars": 4}, {"date": "Dec 2, 2021", "text": "Amazing extension. At first when I heard of the idea of crowd sourcing content blocking I was a bit hesitant, but after trying it for a month or so I can say this extension's concept and execution is excellent. For as long as I use YouTube, I'm going to make sure this is downloaded. This is clearly a must-have.", "stars": 5}, {"date": "Dec 1, 2021", "text": "Epic how you can skip the the reason you clicked on the video !", "stars": 5}, {"date": "Nov 30, 2021", "text": "uBlock origin + this is the most ad free experience! \n\nLearned about this from Youtube Vanced for Android, very happy with it!", "stars": 5}, {"date": "Nov 25, 2021", "text": "Second best extension in history after uBlock origin. Very polished and reliable. Only issues I've experienced is with third party websites that dynamically embed videos.", "stars": 5}, {"date": "Nov 24, 2021", "text": "somehow this extension works on an entirely custom version of youtube\n\namazing", "stars": 5}, {"date": "Nov 23, 2021", "text": "This doesn't work!!!", "stars": 2}, {"date": "Nov 23, 2021", "text": "I used it based off of recommendation, and literally less than a minute in I'm going to rate 5 stars because this is amazing.", "stars": 5}, {"date": "Nov 23, 2021", "text": "I like this extension. It's pretty useful as most YouTubers I watch seem to be sponsored and I find sponsorships quite annoying as I am never interested in the product the YouTubers are trying to sell to me. Thank god for Sponsorblock", "stars": 5}, {"date": "Nov 22, 2021", "text": "very nice", "stars": 5}, {"date": "Nov 20, 2021", "text": "This has stopped working for me.", "stars": 3}, {"date": "Nov 20, 2021", "text": "Works very well.\n\nSkips are community submitted so new or unpopular videos may not have skips yet.", "stars": 4}, {"date": "Nov 18, 2021", "text": "One of the most essential addons for Youtube. \nI do have a suggestion to anyone reading this. With the removal of the dislike counter currently rolling out, it would be great if this was restored via this addon. Essentially, users will opt in to send their like/dislike data to Sponsorblock. The rest is obvious.", "stars": 5}, {"date": "Nov 15, 2021", "text": "The more users that use this extension, the greater the quality of the extension. The users add the time to the video which allows other viewers to skip it. Love the extension.", "stars": 5}, {"date": "Nov 13, 2021", "text": "Awesome extension, I'd like to see Like/Dislike replacement for youtube from you, guys, you have decent user base and it would work as a charm.", "stars": 5}, {"date": "Nov 11, 2021", "text": "Best extension ever along with ad block.", "stars": 5}, {"date": "Nov 10, 2021", "text": "Really nice innovative thought. It helps people to report the sponsor spam by content creators. In-spite of this youtube is providing ads. Ad blocker plus and Sponsor block combo gives peace of mind of internet", "stars": 5}, {"date": "Nov 6, 2021", "text": "I love this extension, it's really useful !", "stars": 5}, {"date": "Nov 5, 2021", "text": "Great, saves times and nerves :D", "stars": 5}, {"date": "Nov 1, 2021", "text": "Absolutely top tier.", "stars": 5}, {"date": "Oct 31, 2021", "text": "Should Have Extension if you are also YouTube Addict.", "stars": 5}, {"date": "Oct 30, 2021", "text": "Wow, this is awesome. Submit a segment, never see the segment again. Simple to submit segment. Great spam filters, never seen anything incorrectly skipped. This extension is to adblocker as a furry cat is to a home (basically they go great together.)", "stars": 5}, {"date": "Oct 30, 2021", "text": "It made Linus Tech Tips videos watchable again. 10/10.", "stars": 5}, {"date": "Oct 26, 2021", "text": "NICE", "stars": 5}, {"date": "Oct 26, 2021", "text": "Amazing!", "stars": 5}, {"date": "Oct 12, 2021", "text": "Yet another thing I invented to find that someone else has already done it! Works nice!\n\nI just have one feature request, let us see how many skips / time saved per video in total.", "stars": 5}, {"date": "Oct 12, 2021", "text": "Great extension, but it clogs my conscience. However, Brave's BAT rectifies that.", "stars": 5}, {"date": "Oct 8, 2021", "text": "Great stuff", "stars": 5}, {"date": "Oct 5, 2021", "text": "Very useful addon when watching yt", "stars": 5}, {"date": "Oct 3, 2021", "text": "Good complement to an ad blocker", "stars": 5}, {"date": "Sep 28, 2021", "text": "grate extension saved me 132 hours so far but as of late it sometimes just dosnt work some days though the extension says skipping is enabled, ive checked it on videos that did have skips and now on days when its not working those skips are not there. hopefully this gets fixed but its still a grate extension as invaluable as an adblocker", "stars": 4}, {"date": "Sep 28, 2021", "text": "Fantastic community driven sponsor block! But it seems like lately (ast of late september 2021) the service/youtube has server overload issues, and can't submit anything.", "stars": 5}, {"date": "Sep 25, 2021", "text": "This extension has been extremely helpful in skipping the sheer amount of sponsors/intermissions\n\nBut as of late, I have been having issues submitting these times where when I click the submit button I always get a \" ! \" afterwards - https://imgur.com/a/xbSzDhV | Link to show the issue(s)", "stars": 5}, {"date": "Sep 23, 2021", "text": "his extension rocks!", "stars": 5}, {"date": "Sep 21, 2021", "text": "Been using it for a few months. Saved 4 hours and 31 minutes of my life so far, and it has never skipped something I wanted to see. Amazing.", "stars": 5}, {"date": "Sep 19, 2021", "text": "Should be preinstalled.", "stars": 5}, {"date": "Sep 17, 2021", "text": "Does what it is meant to. Simple and brilliant!", "stars": 5}, {"date": "Sep 16, 2021", "text": "Totally worth it", "stars": 5}, {"date": "Sep 15, 2021", "text": "This skips sponsorships for the majority of YouTube videos. Newer videos and lesser known creators may not work, but that's to be expected. Combined with Adblock, you're now good to browse YouTube.", "stars": 5}, {"date": "Sep 15, 2021", "text": "Truly awesome!  \nI spend a somewhat worrying amount of time watching and listening to YouTube, so the number of sponsor spots I see has become a significant amount of that time. \nLove how seamless and hands-off this is, and surprised how fast people submit times after a new video comes out.\nI support my most watched channels on Patreon as my adblock tax, but adblock doesn't solve the sponsor spots I've seen hundreds of times.", "stars": 5}, {"date": "Sep 14, 2021", "text": "Sooo good!!!! works with YouTube App as well. AMAZING!!! THX!", "stars": 5}, {"date": "Sep 11, 2021", "text": "This makes YouTube more enjoyable and not have people tell you to subscribe or get scummy ads shoved down our throats! 10/10 would recommend this extension!", "stars": 5}, {"date": "Sep 10, 2021", "text": "Best extension I've seen so far, works smoothly", "stars": 5}, {"date": "Sep 7, 2021", "text": "Does everything its supposed to do", "stars": 4}, {"date": "Sep 6, 2021", "text": "Worked great on Edge, but I've switched back to Chrome and this doesn't work at all in Chrome. disabling and reenabling skipping, reloading the extension through Chrome, even doing a full reinstall of the extension, nothing makes SponsorBlock works and it is infinitely infuriating.", "stars": 1}, {"date": "Sep 6, 2021", "text": "perfect", "stars": 5}, {"date": "Sep 5, 2021", "text": "I absolutely love this extension. I love everything about it. My only problem is that I'm not able to whitelist channels on youtube based on each category. \nSome channels spend a *lot* of time on sponsors but not the rest, and some spend a lot of time on self-advertising but not the rest. It depends a lot on the channel so being able to whitelist each category on each channel would make this extension absolutely perfect.\nI'm still rating this 5/5 because it's perfect at what it does - Just ho... Show more", "stars": 5}, {"date": "Sep 5, 2021", "text": "Great extension that never fails me. The new skip to highlight feature is so helpful.", "stars": 5}, {"date": "Sep 5, 2021", "text": "I does magic. never thought this extension could exist.", "stars": 5}, {"date": "Sep 5, 2021", "text": "Great extension if you use Youtube a lot. One problem I've had is that sometimes I won't have the button available on videos. If someone's got a fix for this please let me know.", "stars": 5}, {"date": "Sep 2, 2021", "text": "The real addon, the best addon", "stars": 5}, {"date": "Sep 1, 2021", "text": "SponsorBlock + uBlockOrigin = Great youtube experience.", "stars": 5}, {"date": "Aug 31, 2021", "text": "FANTASTIC time saver!", "stars": 5}, {"date": "Aug 30, 2021", "text": "Savior of YouTube, not all heroes wear capes.", "stars": 5}, {"date": "Aug 24, 2021", "text": "MUST HAVE! if you hate WASTING YOUR TIME on SPONSERS which aren't valuable to you at all!", "stars": 5}, {"date": "Aug 22, 2021", "text": "best extension, period.", "stars": 5}, {"date": "Aug 22, 2021", "text": "it wotks", "stars": 5}, {"date": "Aug 21, 2021", "text": "Must have. Thank u very much", "stars": 5}, {"date": "Aug 19, 2021", "text": "I don't usually review extensions but this one just deserves it. While your run of the mill adblockers and even pi-hole cover monetized youtube ads pretty well, sponsor bits and other nags were either tolerable if they were in line with the content being shared (like jayz2cents pushing ifixit) or worse than the ads themselves (bps and raid legends). Sponsorblock absolutely removes this from the equation and clears the path for the content that you seek. The combination of the two forces remin... Show more", "stars": 5}, {"date": "Aug 17, 2021", "text": "Mandatory extension for every YouTube watcher!! \nWhy nobody takes about it!", "stars": 5}, {"date": "Aug 15, 2021", "text": "What is this power. Why it is so powerful. Thank you for bestow this to everyone.", "stars": 5}, {"date": "Aug 15, 2021", "text": "One of the must have extensions for chrome! Works well along with adblock", "stars": 5}, {"date": "Aug 14, 2021", "text": "Great extension.", "stars": 5}, {"date": "Aug 13, 2021", "text": "i am amazed by how fast newly uploaded videos are being handled and on nearly any channel\nI've never had an sponsor in any video ever since and there weren't any errors or wrongly placed sponsors\nI really recommend it", "stars": 5}, {"date": "Aug 10, 2021", "text": "Awesome extension. It makes YouTube more viewable, and allows me to get to the point of the videos i like to watch without VPN Companies and crummy mobile games shoving \"Great\" offers down my throat. It brings the YOU back into YOUTube. Also, there is a fork of a third party YouTube app called NewPipe that includes SponsorBlock, so if you have an Android, I recommend you download it. Also, channels begging you to turn on notifications is nerve-wracking. The notification bell was created becau... Show more", "stars": 5}, {"date": "Aug 8, 2021", "text": "Really simple and really good!", "stars": 5}, {"date": "Aug 7, 2021", "text": "Thanks you for your great works.", "stars": 5}, {"date": "Aug 5, 2021", "text": "I freaking love this Extension I had to write a review!!", "stars": 5}, {"date": "Aug 4, 2021", "text": "paired with enhancer for youtube, they both make youtube the way it should be made and enjoyable.", "stars": 5}, {"date": "Aug 4, 2021", "text": "Loved it saves a lot of time.", "stars": 5}, {"date": "Aug 2, 2021", "text": "The Best Ever... thanks for making this!", "stars": 5}, {"date": "Jul 30, 2021", "text": "You wanna know why every review is 5 stars, BECAUSE OF BOT- jk, its because this extension is great, and it really works! 5 stars!", "stars": 5}, {"date": "Jul 30, 2021", "text": "Does what it says on the tin! fantastic. I'm a youtube premium subscriber and shouldn't have to watch any ads or sponsors. Thank you!", "stars": 5}, {"date": "Jul 30, 2021", "text": "Works great, skips ad reads/sponsor spots in the majority of videos that have them. While of course it does not work on every single video, most videos that have an ad read in them are big enough to be crowd sourced fairly quickly after uploading.", "stars": 5}, {"date": "Jul 28, 2021", "text": "epic", "stars": 5}, {"date": "Jul 26, 2021", "text": "It just works. God tier", "stars": 5}, {"date": "Jul 25, 2021", "text": "this is an amazing extension, those sponsor ads are so annoying; but having this automatically skip them for me, is great! i would recommend this 10/10", "stars": 5}, {"date": "Jul 23, 2021", "text": "Really good!! It sometimes marks normal parts as a sponsor but its fine. I dont know how this works but its cool", "stars": 4}, {"date": "Jul 22, 2021", "text": "This is marvelous piece of engineering, thank you so much!\n\nNB: currently crashing Chrome when opening arbitrary YouTube link. Checked with Windows versions 91 and 92.", "stars": 5}, {"date": "Jul 22, 2021", "text": "i cant imagine using youtube without this extension\ni will keep adding segments until i die", "stars": 5}, {"date": "Jul 22, 2021", "text": "Top tier.", "stars": 5}, {"date": "Jul 20, 2021", "text": "One of the BEST extensions... IN THE WORLD!\n\nSeriously though, this extension is just awesome. Simple to set up, a few clicks and it just works. Removes sponsor spots so seamlessly, sometimes you don't even notice anything has been removed. \nSimply can't speak highly enough about this extension.", "stars": 5}, {"date": "Jul 20, 2021", "text": "thanks for saving my time", "stars": 5}, {"date": "Jul 19, 2021", "text": "Great App. Combined with AdBlock, it goes to another level & saves a lot of time.", "stars": 5}, {"date": "Jul 19, 2021", "text": "Ajay ❤️", "stars": 5}, {"date": "Jul 18, 2021", "text": "Incredibly useful addon!\nThanks a lot for what you are doing for the community!", "stars": 5}, {"date": "Jul 18, 2021", "text": "Awesome..", "stars": 5}, {"date": "Jul 16, 2021", "text": "This was so frictionless. Its saved months of my life😛", "stars": 5}, {"date": "Jul 16, 2021", "text": "love it", "stars": 5}, {"date": "Jul 16, 2021", "text": "Great!", "stars": 5}, {"date": "Jul 15, 2021", "text": "Absolutely amazing.Pair it with an adblocker and your golden", "stars": 5}, {"date": "Jul 14, 2021", "text": "I Love it", "stars": 5}, {"date": "Jul 13, 2021", "text": "Grateful that I fount this! MOST USEFUL THINK AFTER ADBLOCK AND MOST SATISFYING AFTER FRIED BREAD!", "stars": 5}, {"date": "Jul 11, 2021", "text": "Bruh where were u all this time T_T", "stars": 5}, {"date": "Jul 11, 2021", "text": "Absolutely amazing! Works like a charm and you can change the settings so it skips perfectly!", "stars": 5}, {"date": "Jul 8, 2021", "text": "One of the most useful extensions we have seen in a while after adblock.", "stars": 5}, {"date": "Jul 7, 2021", "text": "OMG This thing is amazing!", "stars": 5}, {"date": "Jul 7, 2021", "text": "its amazing and seamless, i was just watching a video and I didn't even realize there was a sponsor in it", "stars": 5}, {"date": "Jul 6, 2021", "text": "works well", "stars": 5}, {"date": "Jul 6, 2021", "text": "How does it work?", "stars": 4}, {"date": "Jul 6, 2021", "text": "THIS EXTENSION IS BRILLIANT", "stars": 5}, {"date": "Jul 6, 2021", "text": "I love this extension!! thank you Ajay for this. Much love", "stars": 5}, {"date": "Jul 6, 2021", "text": "Perfect!", "stars": 5}, {"date": "Jul 4, 2021", "text": "An excellent extension.  Between this and a good ad blocker, YouTube is actually tolerable, and submitting new entries to the database is quick and intuitive.", "stars": 5}, {"date": "Jul 1, 2021", "text": "Great extension that improves watching youtube by a ton. Lets me skip sponsorships and know how long unimportant sections are. No problems and surprised how quick new videos get set for this extension by the community.", "stars": 5}, {"date": "Jul 1, 2021", "text": "A must-have.", "stars": 5}, {"date": "Jun 29, 2021", "text": "So sad that the state of the world includes baking advertisements into what used to be charming personal homemade YouTube videos. But in such a world, SponsorBlock is the light that drowns out the darkness that is sponsored segments, so you need not waste your time with such blackness in your life,", "stars": 5}, {"date": "Jun 27, 2021", "text": "Wonderful extension!", "stars": 5}, {"date": "Jun 27, 2021", "text": "Make Simon Whistler Watchable Again. \nAmong countless other channels! Absolutely fantastic. Robust database that includes countless large and small channels in a variety of genres. Easy to add your own blocking. 100% recommended and would not use YouTube without it!", "stars": 5}, {"date": "Jun 26, 2021", "text": "very helpful for everyone. I love it. everybody must use this extention.", "stars": 5}, {"date": "Jun 25, 2021", "text": "I contacted him with an idea to make additions to the app, and in 20 minutes he responded that he already did it and would update the extension soon.\nAwesome dude and awesome app", "stars": 5}, {"date": "Jun 24, 2021", "text": "Great idea, works great when it works, but lately it doesn't seem to work correctly....", "stars": 4}, {"date": "Jun 24, 2021", "text": "I've been using this for a few months now and it has always worked perfectly. Great extension.", "stars": 5}, {"date": "Jun 19, 2021", "text": "awesome", "stars": 5}, {"date": "Jun 15, 2021", "text": "AMAZING NOW I CAN SKIP LINUS TECH TIPS SPONSERS", "stars": 5}, {"date": "Jun 15, 2021", "text": "God-Tier Extension", "stars": 5}, {"date": "Jun 14, 2021", "text": "incrediable !!!!!!!!!!!!!!!!!", "stars": 5}, {"date": "Jun 13, 2021", "text": "Please guys submit new segments and contribute Bangladesh/Bangla language based videos.", "stars": 5}, {"date": "Jun 13, 2021", "text": "BEAUTIFUL. THANK YOU DEVELOPERS. \nDear Youtubers- if you don't want your ****ty advertisements skipped maybe you should make content people would consider paying for instead of relying on company handouts and click bait.", "stars": 5}, {"date": "Jun 11, 2021", "text": "i love this extension everything is great but i would like to disable skipping for some youtubers", "stars": 4}, {"date": "Jun 8, 2021", "text": "Works very well", "stars": 5}, {"date": "Jun 5, 2021", "text": "You'll never go back to using Youtube without it", "stars": 5}, {"date": "Jun 5, 2021", "text": "That's how YouTube should be. YouTube is unusable without this. Don't get me wrong not all videos have segments submitted by other users but its not rocket science to submit couple segments yourself. People help you have a better experience and you should do the same. Just amazing!", "stars": 5}, {"date": "Jun 3, 2021", "text": "Necessary if you watch a lot of Youtube. Works perfectly. I have it on 3 different PCs now.", "stars": 5}, {"date": "Jun 3, 2021", "text": "Very handy, I hope the amount of people using this grows, so more videos have this applied", "stars": 5}, {"date": "Jun 1, 2021", "text": "After uBlock this is easily the most useful tool I have installed. It works perfectly and it is already almost guaranteed to block sponsors for videos with more than 3000 views. And for channel with less views than this it is never needed, as they don't have sponsors.\n\nSo this works perfectly for videos which are older than a few minutes.", "stars": 5}, {"date": "May 29, 2021", "text": "Amazing extension, I use it literally everyday! It also feels kind of satisfying that I've saved people from more 30 hours of ads even though I've only submitted a few segments.", "stars": 5}, {"date": "May 26, 2021", "text": "Doesn't sound like it would work, but literally every video I've watched with a sponsorship has been skipped.", "stars": 5}, {"date": "May 24, 2021", "text": "Fantastic! Automatically skips annoying sponsor and intro clips in videos.", "stars": 5}, {"date": "May 24, 2021", "text": "This is by far one of the best inventions in the digital world, so simple yet so effective. I hope everyone hears about this and uses it, and I'm also promoting this extension also its Vanced plugin to everyone I know.. and I've also contributed so much to this, seeing that I saved 200 hours of people's lives is just crazy! (and 630 hours of mine).\nThank you very much for this great life-saving tool!", "stars": 5}, {"date": "May 21, 2021", "text": "5 out of 5 stars. brilliant extention that makes watching content on youtube bearable again without the interaction reminders, 3 minute intro videos and sponsorship videos. don't forget to support your favorite content creators in a way that doesn't benefit BRAND©", "stars": 5}, {"date": "May 18, 2021", "text": "Works excellently. YouTube ads are so aggressive and frequent that it makes it hard to watch anything. I know that content creators/YouTubers need the revenue to produce videos, but I prefer to \"join\" or send some bucks a month on Patreon especially if ads are in a video because it was de-monetized. Ridiculous to keep people from making a few bucks because the content doesn't fit with guidelines - free speech and a free market should be the way to go.", "stars": 5}, {"date": "May 17, 2021", "text": "Saved me an amazing amount of time.  Thank you.  Makes Youtube feel like early 2010 Youtube.", "stars": 5}, {"date": "May 9, 2021", "text": "Works great, LOVE it so far. The only issue is, I'm frequently getting \"STATUS_ACCESS_VIOLATION\" error on Youtube tabs ever since I installed it. Must be some kind of software clash with other Youtube extensions I have installed, I just don't know which one.\n- Enhancer for Youtube\n- PocketTube: Youtube Subscription Manager\n- Video Speed Controller\n- h264ify", "stars": 4}, {"date": "May 2, 2021", "text": "Great extension that has saved me lots of time, but the keyboard shortcuts don't always work and the skip button deserves a redesign.", "stars": 4}, {"date": "May 2, 2021", "text": "amazing", "stars": 5}, {"date": "May 1, 2021", "text": "Lowering my rating due to a new \"auto moderator\" that is automatically rejecting valid submissions.", "stars": 3}, {"date": "Apr 30, 2021", "text": "It is so good that it has saved me 1 hour already and i set the intro/outro also as autoskip.", "stars": 5}, {"date": "Apr 26, 2021", "text": "Most useful extension nowadays.", "stars": 5}, {"date": "Apr 24, 2021", "text": "add better and simpler review of segment, maybe directly after segment in video thx", "stars": 5}, {"date": "Apr 22, 2021", "text": "Ridiculously helpful for saving time. I'd honestly say it's helpful for relaxing, too. \nI've saved literally ~18 hours from autoskipping all segments thus far. (about 1500, if anyone's wondering)\nUsually I don't have to skip stuff myself which is great but when I do it's pretty simple to figure out, great settings/customizability as well.\nThank you.", "stars": 5}, {"date": "Apr 20, 2021", "text": "Great extension", "stars": 5}, {"date": "Apr 20, 2021", "text": "It's quickly becoming one of my favourite extensions. It saves time and a decent amount of videos are supported.\nEdit 2022: The servers haven't been working for 3 weeks now. I am shocked that this is broken for so long. What the hell are you doing?", "stars": 2}, {"date": "Apr 19, 2021", "text": "Flawless", "stars": 5}, {"date": "Apr 19, 2021", "text": "great", "stars": 5}, {"date": "Apr 18, 2021", "text": "very useful, can also skip end screens & subscribe notifications. does everything you'd want it to and is highly customizable", "stars": 5}, {"date": "Apr 18, 2021", "text": "Using this extension since a month and it is awesome. It blocks the sponsor section of videos even in the smaller youtube channels with less than 10k subscribers. Idk what else to say, highly recommended.", "stars": 5}, {"date": "Apr 18, 2021", "text": "Not sure how this works, but wow, it works really well!", "stars": 5}, {"date": "Apr 17, 2021", "text": "i can't live without this extension", "stars": 5}, {"date": "Apr 4, 2021", "text": "Love it!", "stars": 5}, {"date": "Apr 4, 2021", "text": "Awesome extension", "stars": 5}, {"date": "Mar 31, 2021", "text": "Was recommended to me by a friend and I love it! Worked better than expected. This is the next best thing since adblock", "stars": 5}, {"date": "Mar 31, 2021", "text": "stopped workig", "stars": 4}, {"date": "Mar 30, 2021", "text": "The Best addon", "stars": 5}, {"date": "Mar 30, 2021", "text": "This extension rocks! I watch YouTube for literally 8 hours a day while I'm working. It's the best background noise. This along with an adblocker is the best thing that has ever happened. I can't even come up with a ballpark estimate of how much time they have saved me. Thank you everyone that contributes to this extension, you truly are the real heroes!", "stars": 5}, {"date": "Mar 30, 2021", "text": "saves hours of time when watching YouTube videos", "stars": 5}, {"date": "Mar 28, 2021", "text": "An absolutely amazing extension! If you ever find yourself skipping sponsor segments etc, this is perfect for you. Just keep in mind that it is a community thing and not all videos will have marked segments - new and really old videos especially.", "stars": 5}, {"date": "Mar 26, 2021", "text": "i never rate extensions, but this one, it's worth it. give it a try guys, trust me.", "stars": 5}, {"date": "Mar 26, 2021", "text": "Superb extension. This with a comment block extension makes YT tolerable.", "stars": 5}, {"date": "Mar 24, 2021", "text": "amazing app", "stars": 5}, {"date": "Mar 21, 2021", "text": "The entire thing broke the day after I started using it. Come on. An extension which can't handle being used? Disappointing.\n\nA bad start, but so, so often it just... doesn't skip.\nI have *every* category set to auto-skip. But it also tends to freeze the video when starting with a skip, too.\n\nIt has its clunks.", "stars": 4}, {"date": "Mar 21, 2021", "text": "Have you heard of RAID: Shadow Legends? \n\n\n\nYes? Well now you won't anymore.", "stars": 5}, {"date": "Mar 19, 2021", "text": "I've never rated an extension before, but SponsorBlock deserves a 5 star rating for the amount of time it has saved me.", "stars": 5}, {"date": "Mar 19, 2021", "text": "no more ads for cash grab mobile games or mediocre ear buds :)", "stars": 5}, {"date": "Mar 18, 2021", "text": "Thank you so much for this!", "stars": 5}, {"date": "Mar 16, 2021", "text": "This is god-tier. So much wasted time from sponsors. Gonna add my own submissions cuz this is great.", "stars": 5}, {"date": "Mar 13, 2021", "text": "Makes watching ad heavy channels like Linus Tech tips ACTUALLY VIEWABLE without the constant sponsorship spam. Whoever made this, you're a genius. Thanks!\n\nEdit 3/24 - Looks to be working again! Back to 5 stars.\n\nEdit 3/20 - Docked 2 stars because the app broke. Giving 502 errors, disabling the one function this extension actually had. Devs, fix your servers. It no longer works.\n\nEdit 6/3 - Works again! 5 stars!\n\nEdit 11/2 - Sike doesn't actually work again. 502 errors once more. Devs, fix yo... Show more", "stars": 3}, {"date": "Mar 8, 2021", "text": "perfect", "stars": 5}, {"date": "Mar 7, 2021", "text": "Perfect, does what it says.", "stars": 5}, {"date": "Mar 4, 2021", "text": "Just very helpful so I don't have to watch stupid raid sponsors", "stars": 5}, {"date": "Mar 4, 2021", "text": "The developer no longer knows how to run their server. Getting 502 errors 90% of the time I try to submit a segment, so I have to leave those videos behind most of the time. Seems they finally updated their status page but I got my message deleted when I asked them about it so I'm out.\n\nThis extension was amazing while it lasted but I don't think it's going to survive much longer. Only use it if you will never submit any segments.", "stars": 1}, {"date": "Mar 1, 2021", "text": "This morning, no longer working on Youtube on my Windows 10 machine. \nChrome browser: Version 88.0.4324.190 (Official Build) (64-bit)\nI don't know what happened.., but it seems the latest Chrome update has bugged the extension.\nCan the DEVs please look into it? It still shows the icons on videos, but no behavior.", "stars": 4}, {"date": "Feb 24, 2021", "text": "Makes watching youtube so much better", "stars": 5}, {"date": "Feb 18, 2021", "text": "Loved the idea. Works perfectly.", "stars": 5}, {"date": "Feb 7, 2021", "text": "I am extremely impressed! I use YouTube Vanced on an Android device, and SponsorBlock works so well on it.\n\nI then was curious if there was a desktop/laptop version available for Google Chrome, and to my excitement, there was! I normally use uBlock Origin ad my ad blocker but this obviously can't block interlaced sponsorship content but SponsorBlock solves this issue.\n\nI have never written a Google Chrome addon review before until today, and I shall be making an effort to learn how to contrib... Show more", "stars": 5}, {"date": "Feb 6, 2021", "text": "I love it! Could have been my idea...", "stars": 5}, {"date": "Feb 4, 2021", "text": "So useful!", "stars": 5}, {"date": "Jan 31, 2021", "text": "Used if for a few months, works perfectly.", "stars": 5}, {"date": "Jan 30, 2021", "text": "Musthave extension!", "stars": 5}, {"date": "Jan 28, 2021", "text": "Awesome extension!", "stars": 5}, {"date": "Jan 28, 2021", "text": "Actually so good, does exactly what it says and very impressed how many videos have adds cut out from! A must have.", "stars": 5}, {"date": "Jan 26, 2021", "text": "Basically crucial for anyone on Youtube", "stars": 5}, {"date": "Jan 25, 2021", "text": "I am right now contributing skips for some channels in Vietnam and others. If you have a reccomendation to me, please reply to this comment", "stars": 5}, {"date": "Jan 23, 2021", "text": "Awesome extension! Very useful. It can block not only sponsors, but the other annoying pats of the videos.", "stars": 5}, {"date": "Jan 23, 2021", "text": "This is the best youtube extension I have ever had the pleasure of using. The amount of videos already being notated is incredible. Submitting new segments is downright satisfying due to how good the experience is for me.", "stars": 5}, {"date": "Jan 20, 2021", "text": "I've never reviewed an extension before but this extension has saved me so much time in my life by removing the pointless HOURS of material youtubers put in their video to make it longer for the algorithm and monetization. Thank you", "stars": 5}, {"date": "Jan 19, 2021", "text": "This thing's practically essential to have, these days; great for bypassing in-video ads and cringetubers begging for subs and the like. No reason not to have this extension installed", "stars": 5}, {"date": "Jan 16, 2021", "text": "forget adblock on youtube, use sponsorblock. the creators will still get ad revenue this way.", "stars": 5}, {"date": "Jan 15, 2021", "text": "Awesome tool! Works great!", "stars": 5}, {"date": "Jan 15, 2021", "text": "Excellent Extension. Loads of options. I can't recommend this enough.\n\nWe need more contribution though. Please share this extension to your friends and ask them to contribute.", "stars": 5}, {"date": "Jan 14, 2021", "text": "Normally amazing, but for the past month or so it's been removing the settings gear from videos and I don't have any idea why or how I can fix it.", "stars": 2}, {"date": "Jan 13, 2021", "text": "Great plugin, community has been active and accurate too.", "stars": 5}, {"date": "Jan 13, 2021", "text": "Literal god-tier time-saving tool", "stars": 5}, {"date": "Jan 13, 2021", "text": "the best way to demonetize youtubers yourself when the algorithm fails", "stars": 5}, {"date": "Jan 10, 2021", "text": "Incredible", "stars": 5}, {"date": "Jan 9, 2021", "text": "Literally one of the best extensions ever made, big kudos.", "stars": 5}, {"date": "Jan 9, 2021", "text": "Must have extension for people who use extensively.", "stars": 5}, {"date": "Jan 6, 2021", "text": "Saves so much time one of my favourite extensions", "stars": 5}, {"date": "Jan 6, 2021", "text": "must have extension!! and dont forget help others!", "stars": 5}, {"date": "Jan 5, 2021", "text": "Awesome extension! I have been using it for several months now, and it's saved over 3 hours over sponsorship time now! Sponsorships mid-video are very annoying, and this extension just skips over them entirely! Very useful. 10/10", "stars": 5}, {"date": "Jan 4, 2021", "text": "Sponsorblock extension is one of the best things humanity has created.", "stars": 5}, {"date": "Jan 4, 2021", "text": "Top extension.", "stars": 5}, {"date": "Jan 3, 2021", "text": "Stop! Install this extension right now! YOU WILL LOVE IT. It is super easy to use, once you look around at what the various bits do, and go through the settings so you can auto-skip what you want, or set it to \"manual skip\", etc.\n\nThere's a little shield shaped button with an \"i\" in it on the playback bar, you click it, and you can set the beginning and ending times of sponsorship content, and/or \"please subscribe, like, comment, and share\" type content that you've already heard a million tim... Show more", "stars": 5}, {"date": "Jan 3, 2021", "text": "Constant server problems.", "stars": 3}, {"date": "Dec 31, 2020", "text": "In a few months of use it already saved me 10 full hours. Its crazy how much wasted time you are actually spending watching youtube videos without sponsorblock. Easy to use and easy to contribute. Probably the most usefull addons i have besides ublock origin.", "stars": 5}, {"date": "Dec 29, 2020", "text": "This is one of the must have extension for me. Very very thanks to the developer.", "stars": 5}, {"date": "Dec 28, 2020", "text": "Does it's job, considering there are segments to skip submitted. I hope that this plugin gets A LOT of attention. A dream would be if everyone uses this to submit trash on videos so that others gain a lot of time.", "stars": 5}, {"date": "Dec 26, 2020", "text": "Cant believe this extension exist. It has to be one of the best extensions out there. \nAmazing work dev and amazing work by community also for marking and maintaining the data.", "stars": 5}, {"date": "Dec 24, 2020", "text": "i am in heaven now \nthis is all that was missing in my life", "stars": 5}, {"date": "Dec 23, 2020", "text": "You are great man. Keep it up.", "stars": 5}, {"date": "Dec 21, 2020", "text": "perfect", "stars": 5}, {"date": "Dec 14, 2020", "text": "This is mind-blowingly amazing. No more ads, no more sponsored content, no more filler content. You just get to see what you came for. And it just works.", "stars": 5}, {"date": "Dec 13, 2020", "text": "Thanks you very epic", "stars": 5}, {"date": "Dec 3, 2020", "text": "Wonderful.", "stars": 5}, {"date": "Dec 2, 2020", "text": "Fantastic app. Works flawlessly", "stars": 5}, {"date": "Dec 2, 2020", "text": "really worth it. Works sooooo good!!", "stars": 4}, {"date": "Dec 1, 2020", "text": "Everything is easy to understand about the setup. You also have a whitelist option to enable ads on only some channels. Very nice, would recommend.", "stars": 5}, {"date": "Nov 30, 2020", "text": "good", "stars": 5}, {"date": "Nov 26, 2020", "text": "Update (2022) its working now with the \"Add 3rd-Party Client Instance\" option and some extra extension permissions! Thanks so much for that update! Changed to 5/5!!\n\nDoes not look to work with embed videos!? If im watching YouTube on desktop then im using https://youtube.videodeck.net/ and this does not look to work with YouTube Video Deck. If there is any way to make it work then please let me know and I will change my rating as I love this with Youtube Vanced!", "stars": 5}, {"date": "Nov 25, 2020", "text": "Excellent QoL features!", "stars": 5}, {"date": "Nov 23, 2020", "text": "This is amazing! Thank you so much!", "stars": 5}, {"date": "Nov 23, 2020", "text": "Love it!", "stars": 5}, {"date": "Nov 23, 2020", "text": "I LOVE it!", "stars": 5}, {"date": "Nov 19, 2020", "text": "Love it, does its job, the community is very good, and it saves me time!", "stars": 5}, {"date": "Nov 19, 2020", "text": "The best extension ever!", "stars": 5}, {"date": "Nov 18, 2020", "text": "Brilliant idea!", "stars": 5}, {"date": "Nov 15, 2020", "text": "It skips IN-VIDEO ads (the kind of sponsor where the uploader insert ad as part of the video, not the usual Youtube ads that you can block with adblock-type extensions). You can also contribute whenever you see new ads.", "stars": 5}, {"date": "Nov 14, 2020", "text": "Thanks for Vanced to introduce this to me!", "stars": 5}, {"date": "Nov 13, 2020", "text": "must have", "stars": 5}, {"date": "Nov 13, 2020", "text": "Amazing, I wish that it can work on iOS too, but Apple will obviously block it.", "stars": 5}, {"date": "Nov 11, 2020", "text": "I just installed and test it... wow this is a MUST (plus pihole, dnsCrypt and adblock)", "stars": 5}, {"date": "Nov 11, 2020", "text": "Best extension ever? It might be! Works flawlessly and makes YouTube videos watchable again!", "stars": 5}, {"date": "Nov 9, 2020", "text": "Indispensable", "stars": 5}, {"date": "Nov 7, 2020", "text": "Best thing ever with ublock origin and this addon it makes the youtube experience 100x better.", "stars": 5}, {"date": "Nov 7, 2020", "text": "This is really powerful sometimes i don't even notice that the video has a sponsor sometimes", "stars": 5}, {"date": "Nov 5, 2020", "text": "Thank you! I hate being forced to watch ads and will gladly send timings whenever i find the new ad in video. You are breathtaking!", "stars": 5}, {"date": "Nov 4, 2020", "text": "Seems to have an active community with many of the channels I watch, so segments get marked very quickly.  It works on an honor system but I very rarely see it being abused.  This will vary with channel popularity, obviously.  Love it overall, has saved me from so much RAID: Shadow Legends....", "stars": 5}, {"date": "Nov 3, 2020", "text": "Incredibly useful", "stars": 5}, {"date": "Nov 2, 2020", "text": "The \"next big thing\" in web browser ad blocking.", "stars": 5}, {"date": "Oct 31, 2020", "text": "Very good extension, recommend to everybody!", "stars": 5}, {"date": "Oct 30, 2020", "text": "Works Perfectly", "stars": 5}, {"date": "Oct 30, 2020", "text": "This is hands-down the best extension you'll ever add to chrome if you're a youtube power-user.", "stars": 5}, {"date": "Oct 26, 2020", "text": "Its ok but the fact that is relies on community input screws it over. Ive had it installed for a week and so far its skipped a bunch of stuff that was not a sponsor. Had the times wrong several times and overall it just seems pointless. \nIts not worth having it installed when you can just skip over the sponsor your self.", "stars": 2}, {"date": "Oct 25, 2020", "text": "Genius idea and implementation!", "stars": 5}, {"date": "Oct 22, 2020", "text": "just amazing ,pair this up with adblockplus and you will forget ads and sponsors ever existed", "stars": 5}, {"date": "Oct 17, 2020", "text": "this is excellent, thank you very much!", "stars": 5}, {"date": "Oct 14, 2020", "text": "This extension is wonderful! It saves a lot of time and boredom on youtube, the discord community is nice, and it's actively being maintained and updated. Can't rate it high enough!", "stars": 5}, {"date": "Oct 13, 2020", "text": "Great extension, now I don't have to listen to youtubers ramble on about raid shadow legends or nord vpn ever again.", "stars": 5}, {"date": "Oct 9, 2020", "text": "I only found out about this today when YouTube Vanced developers said they won't make a Desktop version with Sponsor Block (currently in Beta in the mobile version). This is great, and it's easier to use than mobile due to the bigger screen.", "stars": 5}, {"date": "Oct 8, 2020", "text": "Awesome, just awesome. The dev doesn't even put a donate link up anywhere, you have to go to the discord and ask if you want to be able to donate.", "stars": 5}, {"date": "Oct 6, 2020", "text": "actually works wow", "stars": 5}, {"date": "Oct 3, 2020", "text": "best thing after an adblocker for YouTube this is a must have and saves time. if u download try ur best to help other by marking videos,", "stars": 5}, {"date": "Sep 30, 2020", "text": "Works great, I almost never have to watch a sponsor anymore!", "stars": 5}, {"date": "Sep 28, 2020", "text": "I can't longer live without this add", "stars": 5}, {"date": "Sep 28, 2020", "text": "best app on the app store. genius idea and i hope other third party apps integrate this better with easy way to submit sponsored videos. maybe even for certain channels it always skips x seconds based on frequency.", "stars": 5}, {"date": "Sep 24, 2020", "text": "thank u the best app ever save my time thanks u", "stars": 5}, {"date": "Sep 19, 2020", "text": "Works great, does exactly what its meant to with no issues", "stars": 5}, {"date": "Sep 13, 2020", "text": "Amazing! I'm amazed at how quickly some videos get submissions and also amazed at how many are covered! Great idea, great execution! This is easily one of the best add-ons in the google play store.", "stars": 5}, {"date": "Sep 9, 2020", "text": "Saves so much time amazing!", "stars": 5}, {"date": "Sep 8, 2020", "text": "going to use this every time I find a sponsorship. much appreciated.", "stars": 5}, {"date": "Sep 8, 2020", "text": "I just love this extension! Also Contributed some segments and saved time of others! I Love this extension!", "stars": 5}, {"date": "Sep 8, 2020", "text": "based", "stars": 5}, {"date": "Sep 8, 2020", "text": "OSM app dude", "stars": 5}, {"date": "Sep 6, 2020", "text": "Really useful", "stars": 5}, {"date": "Sep 3, 2020", "text": "Awesome Extension great work developer!!", "stars": 5}, {"date": "Sep 3, 2020", "text": "Extension works pretty flawlessly. I haven't had a problem with it at all. Only problem is sometimes the users submit some fairly innacurate times but its uncommon.", "stars": 5}, {"date": "Sep 2, 2020", "text": "This extension is a must-have if you are frequently watching YouTube videos, instead of wasting time watching sponsors, you can skip it with a click. A very useful extension that can save you time.", "stars": 5}, {"date": "Sep 2, 2020", "text": "This is genuinely some of the best computer software ever conceived. Thanks for this.", "stars": 5}, {"date": "Aug 31, 2020", "text": "Wow this extension works like magic, i was surprised by how smoth and accurate it's, if more people use it that would be amazing. respect for the developers from algeria <3", "stars": 5}, {"date": "Aug 31, 2020", "text": "Best quality of life extenstion. I discovered this on reddit and have used it ever since. I used it so much I was one of the top 100 contributors for some time", "stars": 5}, {"date": "Aug 31, 2020", "text": "THE BEST THING EVER, IDK WHY EVERYONE ISN'T TALKING ABOUT IT.", "stars": 5}, {"date": "Aug 28, 2020", "text": "This is probably the best web browser extension I know of right after uBlock Origin. YouTube is nowadays filled with unnecessary sponsor information and this extension is the best way to conveniently get rid of all of that.  Its database is already huge and is growing constantly. Thank you guys for your hard work!", "stars": 5}, {"date": "Aug 27, 2020", "text": "wonderfull. now it is also in youtube vanced. loved it. i always hated sponsors.  but this is life saver for me.", "stars": 5}, {"date": "Aug 27, 2020", "text": "this is a game changer!", "stars": 5}, {"date": "Aug 27, 2020", "text": "STRONGLY RECOMMENDED! \nSHARED TO ALL OF MY FRIEND (wich are none, but still)", "stars": 5}, {"date": "Aug 24, 2020", "text": "Great idea and pretty nice realization! Being a payed member of YouTube, I feel that it's an absurd, to watch promotions. This extensions helps me to make more sense from usage of the service.", "stars": 5}, {"date": "Aug 23, 2020", "text": "Great! Works really well for popular channels", "stars": 5}, {"date": "Aug 21, 2020", "text": "Fantastic addon. It saves me so much time.", "stars": 5}, {"date": "Aug 21, 2020", "text": "The best extension I've ever used. It blocks 95% of in-video ads, and when it doesn't work, it allows me to block them manually for everyone else. \nNow we just need something like this for the like/subscribe/comment/ring-bell/patreon/etc/etc/etc begging at the beginning of every video ;)", "stars": 5}, {"date": "Aug 19, 2020", "text": "works perfectly", "stars": 5}, {"date": "Aug 17, 2020", "text": "Works as intended.", "stars": 5}, {"date": "Aug 16, 2020", "text": "Amazing, was suggested this from a friend and absolutely love it. Thank you!", "stars": 5}, {"date": "Aug 14, 2020", "text": "Biggest youtube experience enhancer since adblock this rocks so hard", "stars": 5}, {"date": "Aug 14, 2020", "text": "Great extension! I'm often surprised how quickly sponsors are blocked.", "stars": 5}, {"date": "Aug 13, 2020", "text": "Must have these days. It's user contributed which is cool and there's something satisfying about adding the sponsor section yourself knowing that you're saving other people precious time :)", "stars": 5}, {"date": "Aug 13, 2020", "text": "Works Perfetly", "stars": 5}, {"date": "Aug 6, 2020", "text": "i mean it does what it says, it skips sponsors", "stars": 5}, {"date": "Aug 5, 2020", "text": "08/16-2023 Sponsorblock is incrased with a lot of functions, options, and universal (desktop browsers), certain mobile browsers (Firefox...) and a lot of alternative YouTube apps. Very reactive community and owner.\n\n08/05-2020 Not working now why? I used this in kiwi browser and with Newpipe to skip annoying sponsors in Android. I'm sad.", "stars": 5}, {"date": "Aug 4, 2020", "text": "I've been using this for months now, and it is the best extension available after an adblocker. If you're someone who watches a lot of youtube, this will change your whole life, at least on desktop.", "stars": 5}, {"date": "Aug 2, 2020", "text": "Amazing! Blocks annoying sponsorships!", "stars": 5}, {"date": "Aug 2, 2020", "text": "blocks almost every video with over 10.000 views! great program", "stars": 4}, {"date": "Aug 2, 2020", "text": "This is one of the best extensions I've ever seen!", "stars": 5}, {"date": "Aug 2, 2020", "text": "It works so well!!", "stars": 5}, {"date": "Jul 30, 2020", "text": "It doesn't skip Raid: Shadow Legends sponsors >: (", "stars": 1}, {"date": "Jul 29, 2020", "text": "works amazingly! its so smooth sometimes i dont even realize it skips anything. Until i watch videos on my phone and suffer from all these sponsorships", "stars": 5}, {"date": "Jul 27, 2020", "text": "Works just as it says on the tin. Absolutely excellent.", "stars": 5}, {"date": "Jul 25, 2020", "text": "Best addon I use currently!", "stars": 5}, {"date": "Jul 24, 2020", "text": "Genuinely one of the best extensions out there. Works as it should, and I no longer have to watch all these samey, tedious sponsor segments!", "stars": 5}, {"date": "Jul 24, 2020", "text": "This is an amazing extension.  It works as advertised...unless you try to smarty-pants like I did and install the Chrome Store version in Chromium Edge.  If you're using Chromium Edge, you actually need the Edge Store version of this extension for once (despite MOST Chrome extensions working fine in Chromium Edge).  Get off this store and use the Edge link!", "stars": 5}, {"date": "Jul 20, 2020", "text": "I never leave reviews on web store extensions but this extension compelled me to do so. This extension will literally change your life. It will save you from countless hours of mundane corporate garbage that is sponsors. Please do you self and your precious time a favour and install this.", "stars": 5}, {"date": "Jul 16, 2020", "text": "A must have.\n\nHaving some trouble with the unlisted/whitelist. I get the popup for unlisted videos always (even on whitelisted with zero check). A global 'never check unlisted' would be nice, as would a default 'never check whitelisted for unlisted'. A granular whitelist (eg allow intro vs sponsor) would be nice too, but one can dream.", "stars": 5}, {"date": "Jul 13, 2020", "text": "Genius plugin and a great addition to regular Ad Blockers!", "stars": 5}, {"date": "Jul 11, 2020", "text": "It is so good. I hope that it will be included in the official vanced versions too", "stars": 5}, {"date": "Jul 9, 2020", "text": "Its really epic, thats all I gotta say", "stars": 5}, {"date": "Jul 4, 2020", "text": "This is the BEST extension since AdBlock!  I cannot watch YouTube videos without this extension!  THANK YOU!!!", "stars": 5}, {"date": "Jun 29, 2020", "text": "AWESOME!", "stars": 5}, {"date": "Jun 27, 2020", "text": "Best add-on i have ever seen", "stars": 5}, {"date": "Jun 22, 2020", "text": "Works after new patch", "stars": 5}, {"date": "Jun 22, 2020", "text": "An awesome time and annoyance saver, makes me want to watch more YT on desktop so that I can skip over sponsorships automatically.", "stars": 5}, {"date": "Jun 22, 2020", "text": "Modern Youtube Must Have. This video is sponsored by raid shad- Now back to the video. Becuase like every semi high effort video on youtube these days has a sponsor in it, youtube is starting to feel like watching recorded live tv but this thing skips the ad. Great app and i really appreciate people who make these sort of things", "stars": 5}, {"date": "Apr 10, 2020", "text": "At this point in time, this extension is really a must have 5/5", "stars": 5}, {"date": "Apr 10, 2020", "text": "Works like a charm sometimes people even skip over the introduction of tutorial videos, really useful stuff.", "stars": 5}, {"date": "Mar 28, 2020", "text": "Worked", "stars": 5}, {"date": "Mar 14, 2020", "text": "This tools is so amazing, it allows me to watch channels i've quit over to much sponsor time. \nIt is simply fantastic, If you are not using it yet... why, make your life better with this extension.\nWorks fantastic, and also  for firefox.\n\nNow hoping there will be an android version, that would be awesome!", "stars": 5}, {"date": "Mar 8, 2020", "text": "Deprives content creator of sponsorships and makes their lives harder.", "stars": 1}, {"date": "Mar 7, 2020", "text": "By making this you have become my favorite person.", "stars": 5}, {"date": "Mar 4, 2020", "text": "I don't often leave reviews but I've used this everyday for a couple months now and it's excellent. I hope it doesn't change and become bad.", "stars": 5}, {"date": "Mar 3, 2020", "text": "Works great. I would like an option where instead of skipping the sponsor, it plays the sponsored section at a higher speed, like for example 4 times faster. That way I can skip most of the sponsor but be able to see if I missed actual content by accident if a normal part of the video was marked as a sponsor.", "stars": 5}, {"date": "Mar 2, 2020", "text": "Saved a lot of time! Thank you!", "stars": 5}, {"date": "Feb 21, 2020", "text": "Love the app. Would it be possible to add a grace period for sponsorship submissions? I just submitted a bad segment by mistake and I'd hate for it to bother other users :)", "stars": 5}, {"date": "Feb 13, 2020", "text": "I really love this :D", "stars": 5}, {"date": "Feb 8, 2020", "text": "sick", "stars": 5}, {"date": "Feb 5, 2020", "text": "SponsorBlock + nanodefender + nano adblock (or ublock) is just a bless to navigate the internet.\nMay the pirate god bless you.", "stars": 5}, {"date": "Feb 2, 2020", "text": "Works Great", "stars": 5}, {"date": "Feb 2, 2020", "text": "Was working great and then it started skipping chunks of videos where the video didn't even have a sponsor, so it was not flagged. I've disabled it but hope its fixed soon so i can continue to use it and flag videos as well.\n\nE. Issue has been fixed :) Excellent App.", "stars": 5}, {"date": "Jan 31, 2020", "text": "Perfect!", "stars": 5}, {"date": "Jan 30, 2020", "text": "I didn't expect much but i can't believe how often this works.Everyone should try this out. I never even get to flag sponsor times because someone else always beats me to it, it's awesome.", "stars": 5}, {"date": "Jan 29, 2020", "text": "This works perfectly. Everybody should be using it. I'm so glad I don't have to listen to youtubers ramble on about VPNs and Web-builder sits anymore.", "stars": 5}, {"date": "Jan 27, 2020", "text": "It is the best freaking extention in existence. This is my first ever review here! Great job! IDK how it works but it makes the youtube watching experience so much better! We did it boys! Raid Shadow Legends is no more!", "stars": 5}, {"date": "Jan 25, 2020", "text": "Fantastic. Been using it for nearly 2 months and it has perfect features, I can't imagine how it could be improved besides that cool neural network idea on the devs site. However, a leaderboard and real people achieve the same effect ;b", "stars": 5}, {"date": "Jan 15, 2020", "text": "bro... this is the ultimate raid shadow legends sponsored ad killer\nepic........................", "stars": 5}, {"date": "Jan 14, 2020", "text": "Works like wonders, it's amazing", "stars": 5}, {"date": "Jan 11, 2020", "text": "It worked fine, but today I can mark the sponsor parts OK, but the SEND button doesn't seem to work.", "stars": 4}, {"date": "Jan 4, 2020", "text": "Installed and am using because of Linus Tech Tips.\n\nI'm okay with their sponsor advertisements. I despise their smug LTT Store advertisements every video, though. So if the other Sponsor spots have to take the hit because of those LTT Store advertisements, so be it.", "stars": 5}, {"date": "Jan 2, 2020", "text": "It worked really well for a while, though seems to have stopped working overnight, it doesn't even skip anymore on videos which previously used to. Also i don't appear on any leaderboards despite having higher figures than many.", "stars": 3}, {"date": "Dec 29, 2019", "text": "\"This video was sponsored by tunnelb...\" is now a thing of the past, thanks to sponsor block. Cant rate highly enough!", "stars": 5}, {"date": "Dec 21, 2019", "text": "That's some good stuff in there. The database is being constantly updated, even on small videos, and it's very nice and smooth to help fill the database yourself.", "stars": 5}, {"date": "Dec 16, 2019", "text": "Works perfectly, if the sponsorship segment is not marked already, you can do it yourself.", "stars": 5}, {"date": "Dec 14, 2019", "text": "I can finally enjoy Linus Tech Tips again", "stars": 5}, {"date": "Dec 13, 2019", "text": "Amazing!", "stars": 5}, {"date": "Dec 13, 2019", "text": "This is a necessity to watch modern day youtube.", "stars": 5}, {"date": "Dec 11, 2019", "text": "Absolutely amazing idea and implementation. If only it were possible to have this extension for the youtube app on mobile devices, even YT premium doesn't do this!", "stars": 5}, {"date": "Dec 9, 2019", "text": "This is the best extension, combined with uBlock, you get a smooth experience on YouTube with as little ads as possible. The community is great and you can easily add time stamps. Thanks for all your work!", "stars": 5}, {"date": "Dec 9, 2019", "text": "I dont mind ads on youtube, i do mind sponsorships. This extension takes care of that brilliantly. Absolutely amazing.", "stars": 5}, {"date": "Dec 7, 2019", "text": "its actually pretty good", "stars": 5}, {"date": "Dec 6, 2019", "text": "Wow Jacksfilms is watchable again! <3", "stars": 5}, {"date": "Dec 5, 2019", "text": "works perfectly on linus tech", "stars": 5}, {"date": "Dec 5, 2019", "text": "Works surprisingly well.", "stars": 5}, {"date": "Dec 5, 2019", "text": "perfect", "stars": 5}, {"date": "Nov 16, 2019", "text": "One of the best extensions after adblock.", "stars": 5}, {"date": "Nov 14, 2019", "text": "Unfortunately doesn't work. :-( Nothing can be submitted and the developer's website seems to be down.", "stars": 1}, {"date": "Oct 27, 2019", "text": "when submitting time it is just says loading. please fix it.", "stars": 4}, {"date": "Oct 22, 2019", "text": "Saves me a lot of time.\nThanks", "stars": 5}, {"date": "Oct 20, 2019", "text": "Works perfectly.", "stars": 5}, {"date": "Oct 17, 2019", "text": "finally apps like this exist", "stars": 5}, {"date": "Oct 16, 2019", "text": "This is brilliant a must have for Youtube.", "stars": 5}, {"date": "Oct 11, 2019", "text": "The more people making good reports, the better this extension gets!", "stars": 5}, {"date": "Oct 2, 2019", "text": "This app is fantastic! after the 100,000th NordVPN or RAID ad your ready to blow your brains out huge thanks to the creator!", "stars": 5}, {"date": "Oct 2, 2019", "text": "Awesome extension, works great so far and finally a solution to the modern type of ads", "stars": 5}, {"date": "Sep 15, 2019", "text": "This extension is pure genius! It just works!", "stars": 5}, {"date": "Sep 15, 2019", "text": "Found it via a youtube comment. Probably the best youtube extension on the web.", "stars": 5}, {"date": "Sep 1, 2019", "text": "Works really well for a lot of videos. Still needs data for mostly older videos but it's constantly improving.", "stars": 5}, {"date": "Aug 28, 2019", "text": "Quite consistent", "stars": 5}, {"date": "Aug 22, 2019", "text": "This is amazing. Love how quickly the users submit the skips before i do. Its like a race. \nthank you", "stars": 5}, {"date": "Aug 19, 2019", "text": "Thanks for fixing the Internet, in a way not even Youtube Premium can help! Works flawlessly!", "stars": 5}, {"date": "Aug 19, 2019", "text": "Absolutely fantastic! Thanks for making this!", "stars": 5}, {"date": "Aug 18, 2019", "text": "This is practically wizardry lol. Well done!", "stars": 5}, {"date": "Aug 8, 2019", "text": "It's so seamless that I sometimes don't even realize I've skipped a sponsor-spot!", "stars": 5}, {"date": "Aug 2, 2019", "text": "Excellent app. Now it just needs more users", "stars": 5}, {"date": "Jul 30, 2019", "text": "Mind blowing! Great job guys!", "stars": 5}, {"date": "Jul 27, 2019", "text": "Linus Tech Tips has never been this bearable!", "stars": 5}, {"date": "Jul 27, 2019", "text": "The idea is good, but this extension keeps cutting out random bits of youtube videos that do not contain sponsors.", "stars": 2}]