[{"stars": 5, "text": "Perfect!", "date": "Feb 14, 2024"}, {"stars": 1, "text": "doesn't work on mac at all.", "date": "Jan 30, 2024"}, {"stars": 5, "text": "Much useful for UI Developers", "date": "Jan 17, 2024"}, {"stars": 1, "text": "it doesn't work", "date": "Jan 17, 2024"}, {"stars": 5, "text": "That's what I was looking for.", "date": "Jan 4, 2024"}, {"stars": 1, "text": "This plugin works, but not everywhere, and this is not the worst thing about it. In fact, I have conducted a test in Figma, where I typically require additional measurements, and I have observed that this plugin yields inaccurate data. If I change the zoom of the canvas, the measuring brakes and after relaunching, the value changes compared to the previous one. Furthermore, the plugin is ineffective if the zoom level of the webpage is not 100%", "date": "Dec 26, 2023"}, {"stars": 1, "text": "Doesn't seem to work at all", "date": "Nov 17, 2023"}, {"stars": 5, "text": "this is a great one!", "date": "Aug 22, 2023"}, {"stars": 2, "text": "If you want to find the dimensions of a selected area on the screen, the just get Nimbus Screenshot & Screen Video Recorder", "date": "Jun 24, 2023"}, {"stars": 3, "text": "It sort of works and it sort of doesn't.\nFirst you have to make sure the extension icon is lit for the site you are trying to measure.\nThen you have to fight the browser. The ALT+D shortcut just highlights the address bar.\nFor some pages and some CSS elements it snaps to the wrong things making it useless, but for others it works fine.\nYMMV", "date": "Jan 3, 2023"}, {"stars": 5, "text": "nice extension work perfectly", "date": "Nov 30, 2022"}, {"stars": 5, "text": "This extensions works great unless the zoom level for the page is changed. Then the extension does not work anymore.", "date": "Oct 31, 2022"}, {"stars": 1, "text": "Doesnt work!!!!", "date": "Aug 20, 2022"}, {"stars": 1, "text": "It doesn't work. Clicked on it, and nothing happens at all.", "date": "May 17, 2022"}, {"stars": 5, "text": "Perfect for measuring awkward buttons and icons", "date": "May 4, 2022"}, {"stars": 5, "text": "The last update was in 2017 but it works perfectly. Thanks a lot for the extension!", "date": "Mar 3, 2022"}, {"stars": 5, "text": "the best extension for designers. 💙", "date": "Feb 9, 2022"}, {"stars": 5, "text": "This extension is actually pretty awesome.  It gives you crosshairs on your screen that follow the mouse, and as you move between elements it gives you height and width in pixels.  Freakin' genius!", "date": "Nov 9, 2021"}, {"stars": 5, "text": "Useful tool", "date": "Oct 3, 2021"}, {"stars": 1, "text": "Noooooo. Fake reviews it doesn't works at all .PLs don't download it if you ae for a review always short by recent. Boomer", "date": "Jul 26, 2021"}, {"stars": 5, "text": "Great one!", "date": "Jun 10, 2021"}, {"stars": 1, "text": "How to use it?", "date": "May 27, 2021"}, {"stars": 5, "text": "perfect ！", "date": "Feb 1, 2021"}, {"stars": 5, "text": "Fantastic tool. It recognises inner divs sizes and paddings. Very helpful productivity tool measuring current html vs designs.", "date": "Dec 21, 2020"}, {"stars": 5, "text": "Simply awesome! LOOOOOVE it :D", "date": "Sep 13, 2020"}, {"stars": 3, "text": "It doesn't measure distance between HTML elements (or text nodes including \"line-height\"). \n\nI was looking for a tool that snaps to HTML elements and text nodes, allowing to select two and measure distance between them no matter where on the screen they are, no matter how many other elements are in between them. \n  \nThis tool is very simple and measures only internal size of elements, as it detects color change. It's fine only for simple measurements. \n\nI'm still looking for something more ad... Show more", "date": "Aug 11, 2020"}, {"stars": 4, "text": "It's an awesome tool. The only problem is that it only sees pixels. An element with an line height would be ignored, picking the first pixel it can find", "date": "Jul 24, 2020"}, {"stars": 5, "text": "Great plugin! absolutely amazing. 🙏🏼\nI hope an update is released to fix it, its not working when devtools is open.", "date": "Apr 15, 2020"}, {"stars": 4, "text": "all good.\nbut it is not working when page is zoomed in", "date": "Mar 30, 2020"}, {"stars": 2, "text": "Extension doesn't work if your website isn't public", "date": "Mar 18, 2020"}, {"stars": 4, "text": "Doesn't measure the elements, but it does measure the pixels between color changes (Like images, text, etc.)\nGreat btw", "date": "Feb 20, 2020"}, {"stars": 5, "text": "The tool is so good for web designing! It saves you a lot of time.", "date": "Feb 5, 2020"}, {"stars": 5, "text": "Very nice tool!\nIt's way faster than drawing a box around an element for measurements.", "date": "Jan 24, 2020"}, {"stars": 2, "text": "Not working for chrome responsive (chrome dev tools--> toggle device toolbar --> responsive)", "date": "Jan 10, 2020"}, {"stars": 5, "text": "Great job ! Thank you for this amazing tool. This should be embedded on all browser's devtools.", "date": "Jan 4, 2020"}, {"stars": 3, "text": "no support for local files?", "date": "Dec 5, 2019"}, {"stars": 1, "text": "No longer works.", "date": "Nov 7, 2019"}, {"stars": 4, "text": "working fine", "date": "Nov 7, 2019"}, {"stars": 2, "text": "It's not working anymore on version 77 +", "date": "Nov 4, 2019"}, {"stars": 4, "text": "Great tool, almost perfect. Keep up the good work ;)", "date": "Oct 25, 2019"}, {"stars": 1, "text": "DOES NOT WORK", "date": "Sep 27, 2019"}, {"stars": 4, "text": "It doesn't work in mobile inspect veiw", "date": "Aug 20, 2019"}, {"stars": 5, "text": "Easy to use and useful", "date": "Aug 2, 2019"}, {"stars": 1, "text": "Literally doesn't work at all.", "date": "Jul 23, 2019"}, {"stars": 1, "text": "Does nothing as of today, Chrome 75.0.3770.100", "date": "Jun 28, 2019"}, {"stars": 5, "text": "great", "date": "Jun 19, 2019"}, {"stars": 5, "text": "amazing tool, thank you.", "date": "Jun 3, 2019"}, {"stars": 1, "text": "don't work.", "date": "May 22, 2019"}, {"stars": 1, "text": "This doesn't work at all, reviews seem like it does but I can see I'm not alone from under the \"support\" tab.", "date": "Apr 29, 2019"}, {"stars": 4, "text": "work in local\nuse wamp or xampp", "date": "Apr 9, 2019"}, {"stars": 5, "text": "Great extension, great tool for web design.", "date": "Mar 25, 2019"}, {"stars": 5, "text": "Awesome tool for web design - huge time saver!", "date": "Feb 8, 2019"}, {"stars": 4, "text": "amazing tool for measuring screen and any screen area if I want to check Image dimension or other used. I use it.", "date": "Jan 29, 2019"}, {"stars": 5, "text": "very good tool", "date": "Dec 7, 2018"}, {"stars": 5, "text": "One of a kind tool!", "date": "Nov 7, 2018"}, {"stars": 5, "text": "It even tries to measure images using colored areas.\nVery nice.", "date": "Oct 11, 2018"}, {"stars": 2, "text": "Get Failed to check angular page.", "date": "Sep 26, 2018"}, {"stars": 4, "text": "When I press ALT for box-measuring it's pretty laggy and unable to use, but despite that it is best tool for perfect pixel measuring I ever found. It even catch color differences in images.", "date": "Sep 24, 2018"}, {"stars": 4, "text": "This tool is amazing! This tool works very well on websites with plain background colors but not on websites with background images. Please add an option to choose on where you want to start measuring. Thanks!", "date": "Sep 7, 2018"}, {"stars": 3, "text": "Does not let you measure distances bw arbitrary points on a page. And if it does, does not provide instructions on how to do it", "date": "Sep 4, 2018"}, {"stars": 5, "text": "Good extension. Work perfect and very useful)).", "date": "Sep 2, 2018"}, {"stars": 5, "text": "Great tool! Very easy to use! Ty!", "date": "Aug 7, 2018"}, {"stars": 5, "text": "I Really liked this extension, helped me so much as a front-end developer, i just have a question, is it possible to make allowed for local url files\n\nThank you", "date": "Jun 25, 2018"}, {"stars": 1, "text": "Chorme Offline Not Working", "date": "Jun 20, 2018"}, {"stars": 4, "text": "Useful tool. But it's not working on mobile mode.", "date": "Apr 9, 2018"}, {"stars": 5, "text": "Super useful! The only issue I find is that it doesn't work inside of iframes. Would be a nice feature to add.", "date": "Apr 5, 2018"}, {"stars": 5, "text": "Great extension, thank you!", "date": "Mar 22, 2018"}, {"stars": 5, "text": "Amazing thing for web develoment. Great thanks to author!", "date": "Mar 16, 2018"}, {"stars": 5, "text": "Absolutely amazing! Far cleverer that I expected!\n\nEven works on images (within reason) and PDFs\n\nSaved so much time!!!", "date": "Feb 15, 2018"}, {"stars": 5, "text": "Amazing tool", "date": "Feb 12, 2018"}, {"stars": 5, "text": "Does what it says and does it well. Would be cool to be able to click and drag for some measurements, but still a great extension.", "date": "Feb 6, 2018"}, {"stars": 5, "text": "It has been 6 years, have been searching for this kind of measure  tool finally found it. \nAwesome :-)", "date": "Jan 10, 2018"}, {"stars": 5, "text": "What a perfect extension !\nIt snaps to all items in your screen and real time says dimensions!\nI like it so much :)\nThank you provider.", "date": "Oct 30, 2017"}, {"stars": 5, "text": "Amazing!", "date": "Oct 27, 2017"}, {"stars": 5, "text": "Easy to use and very beneficial.", "date": "Oct 25, 2017"}, {"stars": 5, "text": "Unique, very simple and easy to use - helps me in my work as a developer.", "date": "Oct 22, 2017"}, {"stars": 5, "text": "Godlike!", "date": "Oct 20, 2017"}, {"stars": 5, "text": "Very helpful.", "date": "Aug 30, 2017"}, {"stars": 5, "text": "Amazing, Amazing, Amaaazing...works on in-image dimensions as well!!! Amazing!!!", "date": "Jun 23, 2017"}, {"stars": 5, "text": "Nice", "date": "Jun 22, 2017"}, {"stars": 4, "text": "Very useful. If it could be made to work properly with the page zoomed in, I'd definitely give it 5 stars.", "date": "Jun 16, 2017"}, {"stars": 5, "text": "Absolutely amazing tool; goes to all the nooks and crannys of icons as well. This will save me a huge amount of time, wish I found this sooner.\n\nI never usually leave reviews for extensions but felt this was so helpful I just had to..... awesome work, love it!", "date": "May 27, 2017"}, {"stars": 2, "text": "It only measure horizontally and vertically, on its own.\n\nThere is no way to choose your own points of measurement.", "date": "Feb 1, 2017"}, {"stars": 5, "text": "Only just installed but appears to do exactly what I was looking for!", "date": "Jan 16, 2017"}, {"stars": 1, "text": "Pressing alt and everything and anything to get this working. Doesn't work for me.. newest version of Chrome.", "date": "Dec 29, 2016"}, {"stars": 5, "text": "As a front end dev this is a must have tool. Incredible work. Clean, simple and reliable. Perfect for static designs to measure padding and margins.", "date": "Nov 4, 2016"}, {"stars": 1, "text": "Another tool that doensn't work on modals/overlays - a z-index issue", "date": "Nov 2, 2016"}, {"stars": 5, "text": "Thank you!!! Amazing!", "date": "Oct 29, 2016"}, {"stars": 5, "text": "Excellent", "date": "Oct 21, 2016"}, {"stars": 5, "text": "Thanks a lot!", "date": "Oct 5, 2016"}, {"stars": 4, "text": "Great Tool, but can you make the icon look a little bit less a swastika? :(", "date": "Sep 23, 2016"}, {"stars": 5, "text": "Nice tool.", "date": "Sep 5, 2016"}, {"stars": 5, "text": "Nice tool. really.", "date": "Aug 25, 2016"}, {"stars": 5, "text": "Very handy!", "date": "Jul 27, 2016"}, {"stars": 2, "text": "It chooses what it wants to measure. Also it's useless in images", "date": "Jun 20, 2016"}, {"stars": 5, "text": "useful", "date": "Jun 20, 2016"}, {"stars": 5, "text": "Awesome. Works with images as well, just what I needed.", "date": "May 18, 2016"}, {"stars": 5, "text": "Simple way to measure  inside pixel height and width of web page elements. Great for sizing photo required dimensions. Wish the blue lines and end stops were a little thicker.", "date": "Apr 27, 2016"}, {"stars": 5, "text": "Love it! Thank you so much!", "date": "Apr 15, 2016"}, {"stars": 1, "text": "Works 1 out of 10 times.. :/ Very poor.", "date": "Mar 23, 2016"}, {"stars": 5, "text": "Loved the fact that it works on top of images also", "date": "Feb 9, 2016"}, {"stars": 5, "text": "It's really fantastic!!!", "date": "Jan 25, 2016"}, {"stars": 5, "text": "So long was waiting for this", "date": "Dec 23, 2015"}, {"stars": 1, "text": "You can't drag a marquee around .. don't see the point.", "date": "Nov 26, 2015"}, {"stars": 5, "text": "An incredible, necessary for anyone who does web design.", "date": "Nov 21, 2015"}, {"stars": 5, "text": "This extension is awesome", "date": "Nov 20, 2015"}, {"stars": 1, "text": "Does not measure distance. keeps showing some dimensitons. There is no start and end points to measure. Also the scale hides behind images and popups", "date": "Sep 7, 2015"}, {"stars": 5, "text": "Very powerful and useful in designing and analyzing page content blocks and images.", "date": "Aug 27, 2015"}, {"stars": 1, "text": "Surely you need black objects on white background for this to work... or something that has NO shading or color hue variance, because measuring objects in photographs is impossible.  It will pick up the slightest nuance in shading and take it as a border, measuring random points within an obkect.  I have tried to measure bicycle frames, for example, and it has selected some random pixel in the middle of a tube, and another random pixel way off to the right in the white area of the screen, giv... Show more", "date": "Aug 13, 2015"}, {"stars": 5, "text": "I love how simple and effective this tool is. It does exactly what I wanted.", "date": "Aug 5, 2015"}, {"stars": 4, "text": "Can you change shortcut from Ctrl+D to anything else as Ctrl+D used for bookmarking any site in chrome browser. Please advice.", "date": "Jun 30, 2015"}, {"stars": 1, "text": "Change shortcut CMD+D to another ... with this shortcut is \"Dimensions\" unusable", "date": "Jun 25, 2015"}, {"stars": 1, "text": "Takes Chromes CTRL+D keyboard shortcut for add bookmark for itself.", "date": "Jun 2, 2015"}, {"stars": 5, "text": "This extension is awesome. Its shortcut is no longer conflicting with the bookmark functionality and it seems more stable.", "date": "May 6, 2015"}, {"stars": 4, "text": "I'd like to be able to hit escape to switch off the tool.\n\nAlso I agree with Gabriel that you should be able to choose whether to measure text to its outline or line height/bounding box.", "date": "Apr 22, 2015"}, {"stars": 2, "text": "It breaks the ability to add a bookmark...", "date": "Apr 21, 2015"}, {"stars": 2, "text": "It's very useful, but it breaks your ability to bookmark things. You can't click on the star in the address panel or use a keyboard shortcut. The workaround is to highlight the whole URL and drag it to a bookmark folder.", "date": "Apr 21, 2015"}, {"stars": 1, "text": "I'm giving it one star because they're taking a long time to fix the bug where it breaks your ability to add a bookmark!", "date": "Apr 16, 2015"}, {"stars": 3, "text": "this is nice but the one downfall is that the key binding is the same for bookmarking, I would give 4 or 5 stars if that was an option to change.", "date": "Apr 8, 2015"}, {"stars": 2, "text": "There seems to be a conflict somewhere on Macs, cmd+d no longer bookmarks websites, it activates this dimensions plugin. Can't click on the start to bookmark a page either. In general just can't bookmark when this plugin is enabled.", "date": "Apr 7, 2015"}, {"stars": 5, "text": "Plugin is useful, but ability to add bookmark seems being broken", "date": "Apr 2, 2015"}, {"stars": 3, "text": "This is one of my favourite extensions for front end development but it's pretty buggy, doesn't always work and I've had to disable it this week since it started disabling the bookmark button. When I try bookmark something this extension button is clicked instead but the extension doesn't start working. Will remain disabled until you fix it.", "date": "Mar 31, 2015"}, {"stars": 5, "text": "Love it. Just a curious question about changing shortcode key. I used to \"CTRL+D\" for adding a current page for bookmark for a long time. Can you tell me how do I change your extension shortcode or disable key activation? (Win7+chrome)", "date": "Mar 26, 2015"}, {"stars": 2, "text": "I really like the extension. But as others already mentioned it sometimes doesn't properly intialize. I had to disable it because it overrides the bookmark functionality.\n\nIf that gets fixed – 5 stars.", "date": "Mar 19, 2015"}, {"stars": 4, "text": "It's a very nice and very useful app, the only one problem right now is I cannot add a new bookmark in chrome, I use it on Mac OS X. I saw the same problem happens in Windows, though it works fine in Linux (Ubuntu).", "date": "Mar 12, 2015"}, {"stars": 2, "text": "Great concept but like others have mentioned, it overrides the bookmark functionality even when you click add bookmark in the menus. Had to install it.", "date": "Mar 11, 2015"}, {"stars": 2, "text": "Just had to switch it off because it overrode my bookmarking functionality in chrome (both clicking the star and ctrl-d)", "date": "Mar 11, 2015"}, {"stars": 3, "text": "Doesn't work on canvas. That's like going back to xScope", "date": "Mar 4, 2015"}, {"stars": 4, "text": "liked", "date": "Mar 2, 2015"}, {"stars": 5, "text": "Awesome, thanks.", "date": "Feb 17, 2015"}, {"stars": 4, "text": "This is a great extension but it sometimes doesn't initialize and render. Besides that, it's a must for web dev work.", "date": "Jan 20, 2015"}, {"stars": 5, "text": "Excellent plug in and easy to use.", "date": "Jan 17, 2015"}, {"stars": 1, "text": "does nothing", "date": "Jan 4, 2015"}, {"stars": 1, "text": "sometimes it wont start then i have to uninstall and re-install it", "date": "Jan 4, 2015"}, {"stars": 5, "text": "Been looking for this for years. Best thing ever", "date": "Jan 4, 2015"}, {"stars": 5, "text": "impressive!", "date": "Dec 30, 2014"}, {"stars": 4, "text": "Excellent, but would love to be able to define a shortcut key!", "date": "Dec 30, 2014"}, {"stars": 2, "text": "Really cool tool, but it crashes on Fedora Chrome within 5-10 seconds of first use, requiring restart of the browser.\n\nBy 'crash' I mean that the tool stops responding. Clicking the button again multiple times doesn't change it, and the tool doesn't work in any other window or tab once it's crashed -hence, a restart is necessary.", "date": "Dec 14, 2014"}, {"stars": 5, "text": "Thank you!!! Amazing!", "date": "Dec 8, 2014"}, {"stars": 5, "text": "How about a to add mode with following by divs\\etc.container(not letters in its(maybe merge this two mode in one)? Tnxanyway.", "date": "Nov 17, 2014"}, {"stars": 4, "text": "I like it.\nIt's like \"Rooler\" plugin.\nThis has fewer features but works.\n\"Rooler\" sadly isn't working now and hasn't been updated.", "date": "Nov 2, 2014"}, {"stars": 5, "text": "THIS IS THE BEST TOOL EVER, IT EVEN SHOWS ME MY SCREEN WIDTH IS 1921px WHEN IT'S ACTUALLY 1920px !!! HIRE IT AT WALMART!!!", "date": "Oct 30, 2014"}, {"stars": 3, "text": "When this extension works, it's EXTREMELY useful. As a web developer for a major clothing company on the East Coast, I use this pretty much everyday. Our company provides us with MacBook Pro's, and for some reason this seems to be finicky with Retina screens. If I drag the window to my non-Retina monitor and use it, sometimes it works, and other times it just stops working, seemingly at random. \n\nIncrease stability to something close to 99.9% and this will become a 5-star extension. Until the... Show more", "date": "Oct 15, 2014"}, {"stars": 4, "text": "Very cool, but needs some better UX. I click to enable it and often nothing happens. Other times the cross appears and I am able to do what I need.", "date": "Sep 29, 2014"}, {"stars": 5, "text": "Amazing!", "date": "Sep 24, 2014"}, {"stars": 1, "text": "Doesn't work on MacbookPro Retina 13\" (late 2013). It measures, but the lines doesn't fit the website graphics. Doesn't work on any of the many popular websites I tested. Show > 'Actual Size' is selected in Chrome. Only thing that works is when it correctly predicts the max width of a site, but usually the width/height lines fly around the screen unpredictably.", "date": "Sep 23, 2014"}, {"stars": 5, "text": "Es funktioniert Super!\n\n@AndisPez:\ngo to chrome://extensions/ and click \"shortcuts\" (bottom-left corner)\n\nthere you'll find it", "date": "Sep 21, 2014"}, {"stars": 3, "text": "WARNING: Causes a conflict with GMAIL! For me, it caused an infinite loading loop on Gmail.", "date": "Sep 18, 2014"}, {"stars": 1, "text": "Doesn't work on a retina screen. The cross just wiggles around the screen and doesn't really snap to anything.", "date": "Sep 18, 2014"}, {"stars": 5, "text": "Great extension! Now I can faster measure and correct things on my projects.", "date": "Sep 16, 2014"}, {"stars": 2, "text": "I don't get how this is supposed to be useful. Any halfway modern website is full of hidden elements that the measure picks up. Instead of the visible things I'd be interested in.", "date": "Sep 14, 2014"}, {"stars": 4, "text": "This is pretty neat! The only thing I don't like right off the bat is that it follows the contours of letters in text. That's interesting to play with, but I don't find it very useful.\n\nIt would be more useful for web development if it just followed the element's box boundary.", "date": "Sep 12, 2014"}, {"stars": 5, "text": "This is fantastic", "date": "Sep 12, 2014"}, {"stars": 5, "text": "This is perfect, that's what I needed.  \n\nJust a minor issue, after zoom-in this plugin doesn't work correctly. But that doesn't stops me from giving it 5 stars. \n\nKudos.", "date": "Sep 12, 2014"}, {"stars": 5, "text": "Out of this world!", "date": "Sep 12, 2014"}, {"stars": 5, "text": "an excellent tool for front end", "date": "Sep 12, 2014"}, {"stars": 5, "text": "Exceptional!", "date": "Sep 11, 2014"}, {"stars": 5, "text": "Awesome, but as Jacob Williams said, magnification must be at 100% in this version.", "date": "Sep 11, 2014"}, {"stars": 4, "text": "Very useful. Would be great if it could also show the length of the guidelines on each side.", "date": "Sep 11, 2014"}, {"stars": 5, "text": "useful.", "date": "Sep 11, 2014"}, {"stars": 5, "text": "You sir, are awesome.", "date": "Sep 11, 2014"}, {"stars": 5, "text": "Excellent stuff!", "date": "Sep 11, 2014"}, {"stars": 2, "text": "Definitely broken at the moment in chrome  37.0.2062.120 on win8. Will update score when fixed", "date": "Sep 11, 2014"}, {"stars": 1, "text": "No documentation, can't figure out how to use", "date": "Sep 11, 2014"}, {"stars": 5, "text": "Nice plugin, it simply works.\n\nTo set a shortcut, scroll down the Chrome Plugin Extension List under Settings and click on “shortcuts”.", "date": "Sep 11, 2014"}, {"stars": 5, "text": "Awesome plugin. You might mention that the tab should be set to 100% magnification for it to work properly. Not sure if you can change that, or if you even should, but maybe mention it in the description.", "date": "Sep 11, 2014"}, {"stars": 3, "text": "Seems broken at the moment. This may be a version of chrome issue or your plugin.", "date": "Sep 11, 2014"}, {"stars": 5, "text": "awesome stuff!", "date": "Sep 11, 2014"}, {"stars": 5, "text": "Awesome!", "date": "Sep 11, 2014"}, {"stars": 5, "text": "Simply amazing. Even works on Flash content.", "date": "Sep 11, 2014"}, {"stars": 5, "text": "awesome", "date": "Sep 11, 2014"}, {"stars": 4, "text": "Awesome tool, Thanks guys.", "date": "Sep 11, 2014"}, {"stars": 5, "text": "Beautiful and efficient.", "date": "Sep 11, 2014"}, {"stars": 5, "text": "Leaps and bound better than anything similar found on the market", "date": "Sep 11, 2014"}, {"stars": 5, "text": "Really quite excellent", "date": "Sep 11, 2014"}, {"stars": 1, "text": "I am not able to set the Keyboard Shortcut because there are no \"OPTIONS\" in the extension section.", "date": "Sep 11, 2014"}]