[{"text": "i love it!", "stars": 5, "date": "Mar 9, 2023"}, {"text": "why would you put it on a chrome store it it dont work on crome", "stars": 1, "date": "Jan 19, 2023"}, {"text": "EVERYONE!\n\nThe extension only works on Windows. This is because Windows has their own launcher. This extension calls it by using a roblox-client:// link. For users on Chrome OS use roblox://gameidhere to open it because the app store is based off of a mobile android device. I currently do not have a reason for Mac OS or Ubuntu users, but it is most likely the same.\nBECAUSE OF THIS, PLEASE DO NOT RATE IT 1 OR 2 STARS JUST BECAUSE IT DOES NOT WORK ON YOUR DEVICE, JUST UNINSTALL IT AND REMOVE YO... Show more", "stars": 5, "date": "Dec 17, 2022"}, {"text": "does not work on a acer chromebook", "stars": 1, "date": "Dec 6, 2022"}, {"text": "People, Just because something is on the chrome webshop, DOESN'T MEAN IT WORKS ON CHOMEBOOK. This is only for windows and mac.", "stars": 5, "date": "Apr 3, 2022"}, {"text": "i dont like it its just bad its just does int lounh me to the game . sorry for my bad trping", "stars": 1, "date": "Mar 22, 2022"}, {"text": "I know it only works on windows but you could've said that it only works on windows in the video", "stars": 3, "date": "Mar 4, 2022"}, {"text": "Very useful, I use it to create a shortcut on my desktop to open a Phantom Forces with a double click.", "stars": 4, "date": "Feb 28, 2022"}, {"text": "To everyone who is complaining that it does not work is because you are supposed to have a windows computer and if you are in a windows computer it is a shortcut to getting on roblox from the extension", "stars": 5, "date": "Feb 6, 2022"}, {"text": "GUYS YOU CANT USE THIS ON CHROMEBOOK/CHROME OS!!! SO SHUT UP!!!!!!!!! anyways it works fine", "stars": 5, "date": "Jan 23, 2022"}, {"text": "it worked", "stars": 5, "date": "Nov 18, 2021"}, {"text": "i want open rublox studio i cat pls help me", "stars": 1, "date": "Oct 20, 2021"}, {"text": "It doesn't work on chrome OS", "stars": 1, "date": "Oct 12, 2021"}, {"text": "Reason why you guys are say it works perfectly iks because your using coding to install roblox for you", "stars": 1, "date": "Oct 7, 2021"}, {"text": "How do you use it?", "stars": 3, "date": "Sep 26, 2021"}, {"text": "i have roblox on chrome os but i cant join someone", "stars": 1, "date": "Sep 19, 2021"}, {"text": "Works perfectly!", "stars": 5, "date": "Jul 25, 2021"}, {"text": "I dont like it donT work on chrome os", "stars": 1, "date": "Jun 26, 2021"}, {"text": "Yeah bad it should say doesnt work for chrome it basically wasted my time why carnt it just say \"only works for this type of laptop.... dosent work for this laptop....\"", "stars": 2, "date": "Jun 19, 2021"}, {"text": "Makes finding someone in a server a LOT easier. Thanks Kurka", "stars": 5, "date": "May 25, 2021"}, {"text": "It does what it says. People who say it doesn't work, get website Roblox or an actual computer.", "stars": 5, "date": "May 15, 2021"}, {"text": "Ok so this is meant for PC not Chromebook", "stars": 3, "date": "May 5, 2021"}, {"text": "Does not work, I cannot join", "stars": 1, "date": "May 3, 2021"}, {"text": "AWFUL! IT MADE MY SEARCH HIJACKED! I HAD TO REMOVE IT AND OTHER DONLOADS IT MADE! DON'T DOWNLOAD THIS!!!", "stars": 1, "date": "Apr 8, 2021"}, {"text": "It worked before, now whenever I try to join somebody it just says the person you attempted to join has left the game while they didn't.", "stars": 5, "date": "Mar 30, 2021"}, {"text": "VERY BAD! Dose not work when it still says os cant open page...\n\nDONT DOWNLOAD!!!", "stars": 1, "date": "Mar 19, 2021"}, {"text": "it didnt work i had my hopes up but its all okay!", "stars": 2, "date": "Feb 26, 2021"}, {"text": "Does exactly what it's supposed to do. Nothing more, nothing less. Open source, lightweight, very handy.\n\nThe bad reviews are from children who don't know how to read or conduct themselves on the internet yet.", "stars": 5, "date": "Jan 28, 2021"}, {"text": "how does it work? im confused", "stars": 3, "date": "Jan 2, 2021"}, {"text": "Bad, not working, I was so excited, just still says \"Chrome OS can't open this page\" But if it works, please tell me how.", "stars": 1, "date": "Dec 27, 2020"}, {"text": "If you see \"Chrome OS Cannot open this page\" error, there is no fixing that. To play ROBLOX on Chrome OS, download it from the Play Store. This is designed for Windows/Mac OS computers (maybe linux and it's distros.) Anyways, this application worked really well and helped me join games.", "stars": 5, "date": "Dec 22, 2020"}, {"text": "not working", "stars": 1, "date": "Dec 19, 2020"}, {"text": "it do not let me join da game", "stars": 2, "date": "Dec 9, 2020"}, {"text": "works great, and now I can add roblox games to my playnite library!", "stars": 5, "date": "Nov 25, 2020"}, {"text": "NOT WORKING\n\nMaybe a bit more code, and how do we get in a specific game?", "stars": 3, "date": "Sep 21, 2020"}, {"text": "It works, but you can only join your friends or people who have their join game setting set to everyone. So, if you want to join people like KonekoKitten or Albert, you can't.", "stars": 2, "date": "Sep 16, 2020"}, {"text": "i love it so much such a life saver", "stars": 5, "date": "Sep 4, 2020"}, {"text": "when you join people it keeps saying the user left the game it happened with 2 diff people so just incase i tried testing on my alt acc on anothr device, says the same thing and never left the game- the place id one also doesnt work-", "stars": 2, "date": "Aug 4, 2020"}, {"text": "Literally lied in the description.", "stars": 1, "date": "Jul 31, 2020"}, {"text": "When i try to join a game, all that comes up is \"chrome os can't open this page\"\n\nDidn't work at all.", "stars": 2, "date": "Jul 15, 2020"}, {"text": "did no work at all", "stars": 1, "date": "Jul 14, 2020"}, {"text": "Works well, speeds things up for me.\nI'd definitely recommend it to people.\n\nThe source code is also available, and the developer is trustworthy.", "stars": 5, "date": "Jun 25, 2020"}, {"text": "It works perfectly, only wish I could see the source code.", "stars": 4, "date": "Jun 25, 2020"}, {"text": "Every time i use it it says \"the user you tried to join has left the game\" and then i check there profile and there still in the game", "stars": 2, "date": "Jun 22, 2020"}]