[{"date": "Jul 25, 2023", "text": "Doesn't work for me at all. Throws this error in console and does nothing: \"Sourcegraph: uncaught error handling code view Error: Failed to create file toolbar mount node: container not found.\"", "stars": 1}, {"date": "Feb 19, 2023", "text": "Extension is does not working now on Github repositories. \"No hover information available.\" \"Error: repo not found\"", "stars": 5}, {"date": "Aug 10, 2021", "text": "nice", "stars": 5}, {"date": "Aug 24, 2020", "text": "It's pretty neat and helpful. Avoid  the fuzz for downloading source code.", "stars": 5}, {"date": "Feb 27, 2020", "text": "love it", "stars": 5}, {"date": "Dec 4, 2019", "text": "Thank you! That a useful extension!", "stars": 4}, {"date": "Oct 14, 2019", "text": "i like it！", "stars": 5}, {"date": "Sep 4, 2019", "text": "nice", "stars": 5}, {"date": "Jun 17, 2019", "text": "Github begins to support officially the feature:\nhttps://help.github.com/en/articles/navigating-code-on-github", "stars": 4}, {"date": "May 8, 2019", "text": "Useful stuff especially when exploring public repos, no need to inspect them locally. \n\nIn combo with Octotree, I like it.", "stars": 4}, {"date": "Mar 3, 2019", "text": "Good for code navigation on github.", "stars": 4}, {"date": "Feb 28, 2019", "text": "every glad I found this.\nI have been using opengrok for several years and sourceinsigh long time ago.\nBut this tool is my future:)", "stars": 5}, {"date": "Jan 21, 2019", "text": "Thank you for creating this tool. Love developer tools", "stars": 5}, {"date": "Jan 19, 2019", "text": "Awesome ~", "stars": 5}, {"date": "Dec 8, 2018", "text": "I really enjoyed the user experience of their website and the way that it summarizes data and makes all of the information of your repo very very accessible. \n\nI have used it mostly with Javascript repos without any issues. The only thing while inspecting files in GitHub, it's that it can get a bit laggy sometimes before showing you the information when you hover on something.\n\nOverall great application, now its a MUST in my browser!", "stars": 5}, {"date": "Nov 29, 2018", "text": "amazing extension", "stars": 5}, {"date": "Oct 22, 2018", "text": "greatly enhances github navigation experience", "stars": 5}, {"date": "Oct 7, 2018", "text": "100% Awesome.\n\nGreatly enhances the utility of UI for the most popular git hosting providers.\n\nThank you Sourcegraph!", "stars": 5}, {"date": "Sep 13, 2018", "text": "Why the Status shows ' Limited Functionality '? And ' Error fetching hover from language server ' when I see a code. How can I solve it?", "stars": 1}, {"date": "Aug 27, 2018", "text": "Awesome! Helps studying GitHub repo a lot.\nShows repo file structure and provides go to definition for methods.", "stars": 5}, {"date": "May 29, 2018", "text": "not so compatibility with octotree...\nwhen I switch file from octotree, SourceGraph did not work.", "stars": 4}, {"date": "May 23, 2018", "text": "awesome!", "stars": 5}, {"date": "Mar 13, 2018", "text": "Good extension. I think it's better than Octotree", "stars": 5}, {"date": "Feb 8, 2018", "text": "Super useful extension. I was also impressed when a recent issue got addressed by the developer so quickly.", "stars": 5}, {"date": "Feb 7, 2018", "text": "I'm not sure why, but I have had mixed feelings with this extension. Sometimes it's VERY helpful, and sometimes it's messed up. Their UI is also always going through dramatic changes. As for this rating, it has been having a problem, which literally freezes my Github whenever I open it. I see an error in console, saying: \"Cannot read property 'telligentWrapper' of undefined\"; not sure if this is the reason for the freezing, but anyway I HAD TO disable it", "stars": 1}, {"date": "Jan 3, 2018", "text": "very useful extension.\nmake chrome like ide", "stars": 5}, {"date": "Dec 19, 2017", "text": "So time-saving :)", "stars": 5}, {"date": "Nov 27, 2017", "text": "like idea ,wonderful IDE", "stars": 5}, {"date": "Nov 14, 2017", "text": "was in strong need of such extension - big thx", "stars": 5}, {"date": "Sep 26, 2017", "text": "Super Helpful!", "stars": 5}, {"date": "Aug 14, 2017", "text": "Simply awesome extension, great work!!!", "stars": 5}, {"date": "Aug 12, 2017", "text": "nice", "stars": 5}, {"date": "Aug 4, 2017", "text": "goof", "stars": 3}, {"date": "Jul 8, 2017", "text": "cool:-)", "stars": 5}, {"date": "Jun 16, 2017", "text": "good", "stars": 5}, {"date": "Jun 5, 2017", "text": "This is well built and extremely helpful. Thank you!! I'm surprised it's not more popular.", "stars": 5}, {"date": "Jan 5, 2017", "text": "I love SourceGraph.  I love the integration with github.  It's now one of my first-install extensions on any new browser or computer.  I truly look forward to having even more language support added in future (Elm especially!).  It's made the experience of exploring new github projects so much better.", "stars": 5}, {"date": "Jul 27, 2016", "text": "Simply amazing !", "stars": 5}, {"date": "Jul 6, 2016", "text": "wow", "stars": 5}, {"date": "Jul 4, 2016", "text": "Updated review:  I managed to fix whatever problem I had with this plugin and now it seems to work very well.\n\nSourcegraph staff reached out immediately when I had a problem the first time.  Once I had time to retry (after an OS update on my side that had nothing at all to do with Sourcegraph), it performed precisely as expected.  Thanks, Matt!\n\nI definitely recommend this tool for people who work in GitHub and whose tooling and languages are supported by Sourcegraph.", "stars": 5}, {"date": "Jul 2, 2016", "text": "Absolutely love it. Makes life so much easier reviewing PRs!\n\nHoping for TypeScript support some time soon.", "stars": 5}, {"date": "Jun 25, 2016", "text": "Magic!", "stars": 5}, {"date": "Jun 13, 2016", "text": "Exciting idea. Disappointed that Javascript files are not supported.\n\nIf it works on your site, why not offer a link to your site, until it's properly working on Github?", "stars": 3}, {"date": "Jun 2, 2016", "text": "Cool idea. Unfortunately this extension doesn't support any java github repo, but only a few... For example, spring-security-oauth2 and wro4j are not supported.", "stars": 3}, {"date": "May 17, 2016", "text": "Super useful tool with tremendous potential.", "stars": 5}, {"date": "Sep 20, 2015", "text": "nice.", "stars": 5}, {"date": "Sep 10, 2015", "text": "I was very disappointed by this,it currently supports only sourcegraph's github repository but even there I did not see the appropriate control to activate sourcegraph.\n\nAn interesting idea,hopefully it works correctly and everywhere soon.", "stars": 1}, {"date": "Sep 19, 2014", "text": "I love sourcegraph. Its incredible and its one of the best tool for all modern programmers! Cheers to all developers!!\n\nWrote a detailed blog post \n\nhttp://www.avilpage.com/2014/09/using-sourcegraph-to-search-real-code.html", "stars": 5}, {"date": "Jul 10, 2014", "text": "Extremely helpful!", "stars": 5}, {"date": "Jan 14, 2014", "text": "nice.", "stars": 5}]