[{"text": "I came from homework to say,\nThank you very much for providing us a free open source with high level of security!", "stars": 5, "date": "May 19, 2023"}, {"text": "Out of the box a pure delight: It ! Just ! Works !", "stars": 5, "date": "May 1, 2023"}, {"text": "In one word: it just WORKS.\nGoodbye, Gmail reading your email and profiling you based on what keywords you type.\nMind you — at least for the free version! — this is a minimalist approach to PGP encryption on a web-based email interface, such as provided by Gmail. It allows you to read and write encrypted messages, and is reasonably simple to do so (you get a BIG Mailvelope icon to click :-) ). If you're a die-hard PGP power user, you can get Mailvelope to use whatever keyrings you already hav... Show more", "stars": 5, "date": "Apr 3, 2023"}, {"text": "On Windows 10 it doesn't work at 1st, meaning, it doesn't recognize my GnuPG key (I installed gpg4win with \"browser integration\").\n\nWhen I say \"at 1st\", it means that it recognizes the GnuPG key at 2nd try, if one of these conditions apply:\n\n(All the browsers I tested with have mailvelope installed)\n\n1) I open another browser after I close the 1st one, and Mailvelope finally shows my GnuPG keyring (no more \"Let's Start\" each time I click the extension icon)\n2) Same as 1), but I keep the 1st b... Show more", "stars": 2, "date": "Feb 22, 2022"}, {"text": "I just discovered this works for thexyz.com \n\nSurprised me how easy it was to set up", "stars": 5, "date": "Sep 1, 2020"}, {"text": "unable to connect 'gpg4win'", "stars": 4, "date": "May 25, 2019"}, {"text": "Best alternative to OpenKeychain (Android) that I can find for PC.", "stars": 5, "date": "Apr 26, 2018"}, {"text": "Genial", "stars": 5, "date": "Apr 11, 2018"}, {"text": "Finally, encrypted GMail!", "stars": 5, "date": "Mar 24, 2018"}, {"text": "100% awesome", "stars": 5, "date": "Dec 18, 2017"}, {"text": "Dont know how to use it has to have step 1 push this step two etc for newbies", "stars": 1, "date": "Nov 29, 2017"}, {"text": "Liked", "stars": 4, "date": "Oct 10, 2017"}, {"text": "Very useful!", "stars": 5, "date": "Oct 1, 2017"}, {"text": "Seems to work as advertised.", "stars": 5, "date": "Sep 23, 2017"}, {"text": "Works great", "stars": 5, "date": "Aug 11, 2017"}, {"text": "Easy to set up & understand. Import keys and can create new ones if needed. (Dana-Office Admin)", "stars": 5, "date": "Jul 19, 2017"}, {"text": "Easy to use, works well.", "stars": 5, "date": "May 18, 2017"}, {"text": "（you haven't provide a place to deliver bug reports so I have to report it here. (Maybe this is the right place to report bug?:(）\nWhen I write a email in gmail webpage, I click the mailvelope extension button and click the \"add\" button . The a webpage about maillist (chrome-extension://kajibbejlbohfaggdiogboambcijhkke/app/app.html#watchList) is open. And then? Should I choose one of the email providers? I clicked \"mail.google.com\" adn clicked \"OK\" but nothing happened next. So I don't know wh... Show more", "stars": 1, "date": "May 15, 2017"}, {"text": "Excellent!", "stars": 5, "date": "Mar 30, 2017"}, {"text": "Nice extension, but it can't be used with Mixmax.", "stars": 3, "date": "Mar 24, 2017"}, {"text": "Very Helpful", "stars": 5, "date": "Mar 20, 2017"}, {"text": "Very fine app", "stars": 5, "date": "Mar 8, 2017"}, {"text": "Helpful", "stars": 5, "date": "Feb 28, 2017"}, {"text": "great extension, only missing feature is PGP/MIME, as it can only decrypt PGP Inline messages", "stars": 4, "date": "Feb 16, 2017"}, {"text": "Makes using PGP easy and less cumbersome. A must have for important emails.", "stars": 5, "date": "Feb 11, 2017"}, {"text": "Mail from Apple mail & GPGtools not decrypted, determined how attachments.", "stars": 4, "date": "Feb 10, 2017"}, {"text": "Must have extension!", "stars": 5, "date": "Jan 26, 2017"}, {"text": "Works well and easy to install/use for a non-techie like me. Thank you for making this great tool freely available. Mind you, I am slightly puzzled as a recipient of my Mailvelope public key (using Enigmail on Thunderbird) said that my Mailvelope public key was not 'asc armoured' just asc. Is this true and, if so, what difference does it make, if any?", "stars": 5, "date": "Dec 2, 2016"}, {"text": "This is the only way I will send an email, and this program makes it extremely easy.", "stars": 5, "date": "Nov 29, 2016"}, {"text": "This is definitely done right, with regard to plain text message encryption on webmail, since it encrypts (and decrypts) in a pop-up that exists only on your end, not on Google's server. (By contrast, Mymail-Crypt has you write normally in Gmail, which saves your \"secret\" message as-is to Google's servers as a draft, then encrypt it before sending, – a seriously false sense of security).\n\nI agree with other commenters that proper handling of attachments is a must.  This was done over a decade... Show more", "stars": 4, "date": "Nov 27, 2016"}, {"text": "Good, But there is somthing error when encrypt end give signature, the result message just send encrypted message and dont show the seignature. but if i send normal message with signature it work properly, so Please fix it", "stars": 3, "date": "Nov 12, 2016"}, {"text": "Good work when sending mail out to Enigmail", "stars": 4, "date": "Nov 8, 2016"}, {"text": "You need a PGP key to do so for everyone you email. That's too much work for so little. I'll find another company for encryption, for my non \"encrypted\" email providers.", "stars": 2, "date": "Oct 14, 2016"}, {"text": "Would be MUCH better if it also supported symmetric decryption at least but also encryption would be useful.  Sometime I need to encrypt to people that don't really have the best key management but still have pgp.", "stars": 3, "date": "Oct 4, 2016"}, {"text": "Very good indeed. I did have a problem with it not recognising gmail.com web based. \n\nAfter lots of messing about I finally uninstalled and then then reinstalled it again, now it is working as normal.\n\nNot sure why it stopped working but an uninstall and install seem to work.\n\nUbuntu 16.04", "stars": 5, "date": "Oct 2, 2016"}, {"text": "Inbox support maybe ?", "stars": 2, "date": "Sep 25, 2016"}, {"text": "Good for text emails, but encrypting attachments should be more seamless.\n\nYou have to jump through lots of hoops to encrypt a file attachment, and also to decrypt it on the other side, if this was easier this would get more stars", "stars": 3, "date": "Sep 15, 2016"}, {"text": "Creates a nice web interface for signing and encrypting messages with Chrome on OSX.", "stars": 5, "date": "Aug 28, 2016"}, {"text": "NO LINUX MINT CHROME SUPPORT. WTF?", "stars": 1, "date": "Jul 15, 2016"}, {"text": "Smooth, adds a \"missing feature\" to gmail for me", "stars": 5, "date": "Jul 9, 2016"}, {"text": "Great. Makes sending and receiving encrypted emails easy and keeps them encrypted from your mail provider's view. Uses OpenPGP.js, a JavaScript implementation of the OpenPGP standard.", "stars": 5, "date": "Jun 10, 2016"}, {"text": "Great!", "stars": 5, "date": "Jun 10, 2016"}, {"text": "solves", "stars": 5, "date": "May 30, 2016"}, {"text": "This is probably the best extension ever developed on the Chrome web store. Mailvelope is right next to Signal in terms of encryption. When you use it, you compose messages in a separate window that Google or anyone else can't read. This extension makes PGP incredibly easy when it used to be hard. I love it and recommend it to everyone.", "stars": 5, "date": "May 22, 2016"}, {"text": "Great, easy to use and super flexible tool.", "stars": 5, "date": "May 3, 2016"}, {"text": "Clearsigning outbound gmail emails verifies in the browser, but they have bad signatures when verified by others/pasted into terminal.", "stars": 2, "date": "Apr 10, 2016"}, {"text": "Super, it works as it is described.", "stars": 5, "date": "Mar 29, 2016"}, {"text": "Once I figured it out, it is so simple! Easy to use!", "stars": 5, "date": "Mar 24, 2016"}, {"text": "thats a great extension ! it works fine and its very ease to use", "stars": 5, "date": "Mar 1, 2016"}, {"text": "Its works but it only works on one machine.  The extension loads if you log into chrome elsewhere but the keys don't follow.  I guess its secure but pretty inconvenient and possibly unusable for some.", "stars": 3, "date": "Feb 10, 2016"}, {"text": "Works well, at least in Chrome 47.0.2526.106 m (64-bit) on Windows 8.1.  One suggestion: allow a decrypted pop-up window to remain open while searching (Ctrl+F) in the main Chrome window.", "stars": 4, "date": "Jan 11, 2016"}, {"text": "Does what it says", "stars": 5, "date": "Jan 8, 2016"}, {"text": "Great app, wish I would be able to automatically attach the message signature (as attachment, rather than inline) before sending for unencrypted email.", "stars": 4, "date": "Jan 2, 2016"}, {"text": "when will the iOS and android bower support this plugin \n\nthe web and word filtering advertising \n\nco prating must hate this plugin due to cannot scan the keyword to warning or block the message travel throw , the privacy force tailsOS already using it ten years ago", "stars": 5, "date": "Dec 5, 2015"}, {"text": "It works does its job well. But I need to encrypt attachments as well.", "stars": 4, "date": "Nov 29, 2015"}, {"text": "otimoooo", "stars": 5, "date": "Nov 3, 2015"}, {"text": "Very good extension, but it's really needed that Mailvelope supports non-inline .asc pgp-signatures (attached to the mail). They're used very often and I can't handle them in Gmail yet.", "stars": 4, "date": "Oct 26, 2015"}, {"text": "Was working great up until a the last update a week back. Since then, it is unusable", "stars": 1, "date": "Oct 24, 2015"}, {"text": "Works great, but not compatible with facebook's e-mails:\n\nError! Error decrypting message!", "stars": 5, "date": "Sep 16, 2015"}, {"text": "Easy to handle, works perfect for me (with Gmail)", "stars": 5, "date": "Sep 16, 2015"}, {"text": "Works very well on gmail!", "stars": 5, "date": "Sep 8, 2015"}, {"text": "Very good. Be great if they added the ability to encrypt attachments.", "stars": 4, "date": "Aug 23, 2015"}, {"text": "Love it, but I desperately need to be able to label my keys since I've had to revoke some keys and remake new ones for the same e-mail address.  I can't delete the revoked keys because I need them around to read the old e-mail encrypted with those keys, but I can't distinguish between the new and old keys that are in my key list.", "stars": 5, "date": "Aug 15, 2015"}, {"text": "Very much simplified PGP encryption for Gmail. Super impressed.", "stars": 5, "date": "Aug 7, 2015"}, {"text": "Very Simple system but an interface to import extern public key associate to a email and user could be fantastic", "stars": 4, "date": "Jul 24, 2015"}, {"text": "Encrypt/Decrypt and Key Management works great, but signing keeps giving a Bad Key error.", "stars": 3, "date": "Jun 21, 2015"}, {"text": "Absolutely brilliant. It not only generates and stores the keys, so I don't have to put them in manually each time. But it also has an intuitive interface ease of use. Love it.", "stars": 5, "date": "Jun 12, 2015"}, {"text": "I love the extension", "stars": 5, "date": "Jun 11, 2015"}, {"text": "Excellent and easy to use once you get the feel for it.", "stars": 5, "date": "Jun 10, 2015"}, {"text": "Thank you to the Mailvelope team!", "stars": 5, "date": "Jun 8, 2015"}, {"text": "very nice software - just make sure you backup your keys to a usb key.. sometimes mailevelope loads up with no keys in it!", "stars": 5, "date": "Jun 3, 2015"}, {"text": "Awesome extension once you get the feel of it. Most Awesome extension made. :)", "stars": 5, "date": "Jun 1, 2015"}, {"text": "Very helpful, easy to use, and I agree, never thought gnupg encryption in Chrome could be this easy. Wish it can be used in Gmail in Android, too!", "stars": 4, "date": "May 3, 2015"}, {"text": "Very useful :D", "stars": 5, "date": "Apr 30, 2015"}, {"text": "Really easy to use with gmail once you figure it out. Best Chrome extension for secure mail I've used.", "stars": 5, "date": "Apr 26, 2015"}, {"text": "Excellent app, makes email encryption really easy.", "stars": 5, "date": "Apr 25, 2015"}, {"text": "Excellent work, well done", "stars": 5, "date": "Apr 9, 2015"}, {"text": "works well. Very nice integration with gmail.", "stars": 5, "date": "Mar 31, 2015"}, {"text": "Works fine and very simple.", "stars": 5, "date": "Mar 23, 2015"}, {"text": "Works in Gmail for me just fine and was able to easily import keys generated from APG, GPG, and PGP without issue.", "stars": 5, "date": "Mar 12, 2015"}, {"text": "Does not work in current gmail for me.", "stars": 1, "date": "Mar 10, 2015"}, {"text": "this app is simply awesome! couldn't believe encryption and decryption would so freakin' simple!!!!", "stars": 5, "date": "Feb 8, 2015"}, {"text": "tried a couple of other plug-ins and this one actually lets you import your public/private keys better and more secure than the other plug-ins", "stars": 5, "date": "Jan 23, 2015"}, {"text": "I can't figure out how to add my private key to decrypt messages.", "stars": 1, "date": "Jan 13, 2015"}, {"text": "The complaints about the visible Private Key aren't a big cause for concern. Someone can only access this if they gain access to your machine. Fully encrypting your hard drive resolves this concern if it's stolen. And even if you forgot to do that, one would have to crack your password. Making a 20+ strong character password makes this pretty unlikely. So unless you're some extremely interesting person to some powerful and resourceful entities, Mailvelope gives you Pretty Good Privacy.", "stars": 5, "date": "Dec 31, 2014"}, {"text": "Does what it says.  Easy enough for my non tech wife to use.\n\nUse in in conjunction with keybase.io for key management.", "stars": 5, "date": "Dec 27, 2014"}, {"text": "The interface and functionality is nice BUT, I'm concerned about having the private key openly available as well as being able to create key pairs to an account I don't own.\n\nAn MITM could theoretically create a key pair against an account they do not own and use that key to pretend to be the \"actual\" account owner. \n\nI suggest implementing a protocol that *only* allows the account owner to create keys for their account and no other through a verification process. Preferably applying Google 2... Show more", "stars": 2, "date": "Dec 13, 2014"}, {"text": "This is app is fantastic. I largely stopped using GPG after I started using webmail clients exclusively because everything out there was lousy.  Mailvelope is super easy to use, and just seems to work. \n\nThe only bit I can't figure out is how to compose messages in RTF within the webmail client. I have RTF setup for gmail, but Mailvelope only seems to allow me to select plaintext. It's not a deal-killer, but it would be nice to be able to have formatted messages once in awhile!", "stars": 5, "date": "Dec 3, 2014"}, {"text": "Extremely easy to setup, easy to use, can do everything on line, but can also export keys for use in mail client - waouh!", "stars": 5, "date": "Nov 22, 2014"}, {"text": "Very easy to use. No issues so far and the PGP keys are easy to set up and export/copy and paste to your intended recipient! I highly recommend it.", "stars": 5, "date": "Nov 16, 2014"}, {"text": "Really good and seamless. I struggled with mymail-crypt. It refused to encrypt or decrypt. This just works!", "stars": 5, "date": "Nov 14, 2014"}, {"text": "Never had a problem with it :) works fine", "stars": 5, "date": "Oct 31, 2014"}, {"text": "Super easy to use.  Found that I didn't need GPGTools once I had this up and running and since I use Gmail, this was just a more practical way to go.  Took all of 5-10 mins to dial this in.", "stars": 4, "date": "Oct 25, 2014"}, {"text": "Works great.  Pretty simple and I only watched a short video on PGP.", "stars": 5, "date": "Sep 5, 2014"}, {"text": "Great add-on.\n\nIf, like me, you no longer have the mailvelope option show up in a gmail window - open your mailvelope preferences and change to plain text input.", "stars": 5, "date": "Sep 3, 2014"}, {"text": "Working well. \n\nI wish there would be an automatic public key lookup / search integration to quickly import private keys from key servers.", "stars": 5, "date": "Sep 1, 2014"}, {"text": "Does not work!\nWhen I want to import keys I get an error message. Without the possibility to import keys, such an add-on makes no sense, of course. It might work if I use the add-on to generate own keys, I did not try. But then all of my contacts need new keys. All other PGP related Programs don't have any issue with my keys.\n\nImport Error! Unable to read one public key: Ascii armor integrity check on message failed: 'ntlQ' should be 'yNlS'\nImport Error! Unable to read one private key: Ascii ... Show more", "stars": 1, "date": "Jul 15, 2014"}, {"text": "Pretty nice compared to others.\n\nI don't like that it changes what the creation tool was when it  pastes your public-key\n\nIt really does need a key ring to store other people's public keys.\n\nAs a more experienced user, it's less work for me to use GPG tools, a text document, compose, encrypt then cut/paste into an email. Your extension makes me open GPG tools anyway to retrieve someone's public-key.\n\nFix those two things and it's five stars and worth money.", "stars": 4, "date": "Jul 1, 2014"}, {"text": "I would give it 5 stars if it included context help. Unless you are used to key rings and exporting and importing keys this may seem a little daunting to you. It's hard to make a serious thing (encryption) easy for the uninitiated but this program is OK once you figure it out. Works great and will cover multiple accounts in the browser once it's installed in chrome. I use it with my gmail accounts and it has worked flawlessly.", "stars": 4, "date": "Jun 14, 2014"}, {"text": "Awesome, but too complicated.\n\nMake it as simple as GPG tools and I'd even pay for it.", "stars": 5, "date": "Jun 11, 2014"}, {"text": "It is almost great!  It needs to support the context menu for attachments like KeyNotes and other such tools.  Too often the interaction between the sending client and GMail convert the encrypted email to binary attachment than you are sunk!  There is no way to change the mime type or to force feed the attachment to Mailvelope.  I am looking for another tool now since it does not handle this situation....", "stars": 1, "date": "Jun 5, 2014"}, {"text": "Great extension, works really well, and pretty simple for non-techies to understand instructions for sending secure mail.\n\nLove the interface, very clean and professional.  Encourages me to encrypt mails when necessary!\n\nRuth", "stars": 5, "date": "Apr 19, 2014"}, {"text": "First decent gmail + pgp extension I've found.\n\nI'd like to trust it more though?", "stars": 5, "date": "Mar 28, 2014"}, {"text": "A great and easy way to use PGP and send secure emails", "stars": 5, "date": "Mar 28, 2014"}, {"text": "Simple and effective, but not very secure.  \n\nPrivate key is stored in the Chrome extension.  This would be easily available to anyone with control over the user's account.\n\nProtecting the private key needs to be a higher priority!", "stars": 3, "date": "Mar 20, 2014"}, {"text": "does what it is supposed to do and allows PGP encryption without an additional client, for those who like webmail a perfect solution.", "stars": 5, "date": "Mar 19, 2014"}, {"text": "Best encrypted e-mail extension/plugin i have seen so far. This makes it so easy i might really be able to convince people to use it!", "stars": 5, "date": "Mar 17, 2014"}, {"text": "Great extension, keep up the good work.", "stars": 5, "date": "Mar 7, 2014"}, {"text": "Great app. Thank you very much. Additional thanx for signing facility.", "stars": 5, "date": "Feb 26, 2014"}, {"text": "Nicely done. I wonder, though, if it supports the automatic on-demand import of keys from key servers. I could find anything on this.\n\nThe current key import supports only one key at a time, which is cumbersome. Why not just use the GPG keychain instead?", "stars": 4, "date": "Feb 21, 2014"}, {"text": "Very nice, and simplest and easiest pki solutions for gmail.", "stars": 5, "date": "Feb 20, 2014"}, {"text": "Very nice... I tried all the others first, and this is the only one that actually worked at all (what, you mean you want software to actually do something??  How picky!)", "stars": 4, "date": "Jan 10, 2014"}, {"text": "It works well to me. The integration in Gmail is almost perfect. If I should look for something to criticize, I would mention, that I cannot import keys from a public key server.\n\nAll the other stuff is very helpful and awesome. Thank you guys!", "stars": 4, "date": "Dec 31, 2013"}, {"text": "wow, very impressive", "stars": 5, "date": "Dec 29, 2013"}, {"text": "Works great and a awesome interface. Tested on Gmail and MS webmail.", "stars": 5, "date": "Nov 12, 2013"}, {"text": "Easiest webmail encryption I have used. Cheers keep up the good work!", "stars": 4, "date": "Nov 11, 2013"}, {"text": "You'd better turn off the draft-auto-saving feature from the mail providers when you use it. Some of the other GPG extensions can block draft-saving for Gmail.", "stars": 4, "date": "Oct 5, 2013"}, {"text": "Lacks signing. Can't import keys from key servers. Can't sign your friends keys.\n\nBy far the best way to integrate GPG into GMail, however. The above missing features aren't dealbreakers.", "stars": 4, "date": "Sep 29, 2013"}, {"text": "This extension makes email encryption extremely easy and convenient. Excellent!", "stars": 5, "date": "Sep 21, 2013"}, {"text": "Excellent, installed in a minute, intuitive, works as promised.\nGreat work by authors.", "stars": 4, "date": "Sep 21, 2013"}, {"text": "Can you support ECC in Mailvelope?\n\nAlso, should you also make it a \"packaged app\" or whatever Google announced recently, just to make it that much more \"native\" and \"outside of the browser\" (so Google can't collect what you input in any way)?", "stars": 4, "date": "Sep 11, 2013"}, {"text": "(Note: I have edited this review to more clearly articulate my concerns.)\n\nNice extension. However, my main concern is that it can give people a false sense of security when the product is used in ways other than the specific way intended by the developer. Note that while writing your message in the native editor, it is saved as a draft copy in clear text. The product, as it stands today, will copy the content of the native editor to the Mailvelope editor if there is anything in it. This may ... Show more", "stars": 4, "date": "Sep 10, 2013"}, {"text": "I just discovered Mailvelope also works in NextCloud's mail plugin! Amazing. (just add your Nextcloud instance's domain to the rules for webmail providers.)\n\nVery easy to use extension for enabling end-to-end encryption.\n\nIf Google *really* wanted to protect peoples' privacy this would be the way to do it.\n\nThey should fund development of this plugin, drive its adaptation to all major browsers and webmail clients, and help usher in an era of end-to-end encryption where everyone's grandmother ... Show more", "stars": 5, "date": "Sep 10, 2013"}, {"text": "Excellent in every aspect :)", "stars": 5, "date": "Sep 5, 2013"}, {"text": "It's really awesome and compared to other available solutions has a strong advantage: \nIt works!\n\nCan't wait for them to add signing!", "stars": 5, "date": "Sep 4, 2013"}, {"text": "Exactly what I was looking for before giving up Gmail for good... I am sure all the little bugs and shortcomings will be worked out over time.", "stars": 5, "date": "Sep 2, 2013"}, {"text": "I really like this.  It take a little bit to get used to it but it's very easy to encrypt and decrypt messages.", "stars": 5, "date": "Sep 2, 2013"}, {"text": "Excellent, but it would be nice to be able to sign messages, too.", "stars": 4, "date": "Aug 24, 2013"}, {"text": "Very helpful software.. Easy to use.", "stars": 5, "date": "Aug 21, 2013"}, {"text": "Awesome.", "stars": 5, "date": "Aug 19, 2013"}, {"text": "Great extension for all users who bother about their privacy!", "stars": 5, "date": "Jul 29, 2013"}, {"text": "randomly loose all registered keys.\n\nSo be very carreful with your Key", "stars": 2, "date": "Jul 24, 2013"}, {"text": "Wonderful application. For new users, there's a pretty short learning curve.", "stars": 5, "date": "Jul 21, 2013"}, {"text": "It's ok, but lacks signing.", "stars": 4, "date": "Jul 14, 2013"}, {"text": "There might be some missing features like signing (which will be added soon, I'm sure) but this extension is a boon for someone who wants encrypted communication (Oops, NSA filters triggered!) but doesn't want to use a mail client like Thunderbird. \n\nMoreover, the software is free and released under GNU Affero GPLv3, so that anyone can see the source code and verify that there is nothing fishy. There has also been a security audit by Cure53!\n\nThanks Mailvelope for such an excellent product.", "stars": 5, "date": "Jul 13, 2013"}, {"text": "(edited: public v. private key)\n\nExcellent UI but it won't take my passphrase so it allows me to send but not to receive. I have even tested that content encrypted for me by Mailvelope can be decrypted with gpg4win, so Mailvelope is obviously accessing my public key correctly, but for some reason it won't let me decrypt the messages (maybe the private key didn't get imported right?).", "stars": 3, "date": "Jul 6, 2013"}, {"text": "Works very well, also with corporate webmail.", "stars": 5, "date": "Jul 5, 2013"}, {"text": "This is an excellent Chrome extension.  Unobtrusive and easy to use.  (I use it with the \"new\" gmail site).", "stars": 5, "date": "Jul 3, 2013"}, {"text": "Excellent app - please people use it! \nThe auto-save problem is solved by now.", "stars": 5, "date": "Jun 26, 2013"}, {"text": "Makes encryption for the masses possible. Super plugin. Thank you.", "stars": 5, "date": "Jun 20, 2013"}, {"text": "Great app!", "stars": 4, "date": "Jun 15, 2013"}, {"text": "Works great! Easy, fast, stable, open, secure.", "stars": 5, "date": "Jun 12, 2013"}, {"text": "Excellent set of features (that all work as far as I can tell) and a nice UI.", "stars": 5, "date": "Jun 9, 2013"}, {"text": "Just tested it, works great! [with the *new* Gmail]", "stars": 5, "date": "Jun 6, 2013"}, {"text": "For personal use this product fits all my needs.  For Enterprise use I would like to see it support a key ring and the ability to to use key groups.", "stars": 5, "date": "May 2, 2013"}, {"text": "Two thumbs up for this extension. It´s lightwight, fast and integrates easily with gmail. A must have!", "stars": 5, "date": "Apr 9, 2013"}, {"text": "Best out of all of the OpenPGP extensions I've tried in Chrome. Very clean UI and easy to use.", "stars": 5, "date": "Apr 3, 2013"}, {"text": "An absolute must have for encryption through web email and compatible with enigmail in Thunderbird. Be careful of the auto-save function that can save incomplete emails in plain-text, if this issue is solved then it would have 5 stars from me.\n(Note* The auto-save problem has been solved, 5 stars for me!)", "stars": 5, "date": "Feb 20, 2013"}, {"text": "To solve this:\n\nWhen you compose your email in the browser you use the editor of the webmail site. That means before you encrypt the mail, the website can \"read\" what you type. This comes as a feature Often With The auto-save drafts function: the incomplete (and unencrypted) mail every few seconds is stored on the server.\n\nI propose that the mail is written in some popup", "stars": 5, "date": "Feb 13, 2013"}, {"text": "It works OK in English, but if you use any kind of Spanish puctuation, then it does not work. In addition, I have to add that it also does not work with cyrillic lettering. If it could work with that, then it would get 5 stars from me.", "stars": 3, "date": "Jan 4, 2013"}, {"text": "This app does exactly what it says it does after you get it set up. Also great support from the author. Thanks!", "stars": 5, "date": "Oct 26, 2012"}, {"text": "I have been using Mailvelope for a while and it works exceptionally well on all webmail applications, but also forums, Google Chat, and even Facebook direct messages. I've spoken with Thomas, the developer, by email and am very comfortable with the reasons for the access levels. This is definitely a must have for anyone looking to secure their communications.", "stars": 5, "date": "Oct 25, 2012"}]