[{"date": "Feb 16, 2024", "text": "Love it! Been such a help as I learn to build my first website as a companion to quickly and visually see my progress. The web app is great too with tons more capabilities than the extension.", "stars": 5}, {"date": "Dec 5, 2023", "text": "A very good concept, and useful extension!", "stars": 4}, {"date": "Feb 20, 2023", "text": "Web Maker is THE ONE that makes me love coding and website design. It's so fun to just experiment something too. Codepen is nice too, but online and can be a bit annoying at times. Web Maker is offline, and more customizable. I love it so much! Thank you very much for this amazing extension. Makes my Brave browser just rock.", "stars": 5}, {"date": "Feb 13, 2023", "text": "i am starting a new business so this will help me build and expand. i'm enjoying this app/ extension a lot. very helpful", "stars": 4}, {"date": "Nov 13, 2022", "text": "It's a great tool", "stars": 5}, {"date": "Sep 7, 2022", "text": "Chrome: 104.0.5112.102\nWindows: 10 Pro 21H2 (build 19044.1889)\n\nIs it just me, or did the extension stop working after some recent Chrome update?\n\nI just opened it after a few weeks without using it, and although all the features appear to be present (editing, libraries etc.) the *preview* doesn't show *anything*. It remains completely blank at all times, and inspecting the underlying iframe shows just empty <head></head><body></body> tags.\n\nAs an experiment I tried in incognito mode (to chec... Show more", "stars": 5}, {"date": "Aug 14, 2022", "text": "I freakin Love this App. I am so lost when it comes to embedding but this make it so easy thank you GREAT JOB", "stars": 5}, {"date": "Jul 24, 2022", "text": "Amazing!", "stars": 5}, {"date": "Jul 9, 2022", "text": "Nice, but console.log() not working on chrome extension, it works only on web app.", "stars": 4}, {"date": "Apr 26, 2022", "text": "WebMaker is an excellent tool, but I'm not sure an extension is even necessary.\n\nAs stated on WebMaker's home page, the Web App is \"Recommended: Works Offline! More features. More fun!\"\n\nThere's no perceptible difference between loading https://webmaker.app/app and the Chrome extension, but factors such as network connection speed *might* affect the experience.\n\nI suspect maintenance and updates are easier on the Web version than they are on the Chrome extension version.\n\nThe \"Replace New Tab... Show more", "stars": 3}, {"date": "Apr 15, 2022", "text": "Genial!!!", "stars": 5}, {"date": "Mar 28, 2022", "text": "Super useful tool right in the browser.", "stars": 5}, {"date": "Feb 23, 2022", "text": "exelent work", "stars": 5}, {"date": "Feb 21, 2022", "text": "thanks for sharing your great app", "stars": 5}, {"date": "Feb 11, 2022", "text": "Great to build and learn", "stars": 5}, {"date": "Jan 3, 2022", "text": "amazing very helpful", "stars": 5}, {"date": "Jan 1, 2022", "text": "mer30 developer mer30 company file maker very gooood very big like .", "stars": 5}, {"date": "Nov 17, 2021", "text": "loved it", "stars": 5}, {"date": "Nov 13, 2021", "text": "good", "stars": 5}, {"date": "Oct 4, 2021", "text": "Great app!", "stars": 5}, {"date": "Sep 22, 2021", "text": "this is too cool\nthank u for making this free", "stars": 5}, {"date": "Jul 28, 2021", "text": "Nice", "stars": 4}, {"date": "Jun 1, 2021", "text": "By far one of the best most underrated extensions since the inception of extensions. I hope it is still supported. Several github issues have gone untouched and still exist today. Some troublesome ones like scss not processing the css. I dread using codepen given its memory leaks and slow processing time. Something webmaker hasn't fallen victim too.", "stars": 5}, {"date": "May 2, 2021", "text": "I like it, but there is a bug with the JavaScript that the OnClick property doesn't work in some devices.", "stars": 4}, {"date": "Mar 1, 2021", "text": "This is an absolutely fantastic tool that I use almost exclusively for all of my coding now. A codepen-esque environment available on and offline. Fun, easy to use and reliable. I recomend it to all of my coding friends and am even using it to teach my kids the basics on. Can't recommend enough!", "stars": 5}, {"date": "Jan 20, 2021", "text": "Nice~!", "stars": 5}, {"date": "Jan 9, 2021", "text": "It was gray screen", "stars": 3}, {"date": "Oct 27, 2020", "text": "Very efficient and amazing tool", "stars": 5}, {"date": "Oct 26, 2020", "text": "Super...", "stars": 5}, {"date": "Aug 27, 2020", "text": "this a much best developing and quick results", "stars": 4}, {"date": "Jul 31, 2020", "text": "I 100% love this extension, it is the best editor I have ever seen for an extension.", "stars": 5}, {"date": "Jun 30, 2020", "text": "I use this all the time when I feel like whipping up some code, and it's so easy to use that I don't want to use anything else!", "stars": 5}, {"date": "Jun 26, 2020", "text": "I am the new kid in town probably. Know a little of HTML and wee bit of Java script, having learnt both in 2000! Now due to COVID-19, I am back to web designing a family website. And we used to do web designing in Notepad. Web Maker therefore is like heaven!  And as magnanimous as heaven too. Unlimited code, I can put here in Web Maker. I am indebted. :-)", "stars": 5}, {"date": "Apr 6, 2020", "text": "Awesome. This is a great web app for developers that want to spin something real fast then move over to Code Pen. The best part is, it keeps getting better.\n\nWe can set up a complete coding environment in seconds and begin typing just as fast. I've tried other online development tools and this is one that I keep coming back to, over and over again. :-)", "stars": 5}, {"date": "Mar 16, 2020", "text": "Absolutely a MUST-HAVE for developers! Thanks so much for being so awesome :-) Enjoying it to full!", "stars": 5}, {"date": "Mar 5, 2020", "text": "Amazing!", "stars": 5}, {"date": "Mar 2, 2020", "text": "pretty awesome !", "stars": 5}, {"date": "Feb 9, 2020", "text": "Used for snippet creation and snippet storage for front-end development.\nUX is also excellent and can be used offline.", "stars": 5}, {"date": "Jan 7, 2020", "text": "It's so awesome tool for frontend developer", "stars": 5}, {"date": "Jan 6, 2020", "text": "great", "stars": 5}, {"date": "Oct 7, 2019", "text": "amazing tool", "stars": 5}, {"date": "Sep 9, 2019", "text": "nice !!!", "stars": 5}, {"date": "Aug 4, 2019", "text": "good", "stars": 5}, {"date": "Jul 24, 2019", "text": "Well done ! You get cookies and milk my friend! \n\nCheers \nJimmy G", "stars": 5}, {"date": "Jul 16, 2019", "text": "the best thing out there. tried many browser based TE but this won my heart. no DB required at all and transpilers are built into it.", "stars": 5}, {"date": "Jul 11, 2019", "text": "good", "stars": 5}, {"date": "Jul 3, 2019", "text": "VERY GOOD !", "stars": 5}, {"date": "Jun 13, 2019", "text": "this is so amzing app  i loved it\nthe very interesting about it \nthat it is offline\nthanks alot", "stars": 5}, {"date": "Jun 12, 2019", "text": "Love it, hope they make a version for the virtual reaallity sites that the future of services like D-wave's cloud computing service and the awesome potential of 5G are such to bring.", "stars": 5}, {"date": "Jun 12, 2019", "text": "Less is more to get what I want.  Always learning.", "stars": 5}, {"date": "Jun 6, 2019", "text": "This is awesome, I hope that this type of application will become more in the Chrome Store", "stars": 5}, {"date": "Jun 3, 2019", "text": "excellent", "stars": 4}, {"date": "May 9, 2019", "text": "It is a very Nice Layout From Google it would Expect from them.", "stars": 5}, {"date": "May 8, 2019", "text": "Love it for checking ideas quickly. \nThanx Kushagra Gour", "stars": 5}, {"date": "Mar 8, 2019", "text": "Excellent extension. Very flexible..hasn't failed me yet.", "stars": 5}, {"date": "Mar 4, 2019", "text": "Great interface. nice tool", "stars": 5}, {"date": "Feb 19, 2019", "text": "This is a very good extension for front-end technologies practice without any setup. The awesome part is that it provides JS and CSS libraries.", "stars": 5}, {"date": "Feb 15, 2019", "text": "My children came to me and told me their teachers make them write their html code in notepad, which will work but I opened up my Web Maker, that i love to use and within minutes, they were ecstatic that they had made their own web page. That was 3 days ago now they both have sites of their own and my boy has started designing games! I believe anyone who wants to get serious on the internet should have Web Maker!", "stars": 5}, {"date": "Feb 13, 2019", "text": "good", "stars": 5}, {"date": "Feb 12, 2019", "text": "Once it was really good , now everything has screwed up ,everytime it show's error in console when loading scripts even Jquery isn't loading , can't include any local resource's , really needs major updates. i tried reinstalling still same thing that's why i am writing review.", "stars": 3}, {"date": "Feb 5, 2019", "text": "Just amazing. I have tried jsbin, codepen and many more, but nothing was instant. Kudos to developer.", "stars": 5}, {"date": "Jan 19, 2019", "text": "This extension is very good for learning different frontend web technologies. I really like it.", "stars": 5}, {"date": "Jan 15, 2019", "text": "awesome app!", "stars": 5}, {"date": "Dec 18, 2018", "text": "Wasn't sure when I saw this posted on a forum, checked it out.. and fell hard. This is GREAT. Love that I can build codePen style in an offline development environment. Love that I don't have to  install a server to make this work. Love love LOVE that it's easy to use, easy to understand, and easy to set up. I want to throw MORE stars up there!", "stars": 5}, {"date": "Dec 2, 2018", "text": "easy to use with nice GUI. honestly i've never loved an extension as i love this extension.\nso, good work for the developer. and 5 stars to the extension.", "stars": 5}, {"date": "Nov 11, 2018", "text": "nice", "stars": 5}, {"date": "Nov 7, 2018", "text": "It's the best one I've ever used", "stars": 5}, {"date": "Nov 2, 2018", "text": "This is the fast, convenient HTML editor I've been looking for, and I've tried them all! It's instantly available as a Chrome extension. It has a friendly, attractive UI and a built-in live preview window. It can pull in external code libraries and resources, such as images from other websites. And it's free! What more could I ask for?", "stars": 5}, {"date": "Oct 19, 2018", "text": "It's amazing! It's like Codepen, but it's open-source, usable locally, and even usable with an account. Amazing for prototyping. Chokes a little on my 20 MB CSS file though /s", "stars": 5}, {"date": "Oct 18, 2018", "text": "good", "stars": 5}, {"date": "Oct 15, 2018", "text": "very awesome app", "stars": 5}, {"date": "Oct 6, 2018", "text": "I recommend web maker to all front-end developers. It's an easy to use and reach playground.", "stars": 5}, {"date": "Oct 4, 2018", "text": "good", "stars": 5}, {"date": "Oct 4, 2018", "text": "I really like the interface and the dark theme. Not only the Output window, but the console also updates in real time. Above all, this guy has kept it FREE in the spirit of Open source! Thanks.  :)\n\nThe only thing i see is the lack (or limit) of keyboard shortcuts as well as TAB behaviour. Some of them like the CTRL + L (to clear console) do not work. Hope the developer can take this as a feature suggestion for a future implementation.", "stars": 5}, {"date": "Oct 2, 2018", "text": "I'm writing a JS app and this helps me do raw html then easily convert to JS version knowing it lines up, etc.  It's great for snippet and widget testing.  I also use Google  200 OK easy web server to run the completed app as localhost.  It's the easiest local web server to use..", "stars": 4}, {"date": "Sep 29, 2018", "text": "This tool is really helpful for me. i just love it", "stars": 5}, {"date": "Aug 30, 2018", "text": "Very helpful", "stars": 5}, {"date": "Aug 26, 2018", "text": "Awesome - recommend it!", "stars": 5}, {"date": "Aug 17, 2018", "text": "nice", "stars": 5}, {"date": "Aug 10, 2018", "text": "This is the perfect extension to teach students (without internet) web development. Love this one.", "stars": 5}, {"date": "Jul 24, 2018", "text": "I really love this extension. Absolutely perfect for my needs. TYVM!", "stars": 5}, {"date": "Jul 13, 2018", "text": "Great tools!", "stars": 5}, {"date": "Jul 13, 2018", "text": "This is bloody brilliant ... the perfect scratchpad for on-the-fly script and style experiments.\n\nI'd been doing this clumsily for a while, with localhost and browser-sync, but this is way more easy and elegant.\n\nKudos to Kushagra.", "stars": 5}, {"date": "Jul 6, 2018", "text": "i like it", "stars": 4}, {"date": "Jun 26, 2018", "text": "excellent, flawless, perfect tool!\nan offline version of Codepen", "stars": 5}, {"date": "Jun 8, 2018", "text": "This is very powerful and usesul tools to quickly test your snipe codes", "stars": 5}, {"date": "Jun 6, 2018", "text": "shortcuts are awesome", "stars": 5}, {"date": "Jun 4, 2018", "text": "great for students and teachers", "stars": 5}, {"date": "Jun 1, 2018", "text": "Great extension", "stars": 5}, {"date": "May 24, 2018", "text": "very nice", "stars": 5}, {"date": "May 20, 2018", "text": "Excellent", "stars": 5}, {"date": "May 10, 2018", "text": "Very nice and handy.", "stars": 5}, {"date": "May 7, 2018", "text": "Nice one", "stars": 5}, {"date": "May 6, 2018", "text": "the best!\nthank for web maker", "stars": 5}, {"date": "May 6, 2018", "text": "its a great tool for web developer", "stars": 5}, {"date": "May 6, 2018", "text": "nice", "stars": 5}, {"date": "May 5, 2018", "text": "Very convenient tool, but takes too much CPU usage which bake my macbook really hot", "stars": 3}, {"date": "May 3, 2018", "text": "so nice..great tool for testing codes", "stars": 5}, {"date": "Apr 28, 2018", "text": "One of the greatest programming extensions I have, would give it 10 stars if I could.", "stars": 5}, {"date": "Apr 28, 2018", "text": "Insanely awesome! I love the code completion!", "stars": 5}, {"date": "Apr 23, 2018", "text": "Great tool for testing codes on the fly", "stars": 5}, {"date": "Apr 20, 2018", "text": "very awsome app . the best app", "stars": 5}, {"date": "Apr 16, 2018", "text": "Very good, but lack tutorial", "stars": 5}, {"date": "Apr 14, 2018", "text": "Super useful for quick prototyping!", "stars": 5}, {"date": "Apr 11, 2018", "text": "cool !", "stars": 5}, {"date": "Apr 10, 2018", "text": "I definitely got what I was loving and finding.", "stars": 5}, {"date": "Apr 6, 2018", "text": "good", "stars": 5}, {"date": "Mar 29, 2018", "text": "beautiful editor", "stars": 5}, {"date": "Mar 27, 2018", "text": "Indispensable for quick code tests or just trying things out when off-line.\nAnd keeps getting better as more feature and functionality are added fairly regularly.", "stars": 5}, {"date": "Mar 25, 2018", "text": "Easy to use. Great tool for rapid editing components or prototyping.", "stars": 5}, {"date": "Mar 24, 2018", "text": "This is amazeballs!", "stars": 5}, {"date": "Mar 19, 2018", "text": "I loved it its great simple and fast", "stars": 5}, {"date": "Mar 1, 2018", "text": "Awesome!!!", "stars": 5}, {"date": "Feb 19, 2018", "text": "always using this app during my trips on Chromebook", "stars": 5}, {"date": "Feb 8, 2018", "text": "This is a simple brilliant app. It is so easy to experiment with code and I don't have to worry about going online to do it!", "stars": 5}, {"date": "Feb 7, 2018", "text": "Awesome! I use it within an intranet for web services & a quick test environment other embeds (like videos) that can't be accessed externally (ie. CodePen won't work).", "stars": 5}, {"date": "Feb 6, 2018", "text": "A perfect addition to any web/developer's arsenal. Period.", "stars": 5}, {"date": "Feb 5, 2018", "text": "best tools for web developer. So helpful for customize a template.", "stars": 5}, {"date": "Feb 4, 2018", "text": "it is a good and handy tool for developing/designing. but if had a console part was great", "stars": 4}, {"date": "Feb 4, 2018", "text": "This is cool for sharing my Soundcloud creations in a seperate website. Is there a way to publish it?", "stars": 5}, {"date": "Feb 3, 2018", "text": "Very good!!!", "stars": 5}, {"date": "Jan 30, 2018", "text": "Lots o' fun & learning! Fast, simply complicated(easy to use yet creating the program took a lot of work, I assume), instant results, multiple languages, powerful!\nThank You to the creators of Web Maker for your time, hard work and for sharing this with us.", "stars": 5}, {"date": "Jan 29, 2018", "text": "awesome, i always wanted a tool like codepen or jsfiddle that runs offline for prototyping. greet work.", "stars": 5}, {"date": "Jan 29, 2018", "text": "Greate work!", "stars": 5}, {"date": "Jan 27, 2018", "text": "Lags when i make an extension request but loads of fun an high Qual", "stars": 5}, {"date": "Jan 26, 2018", "text": "Super!", "stars": 5}, {"date": "Jan 26, 2018", "text": "Great extension!", "stars": 5}, {"date": "Jan 24, 2018", "text": "Very very excelent", "stars": 5}, {"date": "Jan 19, 2018", "text": "God! This tool was made by angels to support code in the Heavens", "stars": 5}, {"date": "Jan 18, 2018", "text": "wonderful, thank you!", "stars": 5}, {"date": "Jan 17, 2018", "text": "Codepen like tool for offline usage. The fun part is absolutely fun! Loved it!", "stars": 5}, {"date": "Jan 15, 2018", "text": "Great tool for rapid prototyping from mock-up to presentable html version.", "stars": 5}, {"date": "Jan 15, 2018", "text": "Amazing learning tool for web dev wish I had stumbled upon it sooner. Fantastic extension def on another level.", "stars": 5}, {"date": "Jan 14, 2018", "text": "Felicity", "stars": 5}, {"date": "Jan 14, 2018", "text": ":D", "stars": 5}, {"date": "Jan 8, 2018", "text": "looks great working with it offline!", "stars": 5}, {"date": "Jan 6, 2018", "text": "good for learner to run the code on it easiy", "stars": 4}, {"date": "Jan 4, 2018", "text": "very useful addons, thanks for making this types of software.", "stars": 5}, {"date": "Jan 2, 2018", "text": "Runs much faster than CodePen on a chromebook. Very nice app overall", "stars": 5}, {"date": "Dec 28, 2017", "text": "thanks web maker", "stars": 5}, {"date": "Dec 21, 2017", "text": "Very straightforward. I love it! Thanks for making the web way painless :)", "stars": 5}, {"date": "Dec 16, 2017", "text": "Useful app.", "stars": 5}, {"date": "Dec 15, 2017", "text": "Using it for a day now but its really awesome!", "stars": 5}, {"date": "Dec 14, 2017", "text": "it's so cool.", "stars": 5}, {"date": "Dec 9, 2017", "text": "Its best for me and very easy to understand. thanks for making this web maker", "stars": 5}, {"date": "Dec 6, 2017", "text": "I love this, I've just been getting into HTML development and this was a great extension to use!", "stars": 5}, {"date": "Dec 5, 2017", "text": "It's cool as a beginner tool. Hey! web designers I recommend you to give it a try, you'll love it.", "stars": 5}, {"date": "Dec 3, 2017", "text": "awesome!!!!!!", "stars": 5}, {"date": "Nov 29, 2017", "text": "awesome !!!", "stars": 5}, {"date": "Nov 26, 2017", "text": "amazing", "stars": 5}, {"date": "Nov 21, 2017", "text": "Crashed and I lost everything. Otherwise very useful.", "stars": 3}, {"date": "Nov 20, 2017", "text": "I have been using this extention for months, very useful. Cheers!", "stars": 5}, {"date": "Nov 19, 2017", "text": "Its awesome and  great tool. I love it", "stars": 5}, {"date": "Nov 17, 2017", "text": "MOST USEFUL extension", "stars": 5}, {"date": "Nov 17, 2017", "text": "very helpfull.and the devs did a great joob at ui", "stars": 5}, {"date": "Nov 17, 2017", "text": "This is just Codepen without internet. Very beautiful! I wish the developer(s) success and happiness.", "stars": 5}, {"date": "Nov 16, 2017", "text": "its good but it can be better a complyment to the develepurs i had a idea: reverse build like you place something and it writes the code for you", "stars": 4}, {"date": "Nov 16, 2017", "text": "My Review is this, This is the most wonderful thing in the world", "stars": 5}, {"date": "Nov 13, 2017", "text": "The MOST USEFUL extension I've ever added to Chrome - perhaps the most useful app I have, other than a web browser. No longer do I need to switch back and forth between Chrome and my text editor when I'm inspired by a page I've come across, or am working alongside an online tutorial. Web Maker is polished, smooth and solid, and feels like such a natural extension to Chrome, that I'd be surprised if Google isn't already courting the developer for a buy out!", "stars": 5}, {"date": "Nov 12, 2017", "text": "the best for learn programming", "stars": 5}, {"date": "Nov 12, 2017", "text": "it's awesome tools, Thank you so much", "stars": 5}, {"date": "Nov 10, 2017", "text": "THE MOST AWESOME APP!!!!! Thanks!", "stars": 5}, {"date": "Nov 7, 2017", "text": "Excellence!", "stars": 5}, {"date": "Nov 7, 2017", "text": "It's awesome for a quick html, css, js debug", "stars": 5}, {"date": "Nov 4, 2017", "text": ";ove it", "stars": 5}, {"date": "Nov 2, 2017", "text": "Love it, good tool.", "stars": 5}, {"date": "Oct 31, 2017", "text": "top :)", "stars": 5}, {"date": "Oct 31, 2017", "text": "Love this has a beginner it helped me a lot to code", "stars": 5}, {"date": "Oct 27, 2017", "text": "it is working good, as i was a beginnerr", "stars": 5}, {"date": "Oct 27, 2017", "text": "very helpful", "stars": 5}, {"date": "Oct 25, 2017", "text": "Best Best Best", "stars": 5}, {"date": "Oct 24, 2017", "text": "Fast and usefull for snippet test", "stars": 5}, {"date": "Oct 24, 2017", "text": "An indispensable tool every developer ought to have. I absolutely love it!", "stars": 5}, {"date": "Oct 21, 2017", "text": "very perfect. Awesome.", "stars": 5}, {"date": "Oct 13, 2017", "text": "Brilliant", "stars": 5}, {"date": "Oct 11, 2017", "text": "useful", "stars": 4}, {"date": "Oct 4, 2017", "text": "I do not like icon ;)", "stars": 5}, {"date": "Oct 2, 2017", "text": "Cool!!!", "stars": 5}, {"date": "Oct 1, 2017", "text": "luv it", "stars": 5}, {"date": "Sep 30, 2017", "text": "very nice!", "stars": 5}, {"date": "Sep 30, 2017", "text": "Perfect", "stars": 5}, {"date": "Sep 30, 2017", "text": "Great app. Amazing performance.", "stars": 5}, {"date": "Sep 30, 2017", "text": "weldone to the developer . i hope i will get all my lost ideas here.", "stars": 4}, {"date": "Sep 29, 2017", "text": "Thank you for Web Maker.", "stars": 5}, {"date": "Sep 28, 2017", "text": "Amazing. The best!", "stars": 5}, {"date": "Sep 28, 2017", "text": "nice!!!", "stars": 5}, {"date": "Sep 28, 2017", "text": "good & good", "stars": 5}, {"date": "Sep 28, 2017", "text": "Delightfully magnificent! Intuitive user interface, well considered logical layout with excellent secondary features. Fast, clean, forgiving of abuse by n00b users :P  Nicely done! I have found my on-the-fly anywhere solution.", "stars": 5}, {"date": "Sep 27, 2017", "text": "This is a great extension. It makes coding very nice and clean. It is very customizable and saves your code as soon as you finish typing. It has plenty of nice themes and fonts, and it automatically runs your program when you finish typing.", "stars": 5}, {"date": "Sep 27, 2017", "text": "Finally, an *open source* web development playground!\n\nWorks great too!", "stars": 5}, {"date": "Sep 27, 2017", "text": "Loved it", "stars": 5}, {"date": "Sep 26, 2017", "text": "I'm speechless...As a beginner at coding, I can't really add anything about the technical aspects of the app that the experienced developers haven't said, but for a newbie, it's an incredible tool for practicing what I'm learning. In fact, it's actually facilitated my understanding of the coding process. Easy to understand, easy to use, and loaded with useful features. My hat's off to this truly gifted developer.", "stars": 5}, {"date": "Sep 26, 2017", "text": "Makes it more fun to learn as you go.Just what I need to catch up", "stars": 5}, {"date": "Sep 26, 2017", "text": "Great", "stars": 5}, {"date": "Sep 26, 2017", "text": "Perfect for chromebook users. I expect the userbase to grow a lot when the author decides to release it as a chrome app too.", "stars": 5}, {"date": "Sep 25, 2017", "text": "very good for my learning css", "stars": 5}, {"date": "Sep 24, 2017", "text": "AWESOME....LOVED IT!!", "stars": 5}, {"date": "Sep 24, 2017", "text": "Absolutely awesome.", "stars": 5}, {"date": "Sep 23, 2017", "text": "this app is nice makes everything easy, fast and fun", "stars": 4}, {"date": "Sep 23, 2017", "text": "Helpful", "stars": 5}, {"date": "Sep 23, 2017", "text": "Much Needed", "stars": 5}, {"date": "Sep 23, 2017", "text": "I just added this extension....and I honestly thought nothing could be better for editing HTML/CSS. I was wrong, way wrong. Web-Maker is more convenient! This extension is awesome.", "stars": 5}, {"date": "Sep 22, 2017", "text": "it is amazing", "stars": 4}, {"date": "Sep 22, 2017", "text": "Nice editor yal", "stars": 5}, {"date": "Sep 22, 2017", "text": "It's really usefull playground. I suggest to every front-end developer to use this plugin.", "stars": 5}, {"date": "Sep 22, 2017", "text": "Great! I can test my things well here on this extension!.", "stars": 5}, {"date": "Sep 22, 2017", "text": "Just what I was looking for. I just started learning programming recently and this nifty app allows me to tinker around with new concepts whether I'm at a coffee house or deep in a forest. Now I can take my learning process with me wherever I go. Thanks!", "stars": 5}, {"date": "Sep 22, 2017", "text": "try it now", "stars": 5}, {"date": "Sep 22, 2017", "text": "Amazing", "stars": 5}, {"date": "Sep 21, 2017", "text": "this is awesome", "stars": 5}, {"date": "Sep 21, 2017", "text": "Fan. Tas. Tic. Really helps with quick notetaking in shorthand, not limited to one app. Super fast and love the save as HTML or CodePen upload.", "stars": 5}, {"date": "Sep 21, 2017", "text": "it's awesome", "stars": 5}, {"date": "Sep 21, 2017", "text": "Legal", "stars": 5}, {"date": "Sep 21, 2017", "text": "AWESOME!!!", "stars": 5}, {"date": "Sep 21, 2017", "text": "So far, I love it!", "stars": 5}, {"date": "Sep 21, 2017", "text": "so good and easy to use", "stars": 4}, {"date": "Sep 21, 2017", "text": "Super cool app", "stars": 5}, {"date": "Sep 21, 2017", "text": "Super tools for developer, a must have for your daily jobs", "stars": 5}, {"date": "Sep 18, 2017", "text": "Does its job extremely well.  Nothing more.  Which I greatly appreciate.", "stars": 5}, {"date": "Sep 17, 2017", "text": "Detached view is finally here!! Thank you!", "stars": 5}, {"date": "Sep 16, 2017", "text": "loved live visuals", "stars": 5}, {"date": "Sep 13, 2017", "text": "I have tried different Wed development software.  This free Web development sandbox is awesome in all ways. Great for stylesheet, scripting, and Atomic Css is wonderful.  \n\nSeriously, I have loved learning and this Web development sandbox I know will make my learning easy.", "stars": 5}, {"date": "Sep 12, 2017", "text": "Very handy!\n\nPlease add support for multiple files + import/export!", "stars": 5}, {"date": "Sep 8, 2017", "text": "By far the most awesome free Web development sandbox in the world, literally.  Why?\n\n- Supports multiple language/syntax for the  markup, stylesheet, and scripting (Atomic CSS is just cool)\n- Import / export to / from a local drive or online storage\n- VIM key bindings!\n- Autocode functions found in many full IDEs, like indenting, completion, folding etc.\n- Built-in console for logging, debugging, etc.\n- MORE!\n\nSeriously, give this a shot -- I promise you won't regret the decision.", "stars": 5}, {"date": "Sep 3, 2017", "text": "nice", "stars": 5}, {"date": "Sep 2, 2017", "text": "Very good.", "stars": 5}, {"date": "Aug 30, 2017", "text": "Perfect", "stars": 5}, {"date": "Aug 30, 2017", "text": "Now I can continue my codepen.io task even when I am offline at home. \nThank you!", "stars": 5}, {"date": "Aug 28, 2017", "text": "awesome", "stars": 5}, {"date": "Aug 21, 2017", "text": "very good pl new version. tanks", "stars": 5}, {"date": "Aug 15, 2017", "text": "I would love to see the Haml HTML-Compiler added (like Codepen has it) :)\n\nAlso, please add the Resource to Bootstrap 4beta to the list :D", "stars": 5}, {"date": "Aug 9, 2017", "text": "This is what we've been waiting for! Long live coding and developer of this app! I love you man! Thank you a lot!", "stars": 5}, {"date": "Aug 9, 2017", "text": "awesome tool, even has vim key bindings :-)", "stars": 5}, {"date": "Aug 8, 2017", "text": "Good for all the beginners in programming. It's amazing!... :)", "stars": 5}, {"date": "Aug 8, 2017", "text": "Really useful offline code playground.", "stars": 4}, {"date": "Aug 7, 2017", "text": "The best! Even better than Codenpen.io because of it's simplicity and light weight. \n\nYou can even use the extension off line. Doesn't get any better than that. \n\nThanks to the Dev for releasing this beauty for all of us! 5 stars", "stars": 5}, {"date": "Aug 4, 2017", "text": "Nice; and love how we can import and export our code. The fork feature is also awesome!", "stars": 5}, {"date": "Aug 3, 2017", "text": "Oh man, this is sooo helpful. Thank you!", "stars": 5}, {"date": "Aug 2, 2017", "text": "Awesome! Thank you!!!", "stars": 5}, {"date": "Aug 2, 2017", "text": "Thank you so much", "stars": 5}, {"date": "Aug 1, 2017", "text": "Yasssssss! Thank you! This is awesome.", "stars": 5}, {"date": "Aug 1, 2017", "text": "freaking awesome that this is offline, insane dude.you are awesome", "stars": 5}, {"date": "Jul 31, 2017", "text": "nice tool, great job", "stars": 4}, {"date": "Jul 24, 2017", "text": "Great, i don't need an ide for idea prototyping.", "stars": 4}, {"date": "Jul 22, 2017", "text": "I must rate", "stars": 5}, {"date": "Jul 20, 2017", "text": "this is one of the coolest, infact the coolest web dev app for developers of websites....BIG_UPS! to u guys", "stars": 5}, {"date": "Jul 20, 2017", "text": "I love this app!", "stars": 5}, {"date": "Jul 17, 2017", "text": "So fast and Amazing!! Thanks", "stars": 5}, {"date": "Jul 17, 2017", "text": "Wow unbelievable extension it has all the features i was looking for, thank you for developing it.", "stars": 5}, {"date": "Jul 16, 2017", "text": "Great app for web development, really usefull.\nThank you for making this!", "stars": 5}, {"date": "Jul 10, 2017", "text": "Awesome extension, Thanks WebMaker", "stars": 5}, {"date": "Jul 8, 2017", "text": "That's great! But please, add HAML extension ;) I really prefer HAML over standart HTML and I think much people would like to see HAML in this extension ;)", "stars": 5}, {"date": "Jul 4, 2017", "text": "perfect", "stars": 5}, {"date": "Jun 29, 2017", "text": "very nice tools for all web developers", "stars": 4}, {"date": "Jun 25, 2017", "text": "This is Awesome editor\n\nits live preview help a lot for beginner.", "stars": 5}, {"date": "Jun 20, 2017", "text": "Super fast & very handy", "stars": 5}, {"date": "Jun 20, 2017", "text": "Things work even better when they are made our default choices.", "stars": 5}, {"date": "Jun 18, 2017", "text": "Very Very Good! :)", "stars": 5}, {"date": "Jun 15, 2017", "text": "This is incredibly useful.", "stars": 5}, {"date": "Jun 14, 2017", "text": "This is a great Add On. Love to make quick ideas with it - actually I use it more and more!!!", "stars": 5}, {"date": "Jun 14, 2017", "text": "So very, very handy!\n\nNo more \"embarrassing pens\" -\n\nIt helps with the flow of ideas in the creative process. You can create concepts and \"stash\" them away on your browser without cluttering your collection of pens.\n\nWhen your idea is more formed, you get to move it to a pen where you can show it off to others.", "stars": 5}, {"date": "Jun 13, 2017", "text": "This can help you greatly in the world to create web sites", "stars": 5}, {"date": "Jun 13, 2017", "text": "Awesome app! Love it more than codepen bc it's more convenient. As far as improvements maybe add html, css, js reference 'cheat sheets'. Also the ability to use google fonts.", "stars": 5}, {"date": "Jun 12, 2017", "text": "best thing since codepen.", "stars": 5}, {"date": "Jun 12, 2017", "text": "Very handy.", "stars": 5}, {"date": "Jun 12, 2017", "text": "great", "stars": 5}, {"date": "Jun 11, 2017", "text": "love show", "stars": 5}, {"date": "Jun 11, 2017", "text": "i love it!", "stars": 5}, {"date": "Jun 11, 2017", "text": "Great tool for quick ideas, but I'd like to have the editors in seperate browser windows, its pretty compact", "stars": 5}, {"date": "Jun 10, 2017", "text": "It's exceptionally beginner friendly! I highly recommend this to anyone who wants to experience, the beauty in coding - and the coding in beuaty! :)", "stars": 5}, {"date": "Jun 10, 2017", "text": "I liked it, but I had a problem linking a img to this. how do i attach a image , NEED HELP", "stars": 3}, {"date": "Jun 9, 2017", "text": "It is so goof to have a web maker that actually does it right and doesn't block certain things that I do! It is really great!", "stars": 5}, {"date": "Jun 7, 2017", "text": "Please support es6", "stars": 3}, {"date": "Jun 6, 2017", "text": "Superb, What I needed in A browser", "stars": 5}, {"date": "Jun 4, 2017", "text": "It is BOMB!!", "stars": 5}, {"date": "Jun 4, 2017", "text": "awesome!! would be awesome++ if auto completion of tags was more enhanced. :)", "stars": 5}, {"date": "Jun 2, 2017", "text": "I love it !!!!! simple for my super old laptop. :)", "stars": 4}, {"date": "Jun 2, 2017", "text": "it is great", "stars": 5}, {"date": "Jun 1, 2017", "text": "The best HTML Editor, I have seen so far. It is dynamic and helps you in coding as well and It also have three different spaces to keep the CSS and Javascipt from getting confused with the HTML code.", "stars": 5}, {"date": "Jun 1, 2017", "text": "It is just amazing", "stars": 5}, {"date": "Jun 1, 2017", "text": "Incredible.", "stars": 5}, {"date": "May 31, 2017", "text": "Excellent!", "stars": 5}, {"date": "May 31, 2017", "text": "goog", "stars": 5}, {"date": "May 31, 2017", "text": "Unique!\nThe best ever truly!\n-properties with Auto-fill.\n-Realtime preview.\n-Auto-tag close;\n-Auto everything, almost auto-page-write.\nCongrats to developers!", "stars": 5}, {"date": "May 31, 2017", "text": "Great app.. Just perfect for what i need to accomplish.", "stars": 5}, {"date": "May 31, 2017", "text": "Fantastic extension, very useful. It's design is simple and easy to use. Does all you want to edit and create web pages on the fly!", "stars": 5}, {"date": "May 31, 2017", "text": "Lightweight, fast and robust code playground for beginners as well as experts. HTML coding was a breeze with this extension", "stars": 5}, {"date": "May 31, 2017", "text": "four features I loved, and do not exist in jsfiddle.\n1- the dark theme.\n2- autocomplete.\n3- settings.\n4- code blast\n\nThank you, this is what I was waiting for.", "stars": 5}, {"date": "May 31, 2017", "text": "Very Clean", "stars": 5}, {"date": "May 31, 2017", "text": "I have been looking for EXACTLY this, a way for me to tinker with random projects while offline on a ChromeBook. This is the definition of a perfect app. Thank you for making it.", "stars": 5}, {"date": "May 30, 2017", "text": "Extremely easy to use and very \"USE-FULL!\" Thank you developer/s who made this great extension!", "stars": 5}, {"date": "May 30, 2017", "text": "Need an offline Codepen? Here it is!", "stars": 5}, {"date": "May 29, 2017", "text": "Truly awesome. Only feature change I'd point out is a timeout on the auto preview, but turning it off and doing it manually is perfectly fine.\n\nRemembering code folding would be great too.", "stars": 5}, {"date": "May 29, 2017", "text": "This will help me  so much.", "stars": 5}, {"date": "May 29, 2017", "text": "Cool!", "stars": 5}, {"date": "May 29, 2017", "text": "Why can't I give this more than 5 stars?? \n\nIf your're a web dev or even just learning. Get this now!", "stars": 5}, {"date": "May 28, 2017", "text": "good work.", "stars": 5}, {"date": "May 28, 2017", "text": "Amazing!", "stars": 5}, {"date": "May 28, 2017", "text": "Very nice! I'm a beginner and using this while learning in Codecademy makes the whole learning experience amazing!", "stars": 5}, {"date": "May 28, 2017", "text": "thanks", "stars": 5}, {"date": "May 28, 2017", "text": "ok", "stars": 5}, {"date": "May 28, 2017", "text": "very thanksful", "stars": 4}, {"date": "May 28, 2017", "text": "Easy and fast\nLove it", "stars": 5}, {"date": "May 27, 2017", "text": "Very nice widget ! Yeeeaaar !", "stars": 5}, {"date": "May 27, 2017", "text": "ADELG-HOME", "stars": 4}, {"date": "May 27, 2017", "text": "Thanks for the app, but it is very sad that colors and height (maybe even visability) of the panels (CSS, JS, HTML) can't be change. I don't like that dark and bold panels, jsbin approach is much more comfortable for me. Anyway, thanks!", "stars": 5}, {"date": "May 27, 2017", "text": "love it", "stars": 5}, {"date": "May 27, 2017", "text": "well done.", "stars": 5}, {"date": "May 26, 2017", "text": "this is really cool!", "stars": 5}, {"date": "May 26, 2017", "text": "Great!", "stars": 5}, {"date": "May 26, 2017", "text": "This is the best experience for experimenting.", "stars": 5}, {"date": "May 26, 2017", "text": "good!", "stars": 5}, {"date": "May 25, 2017", "text": "easy and fast; looking forward to future versions.  every key up seems to trigger a flash, and although I like hot reloading, I wish there was a \"chill out\" feature", "stars": 4}, {"date": "May 22, 2017", "text": "Fast and easy to use, no registration, offline capable, easy to export code. Love it!", "stars": 5}, {"date": "May 22, 2017", "text": "love it!", "stars": 5}, {"date": "May 20, 2017", "text": "Very useful tool!!!", "stars": 5}, {"date": "May 18, 2017", "text": "At last : code pen offline ! great", "stars": 5}, {"date": "May 17, 2017", "text": "Awesome!", "stars": 5}, {"date": "May 17, 2017", "text": "Love it", "stars": 5}, {"date": "May 17, 2017", "text": "Absolutely amazing. Very helpful.", "stars": 5}, {"date": "May 10, 2017", "text": "Really helpful extension. Love that I can take it offline if I need to.", "stars": 5}, {"date": "May 9, 2017", "text": "Very useful app. Work fast and cool!", "stars": 5}, {"date": "May 7, 2017", "text": "It's really awesome.", "stars": 5}, {"date": "Apr 27, 2017", "text": "Definitely a good extension. This baby takes the set-up frustration out. Good for quick code hack!", "stars": 5}, {"date": "Apr 24, 2017", "text": "Very useful! Thanks for this extension.", "stars": 5}, {"date": "Apr 21, 2017", "text": "Very useful! Thanks for this extension.", "stars": 5}, {"date": "Apr 16, 2017", "text": "Very nice, thank you :)", "stars": 5}, {"date": "Apr 12, 2017", "text": "Super cool extension. I love the ability of exporting to codepen.io", "stars": 5}, {"date": "Apr 10, 2017", "text": "lovely", "stars": 4}, {"date": "Apr 8, 2017", "text": "Very useful! I can see myself using this a lot for testing simple scripts. Thanks for this extension.", "stars": 5}, {"date": "Apr 2, 2017", "text": "love it quick and easy", "stars": 5}, {"date": "Mar 27, 2017", "text": "Very useful, Love it. I am using it every day to test some random javascript code or some css tricks !!", "stars": 5}, {"date": "Mar 23, 2017", "text": "Very good chrome app!", "stars": 5}, {"date": "Mar 23, 2017", "text": "Nice work!!!", "stars": 5}, {"date": "Mar 18, 2017", "text": "Excellent!", "stars": 5}, {"date": "Mar 18, 2017", "text": "Thanks for making this! I've already spent hours using it and love the responsiveness in comparison to online editors. In addition, the Markdown integration was unexpected, and is pretty much perfect for taking quick notes via the new tab option.\n\nThe only problem I've encountered is that it conflicts with my duplicate tab removal extension — i.e. it would be awesome if the new tab page had a unique URL for each new-instance/open-file.", "stars": 5}, {"date": "Mar 17, 2017", "text": "Thank you! I totally appreciate being able to work offline ❤", "stars": 5}, {"date": "Mar 14, 2017", "text": "I have been a Codepen pro user for a long time, but this tool makes me debate whether I really need to pay for a service I cannot access offline.", "stars": 5}, {"date": "Mar 12, 2017", "text": "It is very useful to teach my front-end classes!!", "stars": 5}, {"date": "Mar 12, 2017", "text": "This is awesome playground for web developers :)", "stars": 5}, {"date": "Mar 9, 2017", "text": "just wow", "stars": 5}, {"date": "Mar 7, 2017", "text": "A must have Chrome extension for Web-developers.", "stars": 5}, {"date": "Mar 3, 2017", "text": "Great Job and a super Idea!", "stars": 5}, {"date": "Mar 2, 2017", "text": "Awesome app could use some changes but it was great for me to make some html websites.", "stars": 5}, {"date": "Feb 28, 2017", "text": "I always wanted an offline editor for html/css I had asked about it on Stackoverflow some years ago http://stackoverflow.com/questions/11455667/are-there-any-offline-tools-like-jsfiddle-net\n\nWebMaker is very close to what I was looking for", "stars": 5}, {"date": "Feb 28, 2017", "text": "Great solution for classroom teaching web technologies! Big \"thank you\" to the author!", "stars": 5}, {"date": "Feb 27, 2017", "text": "Very nice.", "stars": 5}, {"date": "Feb 24, 2017", "text": "Thanks for creating this.  What a great tool for productivity!", "stars": 5}, {"date": "Feb 21, 2017", "text": "It's fantastic! I'm glad I've discovered it! Thanks!", "stars": 5}, {"date": "Feb 21, 2017", "text": "Great app :)", "stars": 5}, {"date": "Feb 18, 2017", "text": "awesome app!\nIt would be cool if they could add save histories so you could go back, something similar to Plunkr!", "stars": 5}, {"date": "Feb 17, 2017", "text": "Awesome tool", "stars": 5}, {"date": "Feb 17, 2017", "text": "looks cool", "stars": 5}, {"date": "Feb 17, 2017", "text": "It is great tool. Hopefully stay that way when the investors start asking for monetization model ;)", "stars": 5}, {"date": "Feb 17, 2017", "text": "Thanks man. You've done well. Keep it up", "stars": 5}, {"date": "Feb 17, 2017", "text": "excellent offline code playground!", "stars": 5}, {"date": "Feb 16, 2017", "text": "Great Tool Loved it", "stars": 5}, {"date": "Feb 12, 2017", "text": "Very useful app", "stars": 5}, {"date": "Feb 11, 2017", "text": "Extremely useful app.", "stars": 5}, {"date": "Feb 10, 2017", "text": "It is very useful", "stars": 5}, {"date": "Feb 7, 2017", "text": "loved it.", "stars": 5}, {"date": "Feb 7, 2017", "text": "Awesome..!!! Better than CodePen", "stars": 5}, {"date": "Jan 29, 2017", "text": "Great work!\nCodepen is great but too slow sometimes.\n\nTwo suggestions:\n\n- A setting to disable auto-preview (useful when writing JS)\n- Built-in Emmet.io", "stars": 5}, {"date": "Jan 29, 2017", "text": "Awesome", "stars": 5}, {"date": "Jan 26, 2017", "text": "it is very useful", "stars": 5}, {"date": "Jan 24, 2017", "text": "Exactly what I wanted. ♥", "stars": 5}, {"date": "Jan 24, 2017", "text": "it is very useful for the beginners", "stars": 5}, {"date": "Jan 23, 2017", "text": "great", "stars": 5}, {"date": "Jan 23, 2017", "text": "Worked really well for me, to try quick hacks", "stars": 5}, {"date": "Jan 21, 2017", "text": "A really helpful tool to add to your workflow and quickly test your ideas. A big thank you!", "stars": 5}, {"date": "Jan 17, 2017", "text": "Very nice extension. Still I miss an option to manually refresh the page.\nWorking with maps is really a pain here.\nThanks!", "stars": 4}, {"date": "Jan 11, 2017", "text": "Decided to use it to work on my latest project,  it's pretty awesome! Thank you for making this!\n\nEdit: been using it for a month now, love that he keeps adding new features!", "stars": 5}, {"date": "Jan 9, 2017", "text": "pretty cool extension, works on latest chrome and chrome canary", "stars": 5}, {"date": "Jan 8, 2017", "text": "Great extension!", "stars": 5}, {"date": "Jan 4, 2017", "text": "amazing...", "stars": 5}, {"date": "Jan 2, 2017", "text": "Indispensable.\n\nVery recommended to all web developers out there. It's Codepen that runs offline, and even better.\n\nThanks dev", "stars": 5}, {"date": "Jan 2, 2017", "text": "It Keeps On Popping Up When I Hit New Tab", "stars": 1}, {"date": "Oct 21, 2016", "text": "very nice extends for web developers~", "stars": 5}, {"date": "Sep 27, 2016", "text": "i like it", "stars": 5}, {"date": "Sep 19, 2016", "text": "Wow, this feels so much like an offline CodePen. Also, I like how it saves your progress after closing.\n\nThe only huge problem is...**DO NOT try to write for loops in Jade**. When I attempted to write a for loop in Jade, the browser froze and caused my Macbook’s temperature to rise to 140°C and nearly burn up. I was so lucky no flames came out of it. I had to force shut it down immediately and put it in the freezer for a few minutes.\n\nIf using for loops, please type them in a text editor then... Show more", "stars": 4}, {"date": "Aug 9, 2016", "text": "I would have kept it if it could open existing files.", "stars": 4}, {"date": "Aug 5, 2016", "text": "The best!", "stars": 5}, {"date": "Aug 3, 2016", "text": "good for begineers", "stars": 5}, {"date": "Aug 2, 2016", "text": "Great !", "stars": 5}, {"date": "Jul 20, 2016", "text": "great!", "stars": 5}, {"date": "Jun 18, 2016", "text": "It is good but the extension overrides the setting for new tab. There should be a setting in the extension to change this.\n\nEdit: Got the setting to retain new tab in the latest update.", "stars": 5}, {"date": "May 13, 2016", "text": "A great start. So far, there's no reason for me to use this over Caret but I can see the value in this extension and it's only just launched. Nice job so far!", "stars": 4}, {"date": "May 11, 2016", "text": "Great!", "stars": 5}, {"date": "May 11, 2016", "text": "I love it already, never been that happy to open a new tab.\n\nI just wonder, are you going to github it? maybe we can join in as well", "stars": 5}, {"date": "May 11, 2016", "text": "Okayish CodePen clone. \n\nDoesn't save contents, so if I tinker something, I'm back to white screen after closing the tab, and kinda needs the preprocessor support that CodePen has.\n\nIt now saves contents (or has an option to do so), but it refreshes the window on keydown and that is highly annoying as it blocks editing :)", "stars": 3}, {"date": "May 9, 2016", "text": "I use it myself for quick experiments without setting up a bunch of things. Even when I don't have network availability.", "stars": 5}]