[{"text": "this extension definityly has access to browser history, but why this is not revealed in Privacy section? sounds unsafe to me", "stars": 1, "date": "Dec 9, 2023"}, {"text": "Superb! :)\n5 functions, fast, simple, ideal for Tabitis.\nOnly missing for me is a web search option.\nAnd perhaps to search text on all opened tabs.\nOK, here you got it all and more :)\n\"Feature Roadmap\nhttps://saka.io/\n\n- Missing phrases for better web search success :)\nsearch favorites\nsearch tabs list \nreopen closed tabs\n\n- Suggestion: Internet Search Tab with live search with the browsers standard search engine.\n\n- Add a X button to close it.", "stars": 5, "date": "Jan 15, 2023"}, {"text": "Hi,  By far the most beautiful  program ever made.    Can it please have a pop out  or saved  LINKS  IN A HTML PAGE ( dated).    In other words  a clickable \"saved sessions\" page.    Leonardo eat your heart out.", "stars": 5, "date": "Jun 27, 2021"}, {"text": "It would be nice if it can bookmark", "stars": 4, "date": "Mar 6, 2021"}, {"text": "Recent tab is default sort is very very awesome!!!", "stars": 5, "date": "Aug 19, 2020"}, {"text": "Great extension. Increases productivity when working on tasks which require many tabs to be opened.", "stars": 5, "date": "Jun 28, 2020"}, {"text": "Would be much better if fonts were smaller. TOO BIG. I need to see more search results at glance. I have a small screen.", "stars": 4, "date": "Apr 11, 2020"}, {"text": "Good extension, I use it for a couple of years. But there are some moments where it is not ideal. First, for some reason I literally freezes if I try search over history. Second, there are 5 configurable shortcuts for the extension, but they all do the same thing! Is it by design? If it is then in my opinion much better would be if every shortcut opens a specific tab of the extension. I find that I use the extension for bookmarks more often than for open tabs. So I changed default tab in opti... Show more", "stars": 4, "date": "Feb 4, 2020"}, {"text": "Hey very nice extension. Can I suggest one fundamental feature which might make your Saka the best fullscreen extention. Because google locked the search bar we cannot search for new pages. Can it be possible to start in a mode for searching google and if we want we can select from the list of tabs that are open as well? Also more customization of fonts and spacing as well as the button on the bottom would be very cool. \n\nKeep up the good work.", "stars": 4, "date": "Nov 9, 2019"}, {"text": "great! supreme! first class! all we need! I missed it so long time, now, I am calmed down! so thankxsxsxxs!", "stars": 5, "date": "Sep 22, 2019"}, {"text": "so many tab for opening closed tab , recently open tab, history, bookmarks,all opened tab...excellent extension", "stars": 5, "date": "Aug 21, 2019"}, {"text": "It would be so nice to let this extension close tabs with the same ease it allows to switch tabs.", "stars": 4, "date": "Jul 14, 2019"}, {"text": "I love this extension.\nIf the tab list of this extension can display the tabs in tree format like the firefox extension \"Tree Style Tab\", it will be AWESOME!!. I an looking for an alternative for \"Tree Style Tab\" extension in chrome and this extension is the closet I could find in Chrome.", "stars": 5, "date": "May 2, 2019"}, {"text": "The best tab search I've found.  Love the global shortcut feature.", "stars": 5, "date": "Jan 29, 2019"}, {"text": "This is one of these extensions that I didn't know I needed, but now I can't live without it.", "stars": 5, "date": "Nov 10, 2018"}, {"text": "very good application with good performance. exactly what i looking for. the only one thing i wish to be changed is that there is no sense to show current active tab in search results.\n\nexample: if i have 2 opened wikipedia tabs and im currently on it and i remember that i have another wiki article i want to switch, then i just toggle extension, write 'wik', click enter and im on it (my current tab is not listed in search results)", "stars": 5, "date": "Sep 28, 2018"}, {"text": "Loved it! Especially the 'Modes' feature, which is cool. Also easy short-cuts. Must have productivity extension.", "stars": 5, "date": "Aug 6, 2018"}, {"text": "Loved it!\nLooks awesome.\n\nOne thing that would greatly improve the extension is enabling searching through all modes at once. I`ve used a similar extension with that feature and I miss it here.", "stars": 5, "date": "May 5, 2018"}, {"text": "Could there be a way to add functionality to have it open a new tab pre-populated with your search if you press a different key or if there are no results? Mostly for the action \"open current instance of this page if it's currently open, else start the processing of initiating a new one...\"", "stars": 5, "date": "Feb 15, 2018"}, {"text": "Sufyan don't give up now! You are so nearly there with both SAKA key and SAKA. \n\nSaka needs:\n- integrated search ... a mode to search bing, google at the least from the search box. Similar to surfingkey ow.\n\nSaka key needs:\n-You are so close my friend. I have tried vim, SurfingKeys, etc. SAKA is faster, more reliable, better organising the links so fewer characters represent the most important links (not sure if this is by design or simply because it indexes fewer links on the page). \n- I get... Show more", "stars": 5, "date": "Feb 2, 2018"}, {"text": "If you like to open lots of tabs and have trouble finding the right one this lets you quickly search and jump to the right tab with your keyboard.", "stars": 5, "date": "Aug 30, 2017"}, {"text": "Tab searching is easier now. No problems.", "stars": 5, "date": "Aug 25, 2017"}, {"text": "I used to use BurstKey to switch/fuzzy search tabs. Saka is nicer looking.", "stars": 5, "date": "Aug 25, 2017"}]