[{"date": "Mar 7, 2024", "text": "The right-click menu was cnahged and it is not as useful as before. \nBefore: I click the right mouse button (I dont select any text on the page), see the the right-click menu and only one Toggl option: \"Start timer\". \nNow:  I click the right mouse button (I dont select any text on the page), see the the right-click menu and the Toggl option is called \"Toggl Track: Productivity  Time Tracker\" now, and it has two sub-options: \"Start timer\" and \"Disable tiny button on this page\". I don't use tin... Show more", "stars": 3}, {"date": "Mar 6, 2024", "text": "Overall, I love Toggl. It makes it easy for me to track my work throughout the day. As a consultant, this is so important. However, I have two complaints about the extension:\n(1) The latest update has added an extra step to changing tasks. Now, when I right click on the page for a new task, I have to hover over Toggl and then click Start Timer. I much preferred the old method where I was able to directly click start timer.\n(2) I have been noticing this for over a month now - sometimes, when I... Show more", "stars": 4}, {"date": "Feb 14, 2024", "text": "Doesn't work\nEdit: After using it through the website for a few days, I decided to give it another chance and now it does. I have no idea what changed, but I'm happy about it.", "stars": 5}, {"date": "Jan 9, 2024", "text": "The timer activation button stopped working when integrated with asana web-version. When you click on it, nothing happens. Please fix the button. Thank you!\n\nScreenshot: http://joxi.ru/Drlkn7xFdBzkWA", "stars": 1}, {"date": "Dec 18, 2023", "text": "Must to click context menu command maybe 10 times then it starts the task", "stars": 3}, {"date": "Nov 8, 2023", "text": "Hope there will be time number appears on the toolbar for easily knowing time tracked without click the crx button. My using browser: vivaldi.", "stars": 4}, {"date": "Nov 6, 2023", "text": "Great extension for several years.\nHowever, there's too many bugs for these days, I can't even use it anymore.\nThere's no response after clicking the extension icon.", "stars": 1}, {"date": "Nov 4, 2023", "text": "Is this a joke? Seemed promising but once you're all \"setup\", you're in a neverending spiral of \"fill out the required fields in order to save\". Rough. There goes 42:12:33 I won't get back!", "stars": 1}, {"date": "Nov 3, 2023", "text": "Great extension with lots of features to track your time.", "stars": 5}, {"date": "Nov 1, 2023", "text": "Good and intuitive app with good reports, even the free version. However, -1 point because I can't seem to make projects in the browser app, so I have to go do the website every time instead.", "stars": 4}, {"date": "Oct 20, 2023", "text": "It is not working anymore on my Chrome. It seems it is not reaching the server. When I start the day clicking on the \"play\" button, it starts to record, but I can't stop. This record is not being sent to the server and the data in the website is not updated.", "stars": 2}, {"date": "Oct 13, 2023", "text": "Completely useless now that the custom integration feature is gone. Can't believe Kiwi autoupdated the extension...FML. Good job ruining a good thing. Fahk", "stars": 2}, {"date": "Oct 10, 2023", "text": "Was good until they now spy you on your browsing history. Time to move on. Nothing to see here.", "stars": 1}, {"date": "Oct 10, 2023", "text": "don't touch my browser history", "stars": 1}, {"date": "Oct 10, 2023", "text": "Permission to read my browser history? For what?? Time to find another service to time track.", "stars": 1}, {"date": "Oct 9, 2023", "text": "Read your browsing history \n\nFor real?? It's time to find another service for time track.", "stars": 1}, {"date": "Sep 19, 2023", "text": "This extension worked really well for 2+ years of use. However, the past few months it's been terrible.", "stars": 2}, {"date": "Sep 14, 2023", "text": "Updated version doesn't work well with toodledo.\nWorst cases the integration stalls the website completely. Best case you get a lag of 10 seconds when you click the toggl button. Popups are also 10s slow to pop up.\n\nNeeds fixing, in older versions it worked flawlesly.", "stars": 1}, {"date": "Sep 12, 2023", "text": "This extension won't let me log in, so it's unusable", "stars": 1}, {"date": "Aug 22, 2023", "text": "poor updates , there was a timer ticking sound which was serving purpose a purpose of getting focused work but they have removed that functionality without any purpose", "stars": 1}, {"date": "Aug 6, 2023", "text": "perpetual loading spinner", "stars": 1}, {"date": "Aug 1, 2023", "text": "It used to work fine some months ago, now, if you start it from Trello, it doesn't have a project or the name of the task. One has to manually do all that.\nWithin Trello, the timer doesn't even stop.", "stars": 1}, {"date": "Jul 26, 2023", "text": "Requests re-authorization every 2 days. It's annoying...", "stars": 2}, {"date": "Jul 15, 2023", "text": "pomodoro timer somehow keeps the wrong time", "stars": 1}, {"date": "Jul 4, 2023", "text": "Super buggy. You can start, but not stop the timer. This is the most essential feature. The extension is not usable.", "stars": 1}, {"date": "May 31, 2023", "text": "Worst update.\n- Now when you start a browser afresh you likely see you're tracking something while you don't\n- It's now much less clear when you put the title yourself that you must hit enter to save it: first you hit enter as a matter of the old habbit but now nothing happens, it just continues blinking. And at a certain point you lose the habbit and then realize that it doesn't store the title you wrote at all on blur (on exiting extension window). This became much worse experience. Looks l... Show more", "stars": 1}, {"date": "May 24, 2023", "text": "I am always grateful to use your wonderful features.\n\nAfter a recent update, I no longer get the notification banner when the polo mode timer ends.\nMy environment is as follows.\n- Chrome version: 113.0.5672.126 (Official Build) (arm64)\n- MacBook Pro M1\n\nI have also allowed it in the notification settings.\nWhat could be the cause?", "stars": 4}, {"date": "May 23, 2023", "text": "jira and confluence don't work after last update :(", "stars": 1}, {"date": "May 10, 2023", "text": "Could be a 5 star but it breaks shortcuts across Google apps", "stars": 3}, {"date": "May 9, 2023", "text": "Latest update causing Chrome to freeze when used", "stars": 2}, {"date": "May 2, 2023", "text": "Really good before the update, now has various bugs. Most annoying for me is that if you use the phone version to stop a web timer or vice versa it breaks the extension and you have to remove it and reinstall it. Never used to be a problem with them syncing between each other. Would be 5 stars if they fix it or just roll it back as the update only seems to have been a skin change", "stars": 4}, {"date": "May 1, 2023", "text": "As other users mentioned, with the latest update the extension no longer pops a notification when the pomodoro timer stops. I have to remember to manually check and update the end time.\n\nI was thinking about buying the premium version, but I'm happy I didn't - can you imagine how pissed I would be if I paid money and it did that...", "stars": 3}, {"date": "Apr 26, 2023", "text": "Updated version doesn't even log in. As is, it's useless.", "stars": 1}, {"date": "Apr 26, 2023", "text": "The new 3.0.3. update is so slow to load", "stars": 2}, {"date": "Apr 26, 2023", "text": "What happened with the latest update? Pomodoro doesn't stop at set time; notificaiton doesn't pop up when it does. The interface is slower to load. Please fix!", "stars": 2}, {"date": "Apr 23, 2023", "text": "10/10 before the update, now it's so buggy and clunky, for example if I start a new timer from an old one in the history and only want to chagne the title slightly (I like to number things through so I often want to increment the number in the title) it changes the title and then when I open it again the change wasn't saved so I have to do it again, so it works on the second time for some reason. Also right click to start a Timer on a website is now also not always working anymore which is fr... Show more", "stars": 4}, {"date": "Apr 23, 2023", "text": "Now it works better, but still when used in Asana, it hangs all the page. Pressing a button causes a significant delay. Sometimes even message occurs that page is not answering.", "stars": 2}, {"date": "Apr 20, 2023", "text": "Poor update, it totally doesn't work, Fix right now.", "stars": 1}, {"date": "Apr 12, 2023", "text": "Ever since the last big update, it is HORRIBLE. Often doesn't work, doesn't react, sync, sometimes doesn't even open when i click on it (right now) so i have to use my phone.   ...the worst thing is that it used to be flawless! Such a shame.", "stars": 1}, {"date": "Apr 11, 2023", "text": "It would be more nice if the pomodoro timer counts a break time.", "stars": 4}, {"date": "Apr 10, 2023", "text": "I have suffered so Manny bug also have so Manny UX issue.", "stars": 2}, {"date": "Apr 7, 2023", "text": "Bumping the rating up since they're actively listening to user feedback and making fixes. Good job, keep it up!", "stars": 5}, {"date": "Apr 6, 2023", "text": "This extension worked seamlessly for me until the recent update. I'd still say it's 90% great, but it has recently become a lot more difficult to adjust your time on a task.\n\nExample: You walked away from your computer or another task popped up that needed immediate attention. You want to subtract 15 minutes from the current task.\n\nOld timer: subtract 15 minutes from the total time\nNew timer: add 15 minutes to the start time. \n\nThis is frustrating when I do it backwards and don't notice my to... Show more", "stars": 4}, {"date": "Apr 3, 2023", "text": "It's pretty bad UX. Firstly every time the extension updates it opens a tab informing me that I've installed it. I know that. I've got it installed for years now. Then my main way of using the extension was to press play on an existing entry and then edit start and end times (as I usually forget to start an entry when I start a new task and also because I round my entries to 15 min). Honestly the best experience was the old macOS app. It wasn't perfect, but worked far better than the new app.", "stars": 2}, {"date": "Apr 3, 2023", "text": "Since the recent update:\n\n- modifying the time I'm currently tracking got pretty difficult (e.g. just got a phone call, and would like to modify the spent time - I need to either A) modify the start time or B) stop the timer and modify the end time, and then restart timer\n- entering description is pretty painful if i have the same description for other project and the auto-suggestion appears\n- by default the icon looks like i'm tracking time (pink) - if I click on it, it turns grey\n- opens a ... Show more", "stars": 2}, {"date": "Mar 27, 2023", "text": "Used to be great but lately its been working on and off and right now its utterly broken. Don't bother trying, use the desktop app instead.", "stars": 1}, {"date": "Mar 27, 2023", "text": "This new version breaks my workflow.\nFor example:\n1) In Asana press the toggle button to start the timer\n2) stop the timer in toggle\n3) adjust the time entry - e.g. if I'd actually meant to stop the timer 20mins earlier\n4) In Asana start a new timer - Here is the issue -> this stops the old timer and changes the edited time entry to be the start and finish time that was set from asana, My corrections are all overridden with the wrong times.\n\nAlso I often start the timer in Asana way after I'v... Show more", "stars": 4}, {"date": "Mar 23, 2023", "text": "Ever since version 3.0, The addin has had continuous problems in our business environment. Luckily Firefox still uses 2.0.20 as its current version. Toggl support mentioned they had to update to 3.0 because of a Chrome Store compliance issue. PLEASE FIX!", "stars": 1}, {"date": "Mar 23, 2023", "text": "Disappointing Update to the Toggl Chrome Extension\n\nAs a long-time user of the Toggl Chrome Extension, I've generally been happy with its performance and features. However, the latest update has introduced a few issues that have made the extension less useful for my daily workflow.\n\n    Custom Domain Integrations: The update appears to have broken integrations with custom domains, such as self-hosted OpenProject instances. This has severely limited the extension's usability for those of us wh... Show more", "stars": 1}, {"date": "Mar 23, 2023", "text": "This used to be really great and easy to use.  Now when I click the button on various sites I'm using it on, the overlay is huge compared to what it used to be and I can't even tell what I'm supposed to do without scrutinizing over it.  You can't even tell there are fields at first glance; it's just a massive white box over the content.  PLEASE get your old UI/UX people back or something.  The changes over the past year or so (to desktop app, chrome extension, etc.) have been abysmal in terms... Show more", "stars": 1}, {"date": "Mar 23, 2023", "text": "Echoing similar statements from other more recent reviews. Since about six months ago the addon and integrations have become very unreliable and seem to loose control over the timer. Whilst a bit of creative juggling, tabbing to other screens and stopping the timer on the site restores this it happens so often that it affects workflow and productivity in a negative way. It used to work perfectly across multiple devices with a better UI design but slowly seems to be getting wreaked. Please sta... Show more", "stars": 2}, {"date": "Mar 20, 2023", "text": "This extension used to be perfect. I used it in conjunction with Clickup for time tracking and it just worked. But after the recent update, it's been absolutely awful. I keep having to refresh the page for the track button to work, it keeps auto-selecting the wrong project, the UI is ugly, it's just an enormous step backwards in almost every way. Really disappointed. I hope they can fix it soon.", "stars": 2}, {"date": "Mar 15, 2023", "text": "It used to be GREAT for the long six years of my experience until the recent update (feb-march of 2023). Integration doesn't work on any site anymore, have to manually add new tracking. Can't edit time by editing the amount of time (simple amount of minutes or hours), have to enter specific date time. The UI in general become worse and unclear to me. MOVE AWAY the \"Delete\" button or at least add a warning on click. I accidentally removed one of my entries and I can't restore it, nor add it ma... Show more", "stars": 1}, {"date": "Mar 14, 2023", "text": "This extension used to be great but recently it was updated and it's not nearly as easy to use.  I'm now finding it harder to get all projects from one client because you can no longer search for a client name and get all projects associated with it.  I'm also having to do more math to change the amount of time I've been billing; I used to be able to change the elapsed time, now I have to change the start time.  Furthermore, in order to change the start time, I have to do it using two clunky ... Show more", "stars": 2}, {"date": "Mar 9, 2023", "text": "doenst track time automatically like Web Activity Time Tracker", "stars": 2}, {"date": "Mar 2, 2023", "text": "New update has beautiful UI but is very slow, often hangs the whole page, sometimes doesn't even track time. Notifications about task timer hitting a limit are no longer displayed. Please bring back how it worked previously because now it is very difficult to use..", "stars": 3}, {"date": "Mar 2, 2023", "text": "I like your tracking much, but I didn't find a way to contact tech team, so I write this feedback here. I hope so of them read it.\n\nAs for me all working great, but one issue that really boring me. When I run the chrome the toggle extension icon have active state (ping), but when I press there is not tracking on and icon become grey.  Could you plesae fix it so if there is not tracking it was grey as it was.", "stars": 4}, {"date": "Feb 25, 2023", "text": "New version (3.0.0) outfit probably newer, but here are things which made it worse than previous ones:\n\n1. It takes more space\n2. Project and Tags fields are not showed anymore for new task, I need to press each button for them separately and then press again to focus in text field for search. 4 additional clicks for every new task! It is really annoying.\n3. Text search for tags is case-sensitive - why?\n4. There is no button to delete in the list - I need to press on the task firstly. Again a... Show more", "stars": 3}, {"date": "Feb 25, 2023", "text": "Good in every aspect but ONE. I had to close my account and delete the extension because the Toggl entries don't show on Google Calendar. I want them both to be in perfect sync, otherwise it is very confusing and against what it aims to achieve.", "stars": 4}, {"date": "Feb 23, 2023", "text": "Custom domain integration does not work more. Last update broken it. No jira, no youtrack. So app useful only for listed at integraion set services.", "stars": 4}, {"date": "Feb 21, 2023", "text": "It WAS good. Now for the past month or so the button doesn't work and no error message is shown either. It used to work like a charm but now it only works on some days while it doesn't work at all on most days. And yes, I do have the latest version.", "stars": 3}, {"date": "Feb 1, 2023", "text": "Does not work properly, the stop button stopped working, very laggy extension, does not store the auth properly, thus asks sign in again from time to time", "stars": 1}, {"date": "Jan 30, 2023", "text": "Love Toggl and the extension is dead simple & consistently getting better.", "stars": 5}, {"date": "Jan 30, 2023", "text": "I wish it supported rounding as time is added instead of just rounding at the end of a period for a report. Since it doesn't round as soon as time is added it's difficult to know when I've hit x hours for the week without going and manually tallying.", "stars": 4}, {"date": "Jan 30, 2023", "text": "An excellent & helpful extension! I like using it for activities because I haven't allocated a defined time, so I can better track & evaluate the time spent. I also combine Toggl with Zapier for the automated additions of these activities in Google Calendar. I also tried the Pomodoro feature, which is nice but different from what I am looking for now. Thank you!", "stars": 5}, {"date": "Jan 7, 2023", "text": "I like this useful extension!\nBut something happened recently - I cannot stop the timer anymore, only on the site", "stars": 4}, {"date": "Dec 27, 2022", "text": "Love it. Needs Google Calendar integration in a way that the time entries will show in google calendars.", "stars": 4}, {"date": "Dec 26, 2022", "text": "jeez i just added for the trial period and already feeling pressure on the premium features... i want to try it out no premium features to see if it works for me as an individal person (I have no team).  do i have to wait until the 30 days is up to see if the free plan is enough for my needs?  it looks really cool but i don't want to spend time setting up wtih features I won't have in the future. can't you toggle it off?", "stars": 3}, {"date": "Dec 16, 2022", "text": "The face button of the tracker is with no indication of a recent time in work. The embedded Pomodoro timer is with no breaks. I cannot believe in it. Half-stuff (", "stars": 3}, {"date": "Dec 16, 2022", "text": "This is a simple and effective way to track my time while working on projects. Gives me a good sense of my speed and how I can plan for future works.", "stars": 5}, {"date": "Dec 8, 2022", "text": "Working beautifully. Including the shortcuts.\n\nEdit: I am changing my review. Extension has become so difficult to use. I type task naem & hti enter, nothign happens. I need to do it 3-4 times to make it work. Same goes for stopping the timer. I feel like extension is unresponsive. It happens few days after every extenion update. Things work fine from toggl admin panel but extension lacks quick connectivity with servers.", "stars": 2}, {"date": "Nov 28, 2022", "text": "Great tracking tool!", "stars": 5}, {"date": "Nov 23, 2022", "text": "Integrations are not working anymore", "stars": 1}, {"date": "Nov 3, 2022", "text": "Best Tracker and generous Free Account feature. Thanks Toggl. And the support is very responsive, too. I hope to grow my company with this awesome tool further", "stars": 5}, {"date": "Oct 19, 2022", "text": "the extension works well. I like toggl, BUT...\n\nthe extension adds malware/unwanted yahoo search engine that you can't get rid off, unless you remove the extension. \n\nShame on you! Disappointing!!!", "stars": 1}, {"date": "Oct 5, 2022", "text": "Very nice service. Help my works really well", "stars": 5}, {"date": "Sep 13, 2022", "text": "I've been using the extension for a while and I love it. Thanks, Toggl!", "stars": 5}, {"date": "Sep 5, 2022", "text": "they need to implement rest time on pomodoro in the extension", "stars": 4}, {"date": "Sep 4, 2022", "text": "I just love it!", "stars": 5}, {"date": "Aug 22, 2022", "text": "Really useful", "stars": 5}, {"date": "Jul 31, 2022", "text": "Been using it for years, love it", "stars": 5}, {"date": "May 21, 2022", "text": "Amazing! I use it everyday. Recommend.", "stars": 5}, {"date": "May 19, 2022", "text": "i cant integrate it with todoist.. the instruction here (https://toggl.com/track/todoist-time-tracking/) was obsolete", "stars": 3}, {"date": "May 3, 2022", "text": "Great simple time tracking!\nNote: If you are a person that works later than 0:00 some days, reports can be pretty confusing (then your log entries will be split into 2 days, as there is no option to choose when your day usually begins)", "stars": 4}, {"date": "Mar 17, 2022", "text": "Stopped working with github", "stars": 2}, {"date": "Mar 14, 2022", "text": "wow, they added pomodoro timer here which is amazing. the extension and the timer is getting better each time. thank you for your work <3", "stars": 5}, {"date": "Mar 8, 2022", "text": "Really good", "stars": 5}, {"date": "Mar 1, 2022", "text": "Very useful, easy and convenient to use. Many additional functionality - pomodoro, statistics, invoicing, reporting.. thanks for all!", "stars": 5}, {"date": "Mar 1, 2022", "text": "Toggl Track offers a fantastic time & activity tracking service through browser extension and apps. I have been running into an issue with the Chrome extension lately, however, that the extension icon appears incorrectly — when there's no running time entry, the icon shows it is activated (pink instead of gray) and the white circular progress bar would randomly changes (at the 6 o'clock mark to the 12 o'clock mark).\n\nIt'd be great if you could please look into it. Thank you.", "stars": 4}, {"date": "Feb 16, 2022", "text": "I prefer this extension instead of the desktop version for only one reason:\nwhen the pomodoro timer is over, the extension does not stop working", "stars": 5}, {"date": "Feb 10, 2022", "text": "I have been using it for a month, and I really like it. I love the reminders (when I leave it on, or when I haven't logged any hours). A wonderful tool!", "stars": 5}, {"date": "Feb 6, 2022", "text": "Great and very useful tool. Thank You!", "stars": 5}, {"date": "Feb 4, 2022", "text": "If I use the pomodoro timer, the ticking sound continues after the set time period double. If I stop the timer, one ticking sound stops, but another one keeps playing in the background. Only by stoping the extension or closing the browser, does this get reset.", "stars": 2}, {"date": "Dec 16, 2021", "text": "excellent", "stars": 5}, {"date": "Nov 4, 2021", "text": "Great app. Works perfectly, I love the Todoist integration.", "stars": 5}, {"date": "Nov 3, 2021", "text": "I love the Pomodoro functionality!  Keeps me honest and optimizes my study sessions.", "stars": 5}, {"date": "Oct 29, 2021", "text": "Removed because it always asks me to log in every day, really annoying. The MACOS app doesnt do this", "stars": 1}, {"date": "Oct 28, 2021", "text": "I've always loved the simplicity of using Toggl, its pretty PDF reports and its gazillion integrations! Also the Chrome add-on is well-worth. It integrates even with self-hosted solutions such as Kanboard. As for the support staff: I remember reporting something to you guys and communication was excellent. All the best to each one of you, you're awesome.", "stars": 5}, {"date": "Oct 4, 2021", "text": "i like it so far!", "stars": 5}, {"date": "Oct 3, 2021", "text": "This is the app I absolutely always wanted and needed.  What an extension!!!", "stars": 5}, {"date": "Sep 10, 2021", "text": "I am a very basic user. Love it so far. Thank you for the free version.", "stars": 5}, {"date": "Jul 29, 2021", "text": "been using it for a month so far and enjoyed it", "stars": 5}, {"date": "Jul 27, 2021", "text": "Amazing", "stars": 5}, {"date": "Jun 30, 2021", "text": "simple and helpful! thanks", "stars": 5}, {"date": "Jun 29, 2021", "text": "This app has helped me organize everything this summer.  Very glad my brother recommended it to me and I in turn would happily recommend it to anyone looking to stay on track or keep themselves accountable for how they spend their time.", "stars": 5}, {"date": "Jun 24, 2021", "text": "Best time tracking app with the best user interface", "stars": 5}, {"date": "Jun 23, 2021", "text": "Waaaa, so nice! Cross platform too! that's what I needed", "stars": 5}, {"date": "Jun 15, 2021", "text": "Fantastic extension, thank you for existing!\n\nIt would be nice to have the option to block the team members from editing their own time and reserve that option for the admin", "stars": 5}, {"date": "May 25, 2021", "text": "The best! I use it from todoist. Awesome Integration! :)", "stars": 5}, {"date": "May 22, 2021", "text": "This extension is great, as a freelancer I just couldn't imagine working without that.", "stars": 5}, {"date": "May 21, 2021", "text": "I have my misgivings with what all data the extension collects (saw a review that says it tracks my activity on every site), but I've found the app built excellently. \n\nSuggestions: Custom pomodoro notification & alternative to ticking sound (a rain background would be really nice). \nPlus option to decide the length of the pomodoro break (Maybe a bell ring after 5 mins of 25 mins pomodoro passed- as a reminder to get back to work?)", "stars": 5}, {"date": "May 20, 2021", "text": "Absolutely LOVE it! \nI'm using it every day.  I primarily use the chrome extension to keep track of time spent on each client's tasks. Also love the easy reporting I can generate for each client. I highly recommend it!", "stars": 5}, {"date": "May 20, 2021", "text": "Huge fan of Toggl, mostly because of this extension. You'll definitely want to dig into the options when you set it up as features like the integrations and pomodoro timer are easy to miss but very helpful.\n\nIf I could change one thing, I'd make Toggl prompt you visit a site it's got an integration with, or perhaps  suggest some popular integrations when you install for the first time. Integrations are a game changer, but you probably won't know about them unless you dig through the settings ... Show more", "stars": 5}, {"date": "Apr 12, 2021", "text": "Works great... when it decides to work, way too often am i working and when I click on the stop button it just keeps counting  time and I have to then remember to go back and change the amount of time it counted manually. Very frustrating.\nOther than that its a good experience, If this didn't happen as often as it does I'd be way happier.", "stars": 3}, {"date": "Apr 8, 2021", "text": "Really helpful tool", "stars": 5}, {"date": "Mar 26, 2021", "text": "Very useful for my day to day work, nice work guys", "stars": 5}, {"date": "Mar 22, 2021", "text": "Simply: the best time manager out there! It works without any problems in sync with Chrome and Android. This is what I was looking for! Great job!\n\nUpdate: (22.03.2023)\nAfter the upgrade nothing is working when it comes to Pomodoro; no notifications, no sound, no pomodoro status in icon...nothing. The Pomodoro is useless!!", "stars": 4}, {"date": "Mar 15, 2021", "text": "Great tool for time tracking. The chrome extension makes it easy to remember to track tasks. Being able to add a toggl button to apps is great too (specifically salesforce). \n\nthe Pomodoro method included within the chrome extension is great for maintaining focus and avoiding burnout throughout the day.", "stars": 5}, {"date": "Mar 3, 2021", "text": "I needed a simple extension to keep track of my working hours. That is what I had before the upgrade. Now I cannot figure out how or where to make corrections - or if that is even possible anymore. But I was a free user so I will be on my way, now. ~~~  This reminds me of one of my mottos about the computer age: \"I hope that when those genius disrupters in Silicon Valley get old and retire, their kids keep changing everything on them all the time, too.\"", "stars": 2}, {"date": "Feb 24, 2021", "text": "The best way to track time as a contractor", "stars": 5}, {"date": "Feb 20, 2021", "text": "Great app. Has everything I need.", "stars": 5}, {"date": "Feb 14, 2021", "text": "I just started using this extension with Asana. It works great and I love being to able to track how much time I spend on various tasks. However, one thing I'd love to see is to have the toggl button show up in the \"Board\" view of tasks. Right now I can only see the toggl button in the \"List\" view.", "stars": 4}, {"date": "Feb 11, 2021", "text": "I think this extension is great. Currently teaching myself how to code and this is a great way to keep track of how much time I spend per day/week. It's definitely been helpful with my productivity since I started using it. \n\nA couple of small suggestions I have found when using the extension. When using the timer in Pomodoro mode, the alarm to notify you when your session is done is great. However, it would be nice to have a timer for your break period as well (i.e. 25 minute on, 5 min break... Show more", "stars": 5}, {"date": "Feb 11, 2021", "text": "I really enjoy this extension, my only problem is that every time I stop a timer (when using the Pomodoro feature) it will start a new cycle, yes, but keep counting the one that I stopped previously. Later on it will mark the end of the stopped Pomodoro cycle and even count it towards my tracked time. It's very annoying to have to go back and erase the time it counted, as it throws off my tracked time.", "stars": 4}, {"date": "Feb 10, 2021", "text": "Pros:\nCovers my needs for working, easy intuitive interface, convenient reports.\n\nCons:\nI tried using it for both personal time tracking and work. Created 2 separate workspaces for that. But on the dashboard and in the extension, all time entries get mashed together, with no way to separate them.\n\nGonna have to use other extension for personal time, until a way to separate time entries is added.", "stars": 4}, {"date": "Feb 5, 2021", "text": "Great tool if you use ClickUp. Only wishing for better pomodoro functionality.", "stars": 5}, {"date": "Feb 4, 2021", "text": "Been using it for about a week now. Unbelievable, where has this app been hiding. Tried many time tracking solutions. This one integrates so well with Trello and its interface works really well with my workflow. Took a little bit to figure how to use and thus configure the Projects/Clients/Tags taxonomies for my needs. Wish the Pomodoro feature worked better with Trello and jumping to the next item in a checklist without starting the clock from 0. Also wish even with the Pomodoro feature disa... Show more", "stars": 5}, {"date": "Feb 3, 2021", "text": "Changing my life.", "stars": 5}, {"date": "Jan 30, 2021", "text": "The bug of this extension IRRITATES me and I've already uninstalled this extension now, I am currently using chromebook now and, After I clicked and use the extension, I've got stuck at the login section even though I've already clicked logged in and currently logged in. I've uninstalled and reinstall this extension many times, but it still doesn't work. I beg you guys PLEASE! fix this bug, thanks.", "stars": 1}, {"date": "Jan 13, 2021", "text": "Great tool! I would like a way to tweak the pomodoro settings directly in the main interface. Other than that, it's perfect.", "stars": 5}, {"date": "Jan 10, 2021", "text": "First of all, great overall app and extension offering plenty of features for free.\nBut there *has* to be a way to single click start & stop the timer. Maybe this can be an option that you can enable, but what I wanna do when I click the extension icon is to start/stop the timer, not bring up the interface. I don't know how you'd access the interface in that case, but being able to stop the clock with a single click is way more important.", "stars": 5}, {"date": "Dec 21, 2020", "text": "Amazing, Amazing, Amazing!! School + Work + Extracurricular + Programming + Life = way too many things to keep track of.", "stars": 5}, {"date": "Dec 9, 2020", "text": "I wish if i could just pause the pomodoro without it re-starting everytime resume and more entries added .Hopefully you'll add this option", "stars": 3}, {"date": "Nov 29, 2020", "text": "Thank you so much for the excellent effort,\n\nI prefer the old RED color theme instead of current color #564260", "stars": 4}, {"date": "Nov 28, 2020", "text": "It's a waste of time, Every time needs to check time zone and crashes if you travel", "stars": 1}, {"date": "Nov 19, 2020", "text": "Good enough for my current use.", "stars": 5}, {"date": "Nov 10, 2020", "text": "Advertised Asana integration, but I can't get it to work. All of the website support I've contacted has out of date screenshots and doesn't seem to understand my issue.", "stars": 3}, {"date": "Nov 3, 2020", "text": "I use this plugin together with clickup. These two applications have helped me boost my productivity. Absolutely recommend both of them!", "stars": 5}, {"date": "Nov 1, 2020", "text": "I really like this service for the most part, but there's one feature that's missing that makes me use the webpage instead of the browser extension:\n\nIn the extension, there is no autocomplete for task names. This is vital for me! I track time spent on GitHub issues, so what I do is use the integration the very first time, then I type it in the remaining times. Without autocomplete, it's not realistic for me to manually type in the full issue title and number.", "stars": 4}, {"date": "Oct 30, 2020", "text": "need an option to remove ID from title inside Jira", "stars": 4}, {"date": "Oct 26, 2020", "text": "I like the Tracker so much. The only thing, I miss as a feature is auto stopping the tracker after an idle time", "stars": 5}, {"date": "Oct 20, 2020", "text": "It's not something you'd want to pay for providing that you are logged out all the time; the statistics does not stretch further back than recent 01/01/YEAR; there's no search functionality (in the extension) and on and on. I pay for many apps but this is not going to be one of them", "stars": 3}, {"date": "Oct 9, 2020", "text": "Excellent tool", "stars": 5}, {"date": "Oct 1, 2020", "text": "Great tool.\nIt would be nice to be able to see not only the time period for every entry, but also the time it started and ended. And edit those.", "stars": 5}, {"date": "Sep 12, 2020", "text": "Finally I've found a time tracker that has built in Pomodoro! Hurrah!\nUnfortunately, it's very \"Western 9-5 Mon-Fri\" centric because the \"Remind me to track time\" only works on \"weekdays\". But I need to track time on a Saturday and Sunday, and be reminded to do so!", "stars": 4}, {"date": "Sep 10, 2020", "text": "Very good extension with well made integration in all devices. I miss the classic theme. Please add an option for getting back to the old visual identity. I'm not very keen on purple for tools like this. Only reason why I don't really use Dracula theme for example. It is well made and is made for a huge amount of tools so we can standardise our tools, but purple just doesn't feel good (my personal opinion). Looks like every day is Halloween", "stars": 4}, {"date": "Sep 10, 2020", "text": "great tool but I'd love it if I could change the week days\nas I work Sunday - Thursday", "stars": 4}, {"date": "Sep 8, 2020", "text": "The new colour scheme is awful. Please turn back previous one or at least provide users with the option to choose.", "stars": 2}, {"date": "Sep 8, 2020", "text": "I hate the new color scheme enough to leave a review, the icon on my location bar makes me throw up, it's so bad.\nFind a color that looks better on white. Tip: red was perfect.", "stars": 2}, {"date": "Sep 7, 2020", "text": "Used to love it. Unfortunately recent changes provided few bugs that makes it quite annoying to use. Such a shame, happens so many times to good products :(", "stars": 2}, {"date": "Aug 26, 2020", "text": "Used to be a good tool for time tracking, then misguided management and marketing got involved to break all parts - account flow, usage flow, even basic features hidden behind paywalls, site replaced with something that is flashy but unusable. Look elsewhere for something that's worth getting involved with.", "stars": 1}, {"date": "Aug 6, 2020", "text": "Can't log in!!!!!!!!! I can log in to the website, but I can't do that to Toggl Button!!!!\n[ Now I delete cookies and reinstall this extension. Glad to find it works!!😆😆😆 ]", "stars": 5}, {"date": "Aug 5, 2020", "text": "Great pomodoro feature, great support.", "stars": 5}, {"date": "Jul 28, 2020", "text": "Absolutely love this chrome extension! SO helpful to use for projects. Just set it and forget it. Love that it does all the heavy lifting for you. Thanks Toggl!", "stars": 5}, {"date": "Jul 21, 2020", "text": "I've been using Toggl and its Chrome app Toggl Button for years now, both for work and personal projects. It's simple and effective - the tool is very accessible and gets out of your way as much as possible. Love it!", "stars": 5}, {"date": "Jul 17, 2020", "text": "My productivity level went through the roof thanks to the Pomodoro feature. I highly suggest you get this extension ^u^)", "stars": 5}, {"date": "Jul 10, 2020", "text": "Toggl is absolutely awesome, and this button extension works great. Intuitive, straightforward, no BS, great for studying or fighting procrastination. I'm very grateful that this is freely available.", "stars": 5}, {"date": "Jul 9, 2020", "text": "Pretty dang good since they added dark theme.", "stars": 5}, {"date": "Jul 2, 2020", "text": "Best software to track time. Convenient and easy synchronization between all devices. Definitely +5", "stars": 5}, {"date": "Jun 30, 2020", "text": "The button is great! I use it to go through my Todoist list using Pomodoro. The only thing that's missing is the ability to start a timed-break after the Pomodoro session ends. It would also be great if, once you finish a given task, you could switch to another task in your todo list if the current Pomodoro still has time left.", "stars": 4}, {"date": "Jun 24, 2020", "text": "Great with integrations!", "stars": 5}, {"date": "Jun 24, 2020", "text": "You are going a great job guys, I will make video tutorial in my Tube channel explaining how to get befint from this amazing tool especially with Asana. <3", "stars": 5}, {"date": "Apr 13, 2020", "text": "Pays for itself by reducing unbilled hours", "stars": 5}, {"date": "Apr 8, 2020", "text": "simple, cross-platform and veryuseful!", "stars": 5}, {"date": "Apr 7, 2020", "text": "Tried different other. Nearly the best solution by the grouping of the same Pomodoro activities. Love it.", "stars": 5}, {"date": "Apr 6, 2020", "text": "I love this tool.  I have tried MANY and keep coming back to Toggl.  UI is intuitive.  It does exactly what it supposed to and I love the multi-platform support.  It's made my sessions of deep work much more productive.", "stars": 5}, {"date": "Apr 4, 2020", "text": "I installed this extension on the latest version of Chrome 80.0.3987.163 (Official Build) (64-bit).\nI logged in to my Toggle account and enabled Evernote in Integrations.\nI checked that in the \"manage extensions\" page, that the options \"Automatically allow access on the following sites\" and *://*.evernote.com/* are on.\nI turned off the Ublock extension.\nI restarted Chrome.\nThe \"Toggl button\" does not appear in any of my Evernote note webpages.\nWaste of time.", "stars": 1}, {"date": "Apr 3, 2020", "text": "Functional and works as advertised except that there is absolutely no Toggl integration showing up for be in any of my web apps like Google Calendar or Notion. This was one of the main reasons I downloaded the extension and it's frustrating that I can't simply start a Toggl timer from an event in the calendar like advertised.", "stars": 4}, {"date": "Apr 1, 2020", "text": "This extension and Toggl in general are great. I even use their invoice template and attach a PDF of my report for my clients. It's so intuitive and you can customize it down pretty far. I'm a big fan. Even when my client suggested Harvest because it has integrations with Asana, I'm sticking with Toggl...and of course it also has integrations with all the apps I use as well since there are well over 130 in there. Thanks!", "stars": 5}, {"date": "Mar 29, 2020", "text": "This Chrome addon is fine but it would be better if it auto-stops the tracking when you close the browser. Sometimes i forgot to stop it and the task is still running the next day.", "stars": 3}, {"date": "Mar 20, 2020", "text": "Absolutely helpful.", "stars": 5}, {"date": "Mar 5, 2020", "text": "great! simple as possible", "stars": 5}, {"date": "Feb 18, 2020", "text": "Unfortunately not working with Trello, if so tell me how, but your introduction video ist not showing how.", "stars": 4}, {"date": "Jan 27, 2020", "text": "An amazing plugin, has really helped my business grow and help me be more accountable to myself, my team and my clients. Would highly recommend for the designers, developers and creatives out there who are looking to grow their business and add true structure to it. I love toggl!", "stars": 5}, {"date": "Jan 18, 2020", "text": "Does this take screenshots?", "stars": 3}, {"date": "Jan 14, 2020", "text": "Wow, what a mixed bag.   When it works great.   Seems to consistently lose track of its mind, though.   For example, you stop the timer in your toggl tab.   Then randomly you start getting alerts that your timer is still running.   \n\nExcept that its not.\nExcept that it is.\n\nSearch all your tabs, refresh your timer tab, everything is fine.\n\nThen later, when you go to send invoices, the dang thing ran all day and now your clients are hitting the roof.\n\nHave a nice day.", "stars": 3}, {"date": "Jan 12, 2020", "text": "The best extension for time tracking (and the best service)", "stars": 5}, {"date": "Jan 7, 2020", "text": "Fantastic extension - I love it. I am so thankful to all the developers. No problems at all with it in 2 years of use :)", "stars": 5}, {"date": "Dec 27, 2019", "text": "Double timer button on Jira.", "stars": 4}, {"date": "Dec 26, 2019", "text": "Improved the app a lot by shipping new features regularly.\n\nIt's easy to use when you customise the options as per your needs and style.", "stars": 4}, {"date": "Dec 20, 2019", "text": "Toggl is a fantastic company! They are passionate about customer service and feedback, as demonstrated by the fact that they mailed me a free T-shirt some time ago when I provided feedback multiple times within a short period. Syncing among devices has improved and it's extremely convenient to use the Toggl browser button!", "stars": 5}, {"date": "Dec 7, 2019", "text": "It's okay for what I need it to do. It can be annoying to constantly reset the default project even though I have the option enabled to remember the last chosen project. Because of that, I waste a lot of time fixing those errors.", "stars": 3}, {"date": "Dec 3, 2019", "text": "This is a great tool", "stars": 5}, {"date": "Nov 18, 2019", "text": "Amazing app! Keep on developing it please :-)", "stars": 5}, {"date": "Nov 9, 2019", "text": "Super good software! Helping me track my time! Love Toggl! Thanks for the dev team!", "stars": 5}, {"date": "Oct 30, 2019", "text": "I like the extension a lot. However, it's Pomodoro time works sometimes and sometimes not (defeating the purpose of a pomodoro timer). I do find that Toggl products don't always synch, and that I'll have a timer running on one device, move to another device, start a new task, and the first one keeps running until the next day, when I get an email from Toggl (sometimes) telling me that it's still running. All-in-all, I really like the Toggl products a lot, though. It's a step away from 5 points.", "stars": 4}, {"date": "Oct 27, 2019", "text": "Great Feature!", "stars": 5}, {"date": "Oct 20, 2019", "text": "Didn't work with Todoist for Gmail", "stars": 3}, {"date": "Oct 18, 2019", "text": "This extension is very useful and I use it every single day.\n\nThat said, I would love the following things to be addressed:\n\n1. Starting a new time entry using keyboard input is impossible because tabbing from the description to the project or tag dropdown doesn't allow selection of the dropdown. Tabbing to the dropdown should allow selection by arrow keys or by using typeahead search. This makes it tedious to start each entry.\n\n2. Starting a new time entry should allow a quick way of enterin... Show more", "stars": 4}, {"date": "Oct 8, 2019", "text": "I love Toggl.\n\nThere is a problem with sync between desktop app, mobile app and chrome extension, sometimes they throw notifications by mistake.", "stars": 4}, {"date": "Sep 22, 2019", "text": "it works amazing and i love the pomodoro features", "stars": 5}, {"date": "Sep 13, 2019", "text": "I used it to track my pomodoros & it's helpful. I liked it.", "stars": 4}, {"date": "Sep 12, 2019", "text": "works great and the integration is very smooth and really works. The best tool to manage time.", "stars": 5}, {"date": "Sep 10, 2019", "text": "Fabulous extension - I am using it with Asana. I found though that even when I have the exact same project name in Asana and Toggl the project name doesn't always populate automatically - I wonder if there is some detail of the exact logic the extension follows here so I can understand the failure?\n\nIt's a shame that Asana tags don't populate the Toggl tag at all - would be good to see this enhancement implemented.", "stars": 4}, {"date": "Sep 10, 2019", "text": "I absolutely love how toggl has helped me understand where I am placing the majority of my daily tasks & activities throughout the day! I am very blessed & fortunate to have found something like this to implement in my life & for that I am very grateful, Thank you for making this free & simple to use! 🙌🙏", "stars": 5}, {"date": "Sep 2, 2019", "text": "Please add Jupyter Notebooks integration", "stars": 3}, {"date": "Aug 30, 2019", "text": "Does exactly what I need as most of my work is browser based having the extension means I can get it running as soon as I open a browser", "stars": 5}, {"date": "Aug 28, 2019", "text": "Superb Extension. Works Perfectly and the overall app is superb can track time very efficiently. Highly Recommended!", "stars": 5}, {"date": "Aug 21, 2019", "text": "Love the extension, would be nice if you could define a default toggl project for every JIRA Board.", "stars": 5}, {"date": "Aug 20, 2019", "text": "Very useful feature. Would be nice to set different pomodoro times for different projects.", "stars": 5}, {"date": "Aug 14, 2019", "text": "This extension seems to take a huge amount of Javascript Memory for not very much. I turned on Javascript Memory in the Chrome Task Manager and this extension took 260MB of memory!", "stars": 3}, {"date": "Jul 17, 2019", "text": "This is excellent, I use it to track in Asana and Airtable mainly but quite versatile! I wish there was a Safari extension!", "stars": 5}, {"date": "Jul 15, 2019", "text": "Would be really nice if it could be configured to also fill in the Project based on the actual Project or Epic from Azure DevOps", "stars": 4}, {"date": "Jul 15, 2019", "text": "Amazing! The only problem is when you stop the timer and start it again it create new tabs and there is no way to disable this.", "stars": 4}, {"date": "Jun 27, 2019", "text": "Excellent! I work with several clients and has helped me send reports of my time spent to them and to see how I am investing my time with projects as well. Very recommended!", "stars": 5}, {"date": "Jun 5, 2019", "text": "Great service, attentive to feedback and quick fixes. Valuable tool.", "stars": 5}, {"date": "Apr 29, 2019", "text": "Hi, \n\nintegration with Google products not work anymore since latest update (last week).\n\nI've re-installed it and re-login but continue not working. Can use it form toolbar, integration with trello works fine but on mail.google or docs.google it doesn't work.", "stars": 1}, {"date": "Apr 11, 2019", "text": "Improved now there is a much bigger popup although it will take some time to get used to rearranged buttones", "stars": 5}, {"date": "Apr 1, 2019", "text": "Hello!\n\nGetting into using Toggl, especially the Pomodoro timer, which I typically have used in an app on my phone. Excited to integrate a Pomodoro productivity tool into my hourly project time keeping.\n\nOne suggestion that I think I saw someone allude to, but I wanted to emphasize:\nIt would be great to have the ability to time my breaks after each Pomodoro interval with an alert for when the break is over so I can restart my working interval. If there's a way to do this, please let me know. ... Show more", "stars": 4}, {"date": "Mar 31, 2019", "text": "I use Toggl button multiple times every day and it saves much of my time. But one thing is not OK. Every update resets my settings of Pomodoro timer (Stop time tracking when pomodoro time ends) - after the upgrade, this item is set again...", "stars": 4}, {"date": "Mar 29, 2019", "text": "I started using Toggle May 2012. This week for the first time, Toggl started to behavior strangely. I reached out to support; they were helpful and fast to get my service restored. Awesome app that I honestly can live without!", "stars": 5}, {"date": "Mar 26, 2019", "text": "pomodoro doesn't work properly on Windows 10. Baloon notification doesn't apear sometimes. this is real problem because Toggl silent stops counting time.", "stars": 4}, {"date": "Feb 6, 2019", "text": "Just 3 stars because it's inconsistent. 2 weeks ago Toggl Button was working fine with Trello, but now when I start tracking a card it does not assign to the Toggle project anymore. Sorry...", "stars": 3}, {"date": "Jan 15, 2019", "text": "do not work appears in grey, I try to logg but error arises, impossible to login, impossible to use since I installed it one week ago, of course i have internet, so there is no sense in this", "stars": 1}, {"date": "Jan 7, 2019", "text": "Excellent extension, but could benefit from a couple additions:\n\n1. Tags aren't retained when continuing an existing timer. This may be a bug or a feature, but it's annoying. Please, please, PLEASE provide an option to retain the continued timer's tags! It's very annoying to have to re-tag for every continued timer.\n\n2. It would be nice if there was a way to edit existing timers without continuing them. Perhaps a right-click or some other means of editing the details of a previous timer (such... Show more", "stars": 4}, {"date": "Dec 12, 2018", "text": "Good extension but it should pause or stop when my computer sleeps or locks (windows 10). It keeps running and messes all stats. Both of stop automatically and idle detection features are enabled already. Thanks.", "stars": 3}, {"date": "Nov 28, 2018", "text": "Won't stay logged in like a modern extension. I don't have time to input username and password each time I open Chrome.", "stars": 1}, {"date": "Nov 19, 2018", "text": "It tracks the time, but doesn't indicate the project or client, so you have to go in manually to edit every single time entry to assign it to a project and client. Clockify (free) is better, as is Everhour (paid).", "stars": 2}, {"date": "Oct 22, 2018", "text": "This app helps me track time and the connection to the main site is very easy. the only problem is that through the extension you cannot track after fact, like in the website.", "stars": 4}, {"date": "Oct 3, 2018", "text": "Very useful extension", "stars": 5}, {"date": "Aug 10, 2018", "text": "Great, but hopefully they are going to update the integration with Meistertask, it doesn't work anymore.", "stars": 5}, {"date": "Aug 6, 2018", "text": "The app itself is great, but too expensive. Their closest competitor Clockify provides the same features but for free", "stars": 2}, {"date": "Jun 29, 2018", "text": "Really a great product and love the integrations. Amazing work. One improvement I would say is to improve the Pomodoro experience. I know when the Pomodoro is done, but not when the subsequent break is over. It could be a lot clearer. The Marinara extension is a good example of clear Pomodoro time division and alerts. Would get 5 stars if Pomodoro integration was more robust.", "stars": 4}, {"date": "Jun 25, 2018", "text": "It's very good and useful extension, perfect... :)", "stars": 4}, {"date": "Jun 20, 2018", "text": "Used it a lot in the past, but the new one wants permissions to read my browsing history. I can see no reason why it needs that access, so I wont be using it anymore", "stars": 1}, {"date": "Jun 13, 2018", "text": "Well everything worked a year ago, now I cannot log in to Toggl Button with correct credentials. Still the same error. Wrong Email or Password :/", "stars": 4}, {"date": "May 24, 2018", "text": "I don't hate doing time sheets anymore, which I think everyone can unanimously agree sucks. Toggl is great, and having it right in my browser when I start work everyday, and it reminding me to track my time, no matter what reporting method/software my client is using take minutes instead of hours. Thank you for making this, it makes life a little easier.", "stars": 5}, {"date": "Apr 23, 2018", "text": "Love the integration with this and Asana, though Asana just updated their design and the button is gone, but that is being worked on.  Works great for Basecamp, Github, Gitlab, bitbucket and more", "stars": 5}, {"date": "Apr 5, 2018", "text": "I use the heck out of this robust, super-clear, super-smart app.  It motivates.  It informs.  It visualizes.  It makes me more efficient in the real world.", "stars": 5}, {"date": "Mar 15, 2018", "text": "I really love it. Very helpful.", "stars": 5}, {"date": "Mar 13, 2018", "text": "Pomodoro timer is useless. It should start next pomodoro automatically after 5 minutes break. If it doesn't, what's the point? I might as well use just a regular timer.\nAlso, the interface looks so bad compared to the iphone app or even desktop dashboard. I just don't get it. It is one day of work to restyle it in CSS.", "stars": 2}, {"date": "Feb 20, 2018", "text": "great app!", "stars": 5}, {"date": "Dec 20, 2017", "text": "Great Extension. Doesn't work with new material designed google calender.", "stars": 5}, {"date": "Nov 16, 2017", "text": "I just love it!!! Just what I was looking for, I have been using Toggl long time ago since I freelance, and I just found this add-on, added on firefox and chrome, simply love it! Also the pomodoro addition a nice touch!", "stars": 5}, {"date": "Oct 19, 2017", "text": "The application does not work as desired. Auto stop does not work when the browser is closed (Windows 7).", "stars": 3}, {"date": "Oct 10, 2017", "text": "Great app that you can use on a lot of different sites. Really helps to keep me on task and has helped our business immensely with reporting, billing, and more.", "stars": 5}, {"date": "Oct 4, 2017", "text": "Wonderfully useful for anyone who needs to track billable hours", "stars": 5}, {"date": "Sep 14, 2017", "text": "Amazing app. Very good for students", "stars": 5}, {"date": "Sep 6, 2017", "text": "Awesome.", "stars": 5}, {"date": "Sep 3, 2017", "text": "Love this app. Thanks guys", "stars": 5}, {"date": "Aug 4, 2017", "text": "doesn't work with windows 10 scaling...\nEDIT: works now! and works on MacOS too! Thank you for making this that much easier to use!", "stars": 5}, {"date": "Jul 25, 2017", "text": "good", "stars": 4}, {"date": "Jul 25, 2017", "text": "ATTENTION ! the addon track your activity on your browser and sites , those crimi..nals , see the permissions that the addon ask", "stars": 1}, {"date": "Jul 25, 2017", "text": "Best time tracker.", "stars": 5}, {"date": "Jul 24, 2017", "text": "ok", "stars": 4}, {"date": "Jul 24, 2017", "text": "lee pee", "stars": 5}, {"date": "Jul 23, 2017", "text": "nice app, very helpful", "stars": 5}, {"date": "Jul 17, 2017", "text": "I haven't been using it for very long but I love how wonderfully this app works! It runs very smoothly and I am able to access everything very quickly on the google taskbar. I wish the app would run a breakdown by hour though so I'm able to see what the most productive hours of the day are and how these times should be broken down for maximum efficiency.", "stars": 5}, {"date": "Jun 25, 2017", "text": "I've been using Toggl Button for several years. It's great that it works in Trello, Basecamp and GitHub, among others. It makes it much easier to track time on specific tasks while rolling them up to more general projects and clients.", "stars": 5}, {"date": "Jun 13, 2017", "text": "I'm a happy Toggl user for more than 3 years now, after a couple of attemps with non stables apps! \nI really appreciate the intuitive interface, the clean design and the functionalities improvements on a regular base, even for the free version.", "stars": 5}, {"date": "Jun 12, 2017", "text": "Buyer beware for all entrepreneurs and small businesses leaders out there. Time-tracking app #Toggl has the absolute worst customer service in the industry. They take zero responsibility for the issues their poor site UI/UX creates, and hide behind business-first policies no matter the reason, or the cost. \n\nWe wasted so much time, energy & money on this \"hit & run\" business; I want to caution you from doing the same. There are better time-tracking services out there who both deserve your bus... Show more", "stars": 1}, {"date": "Jun 10, 2017", "text": "Great add on for Toggle, toggle there where the Work begins", "stars": 5}, {"date": "Jun 8, 2017", "text": "I am using this with a free account on Toggl. It is just great that you simply can press a button and time registration starts and keeps running until you stop it from the browser on any other device where you have toggle installed.", "stars": 5}, {"date": "Jun 7, 2017", "text": "Great reminder to track my time.", "stars": 4}, {"date": "Jun 7, 2017", "text": "I use this with Evernote (web) - I can simply start the timer from within the Note that I am working on. Makes time keeping easy.", "stars": 5}, {"date": "Jun 6, 2017", "text": "I love it! It works as pomodoro, also works to change tasks quickly!", "stars": 5}, {"date": "Jun 6, 2017", "text": "Great tool. Cross device. Simple to use. Pomodoro doesn't work for me. The rest is great.", "stars": 4}, {"date": "Jun 6, 2017", "text": "I needed it so bad that I moved from using Firefox at the time.  Works great!", "stars": 5}, {"date": "Jun 6, 2017", "text": "Best tool to track your time and pomodoros!\nThanks guys for this amazing tool!", "stars": 5}, {"date": "Jun 6, 2017", "text": "Very useful especially when integrated with other applications.", "stars": 5}, {"date": "Jun 6, 2017", "text": "Half of the times I try to start a timer it does not do it, it sais \"cannot connect to server\" or something similar. \nI am on PC, latest Chrome, WIN10.\nOther than that this app is a MUST!!!!!", "stars": 3}, {"date": "Jun 6, 2017", "text": "easy and functional", "stars": 5}, {"date": "Jun 6, 2017", "text": "I love Toggl. But only the desktop version. I found the online version unhelpful and annoying to use I also want to keep away from the web to focus better at times so I just use the desktop version and I love it!!!", "stars": 1}, {"date": "Jun 6, 2017", "text": "I have no complaints about this Toggl Button extension. I use it every hour of my working day. I'm especially happy with the way it integrates with my Kanban board on Trello. The moment I move a card to the 'Doing' column I press the Toggl Button. Some times it's happened that the Toggl Button doesn't load at the start of the day, but then it fixes when I just refresh the Trello page.", "stars": 5}, {"date": "Jun 6, 2017", "text": "I use it all the time.I love the fine grain tracking I can do from JIRA and from Github.", "stars": 4}, {"date": "Jun 6, 2017", "text": "I don't really use it. I prefer to use Toggl on my browser; it just suits the way I organise my work on my monitor better.", "stars": 3}, {"date": "Jun 6, 2017", "text": "This Chrome extension is a welcome addition to the Toggl family. While it does have some quirks, its ease of use on the fly makes it an indispensable tool for our business. After all, the other alternative is to stop, fire up toggl and start the timer from there. Some of the reviews and the wish lists mentioned would probably bloat this extension beyond is simplicity and ease of use.  So, the alternative would be have a second, premium extension on top of the Toggl subscription for those who ... Show more", "stars": 5}, {"date": "Jun 6, 2017", "text": "Works great! I use it all the time. No complaints. :)", "stars": 5}, {"date": "Jun 6, 2017", "text": "Use it in my daily business!!!", "stars": 5}, {"date": "Jun 6, 2017", "text": "Handy feature, especially when working in Google docs.", "stars": 4}, {"date": "Jun 6, 2017", "text": "Awesome tool for tracking my time.  Easy to use.", "stars": 5}, {"date": "Jun 6, 2017", "text": "Great extension. Help me track time from almost any web 2.0 app, I required to work with.", "stars": 4}, {"date": "Jun 6, 2017", "text": "i use toggl in combination with JIRA ,but since latest update on JIRA toggl the plugin stopped working as it used to , for example the task id , wont show up anymore in toggle ....", "stars": 3}, {"date": "Jun 6, 2017", "text": "Perfect and useful extension. I like it :)", "stars": 5}, {"date": "Jun 5, 2017", "text": "Simplest way to track time I have seen over 40 years of work.", "stars": 5}, {"date": "Jun 5, 2017", "text": "Has always worked fine. Pleased to see that they have a pomodoro timer option as well.", "stars": 5}, {"date": "Jun 5, 2017", "text": "It's a great addon. Recommended.", "stars": 5}, {"date": "Jun 5, 2017", "text": "Makes it a lot faster to integrate with other apps such as Trello.", "stars": 5}, {"date": "Jun 5, 2017", "text": "toggl is the best for a reason!", "stars": 5}, {"date": "Jun 5, 2017", "text": "Use this daily.  I love toggl", "stars": 5}, {"date": "Jun 5, 2017", "text": "I'm using it mainly for JIRA cloud and it works great!", "stars": 5}, {"date": "Jun 5, 2017", "text": "It is great but can't seem to get started with it.", "stars": 3}, {"date": "Jun 5, 2017", "text": "awesome", "stars": 5}, {"date": "Jun 5, 2017", "text": "Super handy that I can see my timer is on any Chrome window.", "stars": 5}, {"date": "Jun 5, 2017", "text": "Works as advertised, very useful, and has so many features (like Pomodoro despite other reviewers not finding it).\n\nBest app for what it does!", "stars": 5}, {"date": "Jun 5, 2017", "text": "Works very well for me, what I'm missing is some autocomplete based on the history.", "stars": 5}, {"date": "Jun 5, 2017", "text": "I use this everyday and it meets all my needs for time tracking.  Love this tool!  I recommend it all the time.", "stars": 5}, {"date": "Jun 5, 2017", "text": "Love all the existing integrations. I use the extension over the native app. It's awesome.", "stars": 5}, {"date": "Jun 5, 2017", "text": "It simply works. What could I ask more?", "stars": 5}, {"date": "Jun 5, 2017", "text": "Great feature, love the integration with other software like Basecamp and trello.", "stars": 5}, {"date": "Jun 5, 2017", "text": "This thing is pretty good! I use it all the time and when a google calendar update breaks it I'm horribly confused and can barely get work done :)\n\nIt would be nice to be able to tie specific google accounts to default clients/projects, saving a couple clicks.\n\nSometimes the time entry fails to populate when I'm using the button on a Google Calendar appointment. I cannot consistently reproduce this but it happens with every Google account I've got.", "stars": 4}, {"date": "Jun 5, 2017", "text": "Good App to track the time on your own work.", "stars": 5}, {"date": "Jun 5, 2017", "text": "We resisted time tracking for so long, and it was hurting our business. Now that Toggl has made it simple, our profits have definitely gone up. W. Edwards Deming was right: you definitely get what you measure!", "stars": 5}, {"date": "Jun 5, 2017", "text": "Pomodoro does not work.", "stars": 3}, {"date": "Jun 5, 2017", "text": "Works well for me", "stars": 5}, {"date": "Jun 5, 2017", "text": "It's very useful! Though I'd love to have more entries to see (maybe a calendar there?)", "stars": 4}, {"date": "Jun 5, 2017", "text": "Unfortunately Toggl Button doesn't support TFS Server 2015/2017", "stars": 3}, {"date": "Jun 5, 2017", "text": "Awesome tool that make you track fast from almost everywhere!", "stars": 5}, {"date": "Jun 5, 2017", "text": "I have used its basic features, like time tracking and it has been very practical, giving me a general dialy and weekly time workflow projection.", "stars": 4}, {"date": "Jun 5, 2017", "text": "Works great, reminders are good and the ability to discard stuff when I forget to stop it. Lovely.", "stars": 5}, {"date": "Jun 5, 2017", "text": "I like the reminder to track my time when I'm working on something. Even if it's a \"quick\" little thing.", "stars": 5}, {"date": "Jun 5, 2017", "text": "Good App", "stars": 5}, {"date": "Jun 5, 2017", "text": "Super useful!", "stars": 5}, {"date": "Jun 5, 2017", "text": "Very useful and integrated on many services I use daily!", "stars": 5}, {"date": "Jun 5, 2017", "text": "I've used toggl for a long time and enjoy the Chrome extension.  I mostly use it with BitBucket, but it's always nice to try a new web app and find the toggl button there.", "stars": 5}, {"date": "Jun 5, 2017", "text": "Need portable version!", "stars": 5}, {"date": "Jun 5, 2017", "text": "I use Toggl button with Trello. These two tools are awesome together!", "stars": 5}, {"date": "Jun 5, 2017", "text": "I cant say enough about how much I love this extension. I also downloaded the desktop app and use the online reporting to bill my clients. This beats the old program I was using... And I havent even explored all the options yet! Thank you for such an amazing tool!", "stars": 5}, {"date": "Jun 5, 2017", "text": "I love Toggl because this extension helps me be able to more easily track time spent on various tasks from Freshdesk, Todoist, Jira, and Confluence, all of which I use daily. I was going out of my mind before, trying to track all the time spent across everything I do.\n\nThe only suggestions that I have would be to make the timeline data available as a report to the user, so that it can be used to make any adjustments that might be needed in case you forget to set or stop a timer; and to make i... Show more", "stars": 5}, {"date": "Jun 5, 2017", "text": "Great product. Helps me stay productive. Has a detailed graph on where your time has been spent, either on your computer or the sites you visit. 4 stars because sometimes the syncing doesn't work well between your apps, desktop and mobile. Also, the Pomodoro feature still needs work.", "stars": 4}, {"date": "Jun 5, 2017", "text": "For free, this is very nice functionality, and it makes it very easy to track time spent on small projects.", "stars": 5}, {"date": "Jun 5, 2017", "text": "This is a life-saver. Keeps me focused and on-task everyday!", "stars": 5}, {"date": "Jun 5, 2017", "text": "Very useful but it would be nice if you could specify what fields from the Trello card get included in the Timer title. I'd personally find it incredibly useful if i could include the Trello card ID so i could match it with a Zapier task to log the time spent on each item back in Trello.", "stars": 4}, {"date": "Jun 5, 2017", "text": "I use this with Trello and Aceproject.\n\nI found the desktop version not easy to use but for basic logging into these two apps it works just find.  I drive the recording from the app, not from Toggl on my toolbar.", "stars": 4}, {"date": "Jun 5, 2017", "text": "I needed Toggl for tracking a certain project I was working on. Toggl was very helpful and flexible. Really easy to use.", "stars": 5}, {"date": "Jun 5, 2017", "text": "A great tool for my business", "stars": 5}, {"date": "Jun 5, 2017", "text": "You have to dig just a bit to find all the ways you can customize this (hence -1 star), but overall this is a great integration tool for Toggl users. Definitely recommended.", "stars": 4}, {"date": "Jun 5, 2017", "text": "Awesome, use it every day.", "stars": 5}, {"date": "Jun 5, 2017", "text": "The pomodoro feature is the main reason why I use the button. I would like this feature to be integrated directly into the Toggl web interface.", "stars": 5}, {"date": "Jun 5, 2017", "text": "Perfect! Tracking, reports, projects... everything you need! It helps giving my time the value it deserves", "stars": 5}, {"date": "Jun 5, 2017", "text": "The best!", "stars": 5}, {"date": "Jun 5, 2017", "text": "Great extension, works very well with Todoist. Also, syncs up nicely with Toggl web and desktop apps. Nice seamless integration. Well done!", "stars": 5}, {"date": "Jun 5, 2017", "text": "Would like better support for working on tasks and assigning projects, I end up re-assigning all the time I tracked half the time.", "stars": 3}, {"date": "Jun 5, 2017", "text": "Useful addon for the best time tracking app I've found.", "stars": 5}, {"date": "Jun 5, 2017", "text": "very useful, it shows up on jira and it picks up the jira issue so you can track time very easily", "stars": 5}, {"date": "Jun 5, 2017", "text": "Love the tool in general. The Pomodoro Timer option is why I use the Chrome extension most frequently.\n\nI wish that I could choose from recently entered activities. I like to spend as little time as possible entering details about what I'm working on so I don't want to enter the project/tags for tasks each time.", "stars": 4}, {"date": "Jun 5, 2017", "text": "Super useful!", "stars": 5}, {"date": "Jun 5, 2017", "text": "Totes awesome! Definitely a part of my workflow. \nCould we get Jira integration though?", "stars": 5}, {"date": "Jun 5, 2017", "text": "It's good!", "stars": 5}, {"date": "Jun 5, 2017", "text": "Completely useless. It doesn't pull in enough meta-data from anything it integrates with to help me to classify anything after-the-fact. It's definitely no faster than simply clicking into another tab and typing a couple of characters to start a new task.", "stars": 1}, {"date": "May 27, 2017", "text": "App shows promise but needs a lot of work. Seems it should be presented as a \"beta\" product not a fully developed one. You can turn on pomodoro functionality in settings but it doesn't work at all. Subprojects are available but only in the paid version (starting at $40/yr+). In reports, reporting by the DAY is not available (can do weeks, months, etc). Reports presents a pie chart (nice) in which each color represents a project (but again, no subprojects/tasks unless using paid version). Also... Show more", "stars": 2}, {"date": "May 27, 2017", "text": "This extension is great. But it could be better when I click it instead of getting a list of activities I have done in recent times. I would like it to list every activitie and to be able to sort it by tag. Also when I click recent entries I get \"Error connecting to server\"", "stars": 3}, {"date": "May 22, 2017", "text": "3.5 stars because it is lacking an essential part of task-managing that i rely on. How do i find the pomodoro option? I enabled it in settings, but i can't find any evidence of the pomodoro timer working. it's really a shame, because what i need is a to-do list/ task manager, with the pomodoro timer option. Frankly, i don't give two $hits about TRACKING my time by counting UP. I need a TIMER, not a stopwatch. Really, that's it. I considered using toggl in combonation with a simple pomodoro ti... Show more", "stars": 3}, {"date": "Mar 16, 2017", "text": "Greate app. Features of correcting time, auto stopping at a defined end-date time are made especially convenient", "stars": 5}, {"date": "Mar 14, 2017", "text": "great app", "stars": 5}, {"date": "Mar 7, 2017", "text": "nice", "stars": 5}, {"date": "Feb 9, 2017", "text": "very nice", "stars": 5}, {"date": "Jan 22, 2017", "text": "Terrible user interface design.\n\nFor example, if I click \"start new\" and then for some reason I don't fill in the description and click elsewhere, the tracking will start anyway with no description. I don't want that to happen.\n\nThe most basic start feature doesn't behave as one would expect.\n\nThere should be a select project option and then \"start\" if I really want it to start. The way it is now, it just starts immediately regardless of my further actions.", "stars": 1}, {"date": "Jan 1, 2017", "text": "Suggestion:\n\nMake it so that the timer doesn't start until you press the GREEN done button.", "stars": 4}, {"date": "Nov 21, 2016", "text": "Very GOOD. \nDoes not work offline.", "stars": 5}, {"date": "Nov 14, 2016", "text": "The screenshot shows the timer button is on Asana page, but it does not shows up.", "stars": 2}, {"date": "Nov 9, 2016", "text": "Excellent!", "stars": 5}, {"date": "Nov 7, 2016", "text": "The extension seems to be rather buggy & flaky. For example if I start timing a task, the button in the top right of the Chrome window doesn't turn red. If I click on it and so forth, I can get it to turn on.\n\nBut it needs a lot more QA. I'd be happy to provide specific feedback to Toggl if this can help improve the product.", "stars": 2}, {"date": "Oct 27, 2016", "text": "I got the dropdown list to show, but after I selected trello, the tab turns to blank...", "stars": 2}, {"date": "Oct 10, 2016", "text": "Podomoro timer not working for the latest version", "stars": 2}, {"date": "Sep 20, 2016", "text": "Extremely useful chrome extension. Love it!\n\nIf you added an option to format the description it would be even more fantastic. For example, I'd like to have the ticket ID in square brackets (e.g., [XXX-1234]).", "stars": 5}, {"date": "Sep 6, 2016", "text": "Love it!", "stars": 5}, {"date": "Aug 31, 2016", "text": "Great tool and it's free.", "stars": 5}, {"date": "Aug 16, 2016", "text": "Just what I need!", "stars": 5}, {"date": "Aug 12, 2016", "text": "it could be better. project assignation could happen automatically from url patterns or page content.", "stars": 3}, {"date": "Aug 6, 2016", "text": "Loving this so far. Will write more as I try using it for a while.", "stars": 5}, {"date": "Aug 1, 2016", "text": "The Pomodoro popup notification sometimes works and sometimes doesn't. When it doesn't appear, I don't even know that the time is up. :(", "stars": 2}, {"date": "Jul 29, 2016", "text": "Please, add Pomodoro 5 min break count down with a green Toggl button (to show it is a break)!!! and prompt to \"Continue the latest task\" or \"Start a new one\" in the end of the 5 min break. Furthermore, show notification that 25 minutes has finished and 5 min break has finished.\nThank you!", "stars": 4}, {"date": "Jun 3, 2016", "text": "So happy about the Pomodoro timer!", "stars": 5}, {"date": "May 26, 2016", "text": "Thrilled about the latest revisions, especially the inclusion of the pomodoro technique. I had been using multiple apps to reconcile my asana, pomos, and work tracking, but toggl addressed all of my needs.", "stars": 5}, {"date": "May 20, 2016", "text": "Very convenient and a great accountability tool", "stars": 5}, {"date": "May 17, 2016", "text": "Very productive", "stars": 4}, {"date": "May 6, 2016", "text": "once upon a time the toggl button integrated with todoist and you could track time spent on tasks in todoist and toggl, but  this doesn´t work anymore", "stars": 3}, {"date": "Mar 24, 2016", "text": "at least once a month the Toggl button disappear from my browser. It's a waste of time enabling it again and again. Fix it please! \nThe user interface in the Toggl website is not very intuitive or user friendly. \nExcept waht's mentioned above, it is quite helpful and useful.", "stars": 3}, {"date": "Mar 22, 2016", "text": "I am a freelancer. I use Toggl to track my time spent on clients' projects and at the end of each month export the data as a csv file, then use the spreadsheet to quickly work out my billable hours to each client for their invoices. It's quick and easy to use.", "stars": 5}, {"date": "Mar 22, 2016", "text": "Very great. I can follow my time.", "stars": 4}, {"date": "Mar 18, 2016", "text": "This app and its desktop counterpart have become essential to my software development contracting business.", "stars": 5}, {"date": "Mar 6, 2016", "text": "No option to disable right-click context menu.", "stars": 3}, {"date": "Feb 29, 2016", "text": "Love this timer.  Works well on my phone, IPad and desktop.  Thanks", "stars": 5}, {"date": "Feb 28, 2016", "text": "Great to be able track my time without having to open up a webpage and login to toggl.com.  I especially like the pomodoro addition as I am able to use it for personal task time tracking & it keeps me from overworking myself without a break or a stretch.", "stars": 5}, {"date": "Feb 25, 2016", "text": "Works great. I would like to see multiple project entries at the same time.", "stars": 4}, {"date": "Feb 23, 2016", "text": "works after login.", "stars": 4}, {"date": "Feb 22, 2016", "text": "I use Toggl religiously. I work freelance and this is the most simplest program I've found yet for keeping track of my time for various projects. It's quick, it's easy, it integrates well with my gmail and with various task list programs. And the reports help me to invoice clients easily and correctly. :) I can't imagine how I functioned before finding toggl.", "stars": 5}, {"date": "Feb 22, 2016", "text": "Absolutely LOVE TOGGL! I have so many projects, with different clients, and team  members that work on these various tasks. Without Toggl and ToDoist, my life would be a mess.", "stars": 5}, {"date": "Feb 20, 2016", "text": "Really easy to use, non-intrusive and intuitive. Great tool for productivity", "stars": 5}, {"date": "Feb 19, 2016", "text": "It really works!\nIn a very convenient and effective way.", "stars": 5}, {"date": "Feb 19, 2016", "text": "simple just what I needed", "stars": 5}, {"date": "Feb 17, 2016", "text": "Don't like the popups, but I love using Toggl.", "stars": 3}, {"date": "Feb 17, 2016", "text": "Great extension, helped save time and integrated with so many different applications in browser. It made tracking time so easy.", "stars": 5}, {"date": "Feb 17, 2016", "text": "I love it.", "stars": 5}, {"date": "Feb 15, 2016", "text": "Great.  Just works.  Grab this if you would like to know where exactly your time is going.  Seamless integration.", "stars": 5}, {"date": "Feb 15, 2016", "text": "Working as a freelancer you need to keep track on the hours you work in order to be able to charge clients accordingly. The ability to generate a report on the hours you have done is great as a proof to clients on the working hours of the project you are working on. Clean and modern interface too.", "stars": 5}, {"date": "Feb 15, 2016", "text": "Very useful app.", "stars": 5}, {"date": "Feb 14, 2016", "text": "The majority of work I do involves using a web browser frequently, and so Chrome is the perfect place to have a button that lets me start and stop tracking time for particular projects. Toggl over-all is one of the best time tracking systems out there because using it is so smooth and easy: it provides enough functionality and really minimizes overhead.\n\nThe one thing I'd like to see changed in this extension is to have its drop-down show the project name currently being tracked as well as th... Show more", "stars": 5}, {"date": "Feb 13, 2016", "text": "A key component of keeping track of my work.", "stars": 5}, {"date": "Feb 13, 2016", "text": "Toggl has been a great addition to my freelance endevours editing resumes and translating a variety of documents in Spanish. Just great for tracking billable and non-billable hours spent on multiple projecs.", "stars": 5}, {"date": "Feb 13, 2016", "text": "Working for a company with multiple projects for multiple clients all in the same day that all needed separate billing, it was becoming impossible for me through memory or e-mail to keep track of my hours.  Toggl was a quick way to do that and the Toggl button is a really fast way to use Toggl.  I love it.", "stars": 5}, {"date": "Feb 12, 2016", "text": "Fantastic extension that tracks time in most of the web services I typically use--Trello, Google Docs, etc.", "stars": 5}, {"date": "Feb 12, 2016", "text": "I can't say enough how much use I get out of this extension. \n\nThe site itself is easy enough to use, but this puts little Toggl buttons in everything I use to run my business.\n\nIf clients use a different tool, there's a good chance it integrates there too. \n\nThis extension was the biggest part of why I made the jump from my previous time tracking solution to Toggl.", "stars": 5}, {"date": "Feb 11, 2016", "text": "Excellent. It keeps improving. I use it constantly while working.", "stars": 5}, {"date": "Feb 11, 2016", "text": "Great little tool. The button is where I need it. Would be happy to have it on every page - somewhere on the left edge just in case and on the pages it knows (like trello or gmail) where it is at the moment. Good job folks :)", "stars": 5}, {"date": "Feb 11, 2016", "text": "Integrates really well with Teamweek - I can click a Teamweek task and start a timer from it, and the timer prefills the description and project of my task that I'm timing to match the task I have set for me to do. And looks it does a similar thing with other tools like Trello.", "stars": 5}, {"date": "Feb 10, 2016", "text": "Top!", "stars": 5}, {"date": "Feb 10, 2016", "text": "Very helpful.\n\nNow I can start my work intently from the task application I work with.\n\nIf you also bring it to Outlook, I will be a happy man.", "stars": 5}, {"date": "Feb 10, 2016", "text": "Great extension. Using it with Trello. Really helps reducing clicks for starting and/or continuing time tracking.", "stars": 5}, {"date": "Feb 10, 2016", "text": "Toggl has been very user friendly and easy to learn. It has simplified keeping track of work projects and tasks. I would recommend Toggl to any one who needs to keep track of work projects or home projects.", "stars": 5}, {"date": "Feb 10, 2016", "text": "Simple and very useful.", "stars": 5}, {"date": "Feb 10, 2016", "text": "Excelent!!! very easy to use...", "stars": 5}, {"date": "Feb 10, 2016", "text": "I use Toggl for work. It helps me track time for freelance projects. \n\nI especially enjoy the color coded client (or project) option. \n\nAt the end of the project, I just send my clients a log and an invoice.", "stars": 5}, {"date": "Feb 10, 2016", "text": "It's a great asset in tracking time. It makes it easy and available.", "stars": 4}, {"date": "Feb 10, 2016", "text": "Pomodoro functions would be awesome! current it's to basic, but works", "stars": 3}, {"date": "Feb 10, 2016", "text": "Almost perfect for what it's for. My only complaint - sometimes sync doesn't work. I've stopped it on laptop, but it still goes on on phone, even though Internet is on both devices... if this is fixed - my five stars for sure :)", "stars": 4}, {"date": "Feb 10, 2016", "text": "I love how this extension connects Toggl with Trello. I use these tools in my work as a web developer, and it has made tracking time on my issues extremely easy.\n\nThe reason I gave it four stars is because the timer always gets out of sync with the actual Toggl app. Also, I use the Pomodoro Technique, and the Pomodoro timer functionality doesn't work at all.", "stars": 4}, {"date": "Feb 9, 2016", "text": "The best time-tracker!", "stars": 5}, {"date": "Feb 9, 2016", "text": "Love it! Very useful.", "stars": 5}, {"date": "Feb 9, 2016", "text": "effective and when linked with my Todoist task list, makes for a very effective way of cataloging my time on each area of work.  Does not always work smoothly, and can glitch or need re-authorisation from time to time, but overall this is a helpful app if you need to keep track of time against task.", "stars": 4}, {"date": "Feb 9, 2016", "text": "It shows me what I use my time for.", "stars": 5}, {"date": "Feb 9, 2016", "text": "Very very useful tool. Makes it super simple to track your time for anything. Ideal for freelancers/starting business etc.\n\nBut also it is useful to track your time just for your self. It helps you avoid unneeded tasks.", "stars": 5}, {"date": "Feb 9, 2016", "text": "Nice", "stars": 5}, {"date": "Feb 9, 2016", "text": "It is very convenient and pleasant to use. Integration with other apps makes it even more indispensable.", "stars": 5}, {"date": "Feb 9, 2016", "text": "Well, i mean i love the idea of the button. It's nice on chrome browser.. but when it comes to that pop-up thing, man, it's bugging me. Annoying. I'd actually take a stabile Toggl button next to the windows time thing in the lower right corner, windows navigation bar or how do they call it.. (dumb-dumb). That would be awsome.", "stars": 3}, {"date": "Feb 9, 2016", "text": "This app is so easy to use! AND it integrates with my email and zendesk so it is right there whenever I need it. Fabulous design.", "stars": 5}, {"date": "Feb 9, 2016", "text": "Extremely useful for easy time tracking. As a web developer, it's essential to have a tool that let's you quickly and easily track time, and toggl is the best there is.\nAlso, this little button has a pomodoro timer built in, which is an amazing productivity hack.", "stars": 5}, {"date": "Feb 9, 2016", "text": "Its a very handy for me and very helpful to track my time on different projects.", "stars": 5}, {"date": "Feb 9, 2016", "text": "It's a tool very powerfull :)", "stars": 5}, {"date": "Feb 9, 2016", "text": "useful.", "stars": 5}, {"date": "Feb 9, 2016", "text": "It just works great! Especially useful with Jira.", "stars": 5}, {"date": "Feb 9, 2016", "text": "Works okay, but misses autocompletion and editing. However, it pops up way too often ‒ I could not find any option to finetune that. Toggl itself is nice.", "stars": 3}, {"date": "Feb 9, 2016", "text": "Very good integration, easy to use. Sometimes there is some sync issue between the button and the site, or the app, but the button is what I was looking for!", "stars": 4}, {"date": "Feb 9, 2016", "text": "By far the best app I found to track my activities throughout the day. My only beef is that the web and desktop applications are not synced well enough, at least from a feature perspective. My second issue, which is more a request, is that it would sync with Microsoft - I plan my day out of Outlook. Being able to start a Toggl button straight from there would save me a ton of time. Other than that, fantastic tool!", "stars": 4}, {"date": "Feb 9, 2016", "text": "Really cool useful application.", "stars": 4}, {"date": "Feb 9, 2016", "text": "I'm not using it at all anymore. I used to. I only keep a tab open with Toggle These days.", "stars": 3}, {"date": "Feb 9, 2016", "text": "This is really really good.", "stars": 5}, {"date": "Feb 9, 2016", "text": "Great tool - helps my work and personal life heaps!", "stars": 5}, {"date": "Feb 9, 2016", "text": "It's a great feature, and combined with the Desktop app is a must have for me every time I get to work", "stars": 5}, {"date": "Feb 9, 2016", "text": "This makes tracking my work time so much easier!", "stars": 5}, {"date": "Feb 9, 2016", "text": "Very usefull! Start time button everywhere", "stars": 5}, {"date": "Feb 9, 2016", "text": "Been using toggl for years.  Great company, great product.  The button is great if you use any of the apps it integrates with (you probably do; there's a lot).  Very stable and useful.", "stars": 5}, {"date": "Feb 9, 2016", "text": "Really handy having this plugin right on my browser. I like how it reminds me to track my time every so often. \n\nGreat tool I use it all day, every day!", "stars": 5}, {"date": "Feb 9, 2016", "text": "It barely functions. Often relying on it without 100% reliable internet will fail to open or close tasks and report the appropriate time. Then I am forced to use the weird and barely functioning web interface to enter the appropriate time durations, which often cause frustration because it seems to default to the wrong dates on manual entry (i.e. it will report I have worked over 26 hours if I take a break at noon, and clock back in the next day). It also seems to be suspect to the normal Chr... Show more", "stars": 1}, {"date": "Feb 9, 2016", "text": "So helpful!", "stars": 5}, {"date": "Feb 9, 2016", "text": "I really really love TOGGL and I'm extremely grateful to the Toggl team. \n\nThe thing is that most of similar service providers allow people to use only the most basic features and try to charge you as soon as possible, however, Toggl free version is just PERFECTLY FINE and I don't feel being pushed by Toggl team to purchase it. \n\nI honestly even feel a bit ashamed that I use such great service for free... so a need arises for more Toggl feature (e.g. when I create my own business / team), I w... Show more", "stars": 5}, {"date": "Feb 9, 2016", "text": "I use the integration to Trello--that is really great.", "stars": 5}, {"date": "Feb 9, 2016", "text": "Good.", "stars": 5}, {"date": "Feb 9, 2016", "text": "As a bookkeeper I need to track time spent on each client. I have been using the free version of toggl for over a year and have had no issues. Don't know what I would do without it. I love that it is so easy to use.", "stars": 5}, {"date": "Feb 9, 2016", "text": "I really like using Toggl; however, as I keep the app open, I notice that I don't really use the button, instead going to the site to press 'Continue' most of the time. Haha. Oh well. It's not the button's fault, it's just the way I'm wired.", "stars": 4}, {"date": "Feb 8, 2016", "text": "Very accessible.", "stars": 5}, {"date": "Feb 8, 2016", "text": "Very useful for my freelancing business :) Thumbs up!", "stars": 5}, {"date": "Feb 8, 2016", "text": "yeah, i need that", "stars": 5}, {"date": "Feb 8, 2016", "text": "I have learned a lot about my time use, and just using it has changed the way I manage my time (for the better..). Can't go back", "stars": 5}, {"date": "Feb 8, 2016", "text": "I don't use the Chrome extension very often, since most of the work I track is on internal projects, but Toggl itself has been a very nice app to have access to. It's made reporting a lot easier on me, my clients appreciate it, and everyone is happy overall.", "stars": 4}, {"date": "Feb 8, 2016", "text": "I haven't found a better way to track and manage time", "stars": 5}, {"date": "Feb 8, 2016", "text": "Very useful tool with integrations in my Gmail, Chrome browser and Google Docs.", "stars": 5}, {"date": "Feb 8, 2016", "text": "Best time tracking, best organisational tool. Keeps you productive.", "stars": 5}, {"date": "Feb 8, 2016", "text": "Can't live without this x", "stars": 5}, {"date": "Feb 8, 2016", "text": "Keeps telling me to log my time when I am already logging my time.", "stars": 2}, {"date": "Feb 8, 2016", "text": "I rely on Toggl to keep track of my hours and having it on the Google toolbar means that whatever pc I log in to I get a reminder to keep track. Brilliant!", "stars": 5}, {"date": "Feb 8, 2016", "text": "Useful and practical. Even merely having that visual reminder of the button when I'm working on a Trello card or Google doc is good. Having that also connected to a time tracking service as comprehensive as Toggle is doubly so.\n\nHowever it does suffer a serious flaw, which is that it frequently fails to refresh its on/off status correctly (where by 'correctly' I take the Toggle server to be canonical). It seems to get into a confused state fairly often , particularly if I stop the Toggl task ... Show more", "stars": 4}, {"date": "Feb 8, 2016", "text": "Makes tracking my time so much easier.", "stars": 5}, {"date": "Feb 8, 2016", "text": "Really amazing for instant time tracking instead of logging into the website. Thanks for the toggl button", "stars": 5}, {"date": "Feb 8, 2016", "text": "So quick and easy to use.  It means that I can easily track my time over a number of different jobs.", "stars": 5}, {"date": "Feb 8, 2016", "text": "Brilliant little helper. I use it to tie together Trello, Todoist and Toggle.", "stars": 5}, {"date": "Feb 8, 2016", "text": "Pretty nice if it wasn't for the fact that it won't let me scroll down to select all the tags I have and click ok. It still keeps the time but I always have to go back on the website and apply the tags then.", "stars": 3}, {"date": "Feb 8, 2016", "text": "The Toggl Button is handy for its integration with Todoist, but it needs wider platform support - specifically Firefox.", "stars": 3}, {"date": "Feb 8, 2016", "text": "Very useful.", "stars": 5}, {"date": "Feb 8, 2016", "text": "Perfect for my needs. I'm an IC with multiple clients. I tend to work in many different windows and apps so it's great to be able to just hit the Toggl Button rather than switch back to the app itself.  It's also a good reminder so I don't forget to start the timer.", "stars": 5}, {"date": "Feb 8, 2016", "text": "Absolutely indispensable for contractors, productivity life hacking.  \n\nIt's also an awesome way to CYA in case the proverbial performance scapegoating starts in workplace politics.  \n\nThe famous AMEX slogan is to never leave home without it; TOGGL's byline should be Never work without it.", "stars": 5}, {"date": "Feb 8, 2016", "text": "Excellent addition to an already excellent product!", "stars": 5}, {"date": "Feb 8, 2016", "text": "I like all four ways of logging hours with Toggl. I forget to use Toggl button most of the time because I tend to launch Toggl desktop when working on my computer. I think I will use it more now that one of my employers has started using Basecamp.", "stars": 4}, {"date": "Feb 8, 2016", "text": "The Chrome extension of Toggl is one of the reasons I use Toggl. It reminds you to register what you're doing if you haven't already done so, and it is a very easy way to engage with Toggl.", "stars": 5}, {"date": "Feb 8, 2016", "text": "I do most of my work via the web so Toggl and the associated Chrome extension have been great for quantifying the time I spend on the various work tasks.", "stars": 5}, {"date": "Feb 8, 2016", "text": "Not much to say here except: Thank you for such a wonderful product.", "stars": 5}, {"date": "Feb 8, 2016", "text": "The Toggl Button is a really useful tool for work and I'd certainly recommend it.\n\nMy reason for only giving four-stars is that it can annoying if I'm doing something that doesn't need to be tracked and it keeps nagging! I'd really like the option to dismiss the reminder for a fixed period of time, say an hour. Aside from that, brilliant stuff, thanks!", "stars": 4}, {"date": "Feb 8, 2016", "text": "Best extension for time tracking ever. Keep going with integration. This is why I love and use Toggl.", "stars": 5}, {"date": "Feb 8, 2016", "text": "Very useful tool for me! Now, I could better analyze what project or work process take me most time.", "stars": 5}, {"date": "Feb 8, 2016", "text": "Great shortcut for workflow. I mostly use it on Todoist, but have seen on Google Drive and Github Issues.\n\nIt entered my workflow seemlessly and now I use it constantly.\n\nOne (!) thing that isn't perfectly done here is when I return to a task after some off-time, I click on the timer to resume it and it starts a race condition that sometimes ends with the extension claims I had idle time (a great feature otherwise) and proposes I'd remove it.\n\nI'd vote 5 stars if it wasn't for this.", "stars": 4}, {"date": "Feb 8, 2016", "text": "i just can't to choose another's words then @Lori Dunn-Reier, this is my situation. just read what he worth :)\n\nVery easy to use. powerful and immediately stand how to use. is absolutly working tool. no have any others like this. Good Job!\n\nwhat is really need is firefox extension, now i just need to use chrome that i not love at all.", "stars": 5}, {"date": "Feb 8, 2016", "text": "As a self-employed individual I really enjoy using Toggl to help me keep track of my hours on different projects for different clients. It take some practice and self discipline to get into a routine of tracking your time, but Toggl has made the process easier. It's the one of the best Applications for tracking time that I've come across. Now that I'm in a routine, I actually enjoy tracking my hours on different projects. I find it helps me to stay focused and time efficient. Thank you Toggl.", "stars": 4}, {"date": "Feb 8, 2016", "text": "Very useful to track time, even in a team!", "stars": 4}, {"date": "Feb 8, 2016", "text": "Really like the extension. It would be nice if it also included auto-complete like the full website, but no complaints on functionality. Does exactly what I need it to.", "stars": 4}, {"date": "Feb 8, 2016", "text": "My favorite part of this is the idle detection. I leave my desk several times a day and with this feature, you can come back and the button will prompt you if you wish to discard the idle time and continue the last task.\n\nOne downside is that the button doesn't sync by itself all that often so if I start a task in my browser then use my phone or the website from another machine the button shows red as if a timer is going but it refreshes instantly when you click on it.", "stars": 4}, {"date": "Feb 8, 2016", "text": "Very useful.", "stars": 5}, {"date": "Feb 8, 2016", "text": "The desktop app is much more useful than the phone app, and I love that it will pop up to remind me to start the time. Not so great, however, is that the pop-up will keep popping up after I've already dismissed it several times. Also, once I made a manual change to the timing of a project, the app got all sorts of messed up and hasn't been right since. So I can no longer look at overviews or run reports on projects. It's still useful in that it allows me to collect all my time on a project in... Show more", "stars": 3}, {"date": "Feb 8, 2016", "text": "I never use it because it's fairly often our of sync, but then again so it the mobile notifications so i guess it's your servers.", "stars": 3}, {"date": "Feb 8, 2016", "text": "The toggle button has given me the chance to easily see where I spend my time -- invaluable!", "stars": 5}, {"date": "Feb 8, 2016", "text": "I love Toggl, and usually use it through the web interface. I like the way the button integrates with sites I use (like Github) and lets me quickly start a new time session.\n\nThe only minor annoyance is that the button doesn't always sync up with the server state, so it'll think I'm tracking a different session (or none at all) if I'm using the web interface simultaneously. Still super useful, though.", "stars": 4}, {"date": "Feb 8, 2016", "text": "I use toggl button more than I use toggl.com Because of all the available integrations such as Trello, GitHub, G Drive and so on ...\n\nThe usability is not so good though, I think there is some work to do to make it very a 5 star", "stars": 4}, {"date": "Feb 8, 2016", "text": "Excellent tool to track time in my business and for the work I do for my clients.", "stars": 4}, {"date": "Feb 8, 2016", "text": "It reminds me .... I am a freelancer working on several projects during the day, using Toggl for some years now and with  the button it's more efficient (and it already was 100% for me ;-) ..)", "stars": 5}, {"date": "Feb 8, 2016", "text": "I use this extension religiously. If you don't have it, get it. It makes life much easier.", "stars": 5}, {"date": "Feb 8, 2016", "text": "It's a good idea, but as people have mentioned, the syncing isn't good - it often doesn't know that I have Toggl open somewhere else.\n\nI'd also appreciate the ability to add new projects and tags from the button, rather than having to go back into the timer.", "stars": 3}, {"date": "Feb 8, 2016", "text": "I love this - helps me accurately track items as I work on them in JIRA. It even supports my company's hosted instance of JIRA (non-default URL).\n\nToggl has revolutionized the way I can track and time events. :-)", "stars": 5}, {"date": "Feb 8, 2016", "text": "Nice and clean tool, though having some delay when syncing between browser button and web interface. Anyway, I am a researcher and I am using it to track my different activities since some months. Finally, I am very happy with the periodic reports it can provide. Give it a try, it is worthwhile.", "stars": 4}, {"date": "Feb 8, 2016", "text": "I do really like this button as a concept, although I find myself using the desktop app much more. As a self-employed consultant, Toggl is an excellent tool if you actually use it. It's just a shame that compliance is very difficult, and that's been the biggest challenge for me.\n\nI do get my remote team to use it as well though, and it would be great to see a more manager-friendly way of viewing their time logs. That would earn the 5th star from me.", "stars": 4}, {"date": "Feb 8, 2016", "text": "I absolutely love Toggl!! What used to take hours every two weeks now takes minutes!\n\nWe are a tiny nonprofit with several part time employees. Toggl makes it easy to track time, collect hours from employees, and allocate hours to projects easily.  Integration with every device platform imaginable makes it easy for the team as not everyone uses the same devices.", "stars": 5}, {"date": "Feb 8, 2016", "text": "Excellent add on to a Chrome browser to keep track of time for billing a customer.  I especially like the button on incoming emails.  This reminds me to start my time on an issue intermediately.\n\nJust wish I had found it earlier.", "stars": 5}, {"date": "Feb 8, 2016", "text": "I work in the human service field on a contract basis with several clients.  This tool greatly helped me keeping track of what I was doing what for whom.  Once I became better at tracking every minute of my work, I started to see where I could do more.  This resulted in my being able to serve more and more clients.  Thank you for helping me having a successful business!", "stars": 5}, {"date": "Feb 8, 2016", "text": "great integration with trello and habitca", "stars": 5}, {"date": "Feb 8, 2016", "text": "For the past year, I have worked from home doing a mixture of things, including one day per week for an employer. I tried a number of options to track my time and help me manage it, but it is Toggl I've stuck with the longest. \n\nAlthough my employer isn't requiring me to track my time, I must do it so I can flex the hours without undermining my plans for other projects. Toggl is perfect for it's forgiveness when I forget to track or when I am multitasking and can then adjust manually.\n\nI also... Show more", "stars": 4}, {"date": "Feb 8, 2016", "text": "It's great. Makes time tracking so much easier to have it always available, especially for e-mail.", "stars": 5}, {"date": "Feb 8, 2016", "text": "As a Freelance contractor doing lots of projects in a flash, this App helps me track/log each and every project I am doing and gives my summary each week for billing. Great App!!!", "stars": 5}, {"date": "Feb 8, 2016", "text": "I love this app, it helps me stay on track and tells me when I need a break which for me is important.  It's very well integrated and so easy to use.", "stars": 5}, {"date": "Feb 8, 2016", "text": "Works great with GitHub!", "stars": 5}, {"date": "Feb 8, 2016", "text": "A great tool. Combined with the Google calendar integration and iPhone app, it's easy and convenient to use The weekly reports help me understand and adjust how I'm spending my time.", "stars": 5}, {"date": "Feb 8, 2016", "text": "Better than cake!", "stars": 5}, {"date": "Feb 8, 2016", "text": "Makes me use Toggl even better. Great add-on.", "stars": 5}, {"date": "Feb 8, 2016", "text": "One of the most useful tools ever created! Helped so much with reports to my Clients. Very precise and simple to use. Thank you developers!", "stars": 5}, {"date": "Feb 8, 2016", "text": "Simple and efficient time tracking tool that does not get in the way. Who would have thunk it?!", "stars": 5}, {"date": "Feb 8, 2016", "text": "Has been great for us so far! Really helps track our estimators time and projects!", "stars": 5}, {"date": "Feb 8, 2016", "text": "I have worked as a freelancer for over four years and this feature has really assisted me in tracking my time. I work various projects at once, some hours billable some not, regardless Toggl allows me to track time and improve my performance. I love that the Toggl Button allows for easy remembrance. It works with my Trello as well. YES!!", "stars": 5}, {"date": "Feb 8, 2016", "text": "I am satisfied, it does what it should without any problems.", "stars": 5}, {"date": "Feb 8, 2016", "text": "Awesome! I use it in  combination with Asana.", "stars": 5}, {"date": "Feb 8, 2016", "text": "Works good", "stars": 5}, {"date": "Feb 8, 2016", "text": "Very handy and useful to keep track of projects / tasks.  I'd recommend it to anyone needing to keep track of their time.", "stars": 5}, {"date": "Feb 8, 2016", "text": "Not particularly useful OR unuseful. Kinda on the fence.", "stars": 3}, {"date": "Feb 8, 2016", "text": "great", "stars": 5}, {"date": "Feb 8, 2016", "text": "I'm a big fan of Toggl and love how it integrates so well with Trello. Couldn't live without it!", "stars": 5}, {"date": "Feb 8, 2016", "text": "Love it! super easy to use, nice integration into Trello", "stars": 5}, {"date": "Feb 8, 2016", "text": "Genial!", "stars": 5}, {"date": "Feb 8, 2016", "text": "reminder to tun off toggle is great, but to turn on toggle during the weekends if im at home isn't. Especially if it happens too often. Also i can't use the continue arrow as in the web app to continue the project phase i am in. its a good idea but needs these small improvements to be truly useful to me.\n\nThanks for all the good work!", "stars": 3}, {"date": "Feb 8, 2016", "text": "Really useful to use straight on my Asana task and emails without even the need to open the desktop app :D", "stars": 5}, {"date": "Feb 8, 2016", "text": "This button is great, the weekly reports really tells me how well I do when i remember to start and close the timer!", "stars": 4}, {"date": "Feb 8, 2016", "text": "Very good!!!", "stars": 5}, {"date": "Feb 8, 2016", "text": "This is really helpful, simple and easy to use.", "stars": 5}, {"date": "Feb 8, 2016", "text": "It works as expected - very useful tool.", "stars": 4}, {"date": "Feb 8, 2016", "text": "It does what I need it to do but I can't get the reminder to stop asking me to initialize it when I don't need it.", "stars": 4}, {"date": "Feb 8, 2016", "text": "Performs all the time tracking tasks needed to run small business.", "stars": 5}, {"date": "Feb 8, 2016", "text": "The button saves me time!", "stars": 5}, {"date": "Feb 8, 2016", "text": "I think that it can be improved in terms on responsiveness and automatic refreshing of list of projects.", "stars": 4}, {"date": "Feb 8, 2016", "text": "Use this often to integrate several different online tools with Toggl. Appreciate all the hard work that went into making this. Great tool!", "stars": 5}, {"date": "Feb 8, 2016", "text": "Excellent for tracking time. I use it a lot with Wunderlist.", "stars": 5}, {"date": "Feb 8, 2016", "text": "Just awesome !!!!", "stars": 5}, {"date": "Feb 8, 2016", "text": "Toggl has really helped me track how much time I spend on each project. I especially love that when I forget to log it and I come back to my desk, it tells me I've been away for X minutes and would I like to keep those minutes or start again at the point I left my desk. Very useful as it integrates across all my devices too. A+ on this app.", "stars": 5}, {"date": "Feb 8, 2016", "text": "I use this every day. It's very useful and has helped me be more precise with my timing, which I appreciate and so do my clients.", "stars": 5}, {"date": "Feb 8, 2016", "text": "Having Github issue and pull request integration is invaluable to me and my team. Time tracking for client projects has never been so easy, accurate, and detailed.", "stars": 5}, {"date": "Feb 8, 2016", "text": "I really like this for keeping me on track - hey did you see that bright shining thing? .... lets go look at that ..... oh no, I'm supposed to be writing a review. Oops.", "stars": 4}, {"date": "Feb 8, 2016", "text": "It is like every app should be. Easy, useful and perfectly integrated", "stars": 5}, {"date": "Feb 8, 2016", "text": "Awesome app!! And the integration really  helps remembering to switch timer! Fully recommend it!", "stars": 5}, {"date": "Feb 8, 2016", "text": "I use it all the time and I think it is super helpful. The only reason it does not get 5 stars is because it is picky about automatically assigning a project. For instance, in trello, I have to name the board the exact name of the project. I would love if it would automatically assign all time for a board, card, etc. based on previous assignments.", "stars": 4}, {"date": "Feb 8, 2016", "text": "It helps a lot but sometimes are not properly synchronized.\nKeep asking me to start the timer when I already did", "stars": 4}, {"date": "Feb 8, 2016", "text": "Works nicely!", "stars": 5}, {"date": "Feb 8, 2016", "text": "I love how much this extension helps me to keep track of what I am working on - and for whom! Wonderful app!", "stars": 5}, {"date": "Feb 8, 2016", "text": "The button is handy and the reminders to track time are helpful, but I wish there were better support for tagging.\n\nYou can't add new tags via the button and adding existing tags is awkward.", "stars": 4}, {"date": "Feb 8, 2016", "text": "I have been using this button for a year. I use it to track billable time and also to track non-billable business tasks. Toggl has helped me keep myself accountable for how much time I actually spend working versus being distracted by non-business tasks. It keeps me honest with myself. Love it!", "stars": 5}, {"date": "Feb 8, 2016", "text": "Very useful extension, esp. for tracking all the time spent on behalf of clients. Includes Idle reminder, and Pomodoro feature as well. Integration with other Toggl products is useful also. Thanks, and keep up the good work!", "stars": 4}, {"date": "Feb 8, 2016", "text": "Excellent - made life simple!", "stars": 5}, {"date": "Feb 8, 2016", "text": "I love my Toggl button! I'm simply amazed to look at my Toggl reports each week and see where my time went. It has completely changed how I work and I highly recommend others use this feature!", "stars": 5}, {"date": "Feb 8, 2016", "text": "Great tool! Also very useful in combination with Trello.", "stars": 5}, {"date": "Feb 8, 2016", "text": "I LOVE THIS BUTTON. Period.", "stars": 5}, {"date": "Feb 8, 2016", "text": "Love it! Keeps me on track and accountable firstly to myself and to your clients. It's one of the few \"apps\" where I constantly find features that otherwise I would wish to have. Very highly recommended, especially for freelancers.", "stars": 5}, {"date": "Feb 8, 2016", "text": "Very useful, widely supported across many web services. Love it!", "stars": 5}, {"date": "Feb 8, 2016", "text": "I love it. It has helped everyone at home, I am teaching my daughter who is studying how to use it and she feels very focused and enthusiastic to complete task in chunks when setting specific goals. The integration with trello is fantastic! really helps the projects. Thanks for such a good tool.", "stars": 5}, {"date": "Feb 8, 2016", "text": "Perfect example of a usefull extension. Excellent for timetracking tasks like in Todoist or Asana.", "stars": 4}, {"date": "Feb 8, 2016", "text": "I wanted to like this extension but it got unsynced from the web app. I use Toggl across my phone, the web app, and the browser extension. It seems like the browser extension just kept running, even when I've turned it off from my phone or webapp.", "stars": 2}, {"date": "Feb 8, 2016", "text": "This button has been a huge lifesaver and allows me to tell where my time is going.  It has helped with my productivity and so much more!! It is a must have on my cell phone and computers  now!", "stars": 5}, {"date": "Feb 8, 2016", "text": "This has really helped me with my job performance review, as I am in a new position, so this allowed me to show them the reality of how my time is divided versus what they expected it to be. Very easy to use. Love the fact that I can adjust it manually because I do forget to adjust the time!", "stars": 5}, {"date": "Feb 8, 2016", "text": "Great plugin. Works like charm on many apps.\n\nI would really appreciate two things. First, on repeated task it could remember associated project. Second, it could have a checkbox to remember last used project and pre-fill it automatically.", "stars": 5}, {"date": "Feb 8, 2016", "text": "This is pretty cool and useful.", "stars": 4}, {"date": "Feb 8, 2016", "text": "Love the integration with the other tools I use.", "stars": 5}, {"date": "Feb 8, 2016", "text": "Very useful extension, but I'd have to agree with another reviewer who mentioned the desire for a snooze-type option on the botton. I find it irksome when it keeps popping up over and over again when I am purposely not using it. Other than that, I really like it!", "stars": 4}, {"date": "Feb 8, 2016", "text": "I use it to organize my studies but sometimes is showing an annoying notification to use it in every moment! It is weird!", "stars": 5}, {"date": "Feb 8, 2016", "text": "Great app!  I started using the free version and later our firm paid for the entire department.  We all track our time on Toggl. The interface is very intuitive and easy to pick up.  Highly recommend it.  This is the fastest and best way to keep track of your productivity.", "stars": 5}, {"date": "Feb 8, 2016", "text": "I love this button. I'm constantly forgetting to record time and have to put it in manually, which defeats the purpose. This button is so much more visible. I love how well-integrated it is and it's been a must-have tool in running my copywriting business.", "stars": 5}, {"date": "Feb 8, 2016", "text": "Great interface and integration across platforms. Very useful and user friendly.", "stars": 5}, {"date": "Feb 8, 2016", "text": "Works great with Trello, we love it!", "stars": 5}, {"date": "Feb 8, 2016", "text": "Very useful for my freelancing projects..", "stars": 5}, {"date": "Feb 8, 2016", "text": "Love it, a life line for my invoicing", "stars": 5}, {"date": "Feb 8, 2016", "text": "Does a nice job!", "stars": 4}, {"date": "Feb 8, 2016", "text": "Great quick way to log time, although I generally use the Mac app or the website. I do like that it shows whether or not you are currently logging time.", "stars": 4}, {"date": "Feb 8, 2016", "text": "I can't picture my self working without tracking my working time with Toggle. Absolutely useful for my workflow.", "stars": 5}, {"date": "Feb 8, 2016", "text": "Since I started as a freelancer , Toggle has been my tool , my clients are happy to see the details of my activities and the flow of these\n\nThanks toggle team", "stars": 5}, {"date": "Feb 8, 2016", "text": "Helps me track my time on all of my activities and works seamlessly with every web app I use!", "stars": 5}, {"date": "Feb 8, 2016", "text": "Nice App, love it! :)", "stars": 5}, {"date": "Feb 8, 2016", "text": "Not well synchronized between smartphone and laptop, but great!", "stars": 4}, {"date": "Feb 8, 2016", "text": "Best of all I've tried!", "stars": 5}, {"date": "Feb 8, 2016", "text": "Toggl is one of my favorite Chrome extensions and my all-time favorite time tracking service!\n\nThe extension does a fantastic job of integrating Toggl with pretty much any other cloud-based software you could ask for. Gmail? You got it! Asana? No problem! Trello? Of course!", "stars": 5}, {"date": "Feb 8, 2016", "text": "Good integration with Toggl and my other places that help track my tasks.", "stars": 5}, {"date": "Feb 8, 2016", "text": "Cannot change/add tags to task directly but otherwise works perfectly", "stars": 4}, {"date": "Feb 8, 2016", "text": "Works great! It's a much quicker version of pulling up the website to start the tracker, especially when using the gmail button and start tracking right from an email.", "stars": 5}, {"date": "Feb 8, 2016", "text": "Excellent. Best time-tracking tool out there (and we tried a few ...)", "stars": 5}, {"date": "Feb 8, 2016", "text": "I'm usually working on Jira issues and this toggle button just makes it super easy to track time per issue without having to copy and paste everytime I have a new issue. Just splendid.", "stars": 5}, {"date": "Feb 8, 2016", "text": "Keeps me honest with my time entry all day long.", "stars": 5}, {"date": "Feb 8, 2016", "text": "Really fun and easy to use. Can you guys please set it up so that I can have a monthly Excel file of my hours?  I use this as a time sheet for work and this would save me so much time. Thanks for the awesome app!", "stars": 5}, {"date": "Feb 8, 2016", "text": "I work on a remote software development team, and we use JIRA to track issues, bugs and work. Toggl's integration with JIRA is excellent, and it makes time tracking a breeze. Can't live without it.", "stars": 5}, {"date": "Feb 8, 2016", "text": "I'm in love with Toggl, a real must have plugin for productivity.\n\nI use to use Toggl every day and now I can have a detailed report of my duty.\n\nEvery one who works has to use it!", "stars": 5}, {"date": "Feb 8, 2016", "text": "Oh wow... Toggle was already nice, but being a big user of Toodledo and Trello, the toggl button is just pure magic. Time tracking use to be a pain, now, it's just so easy !", "stars": 5}, {"date": "Feb 8, 2016", "text": "Useful but does not work on some pages and sometimes does not synchronize (still offering to start timer while one is already started, that kind of stuff)", "stars": 4}, {"date": "Feb 8, 2016", "text": "Finally, a reminder to start my timer. Too many times I've forgotten to start toggl while working on a project, and trying to count the time afterward is a real pain. The Toggl Button solves that problem by reminding me to time my tasks.", "stars": 5}, {"date": "Feb 8, 2016", "text": "I use it only to open the webpage. Desktop app is much better due to it's reminder - this one, is not always visible if you work on few monitors...", "stars": 2}, {"date": "Feb 8, 2016", "text": "Great, very useful in combination with \"Todoist\".", "stars": 5}, {"date": "Feb 8, 2016", "text": "I use toggl button from within pivotal tracker and I really like it. I find it very convenient and a timesaver. To get 5 stars I would like a typeahead search box for selecting the project rather, than a dropdown. Also if it remembered the project of a ticket once you had assigned it once the next time you click \"start timer\" that would be great.", "stars": 4}, {"date": "Feb 8, 2016", "text": "useful. easy. stable", "stars": 5}, {"date": "Feb 8, 2016", "text": "Perfect tool:\n-Reminders every morning\n-Sync on multiple PCs\n-Also works with Gmail and Salesforce", "stars": 5}, {"date": "Feb 8, 2016", "text": "Works just fine - but I would love to have typeahead/autocomplete like in the web app.", "stars": 4}, {"date": "Feb 8, 2016", "text": "Does what its supposed to and makes tracking easier. Syncs with desktop app when you start a timer in the browser it will also show up in the desktop app.", "stars": 4}, {"date": "Feb 8, 2016", "text": "Very very very useful.", "stars": 5}, {"date": "Feb 8, 2016", "text": "It would be nice if it was available for firefox too...", "stars": 5}, {"date": "Feb 8, 2016", "text": "Use it everyday. Love it.", "stars": 5}, {"date": "Feb 8, 2016", "text": "Great!", "stars": 5}, {"date": "Feb 8, 2016", "text": "Very good tool. Inlcudes everywhere. I use it with JIRA and also has standalone desktop version.", "stars": 5}, {"date": "Feb 8, 2016", "text": "It works well, integrates properly with Asana, Trello, Gmail and many more. This allows your tracked times to register exactly to whichever project you were working on, without having to manually fill in everything. \nOnly hiccup is that the  injected button in the project management tool seem out of sync with the browser toolbar button. Usually refreshing the page or opening Toggl's timer page gets the buttons state correct.\nStill very convenient.", "stars": 5}, {"date": "Feb 8, 2016", "text": "5/7 would install again", "stars": 5}, {"date": "Feb 8, 2016", "text": "I have tried many different ways to manage and measure my workflow, and the only one I have used consistently is Toggl. Although I use Toggl Desktop more than the browser button, I still find it useful to be able to quickly add a time period while browsing.", "stars": 5}, {"date": "Feb 8, 2016", "text": "I can't believe all the places you have integration, gmail, github, trello, more. It's pretty awesome.", "stars": 5}, {"date": "Feb 8, 2016", "text": "The interface is a little slow to load at times, but it gets the job done. Also, it would be nice to get a \"snooze for today\" button on the reminder.", "stars": 4}, {"date": "Feb 8, 2016", "text": "great extention", "stars": 5}, {"date": "Feb 8, 2016", "text": "Very useful app. Thanks!", "stars": 5}, {"date": "Feb 8, 2016", "text": "very useful and integrated on many services I use daily!", "stars": 5}, {"date": "Feb 8, 2016", "text": "Works fine", "stars": 5}, {"date": "Feb 8, 2016", "text": "Works instantly and it can be used in many applications. I would have given 5 stars if it would have the possibility to alter the start time (lets say I forgot to start time-tracking) and add intervals (in case of a lunch or toiletbreak). Now I have to go to the official website to alter these settings.", "stars": 4}, {"date": "Feb 8, 2016", "text": "Great Product although i have switched to toggl desktop as i dont need to track websites for work but instead my task on my computer", "stars": 5}, {"date": "Feb 8, 2016", "text": "The toggle button is quite useful. I've always found it a bit hard to remember tracking my time so this makes it quite easier.", "stars": 5}, {"date": "Feb 8, 2016", "text": "Toggl Button is the excellent service for time tracking!", "stars": 5}, {"date": "Feb 8, 2016", "text": "Very useful", "stars": 4}, {"date": "Feb 8, 2016", "text": "The integration with ToDoist means I can track the time spent on every task. I have a job where I perform lots of different tasks and roles and being able to see how much time I spend on various different categories of my role is priceless! When you can then take that data and push it straight into Excel it's simply fantastic.", "stars": 5}, {"date": "Feb 8, 2016", "text": "Great product for managing personal performance, billing and general efficiency. Integrates seamlessly with all the required application for my day to day work", "stars": 5}, {"date": "Feb 8, 2016", "text": "Toggl is an angular piece of our work. The Toggl Button make use toggl easier and help with those partners that are not used to work with this kind of tools puting the button in the places where it is needed.", "stars": 5}, {"date": "Feb 8, 2016", "text": "I use it mostly as a link to the actual site, but it also serves as a nice reminder to whether you're tracking or not.", "stars": 4}, {"date": "Feb 8, 2016", "text": "Best tracking time app ever!", "stars": 5}, {"date": "Feb 8, 2016", "text": "sometimes loses sync, but perfect apart", "stars": 4}, {"date": "Feb 8, 2016", "text": "Easy to use. Great product", "stars": 5}, {"date": "Feb 8, 2016", "text": "G", "stars": 5}, {"date": "Feb 3, 2016", "text": "Good. Wish it could monitor URL and browser activity. This would be amazing.", "stars": 3}, {"date": "Jan 19, 2016", "text": "Promising but too buggy to use.  It keeps popping up and saying I'm tracking idle time when I'm not tracking anything and other issues.  Doesn't seem to handle dragging tabs to new windows very well at all.", "stars": 3}, {"date": "Jan 8, 2016", "text": "Does the very basics well and has promise (the Pomodoro integration is an AWESOME idea!), but there are too many missing features at the moment. \n\nFor example, there's no way to resume a task from Toggl Button menu, which is especially frustrating if you're trying to use the Pomodoro feature. I'll start a pomodoro for a new task within Toggl Button, and then when the pomodoro is finished I'll go take my five minute break. When I get back, there's no way for me to start another pomodoro on tha... Show more", "stars": 3}, {"date": "Dec 9, 2015", "text": "Convenient. Easy to use. Helps me organize work for all projects and clients.", "stars": 5}, {"date": "Dec 8, 2015", "text": "I love toggl but the chrome extension sucks, sometimes it would randomly quit while I was working and it never let me type in the project / description I wanted. So basically it became more of a hassle than being helpful.", "stars": 2}, {"date": "Dec 1, 2015", "text": "Works well for me. For the Dutch people there is a connection with a very well knows Invoice system online (factuursturen.nl) The API's are connecting together and I have within a click all my billing time invoiced. Well done!\n\nOhh yes, it works great on your Smartphone as well and sync's perfect.", "stars": 5}, {"date": "Nov 19, 2015", "text": "Love this extension. It works really well and also integrates with my zendesk. What a pleasant surprise!", "stars": 5}, {"date": "Oct 30, 2015", "text": "Really enjoying the integration with Todoist on Chrome, saving me  lot of time for project tracking. I just wish there was a way to reload projects and tags ot the extension w/o restarting Chrome", "stars": 4}, {"date": "Sep 23, 2015", "text": "Good application, very powerful and easy to use.\nI wait for the next amazing features!", "stars": 5}, {"date": "Sep 22, 2015", "text": "Fantastic piece of software that makes my life a whole lot easier.", "stars": 5}, {"date": "Sep 22, 2015", "text": "Used to use the service some years ago, now I came back to it after realizing I can make it work with trello :D", "stars": 5}, {"date": "Aug 25, 2015", "text": "For a freemium app, there is still much to evaluate and flexibility to determine if it's a good fit for you and your personal or professional team's app workflow. Integration with many other SaaS apps (Zapier & IFTTT too!) and across just about all platforms makes it a standard for many freelancers and small businesses that rely billable hours - individual and team - while integrating with their other core productivity tools.", "stars": 4}, {"date": "Aug 12, 2015", "text": "keeps on not responding on both windows 8.1 and 10\nextremely unstable", "stars": 1}, {"date": "Jul 31, 2015", "text": "Great extension, perfect for my needs. Responsive support and the right amount of features.\n\nTo everyone below:\nTHE NOTIFICATIONS CAN BE SWITCHED OFF. It's in the extension settings.", "stars": 5}, {"date": "Jul 24, 2015", "text": "thank u very much that is the one which i was searching for.", "stars": 5}, {"date": "Jul 23, 2015", "text": "Annoying reminder not needed. 5 stars otherwise.", "stars": 3}, {"date": "Jul 7, 2015", "text": "Stop the desktop nag notifications already! The tool is useful but I don't need to be reminded every 10 minutes that its there!!", "stars": 3}, {"date": "Jun 30, 2015", "text": "A little buggy. And now is showing an annoying notification for me to use toggl all the time.", "stars": 2}, {"date": "Jun 13, 2015", "text": "The nag tool is annoying without any obvious way to shut it off.", "stars": 4}, {"date": "May 20, 2015", "text": "Great tool", "stars": 4}, {"date": "May 4, 2015", "text": "Excellent extension. Toggl is a great idea in general, and the Chrome Extension and app for Android/iPhone (download it now!) provide seamless syncing for cross-platform use. With the extension I can time both planned and unplanned tasks (like responding to work emails). I've finally whittled down my productivity apps to just Todoist and Toggl-- they're perfect together!", "stars": 5}, {"date": "Apr 16, 2015", "text": "Great ... but i think i have an issue \nit was working in Trello when i was on windows .. \nbut when i go Mac it's not working anymore .. any help :)", "stars": 5}, {"date": "Apr 10, 2015", "text": "The service is very useful, as well as the integration with multiple websites, but the button in the toolbar is totally useless.", "stars": 3}, {"date": "Apr 8, 2015", "text": "Very good and useful extension.  Deserves 5 stars but I took one star  off because two reasons:\n\n#1 - When starting a timer in Trello (havent' tried other sites) the Tags dropdown doesn't maintain same sort order as Toggl Timer or site.  Key for me as I have a lot of tags.\n\n#2 - Why cant I just use the chrome button itself to start timers instead of only on select sites?  That would make this much more useful as not *every* task starts for me in task list.\n\nOther than that, so far has been gr... Show more", "stars": 4}, {"date": "Apr 6, 2015", "text": "I love all of the integrations this extension provides with other sites, such as Trello, Gmail, Todoist, etc.. Unfortunately I have to deduct 2 stars, because the Chrome button itself does not show two very basic essential things:\n\n1) What timer is currently running?\n2) How much time has elapsed?\n\nIn its current state the, the Chrome button itself is pretty useless.", "stars": 3}, {"date": "Apr 1, 2015", "text": "don't work", "stars": 1}, {"date": "Mar 27, 2015", "text": "\"Remember\" popup is annoying and unnecessary.", "stars": 1}, {"date": "Mar 23, 2015", "text": "blowminded with this feature", "stars": 5}, {"date": "Mar 23, 2015", "text": "It's great! Thanks!", "stars": 5}, {"date": "Mar 18, 2015", "text": "Very useful extension.", "stars": 5}, {"date": "Mar 15, 2015", "text": "Works awesome!", "stars": 5}, {"date": "Mar 12, 2015", "text": "The \"remember to track your time\" popup is maddening.  Disabled it just because of that.", "stars": 2}, {"date": "Feb 27, 2015", "text": "Does not work in Basecamp.", "stars": 1}, {"date": "Feb 18, 2015", "text": "This button works with Asana account faster but do not get project information form there, it suppose that I should set project manually from projects list mantained inside Toggle. Hey, I already work with all tasks and projects inside Asana. I want only time counting and reports. All other is annoying. But your UI is nice, better than UI of Timecamp, that I already use.", "stars": 3}, {"date": "Feb 17, 2015", "text": "How can I login using Google?", "stars": 3}, {"date": "Feb 13, 2015", "text": "Please let us disable the button for some sites.", "stars": 4}, {"date": "Feb 12, 2015", "text": "Would love to see an option allowing to enable\\disable button on certain supported sites.", "stars": 4}, {"date": "Jan 30, 2015", "text": "Previously worked well, but now I can not log on, you do not see Google account,  login.\nDoesn't work!", "stars": 3}, {"date": "Jan 28, 2015", "text": "The best time tracker!", "stars": 5}, {"date": "Jan 27, 2015", "text": "Removed one start as current version asks me too often to start my timer, even if I have the desktop version running. That said, I like the additional places I see it running (trello and github were the ones I noticed).\n\nI love this extension (and the desktop app, and iphone app). It has a sleek interface and does what it's supposed to.", "stars": 4}, {"date": "Jan 20, 2015", "text": "Use it in Todoist. Works great!\n\nThank you.", "stars": 5}, {"date": "Dec 29, 2014", "text": "Quite nice", "stars": 4}, {"date": "Dec 19, 2014", "text": "Great!", "stars": 5}, {"date": "Dec 16, 2014", "text": "Great, managing time and projects become easier.", "stars": 5}, {"date": "Dec 2, 2014", "text": "It just works!", "stars": 5}, {"date": "Nov 17, 2014", "text": "Saw it pop up in google doc - AWESOME! Not seeing in Basecamp, though, but I think we use some 'vintage version' of it or something. Is there something to enable with Basecamp?", "stars": 4}, {"date": "Nov 12, 2014", "text": "Connot login with Google+ account ... i dont want give you password for my google account ...", "stars": 1}, {"date": "Nov 10, 2014", "text": "Excellent - very useful!", "stars": 5}, {"date": "Nov 6, 2014", "text": "I use this extension mainly with Asana.  It's wonderful-- but requires frequent re-enabling in the Chrome browser preferences. I don't know if it does this each time there is an update, but it seems very frequent and there's no notice to re-enable, the button just doesn't appear. It's also not very consistent in gmail.", "stars": 3}, {"date": "Nov 5, 2014", "text": "- 0 functionality\n- synchronisation is not working", "stars": 1}, {"date": "Nov 2, 2014", "text": "For some reason, extension button started showing an x symbol on the lower right corner.", "stars": 3}, {"date": "Oct 27, 2014", "text": "doesn't work", "stars": 1}, {"date": "Oct 13, 2014", "text": "Love this addin but it constantly gets disabled for some reason (like in Trello) so I have to keep going in and re-enabling it. I don't have this issue with any of my other plugins.", "stars": 5}, {"date": "Oct 4, 2014", "text": "Works very well for me with Todoist. Thanks", "stars": 5}, {"date": "Sep 30, 2014", "text": "Stellar. Dead simple time tracking & reporting. Free tier is great for freelancers or small business owners and the paid tier is excellent for other use cases. Great support, great UX, great everything. Highly recommend.", "stars": 5}, {"date": "Sep 19, 2014", "text": "Button continues to disappear and needs to be reinstalled after a few weeks.", "stars": 1}, {"date": "Sep 2, 2014", "text": "great extension, extremely helpful", "stars": 5}, {"date": "Aug 25, 2014", "text": "Awesome Product.", "stars": 5}, {"date": "Aug 11, 2014", "text": "Please update it to work in producteev again.\nThank you!", "stars": 5}, {"date": "Aug 5, 2014", "text": "Good idea but there is no documentation or support so no idea how to start the timer in the other apps!", "stars": 3}, {"date": "Jun 13, 2014", "text": "Hi\nWell done!!! Thanks.\n\nWill be nice to see ability to configure list of domains to work with and list of CSS selectors to be able to add toggle button for.\n\nKeep moving forward, guys!", "stars": 4}, {"date": "May 28, 2014", "text": "Love the idea. Would be great if:\n- it was an always-visible, always-usable browser button\n- you could select a tag when pressing it if you like\n\nNot very useful as it is!, sadly :S", "stars": 2}, {"date": "May 13, 2014", "text": "The idea is good, but it has extremely limited use seeing as it only works when certain website are being used. It would be much more useful to always have a toggl button in Chrome so that I can start and stop no matter what website I am using or what I am doing, otherwise this new functionality is pointless for me, since I always keep a toggl tab open anyway.", "stars": 2}, {"date": "Apr 15, 2014", "text": "For pivotal Tracker, it would be just perfect, if the time started when status changed for started, and stoped when hit finish,", "stars": 3}, {"date": "Mar 27, 2014", "text": "Please make it work with self-hosted JIRA.", "stars": 2}, {"date": "Mar 11, 2014", "text": "Just broke with new Trello interface update. Pleas fix it.", "stars": 3}, {"date": "Mar 4, 2014", "text": "Does not work on self-hosted JIRA installations so I cannot use it. Probably because it is limited on which domains it will activate on (which is good!).", "stars": 2}, {"date": "Nov 21, 2013", "text": "Love the idea and it worked great for a little while, but giving it three stars because the button disappeared from my Trello boards after a few hours. Will try disabling other extensions at some point, but it's gone for now.", "stars": 3}, {"date": "Oct 9, 2013", "text": "it works well with Pivotal Tracker. i like that it fits into a small space in Pivotal's UI. \n\nimprovements i would appreciate include:\n- change to \"stop timer\" when started.\n- appear only on my stories\n- remind me that i need to log into Toggl and help me do that (instead of not appearing in Pivotal stories).\n\nthanks\n\np.s. new web ui looks and functions great!", "stars": 4}, {"date": "Oct 5, 2013", "text": "Great tool.\nI use it all for github and i love it but it is missing issue numbers :(", "stars": 4}, {"date": "Aug 8, 2013", "text": "Simple and does the job. Works in Asana like a charm. Five stars if you could also stop the timer from within Asana - but otherwise great!", "stars": 4}, {"date": "Jun 26, 2013", "text": "Great tool! Currently, Asana integration is not working, though.", "stars": 5}, {"date": "Jun 7, 2013", "text": "It would be very helpful, if we could stop the time in the Pivotal Tracker as well, not just start it. This is a deal breaker for us and that's why we are uninstalling this button until we see this type of functionality implemented. Otherwise, a very good idea. The more we can do within PT, the more value it has to us.", "stars": 3}]