[{"text": "antivirus keep blocking to access boss.cnwangjie.com reported as url-scam.", "stars": 1, "date": "Dec 24, 2023"}, {"text": "Why my anti-virus keeps polling it's trying to access https://boss.cnwangjie.com/ws/ ???\n\nThe alert disappears once I disable this plugin.", "stars": 1, "date": "Dec 23, 2023"}, {"text": "Using on Brave browser Version 1.60.118 Chromium: 119.0.6045.163 (Official Build) (64-bit)\nUseless. For example moving from one group to another doesn't work at all.", "stars": 1, "date": "Nov 30, 2023"}, {"text": "just downloaded and read reviews. privacy practices should be disclosed, especially from china.", "stars": 3, "date": "Oct 25, 2023"}, {"text": "I'm sorry, but I don't see how this is better than OneTab. Instead of a single page long list, my saved tab groups are displayed in pages. That slows me down significantly when I'm looking for a specific group. It also looks really cluttered because it doesn't show only the title like OneTab, but the title and the URL. That might sound useful, but it actually slows you down as well, because it increases the amount of information that you have to process.", "stars": 2, "date": "Oct 3, 2023"}, {"text": "gave it a brief go - i had to create an export file from onetab, to import. it opened the list, but did nothing with it.\nso.. i pinned the icon and clicked it, to save all tabs - nothing happened.\n\nso.. i wrote this, and removed this brave extension but, like ozzymandias, i shall return!", "stars": 2, "date": "Sep 22, 2023"}, {"text": "This is exactly what it's called, a better version of one tab.  The only thing I wish I could do is email the saved list.", "stars": 4, "date": "Sep 3, 2023"}, {"text": "My OneTab crashed and I can't even tell you how much work history I've lost. I'm not going to delete that one because I still hope I can recover data from the corrupted file somehow. Meanwhile, I have felt overwhelmed without a solution for storing work sessions. Very thankful to have found this piece of code. I want to reach the developer to see if he might want to keep working on it more. Would be cool to see a web3 data storage solution for account backups :D", "stars": 5, "date": "Aug 29, 2023"}, {"text": "This is a completely advanced extension over the original. im happy to have the options to customize the details. thanks to the developer", "stars": 5, "date": "Jun 15, 2023"}, {"text": "You are right, I agree that this is better than Onetab, but for those used to Onetab like me, it is a confusing at first. those people will click on the icon expecting all the tabs to disappear, but then it doesn't and mentions lists. I almost uninstalled this and to go back to Onetab, but I'm glad I went to settings where I figured out how this works. Like a few of your 1 star raters said, you probably shouldn't  use the name of the other app, and also not claim this is better even if it pro... Show more", "stars": 5, "date": "Apr 5, 2023"}, {"text": "Trading on the name of a popular extension to generate traffic is spammy and just plain unethical. On top of that, calling yourself \"better\" is presumptuous and a claim that you'd better be able to back up. So far, you've not come close. Get your own name and earn your own popularity.", "stars": 1, "date": "Jan 19, 2023"}, {"text": "no online support\nno intuitive", "stars": 2, "date": "Dec 30, 2022"}, {"text": "All my tabs are gone from one day to the other. And before some may say I was an idiot: I did not touch my computer for a month. Came home from a trip, wanted to continue where I left off - but all tabs are gone. Splendid...", "stars": 1, "date": "Oct 20, 2022"}, {"text": "Better than onetab", "stars": 5, "date": "Oct 19, 2022"}, {"text": "features are not working...", "stars": 1, "date": "Jul 30, 2022"}, {"text": "when inputting title for my tab collections, the typing is extremely slow.\ni like the UI and everything, but that one thing is a huge let down. Im using it on opera.", "stars": 1, "date": "Apr 8, 2022"}, {"text": "It's great! I started with OneTab, but I moved to this for it's extra features and dark mode.", "stars": 5, "date": "Mar 22, 2022"}, {"text": "Trying to save any more than 50 tabs (I know it's a lot) seems to cause Better-Onetab to open the UI to quickly before closing the tabs resulting in the tabs not actually saving. Basically, it has poor reliability with larger groups of tabs.", "stars": 1, "date": "Mar 17, 2022"}, {"text": "I had been using this for a while, but recently it has just gotten worse and worse.\nNow, mind you, it might be the fact that I'm using it on Edge, since Edge being Chromium based now allows the use of Chrome Extensions, and that might be messing the Extension up.\nBut what makes this so bad - at least in my experience - lately, is that it is incapable of saving lists, and even incapable of deleting lists, as manually deleting them will have the deleted lists pop right back up again the moment ... Show more", "stars": 1, "date": "Feb 28, 2022"}, {"text": "Looks like a nice standard Session saver.\nNow, if it was able to store logins, I'd be extra impressed.", "stars": 4, "date": "Feb 18, 2022"}, {"text": "good everything perfect", "stars": 5, "date": "Feb 17, 2022"}, {"text": "lists do not save, they disappear if you refresh a page", "stars": 1, "date": "Jan 29, 2022"}, {"text": "This extension is great! You just pin the extension, and then you highlight the tabs you want to save (hold control to select multiple or hold shift to save all the tabs in between) and right click on the extension icon & click \"store tabs\". Makes it super easy and you can see different groups of tabs from different days, which makes it easy to work on multiple projects. This app has saved my life when it comes to lit reviews.", "stars": 5, "date": "Jan 21, 2022"}, {"text": "Better in some ways but worse in others\n\nGood things: tags, ability to import from onetab, ability to sort groups (but implementation is clunky, i wanna drag the group to where i want it, not click an arrow)\n\nBad things: looks worse (why is everything in different places than onetab? lol just copy its design and tweak it a bit, it has a TON of borders for everything), it has pages instead of being one scrollable list, performs WAY worse (super slow at times), and still doesn't have functional... Show more", "stars": 3, "date": "Dec 13, 2021"}, {"text": "Until V2 of this extension is deployed, go use Tablerone. It blows all the other tab managers out of the water.", "stars": 3, "date": "Dec 13, 2021"}, {"text": "Bad. Loses some tabs randomly. Not better than onetab. The UI is just as ugly, yet is less readable and feels slower. I wish the CSS animations were faster instead of only having an on/off option. I wish it stored all the tab lists on the same page. The only advantage to this extension over onetab is collapsible lists, but the large headers and bad typographic hierarchy ruin it. Why are retitle/restore/remove/pin options text bigger than the title of the tab list? Why does the list of options... Show more", "stars": 2, "date": "Dec 7, 2021"}, {"text": "not working anymore", "stars": 1, "date": "Nov 17, 2021"}, {"text": "Send selected tabs to list doesn't work, only sends 1.", "stars": 2, "date": "Sep 21, 2021"}, {"text": "Lists lose all tabs, even created lists disappear. This extension was good at first but now it does not do the work", "stars": 2, "date": "Jul 30, 2021"}, {"text": "Way better than saving to bookmarks and open all, no trouble.\nI just set my first enter page to better onetab so once i open chrome I can restore my pages as soon as I can click.\n\nThanks for the effort in the extension", "stars": 5, "date": "Jun 27, 2021"}, {"text": "Zero intuitivity.  Gave up after I couldn't manage to save a single tab.", "stars": 1, "date": "Jun 23, 2021"}, {"text": "This is so much better than the one tab extension. It does what I want one tab to do, including store only selected tab when I click the icon, open the tab but not remove it from the list. Love it when it's also open-source. Developers of this extension, you're god-sent to me!", "stars": 5, "date": "May 21, 2021"}, {"text": "Better get away from it.", "stars": 2, "date": "Apr 17, 2021"}, {"text": "its a onetab with a lot more better features and better looking but thats what makes it worse in my opinion because onetab is simpalistic and easy to move things around open tabs close them with just clicking on the icon and in all just simple and thats what i want from something i will use everyday and this aint it, its a lot cleaner yet more annoying to use", "stars": 2, "date": "Apr 5, 2021"}, {"text": "my lists just suddenly disappeared...", "stars": 1, "date": "Feb 21, 2021"}, {"text": "I hate it, not working.. all my important taps have gone!", "stars": 1, "date": "Jan 20, 2021"}, {"text": "Sync is not working.", "stars": 3, "date": "Dec 23, 2020"}, {"text": "what is https://boss.cnwangjie.com/and why does it need access to that?", "stars": 3, "date": "Nov 27, 2020"}, {"text": "just closes the tab, doesn't save anything", "stars": 1, "date": "Nov 24, 2020"}, {"text": "bonus points for you to begin just for not misleading people by falsely claiming the extension can save 95% of their memory used (when those savings are from closing the tabs, not the extension at all. In other words, the browser's Close Tab button should advertise that it can save people 95% of their memory used. Why google allows such misleading claims by an extension is baffling.)", "stars": 4, "date": "Oct 20, 2020"}, {"text": "Multiple issues with it deleting my tabs instead of storing them... Plus I have a lot of problems with it saving my settings (how hard is it to remember I had it on dark mode?)\n\nI'm writing this in the hopes this gets better. But I can't do this, so I'll stick with the original for now", "stars": 1, "date": "Oct 15, 2020"}, {"text": "Mostly issue free in 2020 & far better than the alternatives.", "stars": 5, "date": "Oct 4, 2020"}, {"text": "doesn't even work", "stars": 1, "date": "Sep 8, 2020"}, {"text": "this is so awesome! it doesn't delete your tabs like the original did! this should be on the top page of chrome web store! i admire your work, thank you very much!!!", "stars": 5, "date": "Jun 24, 2020"}, {"text": "Stored whole list of tabs before closing the browser.. restarted my computer and restarted the browser.. guess what the list in this useless app.. completely empty. Back to one tab", "stars": 1, "date": "Mar 18, 2020"}, {"text": "Does not work within Opera.  Apparently there are APIs within Chrome which aren't present in Opera, so this Extension will load, but does nothing.", "stars": 1, "date": "Mar 16, 2020"}, {"text": "Im going back to bookmarks, at least they dont disappear upon a crash. (see my comment below that neither sync options work). I'll use Bookmark By Date and Bookmark My Tabs to capture tabs and one of the bookmark newtab page exts, probably either BNTP (has solarized and indent options at bottom) or Bookmarks New Tab. \n\nBookmark Table is helpful to see recents and Quick Tab looks interesting. Also Extensions Manager is really helpful for testing different extensions and Quick Key has go back t... Show more", "stars": 4, "date": "Mar 15, 2020"}, {"text": "Great tab manager. I'm coming from one-tab and love the improvement. Great work!", "stars": 5, "date": "Jan 31, 2020"}, {"text": "good UI. Acted like it could do what it said. HORRIBLE PERFORMANCE. Did NOT SAVE tabs 75% of the time even with sync turned on and logged into backend and github as requested. Developers must have stopped. Do not download. what a waste", "stars": 1, "date": "Jan 23, 2020"}, {"text": "As a night owl, this is definitely better than the blindingly white OneTab extension. Layout and UI could use some work but \"better\" is fully functional. Like the Lunar Reader extension, it helps mitigate my aging eyesight. More tips at 1-dot . com / eye-strain", "stars": 5, "date": "Jan 21, 2020"}, {"text": "A nice addition in comparison to the original One Tab. I'm particularly fond of the \"store selected tabs\"  and the \"search\" features. \n\nThis extention has unsatisfactory issues in dire need of fixing, though: \n\n- Where is the option that prevents lists from being deleted upon being restored? The only available way to prevent this is to enable the confirmation message when a list is being deleted, which is tedious to do each time we want to restore a list. \n\n- Also, for some reason, the \"stori... Show more", "stars": 3, "date": "Jan 21, 2020"}, {"text": "Didn't work, right clicked and asked it to store my tabs and nothing happens. Bad UI.", "stars": 2, "date": "Dec 13, 2019"}, {"text": "On one hand This extension has some features that I wanted when migrating from onetab, but it's also more \"expensive\" to use (more ram, more cpu). I use older stuff (iphone 4s, imac 20'' from late 2007 and I'm happy to use it everyday btw), but Your grate extension should have (in the future) option to turn on/off options. I believe it's not only about older hardware, but also energy we use (battery etc.) to do something we want.\n\nThank You for Your gare job and awesome extension. For now I'm... Show more", "stars": 4, "date": "Dec 4, 2019"}, {"text": "While it offered a lot of options I wanted in OneTab and even seemed to be working at first, once I began adding my data to it, it's crumbled worse than knockoff legos. What needs to be fixed?\n - Importing from OneData is useless at best, but this might be the fault of OneTab, but why offer import if it isn't working?\n - When saving tabs, it will open a new tab for itself and then save them to a list and not close the tabs\n - After saving the tabs to a list, the list magically vanishes if you... Show more", "stars": 1, "date": "Nov 29, 2019"}, {"text": "The style and features, all are better than onetab. but there was one big issue which made me remove it from my browser: \n\nthe first tabs I stored to test the extension were stored and loaded without any issue. I got excited and even configured a shortcut key for storing the selected tabs. I stored 54 important tabs and to my surprise, they were closed but they were not added to \"better onetab\". I restored them from my history and tried it again believing it was my mistake, but every time the... Show more", "stars": 1, "date": "Nov 4, 2019"}, {"text": "features suggestion -\n- automatic backup to google\n- smooth like onetab\n- sort groups by number of links\n\nedit - all the links get lost from it after a crash", "stars": 3, "date": "Oct 2, 2019"}, {"text": "Found it really a nice ideia but still prefer onetab for one simple reason... love to be able to scroll down indefinetelly instead of needing to be changing pages (what is really a bummer) also would like to suggest a better way of importing from one tab (like with the pinned tabs and names of the group tabs altogether). Yours is more organized but still thing onetab layout a lot easier to see the links and more clean to look at.", "stars": 3, "date": "Sep 8, 2019"}, {"text": "I absolutely love this extension especially compared to the original. I've been using better onetab for roughly 6 months and have had a few issues but nothing I couldn't reverse or fix. I've read a lot of reviews from people, especially the poor reviews from people and just want to say if you actually read and explore the options and the GitHub website, you'll find that most issues that people are having there is an option for. As for the times that the extension doesn't seem to save any tabs... Show more", "stars": 4, "date": "Sep 3, 2019"}, {"text": "I like the amount of features this extension brings (dark theme, settings), but the biggest problem is amount of bugs in basic functionality (for example restoring tab from tab list opens wrong link from the list and removes the one u clicked so u lose it forever and didn't even open it)", "stars": 3, "date": "Aug 18, 2019"}, {"text": "Everything I saved is lost every time I save it.", "stars": 1, "date": "Jul 26, 2019"}, {"text": "Not working as expected.\nThe very first and most important feature is to be able to store a tab into its list. Instead, it closes the tab but does NOT store that tab.", "stars": 1, "date": "Jul 24, 2019"}, {"text": "Obviously better than the original OneTab.", "stars": 5, "date": "Jul 23, 2019"}, {"text": "Very big Issue with data storage / First I tempted to sync my stored tab lists with my Github account then for optimization purpose (actually I used to do that very often with my 4 Gb of ram lol)  I closed the navigator to clean my laptop with \"CleanMyMac\" so I can continue my work smootly. I relaunched chrome I checked my list but I couldn't find my stored tab lists anymore, everything wiped :/... I can't even describe you the frustration (I have stored important links for work and research)... Show more", "stars": 2, "date": "Jul 23, 2019"}, {"text": "Has not been working lately - won't save any changes, saves or deletes. Needs a fix!", "stars": 1, "date": "Jul 17, 2019"}, {"text": "Best one ! esp. sync function and selective tabs function.", "stars": 5, "date": "Jul 6, 2019"}, {"text": "Sorry, even if this does have extra functionality, it takes away the pure simplicity of being able to save all tabs in one click. I gave it a go and the user experience is just way more complicated and more steps involved than needed. Prefer the original and have returned.", "stars": 1, "date": "Jun 25, 2019"}, {"text": "I appreciate the effort that went into this extension. I agree that OneTab can be improved, sadly this is not it.\nTwo main problems:\n1. Unreliable. Sometimes stores tabs. Sometimes just closes them. Sometimes syncs. Sometimes doesn't. Sometimes you click on the buttons, sometimes you just click to no effect. Sometimes you understand what the options and commands mean, mostly you get surprised.\n2. The name. If you're going to develop this further, please rename it to something else, cause defi... Show more", "stars": 1, "date": "Jun 23, 2019"}, {"text": "Already fixing the biggest issue of onetab. It looks neater too (but I liked the simpler and less fancy look of the original)\n\nI will update my review if there's something else I could add or I find a issue. But great job.\n\nI personally find the lack of simplicity as a big issue, it's annoying. Not the end of the word but uncomfortable. Am I the only one? I mean, it has a lot of the exact same functions but it's just made in a way that's too fancy and less simple. Maybe I'm the only one", "stars": 4, "date": "Jun 23, 2019"}, {"text": "i lost all my tabs... after reinstall", "stars": 2, "date": "Jun 9, 2019"}, {"text": "I really want the feature can customize title of a tab.", "stars": 5, "date": "Jun 5, 2019"}, {"text": "Excellent extension! However, make sure to periodically backup your tabs just in case, as with ANY of these extensions they could potentially be deleted because of bugs/errors. I've used all of these \"OneTab\"/session manager extensions and by far this one in particular is my favorite, although it is still far from perfect. Hopefully the developer continues to keep this extension updated because it has the potential to stand above the rest. :-)", "stars": 4, "date": "May 31, 2019"}, {"text": "Not at all an alternative to onetab\nIt just closes my opened tabs and not storing in its list", "stars": 2, "date": "May 19, 2019"}, {"text": "Better interface and options but it cannot sync and it's not effective. So... when you think your tabs are there they aren't nor even pinned ones! It's not worth it the hassle by now. Maybe when these bugs are fixed. Will stick with TabCloud. Thanks anyway!", "stars": 3, "date": "May 8, 2019"}, {"text": "This app has stopped working. Don't waste your time. It closes your tabs and doesn't save them at all.", "stars": 1, "date": "May 6, 2019"}, {"text": "\"Better one tab,\" not for me, so far it has not saved/stored anything...I can add a url into a list but when I exit out of Chrome the list deletes...What am I missing? (pun) I'm missing the old OneTab, which is no longer available but worked very well.", "stars": 2, "date": "Apr 17, 2019"}, {"text": "search feature is weird and it doesn't work. when i try and search for a page it gives me a list of items that match my query. however, links to that page do not go there. they are set up to go where the saved site is. but that too doesn't work properly. Link leads to a random page that has no link to related to my query. \nexample, i had a number of amazon links that my query displayed. when i clicked on the link it takes me to a page that does not have that link saved.", "stars": 1, "date": "Apr 6, 2019"}, {"text": "Great stuff. Tons better in every way than the original one tab. I don't have any clue how this isn't more popular. Keep up the good work!", "stars": 5, "date": "Mar 29, 2019"}, {"text": "thanks, good job.", "stars": 5, "date": "Mar 18, 2019"}, {"text": "In order to select a number of tabs to make a list, you can hold ctrl and click on the tabs you desire to be in your list. It took me some time to find out how to select tabs and i don't know if there was an obvious more straightforward way or not.", "stars": 4, "date": "Mar 7, 2019"}, {"text": "Awesome extension!! Wish it has a OneTab feature when a tab lists could be seen on every PC as a webpage. Other than that it's the much better alternative!!\nUPD. Sync isn't working anymore  :(", "stars": 3, "date": "Mar 5, 2019"}, {"text": "I've spent a couple of days at least setting up and working with every tab organizer extension there is. This one is the best. It's not perfect, but it comes the closest. It gives me the most flexibility for where to open what: whole windows or just single tabs. By pinning the Tab List, I always have easy access to everything, so it's the best of all words: session manager, bookmarks, and tab manager. What does it lack? The sync function seems a little wobbly. The dark theme seems to come and... Show more", "stars": 5, "date": "Mar 2, 2019"}, {"text": "Syncing seems to be working quite well now!\n\nThank you!", "stars": 4, "date": "Feb 25, 2019"}, {"text": "since v.1.4.x better-onetab introduce lots of bugs...\nsidebar always opened when onetab invoked and/or night/day mode clicked;\nhamburger icon takes 2click's to open sidebar menu;\nsidebar way to transparent;\nwhen i click \"fold all list\" button closes all tab lists... but when onetab opened again didn't retain close state;\nfor whatever reason one of the tab lists doesn't retain pinned state;\nthat same tab list opens by itself when i click other tab lists;\npin/unpin action actually deletes tab l... Show more", "stars": 1, "date": "Feb 13, 2019"}, {"text": "I can search tab list.\nIt is less risk of crash.", "stars": 5, "date": "Jan 30, 2019"}, {"text": "Open-source and actively developed, does what it says", "stars": 5, "date": "Jan 29, 2019"}, {"text": "Thanks, a nice extension, I think that's exactly what I need with my dozens of tabs constantly opened...\nOne tiny detail, \"Night Mode by default\" is kinda awkward atm. It works, but it gives an annoying blink. You should check that setting before rendering the interface. Instead the extension renders default light UI and only after that it re-renders it to the night mode.", "stars": 4, "date": "Jan 20, 2019"}, {"text": "I really like this as a basic tab manager. Really nice interface, especially compare to the original one tab. How does this sync work and where is my data stored? Is it possible to sync and backup to my own, personal Google Drive?", "stars": 5, "date": "Dec 30, 2018"}, {"text": "This is good feature, but it collapses ALL tabs, including pinned what should not!\nSo it's better for me to use the original OneTab extension.", "stars": 3, "date": "Dec 17, 2018"}, {"text": "Thanks. Glad it's open source", "stars": 5, "date": "Nov 12, 2018"}, {"text": "great! I love OneTab but wish it had a few more features. I thought about making multiple user profiles for chrome but that didn't make sense to have a different set of extensions - so instead I searched for a one tab replacement and found this. Now I can keep my programming tabs stored here and my other tabs in onetab.", "stars": 4, "date": "Nov 9, 2018"}, {"text": "Great! Looks better than the original", "stars": 5, "date": "Nov 6, 2018"}, {"text": "I've used one tab for years, this is a much better product", "stars": 5, "date": "Nov 5, 2018"}, {"text": "It really is better than onetab!", "stars": 5, "date": "Oct 21, 2018"}, {"text": "So much better than the original OneTab, this is great alternative.", "stars": 5, "date": "Oct 9, 2018"}, {"text": "This is good.Thanks!", "stars": 5, "date": "Sep 23, 2018"}, {"text": "It works great and it is compatible with Onetab.", "stars": 5, "date": "Aug 17, 2018"}, {"text": "Was a one tab user on firefox. Moved to chrome and decided to try this one. Super extension, I can't get by without it. Replaced my bookmarks workflow.", "stars": 5, "date": "Aug 16, 2018"}, {"text": "If you're morally opposed to the original OneTab, this is an acceptable alternative. It's lacking a couple of features, though, and is less polished", "stars": 3, "date": "Jul 10, 2018"}, {"text": "Better UI", "stars": 5, "date": "Jun 29, 2018"}, {"text": "hey, a decent alternative for one tab", "stars": 5, "date": "Jun 27, 2018"}]