[{"date": "Mar 2, 2024", "text": "Works great after enabling file urls in the settings.\nBy some reason I don't understand, I can't get it work in firefox. It doesn't help to add md in ~/.mime_types. If you who authored this extention can make it work in firefox in Linux, please write an instruction about it in the description page, so Firefoz users can also use this! (and give higher rank)", "stars": 4}, {"date": "Feb 24, 2024", "text": "Doesn't work!", "stars": 1}, {"date": "Nov 30, 2023", "text": "This is a good extension but i would wish it could also support more things from GitHub like this for example:\n> [!NOTE]\n> Highlights information that users should take into account, even when skimming.\n\n> [!TIP]\n> Optional information to help a user be more successful.\n\n> [!IMPORTANT]\n> Crucial information necessary for users to succeed.\n\n> [!WARNING]\n> Critical content demanding immediate user attention due to potential risks.\n\n> [!CAUTION]\n> Negative potential consequences of an action.", "stars": 4}, {"date": "Nov 24, 2023", "text": "It does well what it needs.\nHowever selecting default font face, header sizes, margins/paddings would be great. Some simple css-like formatting.", "stars": 4}, {"date": "Oct 29, 2023", "text": "Best markdown viewer", "stars": 5}, {"date": "Oct 5, 2023", "text": "Very good. I agree with other users: you need to watch the video to make it work, but besides that, it works pretty well. It's almost perfect. I have only one request... could it be possible to add UTF-8 support? I tried setting the encoding on my local .md file to utf8 but the extension stopped rendering it correctly.", "stars": 4}, {"date": "Sep 30, 2023", "text": "You won't be able to make it work without watching the video. It's not intuitive to set up and the options hidden in advanced are essential to make it work, they should be put in a start page and shown to the user to get started. But at the end of the day it works and is pretty useful.", "stars": 3}, {"date": "Sep 19, 2023", "text": "Works good. Except you can't use relative paths for images. You need to use the full path for the src, which makes it less flexible. For example opening file:///D:/myfolder/Mydocument.md. <img src=\"d:/myfolder/Mypicture.png\" alt=\"Setup\"> is working, but <img src=\"/Mypicture.png\" alt=\"Setup\"> is not working. Which works good in vscode.", "stars": 3}, {"date": "Aug 27, 2023", "text": "Loved it, thanks!", "stars": 5}, {"date": "Jul 19, 2023", "text": "Works great. My only complaint is that if you click a # link in the page and then refresh, it will go back to the top of the page.", "stars": 4}, {"date": "Jun 14, 2023", "text": "Thank you so much for such a convenient extension! It fully satisfies me and even more! It's incredibly easy to customize the extension according to my preferences.\n\nHowever, I must admit that I initially deleted it, thinking it wasn't working. It turned out that I needed to allow the browser to work with local files for this extension to function properly.\n\nDear author, please emphasize this in the description, using large letters, for people as foolish as me :)\n\nIt seems to me that this ext... Show more", "stars": 5}, {"date": "May 15, 2023", "text": "After struggling to get it working with local files I have now managed to (reinstalling the extension, restarting chrome...) and it looks good", "stars": 4}, {"date": "Jan 27, 2023", "text": "lightweight, user-friendly, and does exactly what it's supposed to do, kudos!", "stars": 5}, {"date": "Dec 3, 2022", "text": "Very light extension! Love it!\n\nNot giving 5 star because I cannot add a custom CSS style! The only missing feature I think is essential!", "stars": 4}, {"date": "Oct 21, 2022", "text": "Works like a charm and has an auto-reload option!!!", "stars": 5}, {"date": "May 10, 2022", "text": "one of the best extensions i ever installed. is it possible to create a collapsible toc and collapsible headings?", "stars": 5}, {"date": "Feb 26, 2022", "text": "Great extension, except it poorly supports gfm footnotes:\n\nhttps://docs.github.com/en/get-started/writing-on-github/getting-started-with-writing-and-formatting-on-github/basic-writing-and-formatting-syntax#footnotes", "stars": 5}, {"date": "Jan 26, 2022", "text": "this is very good extensions", "stars": 5}, {"date": "Jan 18, 2022", "text": "Great!\nI'v never seen like this MD viewer.\nThis is the the best MD viewer.\nThough, I want to ask one thing.\nIs editing ML file possible?\nEven if not, it's exellent.", "stars": 5}, {"date": "Dec 19, 2021", "text": "Simple and neat.", "stars": 5}, {"date": "Dec 16, 2021", "text": "Somehow it stopped compiling emojis in headings. Now, It only compiles shortcodes.", "stars": 4}, {"date": "Dec 6, 2021", "text": "Simple and the best currently..\nBut syntax broken when some conditions meets.", "stars": 3}, {"date": "Oct 7, 2021", "text": "Navigated to a markdown file and it didn't render so this seems broken.", "stars": 1}, {"date": "Sep 1, 2021", "text": "Excellent extension. I just found the TOC and Scroll options, both are super helpful!\n\nWould you consider applying the dark mode themes to the TOC sidebar?", "stars": 5}, {"date": "May 19, 2021", "text": "Doesn't seem to do anything.  Open up a page with MD, get raw text.  Can't figure out how to open a local file with MD.  Not sure how it works but it doesn't tell you either.", "stars": 1}, {"date": "May 9, 2021", "text": "Very nice.  \n\nYou can associate Markdown Viewer with .md files in Windows Explorer.  Create the registry key HKEY_LOCAL_MACHINE \\ SOFTWARE \\ Classes \\ .md \\ OpenWithProgids (remove spaces) and add the empty the registry values \"BraveHTML\" and \"ChromeHTML\" (type REG_SZ).  \n\nWhenever you click on an .md file it will pop up in your browser for display.", "stars": 5}, {"date": "May 6, 2021", "text": "I love the extension,  although i;m wondering why did the screenshots in windows not show, does it not render local file paths?", "stars": 5}, {"date": "Apr 17, 2021", "text": "This one is much better than Markdown Preview Plus, which I used to use. In particular, Markdown Viewer renders MathJax-based equations more correctly, while MPP ate backslashes, breaking the formulas. But one feature I'm missing is automatic reload of a local file on change. I have to manually update the page to see the changes.", "stars": 5}, {"date": "Apr 9, 2021", "text": "Good so far! But by default it does not render web-based URLs from Markdown into html. You must go into Settings, and where it says Allowed Origins, click the button \"Allow All\". Now it should properly render .md files on a website and as a local file.\n\nAlso it does not interpret a YAML block (used with Pandoc) as normal info, it renders it as Markdown.", "stars": 5}, {"date": "Mar 7, 2021", "text": "Good extension, I really like it.\nOne little bug (maybe only for me?): footnotes do not render:\n\nSource:\nFootnote is not working.[^1]  \n[^1]: This should be a footnote.  \n\nGets rendered in source a above, without link and small char link.\n\nCould you look into this? Thanks!", "stars": 4}, {"date": "Feb 15, 2021", "text": "Works perfectly for me!\nJust a small question: how can I export what I see as an HTML file? I can print it as PDF, but I cannot find a way to save it as HTML.", "stars": 5}, {"date": "Jan 24, 2021", "text": "Awesome extension. But it doesn't seem to support the syntax of tables, like this:\n\n| Syntax      | Description |\n| ----------- | ----------- |\n| Header      | Title       |\n| Paragraph   | Text        |", "stars": 5}, {"date": "Jan 16, 2021", "text": "Nice viewer. My only complaint is that the TOC is un-styled. It's always brain-searing black on white regardless of the style used for the document.", "stars": 4}, {"date": "Dec 5, 2020", "text": "This makes viewing markdown files so easy! I write my notes in markdown now and if I need to look at it I can just open in chrome", "stars": 5}, {"date": "Nov 22, 2020", "text": "Any idea if you can improve it such that it can support LaTex mode such as the following?\n\n$$ f(x) = x^2 + y^2 $$\n\nwhere $ x $ is real part and $ y $ is imaginary part.", "stars": 4}, {"date": "Nov 16, 2020", "text": "I cannot use it on github like README.md.It doesn't work at all!", "stars": 3}, {"date": "Nov 3, 2020", "text": "It reminds me of VuePress, but I don't know how it really works. This is incredible!", "stars": 5}, {"date": "Oct 8, 2020", "text": "Produces nearly perfect markdown file output--almost identical to what GitHub shows for any given markdown file--images, formatting, tables, and all! I wrote about it in my answer here: https://superuser.com/a/1591372/425838.", "stars": 5}, {"date": "Sep 18, 2020", "text": "I installed this and for probably a week had trouble figuring out how to use it. If I opened files in google chrome it would just show them in plain text. However after some googling I discovered you have to allow access to local URLs, AND have file:///* enabled under sites. These options are only selectable on the extensions page and not from the plugin bar.\n\nThere should be a note of this somewhere in the description. Otherwise I think this will meet my needs of previewing markdown documents.", "stars": 4}, {"date": "Aug 25, 2020", "text": "It doesnt work at all. still showing plain text", "stars": 1}, {"date": "Aug 22, 2020", "text": "Does what it says!", "stars": 5}, {"date": "Aug 14, 2020", "text": "Nice job, I really like how many options you have.\n\nBad thing: The only good theme (dark github) fills my html paddings with white color!\n\nFor example when using this html to display an image in the center:\n<img src=\"./my_image.png\" alt=\"drawing\" width=\"600\" style=\"padding-left:200px\"/>", "stars": 3}, {"date": "Jul 26, 2020", "text": "loving the simplicity", "stars": 5}, {"date": "Jul 24, 2020", "text": "Does not render Markdown (*.md files).", "stars": 1}, {"date": "Jul 11, 2020", "text": "Great work.\n\nThe MARKDOWN-ALT theme has a very eye-catching rendering of text blocks surrounded by backticks (`like this`). It would definitely be nice to have one's own CSS and create custom themes to include highlighting features like this in other themes.", "stars": 5}, {"date": "Apr 6, 2020", "text": "So far very good!!\nI need to review a bunch of technical documents (for software developers) and this little guy does it perfect.\nAll formatting is neatly presented... and there's an ample amount of themes to choose how you'll see the document.\nLinks work, as expected.\nI'll come back, to add further notes.", "stars": 5}, {"date": "Mar 26, 2020", "text": "How to save my markdown file to html file?", "stars": 4}, {"date": "Mar 23, 2020", "text": "I've enabled allow access to file URLs, when I drop a .md file into Chrome, it just downloads the file instead of opening it...", "stars": 1}, {"date": "Mar 2, 2020", "text": "works with latest Chrome version 80. Love it.", "stars": 5}, {"date": "Feb 28, 2020", "text": "Does not do anything when you open an .md file", "stars": 1}, {"date": "Jan 19, 2020", "text": "Does not work, the md files are seen as text files, no formating", "stars": 1}, {"date": "Jan 17, 2020", "text": "Just shows the markdown source-code. Not discernible for me, how to get it to show the rendered markdown (Chrome  79.0.3945.117 on Win10Pro). So it's useless ...", "stars": 1}, {"date": "Jan 5, 2020", "text": "There are some unique characteristics about this extension:\n 1. The compiler can read complex syntax.\n 2. You can choose your compiler.\n 3. You can choose your theme from a wide variety.\n 4. You have fine level control over the permissions you give it.\n 5. You have fine grained control on activating (or not) the individual features", "stars": 5}, {"date": "Dec 19, 2019", "text": "does not render any markdown from git repo I'm working on... followed the readme.md from git repository, Documentation: https://github.com/simov/markdown-viewer#table-of-contents. enabled the 'allow access to file:urls' in the advanced options' as instruction states... running, Chrome: 78.0.3904.97 (Official Build) (64-bit)", "stars": 1}, {"date": "Dec 17, 2019", "text": "My markdown cannot display local picture(you can only see the title but cannot see picturs), i use google chrome, can anyone help me?", "stars": 4}, {"date": "Nov 15, 2019", "text": "Love this so much, very clean", "stars": 5}, {"date": "Nov 4, 2019", "text": "Doesn't work. How do you turn an md page into HTML? The conversion just appears in the video without any explanation. I've allowed local files. What do I need to do???", "stars": 1}, {"date": "Nov 4, 2019", "text": "I love the plug-in, really handy, brisk and with many themes. Unfortunately, I cannot figure out how to make Chrome stop downloading .md files instead of opening them as it did before.", "stars": 5}, {"date": "Nov 4, 2019", "text": "Tried changing all the settings but just flat out did not work on my mac.", "stars": 1}, {"date": "Oct 11, 2019", "text": "It loads a blank page when I visit this website\nhttps://github.com/ziishaned/learn-regex/blob/master/translations/README-cn.md", "stars": 4}, {"date": "Sep 30, 2019", "text": "I have no idea how to make this work for local files.", "stars": 1}, {"date": "Jul 29, 2019", "text": "Really beauty markdown viewer. :+1:.", "stars": 5}, {"date": "Jul 24, 2019", "text": "When it works it works great!\nThe problem is that often it doesn't render the local files. What frustrates me is that this is not happening consistently... if I refresh the page, the file will render... maybe or maybe not.\nI don't know what other extensions it may be conflicting with and I don't know how to find out. The inconsistency is killing me!", "stars": 3}, {"date": "Jun 19, 2019", "text": "It's break the github markdown viewer page.", "stars": 3}, {"date": "Jun 15, 2019", "text": "Excellent tool. Make sure to enable  'allow access to file:urls' in advanced options as noted.", "stars": 5}, {"date": "Jun 11, 2019", "text": "Almost deleted this extention it didn't worked but after giving permission it worked. Please let me know next time after installation.\nhttps://imagecomputing.net/damien.rohmer/teaching/general/markdown_viewer/index.html", "stars": 5}, {"date": "May 29, 2019", "text": "TOC seems not support Chinese", "stars": 4}, {"date": "May 20, 2019", "text": "For local, need to go into Advanced and allow access to file:// urls", "stars": 4}, {"date": "May 20, 2019", "text": "very good!", "stars": 5}, {"date": "Apr 8, 2019", "text": "Does absolutely nothing, waste of time.", "stars": 1}, {"date": "Mar 31, 2019", "text": "Didn't work for MD files running on localhost", "stars": 2}, {"date": "Mar 30, 2019", "text": "This is exactly what I have been looking for, works perfectly :) great work!", "stars": 5}, {"date": "Mar 24, 2019", "text": "Its most helpfull MD application i ever used", "stars": 5}, {"date": "Mar 6, 2019", "text": "Another gripe is that sometimes it loads a blank page. I've tried changing the theme, compiler, and options without any systematic pattern that I can discern.", "stars": 5}, {"date": "Mar 4, 2019", "text": "Thanks for the developer for this simple and awesome extension 💖👍", "stars": 5}, {"date": "Feb 17, 2019", "text": "It supports only basic md features. No KaTeX, mermaid, emoji, TOC. But at least it looks like as desired.", "stars": 4}, {"date": "Jan 9, 2019", "text": "This is just what I needed. I wanted to be able to render Markdown files, but still use the plain text editor of my choice. This way I don't have to use one of those bundled editor/viewers that are never quite to my liking. Thanks!", "stars": 4}, {"date": "Jan 4, 2019", "text": "simple and easy to use, also support table of content!", "stars": 5}, {"date": "Jan 2, 2019", "text": "Looks great and works on local files. Does not seem to correctly parse some code blocks.\n\nExample (slight abuse but common): ```x+y```", "stars": 4}, {"date": "Nov 8, 2018", "text": "My favorite markdown viewer I've found, mainly because it's simple and easy to use and I like the Github-Dark theme.", "stars": 4}, {"date": "Sep 27, 2018", "text": "This is working nicely for me: just ensure you enable the 'allow access to file:urls' in the advanced options ( as it clearly shows in the documentation).  Great work!\nMy only trouble is how to get it to render images? I am getting a broken link icon for images. What is the best way/format/markdown to ensure images render correctly?", "stars": 4}, {"date": "Sep 22, 2018", "text": "(Update 2022) Excellent! Thanks to the developer for adding the \"wide\" switch, and for fixing the delayed parsing.\n\n(Original review, outdated) It is good. Two annoyances: 1) it adds spaces on the left and on the right – in every theme – I can not use the full screen. 2) with more than 5 other Addons installed, when no Chrome instance is open and then I open a local *.md file from within the file manager then it wont parse it. First I have to middleclick the reload button to open it in a new ... Show more", "stars": 5}, {"date": "Aug 30, 2018", "text": "Saves lot of time...", "stars": 5}, {"date": "Aug 27, 2018", "text": "Useful extension (y)", "stars": 5}, {"date": "Aug 26, 2018", "text": "Support many flavor of markdown and has two compiler. The remark compiler renders code block with special tags correctly.", "stars": 5}, {"date": "Aug 16, 2018", "text": "Where has this been all my life?", "stars": 5}, {"date": "Aug 8, 2018", "text": "Awesome extension. \n\nThank you very much :)", "stars": 5}, {"date": "Aug 8, 2018", "text": "not working", "stars": 1}, {"date": "Jul 13, 2018", "text": "Useful and effective.\nGood to have a provision to easily include additional codeblock languages as an extension function.", "stars": 3}, {"date": "Jul 9, 2018", "text": "doesn't work", "stars": 1}, {"date": "Jun 27, 2018", "text": "Step 1) I downloaded and installed the extension. \nStep 2) I went to the extension's settings and did the following: enable the Access to file URLs\nStep 3) Made a simple markdown file with a simple H3 heading. ex. ### HEADING and a numbered list\nStep 4) dropped the md file on Chrome and it showed the list fine but, no matter what I did it wouldn't show the heading properly, it just showed the three ### HEADING. So I tried to make text bold, it wouldn't do that either. Don't know what is wrong... Show more", "stars": 2}, {"date": "Jun 22, 2018", "text": "A decent md viewer, it won't render tables though :(", "stars": 2}, {"date": "Jun 19, 2018", "text": "MARKED complier doesn't support CJK characters, it always generate '-' as the id of element. But REMARK complier works fine.", "stars": 5}, {"date": "Jun 18, 2018", "text": "It seems pretty well when reading an .md file, but viewing a web page which URL ends with \".md\" will cause it crash.", "stars": 3}, {"date": "Jun 17, 2018", "text": "Output of my Github project markdown is more accurate to what github generates than it's competitors.  It still is not rendering checkboxes, but otherwise a winner.", "stars": 5}, {"date": "Jun 2, 2018", "text": "The plus here is the variety of themes are render engines and options. \n\nBut, I found this extension often crashed while trying to render a variety of content - so too flaky for my toolbox...", "stars": 3}, {"date": "May 25, 2018", "text": "Thank you for this great extension! I love it! Especially the added themes :)", "stars": 5}, {"date": "May 23, 2018", "text": "Nice, thanks.", "stars": 5}, {"date": "May 11, 2018", "text": "Did not work at all, on a browsed local file anyway", "stars": 1}, {"date": "May 2, 2018", "text": "Seems very flaky. Even after adding whitelists for Github (the extension should be offering these by default) I still have problems. Playing with the options, sometimes the page appears after a refresh, and other times it doesn't.", "stars": 2}, {"date": "Apr 11, 2018", "text": "Very helpful extension that i use daily.\n\nWould be nice if ```diff ``` will be render too.", "stars": 5}, {"date": "Mar 13, 2018", "text": "Unable to render local files, but remove andreinstalling solved a lot of problems", "stars": 5}, {"date": "Feb 20, 2018", "text": "Add latex syntax highlightning to prism list  please and may be autoreload file optionally. Then will be 5.", "stars": 4}, {"date": "Jan 27, 2018", "text": "Does not work out-of-the-box and documentation does not explain how to get it working.", "stars": 1}, {"date": "Jan 25, 2018", "text": "perfect", "stars": 5}, {"date": "Jan 8, 2018", "text": "Not support ANSI/Chinese :(\nBut I like the github style.", "stars": 3}, {"date": "Dec 27, 2017", "text": "Did not work at all, even after a restart of the browser. On Chrome 63.0.3239.84", "stars": 2}, {"date": "Dec 25, 2017", "text": "Cool", "stars": 5}, {"date": "Dec 1, 2017", "text": "Great, works like a charm. Only criticism, would have liked to know you had to allow access to files in the extensions page. Simply doesn't work if you don't do that bit.\n\nI stumbled across it but would have been nice to be prompted to do that. Otherwise I might not have seen it.", "stars": 5}, {"date": "Nov 21, 2017", "text": "got many compile options. suggest author to add a watermark on the front pic to remind users to allow access to file urls.", "stars": 5}, {"date": "Nov 4, 2017", "text": "Didn't work.\n\nSwitched to Markdown Reader instead.", "stars": 1}, {"date": "Nov 3, 2017", "text": "quality extension. does everything that I need", "stars": 5}, {"date": "Nov 1, 2017", "text": "very cool!!!", "stars": 5}, {"date": "Oct 24, 2017", "text": "Great viewer, thanks!", "stars": 5}, {"date": "Oct 23, 2017", "text": "Awesome", "stars": 5}, {"date": "Oct 13, 2017", "text": "The best.", "stars": 5}, {"date": "Oct 10, 2017", "text": "Love it! So many themes works great!", "stars": 5}, {"date": "Oct 1, 2017", "text": "Does not seem to do anything. Yes, I enabled \"allow access to files\".\n\nJust seeing .md source, with no obvious instructions on how to get it working", "stars": 1}, {"date": "Sep 29, 2017", "text": "Supports GitHub Flavored Markdown, creates table of contents, themable and configurable. Highly recommended", "stars": 5}, {"date": "Sep 21, 2017", "text": "It's the most beautiful Markdown rendering tool, but a  pretty point is that it can't export as a mhthtml(or something like that) that could contain images, tables and all style in a file.", "stars": 5}, {"date": "Sep 12, 2017", "text": "Perfect, thanks guys.", "stars": 5}, {"date": "Aug 22, 2017", "text": "Job well done", "stars": 5}, {"date": "Aug 18, 2017", "text": "Works as expected. Very helpful!", "stars": 5}, {"date": "Aug 18, 2017", "text": "2018-11-05\nI would still like to see support for custom css, which this extension doesn't have so far.\n\nAnother gripe is that sometimes it loads a blank page. I've tried changing the theme, compiler, and options without any systematic pattern that I can discern.\n\n<earlier>\nMy favorite markdown viewer so far.\nHowever, none of the themes that are built in suit my typical needs. I would really like to see support for custom themes/css.", "stars": 3}, {"date": "Aug 17, 2017", "text": "How to enable TOC?", "stars": 5}, {"date": "Aug 13, 2017", "text": "Nice simple but powerful plugin", "stars": 5}, {"date": "Aug 1, 2017", "text": "I looked at that other Markdown Viewer. It worked, but looked awful. This one has all the themes we're used to. God bless!", "stars": 5}, {"date": "Jul 10, 2017", "text": "awesome plugin!", "stars": 5}, {"date": "Jun 30, 2017", "text": "Really good plugin! There's a lot of 'flavors' / styles of formatting the results.  Maybe a suggestion for future versions would be to make possible to edit the CSS styles and then save our own custom style.\nOne more idea: add a button to save as html (the way we see on browser).", "stars": 5}, {"date": "May 27, 2017", "text": "View is go but broke GitHub website", "stars": 3}, {"date": "Mar 29, 2017", "text": "Documentation is useless for a new user.  No way to get started.  I only want to read a .md file that I've downloaded. It's open in a tab, that shows just the markdown source. \n\nRating raised from 1 to 2, as the tab with the .md file started showing the rendered view.  Maybe from refreshing it.  Documentation still lacking.\n\nUnder the chrome extension, the first option only takes me to the Chrome store with a screenshot that looks nothing like what I see.  In Options, the ADD button does not ... Show more", "stars": 2}, {"date": "Mar 23, 2017", "text": "useful and simple", "stars": 5}, {"date": "Mar 20, 2017", "text": "Simple and efficient.", "stars": 5}, {"date": "Mar 15, 2017", "text": "Comparing to other markdown viewers, I love this one. It is like opening Github page. Clean and simple.", "stars": 5}, {"date": "Mar 10, 2017", "text": "I can't figure out how to make it work. I open a local markdown file in a chrome tab, click the Markdown Viewer extension icon and I can Click \"Markdown Viewer\" which just takes me back to the extension page on the web store.  I can go to options.  But it doesn't look anything like the picture in your sample and nowhere do I see how to render my markdown doc.  I don't doubt you have that functionality somewhere in here but I have to give a low rating because it lacks an intuitive interface an... Show more", "stars": 2}, {"date": "Mar 10, 2017", "text": "Awesome productivity tool if you keep your notes in  MD.\n\nI only have one feature ask:\nGitHub added Task Lists to their flavor. That would be super nice.\nhttps://github.com/blog/1825-task-lists-in-all-markdown-documents", "stars": 5}, {"date": "Mar 4, 2017", "text": "Tried several markdown viewers, this is the best by far!", "stars": 5}, {"date": "Mar 1, 2017", "text": "Love the fact that you don't need to give it the permissions on all the websites you visit. Cheers!", "stars": 5}, {"date": "Feb 14, 2017", "text": "I've tried a few markdown extensions and this one works best, minus the emoji, thanks!\n\nNote: Took me a sec to realize that \"Make sure that the Allow access to file URLs checkbox is checked for the Markdown Viewer extension\" doesn't count as special permissions.", "stars": 4}, {"date": "Nov 25, 2016", "text": "Perfect. Provides many styles, including github. Parses everything correctly.", "stars": 5}, {"date": "Nov 8, 2016", "text": "Simple and the best ever for Markdown", "stars": 5}, {"date": "Aug 27, 2016", "text": "The best of those that I found. Though themes don't work", "stars": 5}, {"date": "Mar 25, 2016", "text": "Does not support UTF-8 encoding.", "stars": 3}, {"date": "Jan 20, 2016", "text": "I like this markdown viewer more than any other I have tried, because of its flexibility. I only wish there were more \"left-adjusted\" themes, such as the Solarized ones (I don't like these very much). When using centered themes long path names get folded to the next line, which is inconvenient for copy/paste. Otherwise it would definitely be a 5-star!", "stars": 4}, {"date": "Sep 17, 2015", "text": "Better if more themes, and support embedded html tags", "stars": 4}, {"date": "Sep 9, 2015", "text": "I've tried most of the other Markdown viewer extensions and this is by far the best.", "stars": 5}, {"date": "Jul 28, 2015", "text": "easy, simple, almost invisible. exactly what I want. Thanks man!", "stars": 5}, {"date": "Sep 29, 2014", "text": "really cool extension!\n\nsince Prism (code colorizing module) hasn't implemented language guessing yet one can temporarily modify `C:\\Users\\<username>\\AppData\\Local\\Google\\Chrome\\User Data\\Default\\Extensions\\<extension ID>\\1.4_0\\js\\content.js` adding\n\n    document.body.className += \" language-xxxx\"\n\nright before `Prism.highlightAll()` line to set default highlighting to specified language (e.g. `language-ruby`)", "stars": 5}]