[{"date": "Jan 30, 2024", "text": "Poor functionality. Not a particularly useful plugin for developers.\nHowever, if the authors add the ability to highlight meta tags or make it possible to manually add custom highlights, it would be a 5.", "stars": 3}, {"date": "Oct 25, 2023", "text": "Not what I was looking but once you reload an existing tab and  hit the icon on the toolbar then it shows the source code. However, what I was looking for was the ability  to select/highlight  an image and or text, right click, and  choose View selection source,  , then copy and past what it highlights. Which is easy to do in  Firefox and derivative based browsers, while Developer tools > View page source  in Chromium based browsers (or at least Vivaldi) does not make this easy.", "stars": 4}, {"date": "Jul 6, 2023", "text": "You are changing my life man, thank you !", "stars": 5}, {"date": "May 14, 2023", "text": "5 stars. There is one thing though, you have to make sure you reload any pages after installing it or it wont work. I think a few people in here were not smart enough to figure that out and thought it was bad for that reason. You might want to grey the button out or show a tooltip saying you have to reload the page, so those people don't bang their heads on the keyboard.  Nice that it pretty-prints, F12 inspector doesn't do that. I installed this because inspector was ticking me off so bad wi... Show more", "stars": 5}, {"date": "Mar 7, 2023", "text": "Stays in a useless state, reporting “Page loading...” without change.", "stars": 1}, {"date": "Nov 23, 2021", "text": "not working: \"Error: Access is denied to chrome:// and Chrome Store pages\"", "stars": 1}, {"date": "Jul 14, 2021", "text": "Doesn't work.. Error: Access is denied to chrome:// and Chrome Store pages", "stars": 1}, {"date": "Jan 18, 2021", "text": "Please add support Brave browser\n\nThanks a lot", "stars": 5}, {"date": "Jul 30, 2020", "text": "Works very well for me, even with *unco-operative* websites.", "stars": 5}, {"date": "Feb 21, 2020", "text": "Incredible tool", "stars": 5}, {"date": "Jan 18, 2020", "text": "I'm going to marry this extension. It's a developer's wet dream.", "stars": 5}, {"date": "Jan 6, 2020", "text": "A much better page source viewing experience than Chrome's default. Very nice!", "stars": 5}, {"date": "Nov 6, 2019", "text": "Good extension. But I can't open source for local pages stored on my computer. Got \"Error: Access is denied to chrome:// and Chrome Store pages\"", "stars": 3}, {"date": "Oct 14, 2019", "text": "Great. Very useful. But this extension cannot show Cyrillic symbols. Could you, please, fix it?\nScreenshot:\nhttps://i.imgur.com/lAFJaqx.jpg\nscript sample:\nhttps://forum.ru-board.com/board/Cheery/projects/vkeyboard/vkeyboard/vkeyb.js", "stars": 5}, {"date": "Dec 17, 2018", "text": "It's very useful. And could you add showing images source in the next version?", "stars": 5}, {"date": "Nov 13, 2018", "text": "when i try to use this extension on html files from disk,i got this error : Error: Access is denied to chrome:// and Chrome Store pages", "stars": 3}, {"date": "Sep 12, 2018", "text": "It works great ! Thankz :)", "stars": 5}, {"date": "Jun 7, 2018", "text": "Doesn't work.", "stars": 1}, {"date": "Apr 26, 2018", "text": "First impressions quite good!", "stars": 5}, {"date": "Dec 16, 2017", "text": "It worked OK, however, I see \"truncated 1424bytes...\" in the end of all inline <script> tags, if you watch them inside of base html source. It would be convenient to be able to see them in the source.", "stars": 2}, {"date": "Apr 3, 2017", "text": "Its not working. Hey could you please let me know if i can work with you to solve it.", "stars": 1}, {"date": "Feb 1, 2017", "text": "The best extension for Chrome ever created. Good job!", "stars": 5}, {"date": "Jan 25, 2017", "text": "Had trouble with \"access denied\" at first, but it just needs the target page reloaded, then the extensions page reloaded. Seems to work consistently if I do that. \n\nMakes it real easy to view the js and css, should be very educational, Thank You", "stars": 5}, {"date": "Dec 17, 2016", "text": "giving error \nError: Access is denied to chrome:// and Chrome Store pages even when allow access to page url is allowed", "stars": 2}, {"date": "Nov 25, 2016", "text": "to make this work allow access to files urls", "stars": 5}, {"date": "Oct 28, 2016", "text": "Does not work for most pages", "stars": 1}, {"date": "Sep 1, 2016", "text": "Doesn't seem to work on private pages.", "stars": 1}, {"date": "Aug 18, 2016", "text": "Clciked it an told me \"Error: Access is denied to chrome:// and Chrome Store pages\"", "stars": 1}, {"date": "May 15, 2016", "text": "Works gr8, i use it frequently.", "stars": 5}, {"date": "Jan 27, 2016", "text": "useless doesnt load.... doesnt do anything.....", "stars": 1}, {"date": "Dec 29, 2015", "text": "Do not work anymore...", "stars": 1}, {"date": "Dec 27, 2015", "text": "Did not display page source at all.", "stars": 2}, {"date": "Dec 2, 2015", "text": "Not that fast while loading", "stars": 2}, {"date": "Nov 11, 2015", "text": "I get the \"error loading file\" message more often than not. \n\nSorry, but that's a showstopper. The occasional glitch is tolerable. But repeated errors are not.", "stars": 1}, {"date": "Nov 11, 2015", "text": "\"error loading file\"", "stars": 2}, {"date": "Oct 15, 2015", "text": "Very nice to browse code, colorful format. But it can't format the js file opened from  address bar.", "stars": 4}, {"date": "Sep 10, 2015", "text": "Doesn't work.. tried several times.. no bueno.", "stars": 1}, {"date": "Aug 28, 2015", "text": "Does all that I need and more. Just wish it had showed up in my first search of extensions when I searched for \"current source\"\n\nCan you make it show on the context menu?", "stars": 5}, {"date": "Aug 15, 2015", "text": "Works like a charm, Would give 5 stars if only the extension never shows the \"error loading file\"", "stars": 4}, {"date": "Jul 10, 2015", "text": "Had to reload many times to fix the error loading file page, but it worked eventually.", "stars": 4}, {"date": "May 23, 2015", "text": "This very nice. I like it as it show all files in detail with the code.", "stars": 5}, {"date": "Apr 29, 2015", "text": "All I ever got was an \"error loading file\" message never saw it work.", "stars": 1}, {"date": "Apr 18, 2015", "text": "I get the message \"error loading file\" and then I have to refresh a few times, and then it works.\n\nWould be nice if we could expand and collapse sections of HTML.", "stars": 3}, {"date": "Mar 31, 2015", "text": "Error loading file when run", "stars": 1}, {"date": "Jan 27, 2015", "text": "Does what it says on the tin.", "stars": 4}, {"date": "Nov 4, 2014", "text": "Always shows error loading file.", "stars": 1}, {"date": "Sep 20, 2014", "text": "This is an amazingly useful tool! It's simple to use and offers all the functions I had hoped for, and some i didn't even know I needed but now can't live without (such as showing the option to show the cache expiration date of each file—which makes it easy to see if my caching is configured correctly). I can see I'll be using this every single day. One feature that would make it even more useful is a text entry box for pasting code that didn't come from a web page. Thank you!", "stars": 5}, {"date": "Aug 8, 2014", "text": "very nice!!", "stars": 5}, {"date": "May 4, 2014", "text": "Nice, very nice! it looks great on a 23\" screen.", "stars": 5}, {"date": "Apr 24, 2014", "text": "This works great and I like that it defaults to the generated source, after javascript has messed with it. I would like to be able to control the size of the pane with all of the CSS/JS assets though, and a keyboard shortcut would be a good addition as well.", "stars": 4}, {"date": "Feb 11, 2014", "text": "Displays CSS neatly formatted.\nDisplays -current- HTML (Javascript modifications).\nGets inline Javascript from HTML and displays it along with the other scripts.\n\nAmazing. 10 stars.", "stars": 5}, {"date": "Feb 2, 2014", "text": "Doesn't work at all", "stars": 1}, {"date": "Oct 7, 2013", "text": "This is the most awesome developer tools extension so far!", "stars": 5}, {"date": "Sep 25, 2013", "text": "Brilliant - I've been looking for this for years! I code in ASP and so my HTML is wonderfully compact but impossible to debug without first beautifying it. Until now, the only reliable way to do that was to paste it into Dreamweaver and then do Source Formatting (aaaaagh!) . Now I can do it with one click. Thank you very much indeed.", "stars": 5}, {"date": "Jul 28, 2013", "text": "awesome extension and it makes reading code much confortable \nthnx a lot", "stars": 5}, {"date": "May 29, 2013", "text": "Works like a boss. Displays like a pro.", "stars": 5}, {"date": "Oct 26, 2012", "text": "Great! Pretty prints the html source for the page and with this makes the source more comfortable to read.", "stars": 5}, {"date": "Aug 30, 2012", "text": "Amazing plugin! Very handy for developers. Shows all loaded (and injected) css/js and formats and syntax highlights them!", "stars": 5}, {"date": "Jul 27, 2012", "text": "A fun javascript tool for exploration.", "stars": 5}]