[{"text": "Phenomenal!  This extension allowed me to easily download and archive my Pinterest boards.  It does an excellent job of retrieving the original, high quality source image when it is available.", "stars": 5, "date": "Mar 7, 2024"}, {"text": "It works in most of the sites where other add ons can't do the work, but the problem comes to work with Deviantart, because sometimes it can't load the related links, working good just one or two times, and later it needs something random to work.\n\nHope you can fix this issue.", "stars": 4, "date": "Feb 27, 2024"}, {"text": "I've been using this extension and it was working fine, but since yesterday, when I download any image, it doesn't retain the name that I set in \"name template\" and the folder i set in \"base folder\". I'm using Google Chrome and this issue only appears on one of my Chrome profiles. Leaving this aside, the extension is really great and usefull, thanks.", "stars": 4, "date": "Feb 10, 2024"}, {"text": "hope you make a way to fully view a picture that fills the screen, and have an option to put all images on 1 page instead of separating them, either way this extension is really great!! and im thankful for it for how much time this saved me, instead of downloading images individually", "stars": 5, "date": "Dec 26, 2023"}, {"text": "Does this download videos on pixiv? Its great for images but the videos don't seem to work", "stars": 3, "date": "Oct 7, 2023"}, {"text": "Works like a charm!  I love it!!!  Thank you Kelly! :)", "stars": 5, "date": "Jul 22, 2023"}, {"text": "An excellent extention which produces the desired results in even on the sites, which are not the primary targets (e.g. Twitter, DeviantArt, Instagram, etc.) The interface is intuitive and the developer has produce tutorials on the general functionality of the program, specific guides on the intricacies of the most popular sites and a table which quickly summarises the similarities and differences. Thumbs up to the developer: your extension saves a lot of time and is fun to use.", "stars": 5, "date": "Jun 27, 2023"}, {"text": "Best!", "stars": 5, "date": "Jun 23, 2023"}, {"text": "not work.\nPressing record and save only sent me to the SETTING screen.", "stars": 1, "date": "Feb 1, 2023"}, {"text": "Ingenious!", "stars": 5, "date": "Dec 11, 2022"}, {"text": "If you need a image downloader that is specific and has QoL. This is the one. Even has tutorials and videos how to use it. Thank you for this extension!", "stars": 5, "date": "Dec 4, 2022"}, {"text": "Excellent for sites that employ hotlink protection ;-)", "stars": 5, "date": "Nov 3, 2022"}, {"text": "The best extension for image grabbing I've seen so far! \n\nBut it's not your usual press one button and wait extension, you should take your time to explore all the options first and think a bit to get the best result. \n\nAnyway, I like how it's made with such care and attention to the details. So many useful settings and filters to cover all the different situations. \n\nLove it.", "stars": 5, "date": "Oct 30, 2022"}, {"text": "Best universal image/gif/mp4 bulk downloader as long as you see an image/thumbnail that has an album you can download it all and in batch at that, it means multiple album can be downloaded at the same time as long as they are in the same page or thread of a page. A Million thanks for this extension. 🫶🫰", "stars": 5, "date": "Oct 23, 2022"}, {"text": "How can you not luv Kelly.C? She's the !!BOSS!!", "stars": 5, "date": "Oct 1, 2022"}, {"text": "Thank you, Greate job", "stars": 5, "date": "Sep 20, 2022"}, {"text": "Thank you very much. there is finaly someone that made something that works.", "stars": 5, "date": "Sep 12, 2022"}, {"text": "Thank you!", "stars": 5, "date": "Aug 21, 2022"}, {"text": "Very good extension. Very helpful in some conditions. <3", "stars": 5, "date": "Jul 6, 2022"}, {"text": "Great. Thank you", "stars": 5, "date": "Jun 27, 2022"}, {"text": "i tried this  in deviantart, but it only downloads the thumbnails and not the original sized picture. please help.", "stars": 1, "date": "Jun 26, 2022"}, {"text": "Only loads the first 18 images in pinterest. Any workaround?", "stars": 4, "date": "Apr 30, 2022"}, {"text": "Mr.Developer, Thank you!", "stars": 5, "date": "Apr 17, 2022"}, {"text": "i love thissss.. thank youuuuu.. goodluck", "stars": 5, "date": "Jan 21, 2022"}, {"text": "Good Job", "stars": 5, "date": "Feb 26, 2020"}]