[{"text": "The idea of this is great but sadly it doens't work. I had saved a long page and when I went to resume, the extension only worked for one scroll.", "stars": 1, "date": "Dec 10, 2023"}, {"text": "Most underrated and less reviewed extension, that is why I found it after 37 minutes of searching here and there for this exact feature. Go for it, it is working as of now (19 November 2023). Best scroll saver that I found which is really working. Thanks Developers !!", "stars": 5, "date": "Nov 19, 2023"}, {"text": "Just installed and tested it. works as intended. will report back for longer use.", "stars": 5, "date": "Jun 12, 2023"}, {"text": "This plugin is very user-friendly and responsive, but there is one issue (or rather, a suggestion): there is no way to synchronize, meaning that when logged in on different devices, you can only see the locally saved settings and cannot access the settings from other computers.", "stars": 4, "date": "May 14, 2023"}, {"text": "the best i could find right now", "stars": 5, "date": "Apr 26, 2023"}, {"text": "“You must have been in a situation wherein you are reading a long article, but you don't have enough time to finish it, so you close the tab, and the next time you open the article again, you have no idea where you left it.”\n这就是我的诉求啊，感谢~~~", "stars": 5, "date": "Feb 23, 2023"}, {"text": "Save me a lot of time to scroll for our wall screen. Thank you so~~~~~ much", "stars": 5, "date": "Jun 30, 2022"}, {"text": "While this extension is great, it would be brilliant if you could do a quick temp save and retrieve, withing having to name it or save it longer than you are on the page.  I am often researching and need to scroll around long pages.  When I am reading something and I do a Ctrl+F to find something else in the page and then I wanna jump back to where I was.  In these cases, which happen all the time, I don't need to name the scroll position, or even save it longer than I am on the page.  I just... Show more", "stars": 4, "date": "Jun 11, 2022"}, {"text": "great extension, thank you", "stars": 5, "date": "Mar 12, 2022"}, {"text": "Super easy and works a charm. Thank you so much! I have no idea why this is not an official Google feature, it is so handy to have. Life saver thank you", "stars": 5, "date": "Jan 17, 2022"}, {"text": "This is SO fast and efficient that I had to set a pause location because the blog wouldn't load if I went directly to it. (I don't know if that creates a problem for many..  maybe a slow scroll option is needed?)\nI love that it can name and set more than one scroll point.", "stars": 5, "date": "Oct 3, 2021"}, {"text": "Does not work anymore. Previously worked 70% of the time.", "stars": 1, "date": "Sep 30, 2021"}, {"text": "I want to thank the developer for having fixed this extension. Not sure if it was because of my feedback I typed when uninstalling it, but it now works properly on wheeldecide.com , which was the main place where I used this extension.\nThe other extensions aren't as good or reliable, so I'm glad this one exists. Please keep it like this, at least at its core functionality. It works perfectly. Thank you and Great Job!", "stars": 5, "date": "Aug 1, 2021"}, {"text": "Latest update completely broke the extensions. It doesn't fetch the scroll and it breaks the page. Good job!", "stars": 1, "date": "Jun 26, 2021"}, {"text": "It works great and is exactly what I was looking for.\nBut can you make an option so that it doesn't automatically scroll down to a saved point whenever I enter a site, but scrolls only when I click a button?", "stars": 4, "date": "Jun 14, 2021"}, {"text": "Works great as promised (at least as long as the browser window size is the same). Thank you for that! :)\n\nA feature idea from my side would be to save the position of a marked text which was selected before saving the scroll position. Scrolling to and highlighting this textfragment after restoring the tab would be my dream solution.", "stars": 5, "date": "May 4, 2021"}, {"text": "doesnt seem to be working for pdf file", "stars": 1, "date": "Apr 13, 2021"}, {"text": "Works perfect!", "stars": 5, "date": "Apr 10, 2021"}, {"text": "Does what it should!", "stars": 5, "date": "Mar 29, 2021"}, {"text": "Great!", "stars": 5, "date": "Feb 8, 2021"}, {"text": "Works for me ; well done ; yet I would like to navigate from tab to tab#myscroll (not only navigate inside single page). Thank you.", "stars": 4, "date": "Oct 16, 2020"}, {"text": "Was trying to find an extension that does exactly this, great app.", "stars": 5, "date": "Mar 12, 2020"}, {"text": "The only extension of its kind that does what it says and just works.\n\nNever mind the top-placing review by Aliez. I tend towards as simple as possible... but the way this extension is set up is fantastic.\n\nA feature request: I set up a Chrome keyboard shortcut to activate the extension... and to keep it mouse-free, it'd be great once the extension is activated to be able to hit \"F\", \"U\" or \"D\" to select one of the 3 options.", "stars": 5, "date": "Mar 5, 2020"}, {"text": "Great extension, works as advertised. Have tried a few similar extensions and this one finally works very smoothly. Great work. Only suggestion (if it's still possible): the name is pretty difficult to google, the SEO makes it impossible to find. Only stumbled upon this extension via producthunt", "stars": 5, "date": "Feb 20, 2020"}, {"text": "It works fine. But I think there can be improvement in user experience.\n\n1. I don't need fetch\\update options. Just an icon to make users know that current page's scroll position has been saved is enough.\n2. Auto remember position is better so that users don't need to click save button. Besides, some people may forget to click that button.\n3. I think the page showing users' saved scroll bookmarks is redundant. This extension aims at remembering page scroll position, not saving bookmarks for u... Show more", "stars": 3, "date": "Nov 21, 2019"}, {"text": "This extension works fine, and is as user friendly as it can be, with the limited storage space Google offers for scroll bookmarks. rated 2 star, because I saw it advertised on other people's scroll bookmarker extensions, with a referral link.", "stars": 2, "date": "Nov 13, 2019"}, {"text": "I have tried many other similar extensions previously but believe me when I say that, this is the only extension that works.", "stars": 5, "date": "Oct 26, 2019"}, {"text": "Awesome extension! Comes in handy a lot of times when you cannot finish an article.", "stars": 5, "date": "Oct 24, 2019"}, {"text": "Works no better than the other extension I tried. Scrolls down a little bit, but nowhere near the point that I saved.", "stars": 1, "date": "Oct 21, 2019"}]