[{"date": "Dec 16, 2023", "text": "Can you add German to english please like someone learning german would really be helpful", "stars": 5}, {"date": "Oct 5, 2023", "text": "i can only use Collins dictionary, when i click on a word using other dictionaries like Cambridge or Oxford, it doesnt work. Could you fix it please", "stars": 3}, {"date": "Jul 5, 2022", "text": "I could use it yesterday but it doesn't work today although my anki was connected.", "stars": 5}, {"date": "Jan 19, 2022", "text": "This is a really handy extension, especially for writers. However, it could be improved with a close down function for when the dialogue box pops up as sometimes it's not needed when the word highlighted is being sectioned for replacement. There is currently no way to close the dialogue box down other than clicking off the word. Could you please work this option into an update? Otherwise, good work. Thank you.", "stars": 4}, {"date": "Dec 2, 2021", "text": "nice", "stars": 5}, {"date": "Nov 6, 2021", "text": "Exceptionally good!\nThat's what I've searched for. Some included dicts (as scripts) are already offline, hope that author won't quit updating his great addon.\n\nDear Huang, please could you add the Chinese-English script for YouDao dictionary? YouDao is bidirectional AFAIK and as a truly concise dict is perfect for Anki card creation, too", "stars": 5}, {"date": "Jun 12, 2021", "text": "It worked fine at the first time. But then when I restart my computer, the pop-up does not show up anymore and I don't know how to fix this. I just tried to reinstall it and it was working fine until the next time I accessed to my computer. Pls help me!", "stars": 3}, {"date": "Feb 10, 2021", "text": "it works again xie xie ni :>", "stars": 5}, {"date": "Feb 4, 2021", "text": "It constantly keeps autohighlighting things and thus deleting what I'm typing in fields. No fun...", "stars": 2}, {"date": "Aug 21, 2020", "text": "Had problems adding vocab at first but now it works great! Thx for this amazing addon!", "stars": 5}, {"date": "Aug 20, 2020", "text": "When I use Oxford EN->CN Dictionary, its audio isn't work.", "stars": 3}, {"date": "Aug 10, 2020", "text": "Even Though the app connected successfully to my Ankiconnect, it failed to add flashcard. Don't know how or what wrong happened. Please, fix it", "stars": 3}, {"date": "Mar 29, 2020", "text": "It does not work", "stars": 1}, {"date": "Mar 27, 2020", "text": "nice ^^", "stars": 5}, {"date": "Mar 12, 2020", "text": "5 star", "stars": 5}, {"date": "Feb 14, 2020", "text": "Excellent work, an immensely helpful extention! I have been using the other similar extention wrote by the same author for about two years and collected over 5000 thousands words and phrases. My vocabulary size grew from 4560 (http://testyourvocab.com/result?user=7684985) to 10600 (http://testyourvocab.com/result?user=13145716) after these two years of daily flashcard review (200 per day). Now I switch to this wonderful new extention and will keep on ratchetting up my vocabulary size as well ... Show more", "stars": 5}, {"date": "Feb 6, 2020", "text": "Good, very helpful for lean eng with IPA", "stars": 5}, {"date": "Dec 19, 2019", "text": "Thank for creating a great addons. It helps me add my new words to anki. Thank you.", "stars": 5}, {"date": "Nov 14, 2019", "text": "This extension doesn't work out for me. I can't connect to Anki anymore. I have used this extension for a month and everything was extremely fantastic. But yesterday there was something wrong with it and i cant use it anymore. Can you fix it?", "stars": 4}, {"date": "Sep 3, 2019", "text": "I use chrome with windows and I can't access the options to proceed the installation with Anki. When I click on Quick Options, a new tab appears leading to the chrome online store. Please guide me how to solve it.", "stars": 4}, {"date": "May 5, 2019", "text": "Can you add the support of Google play books?", "stars": 4}, {"date": "Apr 29, 2019", "text": "nice work! thanks man!", "stars": 5}, {"date": "Apr 2, 2019", "text": "Amazing thanks for your amazing works!", "stars": 5}, {"date": "Feb 9, 2019", "text": "It's simply the best app out there to boost your productivity with Anki, I use it everyday and love it. Thanks a lot to Huang Zhenyu: you save me hours and hours of agony :)", "stars": 5}, {"date": "Dec 3, 2018", "text": "This extension is exactly what I'm looking for. There is just one thing I can't seem to overcome. I've chosen to use an online dictionary. I cannot add words to Anki, however, when I choose an online dictionary. When I switch back to a built-in one, the word gets saved without any hassle. Please tell me what I'm doing wrong. Thank you very much for your time.\nUPDATE: No, I've noticed that's not the case. Some words just don't get saved. Can you kindly let me know what are the causes behind th... Show more", "stars": 5}, {"date": "Oct 2, 2018", "text": "Fantastic extension. The only issue is that it shows Chinese text at the end of the definition. It's a bit annoying because it ends up in my Anki decks. Other that it's amazing. I hope the Anki developer won't ban my account for using this extension. I bought two iPhone apps apps just to support his efforts.", "stars": 5}, {"date": "Jul 14, 2018", "text": "Good product～", "stars": 5}, {"date": "Jul 2, 2018", "text": "good work\n\nHope somebody can find time to translate your website in English seems you have more going on there;)", "stars": 5}, {"date": "Jun 21, 2018", "text": "Awesome, however HotKey doesn't work at all.\nEven I set up as Shift + double click, the definition popup apprea on all key like Alt+double click, Ctl+double click and just plain double click.\nWould you fix this issue?\nThanks. :)", "stars": 4}, {"date": "Apr 21, 2018", "text": "Thanks!", "stars": 5}]