[{"stars": 5, "text": "Please can you make it work on feedly and inoreader? Thanks", "date": "Mar 3, 2024"}, {"stars": 4, "text": "It would be great if it were possible to open instagram/facebook/tiktok images from google images, without the need to open them. I don't know why these never work.", "date": "Mar 1, 2024"}, {"stars": 5, "text": "Works perfectly, I love being able to blow up images just by hovering over them. It even has keybinds to do stuff such as move through a gallery or directly save an image. This thing is awesome", "date": "Feb 27, 2024"}, {"stars": 2, "text": "it doesnt work on click option on vivaldi browser", "date": "Feb 26, 2024"}, {"stars": 2, "text": "Could've swore it was working few days ago on reddit but for whatever reason it has now stopped working on the sh.reddit.com (newest version of reddit)", "date": "Feb 16, 2024"}, {"stars": 5, "text": "It works almost everywhere, but can you please make it work on raindrop.io? Thanks", "date": "Feb 10, 2024"}, {"stars": 4, "text": "Please just add one feature to zoom pix on the spot when in hover mode by pressing Shift Key + scroll wheel", "date": "Feb 10, 2024"}, {"stars": 2, "text": "Google images - sometimes works, most times doesn't work. Clicking empty space 'to wake' sometimes works, most times doesn't work. When it doesn't work 'action keys' don't work. In the end, to stop this nonsense, I just click on the image to open.", "date": "Feb 9, 2024"}, {"stars": 4, "text": "It took some manual QA (disabling every extension one-by-one, testing, re-enabling), but I figured out this extension was causing **ChatGPT** (https://chat.openai.com/) to freeze when uploading one or more images/screenshots. Fortunately, you can configure the extension to not load on specific websites, which solved the issue for me.\n\nHope this helps someone else!", "date": "Feb 9, 2024"}, {"stars": 1, "text": "When will this extension fix the issue of laggy scrolling on Facebook website?", "date": "Feb 8, 2024"}, {"stars": 2, "text": "This plugin breaks multiple sites. I've noticed that the referrer is set as instagram and it breaks websites that have cloudflare hotlinking protection installed.", "date": "Feb 7, 2024"}, {"stars": 5, "text": "this addon brokes kick com logins, keeps logs out of that site, whenever i uninstall this addon, problem gets fixed, could you please fix this?", "date": "Feb 2, 2024"}, {"stars": 3, "text": "I am having to turn it off for some sites, (facebook and games are the worst performers when this is enabled) and then back on again after I leave them. I  wish that you'd let us whitelist some sites in chrome like you do in mozilla.", "date": "Jan 18, 2024"}, {"stars": 3, "text": "Frustratingly I love this extension, but after months of problems with Facebook freezing and hanging literally any time I was on it, I did some extension research (turning all off and on one by one) and learnt that this one was causing the FB hanging. No idea what to do other than turn it off permanently.", "date": "Jan 16, 2024"}, {"stars": 4, "text": "Why it opens the image url in a previous tab? can't just open next to the tab? can you fix that please?", "date": "Jan 16, 2024"}, {"stars": 4, "text": "I don't know how it does view the high quality version of the images when the previews are low resolution, but could you add an option to also replace all the low resolution previews to the original images? \n\ncause I use another extension to save images, and I have to open the images every time, that would be really useful", "date": "Jan 13, 2024"}, {"stars": 1, "text": "After disbling add-ons one by one, I found this one causes facebook hung and lag", "date": "Jan 11, 2024"}, {"stars": 1, "text": "I USED TO LOVE THIS TBF wrote review on other acc praising but on this computer i have which is good speed 16gb ram, good amd cpu, it was always jittery and laggy scrolling ON CHROMEE.. tried all these angle grpahics backened to d3d9 or d3d11, smooth scorllin' buut naa then started turning off extensions and this was the culprit. AH! SO GUYS JUST AVOID IT IF U GETTING LAG N SHI", "date": "Jan 4, 2024"}, {"stars": 1, "text": "Amazing and deserves 5 stars, but unfortunately give 1 to let developers know that lately I don't know why the extension is causing as conflict with WhatsApp Web making it very slow, and I had to turn off the Hover Zoom+ extension to have the whatsapp video, images load speed and so on working normal again. What a pity, because I love this extension. Not getting to sign to GItHub to send it there.", "date": "Jan 3, 2024"}, {"stars": 5, "text": "Undoubtedly a top player in the plugin market. It only falls short of perfection due to the lack of a feature to back up settings. If that feature is added, it will be flawless. Thank you", "date": "Dec 25, 2023"}, {"stars": 3, "text": "Wish it would work in NetSuite or other CRM web apps, can not get any links to load there. Otherwise it seems to work great for google and other places I have tried.", "date": "Dec 19, 2023"}, {"stars": 3, "text": "Is the Chrome version supposed to work with MS Edge? I just installed it and tried it on library pages of Last.fm, but it doesn't do anything.", "date": "Dec 4, 2023"}, {"stars": 4, "text": "basically works ok but i would like to see any option to disable zooming of already images that are bigger than XY pixels so it wont zoom in every situation", "date": "Nov 24, 2023"}, {"stars": 5, "text": "It is a great extension, but it no longer works on google images... why?", "date": "Nov 3, 2023"}, {"stars": 2, "text": "Will not work with kick.com, I have to install and uninstall it multiple times a day and it's frustrating!", "date": "Nov 1, 2023"}, {"stars": 4, "text": "It works well on many many sites but it doesn't work on google photos. Please can you make it work?", "date": "Oct 27, 2023"}, {"stars": 5, "text": "1. I usually find myself too lazy to write reviews on Chrome extensions, but my personal rating for this plugin goes through the goddamn roof!  2. You really need to familiarize yourself with all the options to get the best out of it.", "date": "Oct 25, 2023"}, {"stars": 5, "text": "hey what is up my bro i just wanna come & wish You & the Family a Good & Happy time of day & add friends in this mix aswel im a big fan of this add on its concept is just very very very good cuz it helps any1 with a bad vision to fully see / View what so ever an individual might wanna see old ppl and such especially so there is no way i could ever thank you Enough for comming up with such extension which helps any 1 who may need it cuz alota ppl needs it i will say however as all things in Li... Show more", "date": "Oct 11, 2023"}, {"stars": 3, "text": "Not very reliable when dealing with imgur albums on Reddit. You'd be lucky if you could scroll to more than two images.", "date": "Oct 10, 2023"}, {"stars": 4, "text": "Good but why it never work with videos?", "date": "Oct 7, 2023"}, {"stars": 4, "text": "Love the extension but can you please add support for dropbox links?", "date": "Sep 8, 2023"}, {"stars": 5, "text": "best extension on the store. unfortunately i can't skip ahead in videos with mousewheel anymore, or arrow keys. not sure why", "date": "Sep 3, 2023"}, {"stars": 1, "text": "Name is grossly misleading. It's not zooming, it just shows the image in real size. Zoom means 101% or more. On a site that has small 100% images, this is useless.", "date": "Aug 31, 2023"}, {"stars": 5, "text": "Must-have!", "date": "Aug 11, 2023"}, {"stars": 5, "text": "An absolute essential extension for someone who browses a lot of art on the internet. Occasionally/on certain websites, the hotkeys might not work as intended but it's a minor inconvenience. it works well on most sites.", "date": "Aug 4, 2023"}, {"stars": 2, "text": "none of the hotkeys work", "date": "Jul 25, 2023"}, {"stars": 4, "text": "Its really good extn.. But last few days album support is not working.. Have tried remove and add extn .. clear cache and cookies.. But no luck..", "date": "Jul 3, 2023"}, {"stars": 5, "text": "Love it since years! \nJust hope to see the `hover` support for Dribbble.com someday.", "date": "Jun 29, 2023"}, {"stars": 4, "text": "I have the \"use mousewheel to navigate albums\" checked but everytime I try to scroll through an album, the scroll wheel just moves the webpage. This obviously causes the webpage to move and you lose the image zoom. Any fixes for this?", "date": "Jun 23, 2023"}, {"stars": 3, "text": "this extension really sus, it make my youtube slower down by run something", "date": "Jun 21, 2023"}, {"stars": 3, "text": "as answer that is repeating, and first it is not working, second, there is not a option \" \"Allow downloading images using an action key\"\".", "date": "Jun 14, 2023"}, {"stars": 3, "text": "Reddit videos not playing just image and gif works why? anyone help out", "date": "Jun 8, 2023"}, {"stars": 3, "text": "hover zoom plus causes 404 bad request error on kick.com\n\nI can't explain why it happens, but specifically on chromium browsers, in particular with brave browser, kick.com eventually produces a 404/400 bad request error, and can't reload the site/pages, and basically makes the streaming site unusable. \n\nonce i deactivate hz+, website functionality is restored. and sadly, this started happening within the last 2 months or so. prior to that, kick.com worked fine with hz+ active. \n\nplease advise... Show more", "date": "May 31, 2023"}, {"stars": 2, "text": "It dosen't work Facebook anymore. Only reason i think it's useful is Twitter.", "date": "May 31, 2023"}, {"stars": 1, "text": "Don't work social media and any downloads!", "date": "May 27, 2023"}, {"stars": 4, "text": "Love it! It works on almost every site. Sometimes it doesn't work & I have to refresh the page from time to time. I'm glad I found this. Wish I found it sooner.", "date": "May 23, 2023"}, {"stars": 1, "text": "doesnt work", "date": "May 11, 2023"}, {"stars": 3, "text": "Hello Hover+ team, I have been having trouble downloading images using the 'S' feature that I was previously able to use. I am currently unable to use this feature. Can you please let me know when this issue will be fixed?", "date": "Apr 21, 2023"}, {"stars": 5, "text": "The extension is working again! Thanks for fixing the bug devs! \n\nNow all you have to do save the zoomed images is  to re-enable it on settings.\n\nJust go to the extension option page, click on the \"Advanced\" tab, and enable the first option \"Allow downloading images using an action key\".", "date": "Apr 20, 2023"}, {"stars": 4, "text": "file extension is gone. the file is save with no extension.", "date": "Apr 2, 2023"}, {"stars": 5, "text": "Working good! Thanks!", "date": "Mar 9, 2023"}, {"stars": 1, "text": "Videos will play when hovered over, but lack sound. This is with sound turned on and at 100% volume. This happens with any video link on old.reddit, not just stuff hosted on their CDN. Gyfcat vids, streamable vids, even youtube videos will just play the video without audio. This is only happening on old.reddit, and nowhere else.", "date": "Feb 5, 2023"}, {"stars": 5, "text": "Amazing extension that I've used for years. The only problem is it seems to have issues with Ecosia", "date": "Dec 16, 2022"}, {"stars": 1, "text": "Not working on ebay.co.uk ..", "date": "Dec 14, 2022"}, {"stars": 3, "text": "For ages it worked all over the internet, but it has stopped working on eBay search returns. Devs, please take pity on all the long-sighted folks who rely on it.", "date": "Dec 6, 2022"}, {"stars": 5, "text": "GOOD", "date": "Nov 23, 2022"}, {"stars": 5, "text": "it's a great extension but it couldn't work on facebook now.\nI would be grateful if you guys fix it up\n\n2023/5/12\nstill a great extension.\nbut \"press s to save image\" is not working now", "date": "Oct 27, 2022"}, {"stars": 1, "text": "Does not zoom on Instagram. Issue was reported years ago and devs REFUSE to fix it? You can manually get larger instagram photos, so there is no reason this should not be able to work.", "date": "Oct 6, 2022"}, {"stars": 4, "text": "Great extension, it was beneficial for me.", "date": "Sep 26, 2022"}, {"stars": 4, "text": "I've loved this extension for years! But, I've discovered it's messing with TikTok by preventing me from commenting or liking comments. Hopefully, someone can figure out what's happening and fix this. 😥", "date": "Sep 25, 2022"}, {"stars": 3, "text": "used to work almost on all websites, now i don't think it is anymore", "date": "Sep 5, 2022"}, {"stars": 2, "text": "Thank you, but unfortunately it was causing me problems on some sites.. For example when I used it on Facebook for mobile m.facebook.com and when I entered the list of friend requests, it started sending friend requests unreasonably.. which made me not trust this extension.. What is the developer’s response So, I will adjust my review when this issue is resolved.", "date": "Aug 30, 2022"}, {"stars": 5, "text": "Working really well...", "date": "Aug 18, 2022"}, {"stars": 3, "text": "Not working in Google Sheets", "date": "Aug 17, 2022"}, {"stars": 5, "text": "Best extension i ever experianced for chrome closure.", "date": "Aug 10, 2022"}, {"stars": 5, "text": "It a good extension, to use for images and video. Pl. make he video popup should be the screen aspect size or customizable. .", "date": "Aug 10, 2022"}, {"stars": 5, "text": "LOVE", "date": "Aug 6, 2022"}, {"stars": 2, "text": "Doesn't work with instagram.", "date": "Aug 2, 2022"}, {"stars": 5, "text": "Good Extension,\n\nPlease Add image Downloader inbuild this. would be amazing .", "date": "Jul 20, 2022"}, {"stars": 4, "text": "So far, the only gripe I have is that it on Twitch, even with adblock running, it still shows ads if you're hovering over a channel/stream. I looked through the options but didn't see anything that would help with this issue.", "date": "Jul 17, 2022"}, {"stars": 4, "text": "Decent, but could be better. Activating full zoom doesn't seem to work regardless of what option I select. The image just stays as is and can't become static so that I can copy-paste it for use elsewhere.", "date": "Jul 16, 2022"}, {"stars": 5, "text": "14/7/2022 the best extention for hover zoom images. and imagus is the most stupid extention", "date": "Jul 14, 2022"}, {"stars": 2, "text": "Extensions now tries to download the same image 3-17 times when using the shortcut key. Have tried it on multiple keys and reset settings. Issue's get worse as time goes on with this app unfortunately.", "date": "Jul 4, 2022"}, {"stars": 3, "text": "It has its issues, but I prefer it over Imagus.\n\nAt least I did.  Last update has broken HoverZoom+, and isn't working on links anymore.", "date": "Jun 29, 2022"}, {"stars": 2, "text": "if an Instagram post has multiple images, it only \"hover zooms\" the very first image.", "date": "Jun 11, 2022"}, {"stars": 5, "text": "I ve used this plug-in for a long time and it is just amazing and convenient.\nBut I recently found something strange which is a sentence \"click anywhere on the page to activate action keys\" randomly shown up on the picture zoomed. I ve no idea what it is even if it's caused by the plug-in. I am just curious is there some kind of harming computer stuff or else in the plug-in?", "date": "Jun 8, 2022"}, {"stars": 5, "text": "Amazing👌", "date": "May 25, 2022"}, {"stars": 3, "text": "The extension no longer works on links from reddit gifs and videos, and I go on that site a lot from my pc.", "date": "Apr 27, 2022"}, {"stars": 3, "text": "please zoom on face and insta profile pic like other extension imagus", "date": "Mar 27, 2022"}, {"stars": 5, "text": "a great extension i highly recommended", "date": "Mar 8, 2022"}, {"stars": 5, "text": "I've been using this extension for years in all of my (chrome based) browsers, it has never let me down 👍", "date": "Mar 7, 2022"}, {"stars": 2, "text": "hotkeys only allow you to hold a key to activate/deactivate. there's no option to press or toggle.", "date": "Feb 13, 2022"}, {"stars": 1, "text": "I installed it for reddit and it not work there at all.", "date": "Feb 10, 2022"}, {"stars": 4, "text": "I think add the download image from zoomed image would be perfect", "date": "Jan 13, 2022"}, {"stars": 5, "text": "I usually do not rate extensions, but this one is by far the best extension i have installed, previews gifs and imgur image almost everything. 5/5 stars easily!", "date": "Jan 10, 2022"}, {"stars": 5, "text": "Just a fantastic extension", "date": "Dec 21, 2021"}, {"stars": 3, "text": "Works pretty well, although lots of ads appear suddenly on Google.", "date": "Dec 19, 2021"}, {"stars": 1, "text": "many website doesn't work", "date": "Dec 19, 2021"}, {"stars": 5, "text": "onm this perfect tho", "date": "Dec 10, 2021"}, {"stars": 5, "text": "yo bro beast app ever used", "date": "Dec 7, 2021"}, {"stars": 1, "text": "Doesn't work.", "date": "Nov 27, 2021"}, {"stars": 3, "text": "Very useful tool in theory but doesn't work half - if not majority of the time.", "date": "Nov 7, 2021"}, {"stars": 5, "text": "It was (some time since the penultimate update it had stopped working) and after the latest update luckily again is one of the most useful extensions out there. Just don't be lazy to adjust the settings to your needs.", "date": "Oct 28, 2021"}, {"stars": 4, "text": "How can I export/import extension settings?", "date": "Oct 22, 2021"}, {"stars": 5, "text": "Awesome!", "date": "Oct 17, 2021"}, {"stars": 5, "text": "A pity Chrome excluded it ! Am using other apps.", "date": "Oct 7, 2021"}, {"stars": 5, "text": "Very thankful the whole spyware/malware situation was rectified, and it's nice to see HZ+ is open-source. I'm now back to using HZ+ after using Imagus since 2013, which has not been updated for a while now.\n\nThanks to everyone's efforts for this extension, much appreciated.", "date": "Sep 27, 2021"}, {"stars": 4, "text": "Please add an option to backup extension settings", "date": "Aug 21, 2021"}, {"stars": 5, "text": "The most useful extension in my browser. made my life so easy. Thanks Oleg Anashkin", "date": "Aug 10, 2021"}, {"stars": 4, "text": "Bugs here and there but I have yet to find something better. Solid extension thank you", "date": "Jul 30, 2021"}, {"stars": 4, "text": "been using this extension for years, love it and am lost using computers without it.\nThat being said I wish it remembered where you last saved to.  Hate having to navigate back to the same folder every single time.", "date": "Jul 11, 2021"}, {"stars": 5, "text": "Great extension, absolutely essential. The only issue I find nowadays is more a problem with Google themselves: since extensions aren't \"allowed\" to save to directories other than the default Downloads, the extension no longer saves to the directory I'd previously saved to. Any way to edit this without Google's stupidity?\nTo clarify: If I saved something to \"C:\\Media\", the next file saved would default to that directory, instead of resetting to Downloads. Any way to restore the previous funct... Show more", "date": "Jul 8, 2021"}, {"stars": 1, "text": "extension not working properly as most photos on facebook doesn't zoom at all", "date": "May 29, 2021"}, {"stars": 3, "text": "If there's an option to mute videos, I can't find it. It would be nice. Also some images just show regular or thumbnail size, not full size.", "date": "May 27, 2021"}, {"stars": 5, "text": "great extension no complaints!", "date": "May 21, 2021"}, {"stars": 5, "text": "I LOVE this extension. I JUST found out how to hide the giant block of text covering each picture when you hover. \nYOU PRESS THE \"/?\" key on your keyboard.\nI was going to manipulate this extension until I found that out", "date": "May 15, 2021"}, {"stars": 5, "text": "Loved it and it is very useful, I think there should be some more updates for extension.\n\nThe extension is not working on google sheets images.\n\nPlease look into it and let me know your feedback", "date": "May 4, 2021"}, {"stars": 1, "text": "Doesn't work.", "date": "May 2, 2021"}, {"stars": 2, "text": "Does Not work", "date": "Apr 22, 2021"}, {"stars": 3, "text": "not active all with fb", "date": "Mar 26, 2021"}, {"stars": 5, "text": "It stopped working on facebook. tried with two different browsers, reinstalled the extension.\nedit: it works now\n\nedit: I noticed it also doesn't work on reddit (hoverzoom.js:875 [HoverZoom] Failed to load image: https://preview.redd.it/2pltp9v0a6r61.jpg). it works if I open an image, not in the timeline.", "date": "Mar 25, 2021"}, {"stars": 2, "text": "It's nice and all but like 80% of media on any website just doesn't work like it did before, shame.", "date": "Mar 24, 2021"}, {"stars": 3, "text": "I've had this extension for years, and it works for the most part.  However, recently it has stopped working on Facebook.  I have refreshed my FB pages numerous times over the last few days and it still doesn't work.  Is there a way to fix this?", "date": "Mar 17, 2021"}, {"stars": 5, "text": "This is the best one.", "date": "Mar 11, 2021"}, {"stars": 2, "text": "So, I tried Hover Zoom+ out on Chrome: it won't display a popup when hovering over images on the front page of ArtStation as well as in artists' galleries! When using Imagus on this site, enlarged images pop up right away!", "date": "Feb 28, 2021"}, {"stars": 5, "text": "The best add-on for preview..", "date": "Feb 24, 2021"}, {"stars": 3, "text": "Use - Imagus extensions - for images and video mp4 - in Instagram)", "date": "Feb 14, 2021"}, {"stars": 4, "text": "Would be very helpful and convenient if you could add support for other file types when hovering over videos like M4V, MOV, AVI, etc", "date": "Jan 31, 2021"}, {"stars": 5, "text": "fantastic extension\nbeen using this for a few years and thought I'd add my praise\nthank you so much", "date": "Jan 3, 2021"}, {"stars": 4, "text": "Had an issue zooming images on Pinterest but seems to be working again. So far so good.", "date": "Dec 29, 2020"}, {"stars": 5, "text": "It's a great addition, helps keep me from opening hundreds of tabs to see an image without losing my place while browsing. In fact, I've been using it for years now and can't picture surfing the internet without it. My only complaint is that when images with long captions/descriptions are displayed, it only shows two lines before just abruptly stopping. I don't know if I'm just missing something, but when I look at the options there isn't a choice to expand the caption.", "date": "Dec 21, 2020"}, {"stars": 5, "text": "Love it!", "date": "Dec 15, 2020"}, {"stars": 5, "text": "Not working right on Reddit. On a fresh page reload, it works, but it seems that if you click on a post and leave a comment, it stops working for other posts until you refresh the page again.\n\nOtherwise, it's great.", "date": "Oct 18, 2020"}, {"stars": 3, "text": "please update for new UI facebook 2020", "date": "Oct 15, 2020"}, {"stars": 3, "text": "It's a good extension.\nBut Hover zoom is not working on Facebook.", "date": "Oct 13, 2020"}, {"stars": 3, "text": "Please add New animations and new faster load using cloudflare DNS and speed up things using cache..", "date": "Oct 4, 2020"}, {"stars": 5, "text": "This extension is one of about 6 that I deem must haves. When I'm not utilizing VMs to provide a sort of poor-man's sandbox for my activities, the next best solution is utilizing many browsers and segmenting your day to day activity; banking = browser A. Social = browser B. etc, etc. I only mention this because every time, regardless of that browser's designated purpose, HoverZoom+ gets DL'd within the first 10 min. Every time. For well over half a decade now. The upkeep is truly impressive(y... Show more", "date": "Sep 30, 2020"}, {"stars": 3, "text": "How to use with facebook?", "date": "Sep 29, 2020"}, {"stars": 5, "text": "A great extension! Makes the browsing experience so much more fluid. Thanks a lot.", "date": "Sep 14, 2020"}, {"stars": 5, "text": "I think i use this in 2014ish, amaze me that this app still got an update", "date": "Sep 11, 2020"}, {"stars": 5, "text": "What a great app! I use it every day throughout the day on both my PC and my Chromebox. #2ThumbsUp!", "date": "Sep 10, 2020"}, {"stars": 5, "text": "thanks man let me get hover of mine own property .comon man iam a good man just trying to get his Right which is legally accepted and religiuosly and logically and humanARY and Animally even accepted", "date": "Sep 7, 2020"}, {"stars": 3, "text": "The very best extension... but no longer?  For the past few months this hasn't worked in Google Images or Facebook, and neither on many other sites. Once upon a time: it was perfect. OPEN SOURCE FTW", "date": "Aug 30, 2020"}, {"stars": 2, "text": "was using it perfect until new fb interface in 2020 and old interface will closed n next month, anyone can fixed it ?", "date": "Aug 29, 2020"}, {"stars": 3, "text": "needs an update with the new Facebook UI", "date": "Aug 25, 2020"}, {"stars": 1, "text": "I've been using this for months, but I recently noticed that when accessing Amazon, i was constantly being redirected to a deals page, always with an amazon affiliates tag now in the site URL (guitacom20) -- I basically disabled my extensions one by one, and worked out that when this extension was disabled, I no longer suffered the problem.\n\nSo I don't conclusively know whether this extension contains malware, but it seems possible for sure and I will no longer be using it.", "date": "Jul 20, 2020"}, {"stars": 5, "text": "been using this extension for years now. Is there any chance for https://safebooru.org/ to be added in the plugin list?", "date": "Jul 18, 2020"}, {"stars": 3, "text": "It doesn't work with Instagram website.", "date": "Jul 16, 2020"}, {"stars": 3, "text": "Works only on a limited number of sites, and even then on a limited number of images on those sites. It doesn't work at all on the NY Times or Washington Post, and only rarely on Amazon. Does not seem to work on Reddit.  I tested these sites on 7/10/2020, Linux, Chrome Version 83.0.4103.116 (Official Build) (64-bit).", "date": "Jul 10, 2020"}, {"stars": 1, "text": "In Instagram page its not working Is there any remedy with you", "date": "Jul 4, 2020"}, {"stars": 1, "text": "Half the pictures and photo's simply refuse to show.", "date": "Jul 3, 2020"}, {"stars": 4, "text": "Great functionality, unfortunately I wanted it to work with google sheets and it didn't 😢", "date": "Jun 28, 2020"}, {"stars": 5, "text": "good", "date": "Apr 11, 2020"}, {"stars": 3, "text": "Used to work well on most sites but it seems that as of 1st April 2020, this is no longer working on many sites like it used to including Tumblr and Discord, and will only work on Google images if you have already clicked on an image but won't on others that you haven't clicked on. Only days ago it was working on these sites as normal (although at present is still working ok on Deviantart). Would be nice if this was fixed as it was a decent app/extension.", "date": "Apr 2, 2020"}, {"stars": 2, "text": "no longer works...so disappointing...I used it constantly", "date": "Mar 23, 2020"}, {"stars": 2, "text": "All I can say is that sometimes it works and sometimes it doesn't. I've been using it for years and I don't recall any issues with it at all when I first started using it. It played videos and always zoomed, at least as far as I remember. I've noticed that within the last year or so though, it's started to decline in practicality, but today I decided to finally mark this extension as probably dying. Many of the images I try to expand won't load for whatever reason, whether it's on reddit, fac... Show more", "date": "Mar 17, 2020"}, {"stars": 5, "text": "An absolute life saver. Opens pictures from unembeded imgur links for example, and occasionally shows a larger version of the pictures in google image search, than what the search page itself would show. The only minus i could think of is that it doesn't show the pictures from unembeded instagram links anymore, like it used to. But i guess that isn't the extensions fault.\n\nOverall very good.", "date": "Mar 13, 2020"}, {"stars": 3, "text": "Was a very good app but on my chrome browser it has stopped working.  I have the latest windows 10 installed and the top of the line pc.  not sure why it stopped working.  Wish it could be fixed.  Tried going to multiple websites and it no longer zooms when I hover over an image like it used to.  Fix the extension or remove it from the chrome store.", "date": "Mar 7, 2020"}, {"stars": 1, "text": "No longer working on Google images. :-(", "date": "Feb 29, 2020"}, {"stars": 3, "text": "No longer working on Google images for me. I hover, but nothing pops up. it's still working on other websites, so I don't know what's wrong. Don't know if this will be a problem for others.", "date": "Feb 27, 2020"}, {"stars": 5, "text": "Ok", "date": "Feb 21, 2020"}, {"stars": 3, "text": "It seems to have always been spotty (didn't work on all pictures in Google Image search, but now doesn't work at all", "date": "Feb 16, 2020"}, {"stars": 2, "text": "Today I went to use it and it doesn't work anymore. I don't know why or what happened, but no more zoom. :(", "date": "Feb 11, 2020"}, {"stars": 4, "text": "January 2020. Stopped working on google.com. Otherwise great", "date": "Jan 31, 2020"}, {"stars": 2, "text": "This is normally a 5-star extension.  However, sometime in the last week (approximately, \"or roughly \"early January 2020\") it's stopped working across all my machines.", "date": "Jan 13, 2020"}, {"stars": 5, "text": "Works on Facebook, which is what I needed! Thank you!", "date": "Jan 1, 2020"}, {"stars": 1, "text": "This used to actually play YouTube videos while hovering over them. You still have the video settings in Options/General. Something is broken here. Then you make someone sign up for a Github account when they have \"questions, suggestions, or problems\" in the support tab? Jeez Oleg, how about an explanation?", "date": "Dec 16, 2019"}, {"stars": 5, "text": "Been using this for a long time already, super useful! However as of now, Dec 10 2019, the extension is not working on google images. You need to click on the image and then the extension will acknowledge the picture as something to zoom in on. Hope this gets fixed soon! Super loving this extension!", "date": "Dec 10, 2019"}, {"stars": 1, "text": "Dont work anymore basically useless", "date": "Dec 8, 2019"}, {"stars": 2, "text": "This used to work well, but especially on reddit as another user said it increasingly doesn't f'n work! I have to find an extension that actually DOES what it says, which this does not. If you want a hover zoom look elsewhere.", "date": "Dec 4, 2019"}, {"stars": 4, "text": "It's the best pictures zoomer, but it could be nice if it could zoom on the pictures\n\n1. In Youtube Comment + to zoom on the video thumbnails in Youtube.\n2. In Messenger.", "date": "Nov 16, 2019"}, {"stars": 4, "text": "it will be amazing if I chose default default saving location in addition to shortcut for save as option to chose saving location and make it as defult", "date": "Nov 6, 2019"}, {"stars": 3, "text": "No longer working for google", "date": "Oct 30, 2019"}, {"stars": 2, "text": "It no longer works in chrome.", "date": "Oct 26, 2019"}, {"stars": 4, "text": "No longer working for google images.", "date": "Oct 25, 2019"}, {"stars": 5, "text": "I love it and use it constantly. Have had it for years.", "date": "Oct 23, 2019"}, {"stars": 1, "text": "I only gave 1 star as it doesn't work?? i've used this for years (well, i think this one?) but as of today updated my win 7 from 32bit to 64 bit...Chrome and all my bookmarks and all extensions came, but this, so i re added it..but no joy?? any help as i used to find it invaluable.", "date": "Oct 11, 2019"}, {"stars": 5, "text": "One of the best for pinterest, use with save image makes it even good", "date": "Oct 7, 2019"}, {"stars": 3, "text": "I have used Hover Zoom for a long time, but now they are not working. I tried to update, could not. Delete and reinstall, does not work. Can you tell me what I blamed? Thanks in advance.", "date": "Oct 3, 2019"}, {"stars": 3, "text": "Still works great with Facebook, Imgur and deviantArt but it stopped working for Twitter, YouTube and Pixiv", "date": "Sep 28, 2019"}, {"stars": 5, "text": "bravo", "date": "Sep 23, 2019"}, {"stars": 2, "text": "Doesnt Work With Google Images", "date": "Sep 13, 2019"}, {"stars": 5, "text": "Please make this work with the new Google images layout, I used to just hover over images and look at them full size but now that doesn't work anymore and you have to click on them", "date": "Aug 30, 2019"}, {"stars": 4, "text": "Works great for the most part, however does not work on Facebook or Instagram.", "date": "Aug 18, 2019"}, {"stars": 5, "text": "Safe,useful, and simple <3", "date": "Aug 17, 2019"}, {"stars": 5, "text": "very good", "date": "Aug 3, 2019"}, {"stars": 3, "text": "When saving it tries to save 3 times, when open in new tab it open 3 tabs. and guess what, when opening new window it open 3 new windows Fix this annoying bug", "date": "Jul 27, 2019"}, {"stars": 5, "text": "It works fine!\nHope it will work in twitter new interface too!", "date": "Jul 26, 2019"}, {"stars": 3, "text": "Generally good, though the recent news on its insecurities is not so good, but also, would be good if it worked with DuckDuckGo's Image searching, but not at all currently :/", "date": "Jul 25, 2019"}, {"stars": 3, "text": "Stop working on twitter", "date": "Jul 22, 2019"}, {"stars": 1, "text": "they are leaking your data, deleted it.", "date": "Jul 20, 2019"}, {"stars": 5, "text": "hi, twitter just renew their site, please fix.", "date": "Jul 20, 2019"}, {"stars": 1, "text": "No longer works on Facebook beta for desktop.", "date": "Jul 20, 2019"}, {"stars": 3, "text": "Hover Zoom+ no longer works on Twitter, with their new layout. I'll gladly bump this up to 5 star if that gets fixed.", "date": "Jul 17, 2019"}, {"stars": 3, "text": "Doesn't work on my desktop in Incognito mode.  Any suggestions?", "date": "Jul 5, 2019"}, {"stars": 4, "text": "I've used this extension for years and really like it, but with the new twitter web interface, it doesn't work anymore on the the timeline which is a shame since clicking into tweets is also a pain with that new interface. If a fix could be made for this issue, then I'd have no other issues", "date": "Jun 26, 2019"}, {"stars": 3, "text": "The extension breaks and resets to defaults much more commonly than it used to.", "date": "Jun 20, 2019"}, {"stars": 3, "text": "YouTube videos stopped working! well, basically all videos are not working. \nIt's a shame it was an excellent extension!! WAS !! \nI will change this to 5 stars when it'll work again.", "date": "Jun 16, 2019"}, {"stars": 4, "text": "Can't imagine browsing without it. Only thing missing is a 'Copy to Clipboard' shortcut.", "date": "Jun 12, 2019"}, {"stars": 3, "text": "Suddenly my Yahoo Mail keeps opening up blank tabs - has been isolated to this extension which is a shame because I love it. Can't read or write email with it installed now.", "date": "Jun 11, 2019"}, {"stars": 5, "text": "Without image exif, hover zoom will not work.", "date": "Jun 7, 2019"}, {"stars": 3, "text": "Well it works sometimes, but seems to be a little slow when loading images. I'm using PhotoShow now, which works perfectly on most websites that I need(Twitter, Instagram, Amazon, Tumblr, Reddit, YouTube,  Pinterest...). However, it seems not to support video at the moment. Maybe it would do some day, as it updates frequently.", "date": "May 29, 2019"}, {"stars": 5, "text": "Has a few limitations, but I imagine they come with the unmatched compatibility offered by this add-on. Some of the website specific zoom extensions may be a bit more stable, but none match the universal utility offered here.", "date": "May 8, 2019"}, {"stars": 4, "text": "I love it's window feature and how excellent it is, but wish it works in Facebook's photos section, it works well in timeline though.", "date": "May 4, 2019"}, {"stars": 4, "text": "it doesn't work on twitter timeline  !!", "date": "Apr 26, 2019"}, {"stars": 3, "text": "Works well on most sites. It does have some serious trouble on facebook though; profile images won't open as well as some of the side photos on a profiles frontpage (sometimes coverimage too).", "date": "Apr 15, 2019"}, {"stars": 5, "text": "good", "date": "Apr 10, 2019"}, {"stars": 5, "text": "I've been going back and forth between Imagus and Hover Zoom+. These are two extensions that do pretty much the same thing. But they have differences between them and after the comparison I've compiled a list of differences between the two that will hopefully help you make your decision on which one you want to keep. Here they are:\n\n\nImagus\n\nPROS\n* Nice caption design\n* Image/video size in caption\n* Captions the links correctly - example Instagram, shows not the title of the link, but the act... Show more", "date": "Mar 31, 2019"}, {"stars": 4, "text": "Stopped working on Reddit, I've been waiting for a fix to come along but it's been months and nothing. Otherwise it's a good extension.", "date": "Mar 25, 2019"}, {"stars": 1, "text": "Doesnt work smh", "date": "Mar 21, 2019"}, {"stars": 1, "text": "I used it for a long time and thought it was great, but recently was getting constant ADVERTISING REDIRECTS in Chrome (something called \"xfreeservice\")––redirecting every URL from a Google search to full page ads for tons of different things. Nothing I could find to remove this ... until I DISABLED HOVER ZOOM+. Scummy add-on.", "date": "Mar 20, 2019"}, {"stars": 5, "text": "This extension is a miracle! I can't believe I've been surfing the web for years without such a simple but life changing tool. \nNo more 'open in new tab' just to get an idea of what an image is.", "date": "Mar 20, 2019"}, {"stars": 1, "text": "DO. NOT. GET.\n\nThis extension hijacked my browser-- I never consented to having spyware on my computer, obviously. \n\nIt just took me over 2 hours to figure out which extension in Chrome was messing with my default browser. Sure, it's nice to zoom in on photos if you are blind as a bat like I am, but it is not worth it. Really freaks me out....", "date": "Feb 28, 2019"}, {"stars": 5, "text": "I like looking at big pictures and I hate having to click into pages to see them! This is an unexpectedly useful extension. I only wish more websites were supported. Also, it's open source, so if I was smart enough, I could add that kind of support. 5/5 stars!", "date": "Feb 22, 2019"}, {"stars": 5, "text": "very helpful", "date": "Jan 31, 2019"}, {"stars": 5, "text": "Very good functioning app that has all u need makes browsing the internet even better.", "date": "Jan 19, 2019"}, {"stars": 3, "text": "Many of the images only shows them in their real size and does not zoom. In the miniatures, it shows them as small, so it is not useful in that sense.", "date": "Dec 27, 2018"}, {"stars": 4, "text": "Only complaint is that when it comes to Reddit videos/GIFs/pictures, it doesn't work well. Videos and GIFs seem to show up super small, and pictures sometimes doesn't show up.\n\nWill re-rate 5/5 if fixed.", "date": "Dec 27, 2018"}, {"stars": 3, "text": "This extention is great, but lately it quit working when viewing gifs and videos on Reddit. Hopefully there will be an update soon to fix it, and I'll up my rating to a 5*.", "date": "Dec 4, 2018"}, {"stars": 5, "text": "Works great! I love the keyboard shortcut to download photos!  I do kind of wish that I could specify a download folder... but I'll live!  :)", "date": "Nov 16, 2018"}, {"stars": 5, "text": "Instagram again? :(", "date": "Nov 2, 2018"}, {"stars": 5, "text": "Works great.", "date": "Oct 28, 2018"}, {"stars": 1, "text": "doesn t work", "date": "Sep 14, 2018"}, {"stars": 1, "text": "It doesn't wort every second time i want to watch a picture;\nIt also shows a picture instead of the gif I want to see.", "date": "Sep 9, 2018"}, {"stars": 5, "text": "Relied on this and Hover Zoom for years. An essential for any productive PC user.", "date": "Sep 7, 2018"}, {"stars": 5, "text": "Nice!", "date": "Sep 2, 2018"}, {"stars": 5, "text": "fine good", "date": "Aug 6, 2018"}, {"stars": 5, "text": "Been using this for a couple of years. Love it!!", "date": "Aug 3, 2018"}, {"stars": 5, "text": "What a time saver! Love this extension. My only regret is that I didn't know about it sooner. Thank you for creating this!", "date": "Aug 2, 2018"}, {"stars": 4, "text": "Suddenly it doesn't work on Pinterest. Maybe that's due to the site referred to..", "date": "Jul 23, 2018"}, {"stars": 3, "text": "Does not play youtube videos on hover anymore (throws errors in the Chrome console), so I've changed over to the Youtube on Hover Preview extension which currently does work.", "date": "Jul 22, 2018"}, {"stars": 1, "text": "Doesn't work with Google Sheets and images in cells.", "date": "Jul 13, 2018"}, {"stars": 5, "text": "Best extension ever made, been using this type of extension since like 2010... can't live without zoom tech, also love that 1 . save works in this version whereas its broken in others, and I see what you did there for lazygirls, I thought I was the only one who visited that site", "date": "Jul 6, 2018"}, {"stars": 4, "text": "This needs to be updated to function on Reddit's new compact view.", "date": "Jun 21, 2018"}, {"stars": 4, "text": "good", "date": "May 15, 2018"}, {"stars": 3, "text": "Was ok for Reddit until the \"new\" reddit.  Now doesn't work on the home page any more.", "date": "May 11, 2018"}, {"stars": 5, "text": "Please add image copy key", "date": "May 9, 2018"}, {"stars": 4, "text": "Perhaps I could save the image from the preview window.", "date": "Apr 29, 2018"}, {"stars": 5, "text": "It's great when working.\nSuch a great tool, especially for a person like me that has trouble with their eye sight. Works perfectly and is easy to use. Only downside is it doesn't seem to work on Pinterest, if it wasn't for that then i'd give this extension 5*.", "date": "Apr 26, 2018"}, {"stars": 5, "text": "5 5 star", "date": "Apr 23, 2018"}, {"stars": 1, "text": "Does not work on the new Reddit style.", "date": "Apr 20, 2018"}, {"stars": 1, "text": "Worked great until it need additional permissions. Maybe I don't want the new version or your new \"functionality\"  Maybe now isn't the time to be more intrusive into people's privacy. This app wants to:\n1. Read and change all your data on the websites you visit\n2. Display notifications\n3. Manage your downloads", "date": "Apr 15, 2018"}, {"stars": 5, "text": "I am not an extension collector, for all sort of reasons, and I can tell you this is one the four extensions I allow in my browser. Really neat UX trick, that should be a default in all browsers (Opera are you listening?), and really good implementation.", "date": "Apr 12, 2018"}, {"stars": 3, "text": "This was an incredibly useful extension but unfortunately it now needs access to manage my downloads which is something I am unwilling to give. Apparently it is to fix the download feature which I did not find useful at all. Very unfortunate.", "date": "Apr 8, 2018"}, {"stars": 5, "text": "This is open source, that means safe.\nMaybe a upgrade note would be better.", "date": "Apr 8, 2018"}, {"stars": 5, "text": "If you want the extension to download images, then it needs access to \"manage downloads\", and if you want it to zoom an image, then it needs access to \"data on webpages\", it's that easy. Guess all the 1star givers here are morons ;-)\nThanks for you good work!", "date": "Apr 8, 2018"}, {"stars": 5, "text": "Great extension, no complaints!\nWould be cool if there was an additional 'action key' to save the current image to clipboard.", "date": "Apr 8, 2018"}, {"stars": 1, "text": "Latest update wants to manage my downloads? Read and change all my data on the website I visit?? Good grief, why not just asked me for my bank details? Permission denied.", "date": "Apr 8, 2018"}, {"stars": 1, "text": "I will not allow a picture hover plugin to access my downloads. Removed and rated 1 star", "date": "Apr 8, 2018"}, {"stars": 1, "text": "As of today this extension wants to manage your downloads. I don't trust that.", "date": "Apr 8, 2018"}, {"stars": 5, "text": "Works Great!", "date": "Apr 8, 2018"}, {"stars": 2, "text": "Worked great until recently, where Chrome thankfully disabled it because now it needs permissions to modify my downloads, which is incredibly shady. There's no legitimate reason this extension should ever need to manage my downloads.", "date": "Apr 8, 2018"}, {"stars": 5, "text": "As of this review the latest update to the extension fixed the issues and now the extension works and the hotkeys also work.", "date": "Apr 7, 2018"}, {"stars": 5, "text": "I love this extension but recently has been working bad, probably because the last Chrome update, hope developers can check this out because its a very helpful extension.", "date": "Apr 7, 2018"}, {"stars": 2, "text": "Does not work on Instagram.\nAction key for saving an image opens it instead.\nCursor doesn't disappear while zooming a picture.\nNo response on the Github for such problems.\n\nI hope there's a good replacement for this…", "date": "Apr 7, 2018"}, {"stars": 1, "text": "Used to be great.  Now it works so infrequently that it's useless.", "date": "Apr 5, 2018"}, {"stars": 1, "text": "The author already have the code to upgrade the extention... he just choose not to implement it yet.\n\nAt github there is a forked working version. Maybe it's time to upload it again with a new name.", "date": "Apr 3, 2018"}, {"stars": 5, "text": "It was okay until the recent Window 10 update. Which prompted Chrome to do an update as well. All extensions which have this type of feature to zoom images have been disabled by Chrome permanently. \n\nIt's not the extension developer's fault. Chrome's latest update disables 3rd party downloading ability. It was their way of fixing a bug some people were exploiting so in the backlash once useful tools such as this can no longer be used. \n\nI suspect my bulk page image downloader will be disabled... Show more", "date": "Mar 23, 2018"}, {"stars": 5, "text": "Wow you fixed the Download issue, Thanks so Much, needed it a lot. Thank youuuu, you're the best", "date": "Mar 21, 2018"}, {"stars": 1, "text": "it sucks because it dont even work", "date": "Feb 24, 2018"}, {"stars": 2, "text": "Only works on very few photos. \nStarts to load, for a second, then stops and disappears.", "date": "Feb 22, 2018"}, {"stars": 3, "text": "why doesn't it work. Its very unpredictable. Not happy.", "date": "Feb 5, 2018"}, {"stars": 4, "text": "It seems inconsistent these days. It often doesn't work on .gifv formats. Browsing Reddit with this used to work perfectly, but sometimes gifs would show up, and sometimes doesn't. I think it's mostly the .gifv that's causing issues. If you could fix this, that'll be nice.", "date": "Feb 2, 2018"}, {"stars": 3, "text": "As another user mentioned, I believe a Chrome update has done something to the 3rd party download permission, now when pressing the save hotkey, it opens up the image's url.", "date": "Jan 19, 2018"}, {"stars": 3, "text": "It WAS okay, now it doesn't work on instagram and doesn't work on facebook albums, only zooms featured and timeline photos.\nSometimes it works, then it stops for weeks", "date": "Jan 17, 2018"}, {"stars": 5, "text": "works fine", "date": "Jan 16, 2018"}, {"stars": 3, "text": "up until a few months ago, it worked well with everything. now it's not working on pinterest at all.", "date": "Jan 16, 2018"}, {"stars": 5, "text": "awesome", "date": "Jan 14, 2018"}, {"stars": 3, "text": "This app worked great up until about 3 moths ago. Now it works about 60% of the time. When it works I love it. When it doesn't It's VERY frustrating. \nIt doesn't matter what site I'm on. It can work 1 min. and not the next.\nIf this issue is fixed I'd gladly give it 5 stars. Right now I give it a generous 3 stars.", "date": "Jan 12, 2018"}, {"stars": 1, "text": "Does not work at all.", "date": "Jan 6, 2018"}, {"stars": 1, "text": "doesnt do anything. ive been using Imagus since day one never had a problem, just wanted to see why this one has 4 stars. still confused after trying it with zero results.padding the stats with bots maybe? dont know, dont care. Imagus still the best so far", "date": "Jan 2, 2018"}, {"stars": 5, "text": "best tool ever !!", "date": "Dec 23, 2017"}, {"stars": 5, "text": "Nice tool!!", "date": "Dec 20, 2017"}, {"stars": 4, "text": "Such a great tool, especially for a person like me that has trouble with their eye sight. Works perfectly and is easy to use. Only downside is it doesn't seem to work on Pinterest, if it wasn't for that then i'd give this extension 5*.", "date": "Dec 15, 2017"}, {"stars": 5, "text": "I can't imagine how tedious normal web browsing would be without this extension.", "date": "Dec 12, 2017"}, {"stars": 5, "text": "Great!", "date": "Dec 6, 2017"}, {"stars": 3, "text": "It is not working on Pinterest! : (", "date": "Oct 23, 2017"}, {"stars": 4, "text": "I like it a lot, except for it's inability to zoom if more than one pics are in a post..this on twitter...\n\nwould be 5 star if that worked, and for now i have to go back to the very sometimish imagus", "date": "Oct 20, 2017"}, {"stars": 5, "text": "very nice & usefull app", "date": "Oct 20, 2017"}, {"stars": 5, "text": "It worked for quite a while, but now it doesn't seem to. I think it needs to be updated.", "date": "Oct 9, 2017"}, {"stars": 2, "text": "Doesn't work on Pinterest anymore.\nVery disappointing.", "date": "Oct 5, 2017"}, {"stars": 1, "text": "Wont work", "date": "Oct 4, 2017"}, {"stars": 5, "text": "now not work on twitter. please fix it.", "date": "Sep 24, 2017"}, {"stars": 4, "text": "I love this extension but I used to be able to use it on pinterest. I can't anymore, which is what I mostly use it for so...\n\nI really want someone to fix this.", "date": "Sep 20, 2017"}, {"stars": 4, "text": "Pinterest doesnt work anymore why??", "date": "Sep 18, 2017"}, {"stars": 5, "text": "Works as intended", "date": "Sep 18, 2017"}, {"stars": 3, "text": "ZOOMING OF PROFILE PICTURE IS NOT WORKING AS OF 25 AUG 2017.PICS IN TIMELINE OF FB IS WORKING.", "date": "Aug 26, 2017"}, {"stars": 5, "text": "I love the shortcuts, opening image in a new tab etc. But what I miss the most is shortcut to copy the image to clipboard. This would be awesome :) \nThanks for a great extension", "date": "Aug 10, 2017"}, {"stars": 3, "text": "Bruh, Oleg, you need to either revert to an older version or fix the .gif playback and not adding stuff to history. I love this extension, but usability has def suffered with the latest update (Ver. 1.0.120).", "date": "Aug 1, 2017"}, {"stars": 1, "text": "not working anymore on FB and most sites", "date": "Jul 31, 2017"}, {"stars": 5, "text": "very nice", "date": "Jul 31, 2017"}, {"stars": 5, "text": "Hi, \nI am interested in acquiring your extension \"Hover Zoom+\". \n\nPlease contact me at: yuliyademchak@gmail.com", "date": "Jul 21, 2017"}, {"stars": 1, "text": "It works wonderful, sadly it has an adware", "date": "Jul 10, 2017"}, {"stars": 2, "text": "Same here, as all the others bellow.", "date": "Jul 6, 2017"}, {"stars": 3, "text": "I love this extension but the latest update no longer loads youtube thumbnails which was the thing I used it most for! Pls update it soooon!", "date": "Jul 3, 2017"}, {"stars": 4, "text": "love it", "date": "Jun 30, 2017"}, {"stars": 1, "text": "After some great years this doesn't work anymore. For months already. Not on google, not on youtube, or anywhere else... well, yes, it works on googles image search, but that's it.\nI have un- and reinstalled it without being able to fix it. Sad to see a once great extension become useless.", "date": "Jun 23, 2017"}, {"stars": 1, "text": "It quit working.", "date": "Jun 23, 2017"}, {"stars": 3, "text": "It didn't work very well.", "date": "Jun 20, 2017"}, {"stars": 2, "text": "stopped working in facebook! please fix.", "date": "Jun 19, 2017"}, {"stars": 2, "text": "Does not work anymore on Facebook.", "date": "Jun 18, 2017"}, {"stars": 2, "text": "I use this extension exclusively for Facebook. It used to work great, but in recent weeks, it hasn't worked at all. It's a 5-star extension when it works but for now, it's basically useless until it gets fixed. Will edit this to a 5-star rating if/when it's fixed.", "date": "Jun 17, 2017"}, {"stars": 2, "text": "It used to be the best but for the last weeks its barely works!", "date": "Jun 14, 2017"}, {"stars": 1, "text": "Not working on facebook and the preview on youtube is not full.", "date": "Jun 11, 2017"}, {"stars": 2, "text": "Was good, but since latest update it doesn't load 80+% of all images or videos.", "date": "Jun 4, 2017"}, {"stars": 4, "text": "what happened that useful ext. please fix it.", "date": "Jun 1, 2017"}, {"stars": 2, "text": "Not working on many popular sites. Hopefully the developer can get this rectified because it used to be a useful extension.", "date": "May 30, 2017"}, {"stars": 5, "text": "Recently, it isn't loading every thumbnail on Youtube properly. Most of them are gray pictures of youtube's logo with 3 dots. On the other side this extension is hands down the most usefull for any Chrome user.", "date": "May 29, 2017"}, {"stars": 4, "text": "suddenly not working well on Facebook, profile pics no longer zooming, and a lot of images on profiles no longer zooming as well.", "date": "May 28, 2017"}, {"stars": 3, "text": "Recently seems to not be working properly. I don't know if this is because of a recent Chrome update or not, but it is sporadic with which images it will work on. But when it works, it is great!", "date": "May 27, 2017"}, {"stars": 4, "text": "Overall good. Works Well and pretty cool.", "date": "May 18, 2017"}, {"stars": 5, "text": "This has become such a great extension since I first installed it. Works perfectly, thank you!", "date": "May 12, 2017"}, {"stars": 4, "text": "cdd", "date": "May 5, 2017"}, {"stars": 5, "text": "works like a charm.", "date": "Apr 20, 2017"}, {"stars": 3, "text": "Not working on all the web pages. working on facebook though.", "date": "Apr 11, 2017"}, {"stars": 2, "text": "DO NOT INSTALL IT! Or it will crush your Windows into bluescreen every week.", "date": "Apr 6, 2017"}, {"stars": 4, "text": "All good, but I would love to have a \"Copy image to clipboard\" keyboard shortcut in the settings.", "date": "Mar 31, 2017"}, {"stars": 5, "text": "great stuff.. 5 stars for y'all", "date": "Mar 28, 2017"}, {"stars": 5, "text": "Better than the original. Thank you for keeping this plug as it was intended. 5 stars for you :)", "date": "Mar 21, 2017"}, {"stars": 5, "text": "good", "date": "Mar 12, 2017"}, {"stars": 3, "text": "Hello, \n\nSorry to say but I am having some problems with this extension. When I go to a page on google, and when i hover my mouse over an image, it takes too long to load out the image and random images pop up sometimes when i go close to an image. But I am really not on it. Everything else is perfection.\n\n- Micheal", "date": "Mar 9, 2017"}, {"stars": 3, "text": "Mostly good, but it is a memory hog. 220+ Mb of memory just for this extension is too much.", "date": "Feb 23, 2017"}, {"stars": 3, "text": "This version lacks GIFV support.", "date": "Feb 18, 2017"}, {"stars": 5, "text": "Go into the extension's options, Advanced tab, and check \"Add viewed pictures to the browser's history\" so the links go purple and don't remain blue. This, my friends, is the key!", "date": "Feb 18, 2017"}, {"stars": 4, "text": "No longer works to scroll through images, or video. ChromeOS. Switched to imagus. Still works on win10 though.", "date": "Feb 17, 2017"}, {"stars": 4, "text": "One of my favorite extensions. I wish it worked on instagram.", "date": "Feb 13, 2017"}, {"stars": 4, "text": "Stopped working on Instagram :(", "date": "Feb 13, 2017"}, {"stars": 3, "text": "Hi Thanks for the response. Yes it's working now.The images are loading now.\n\nHowever, the scales are still not correct.\nThe image you get when zoomed and when clicking on the image, is different.\n\nusually the thumbnails are cropped compared to the full image.\nThe extension actually zooms the cropped image and doesnt give the full image.", "date": "Feb 11, 2017"}, {"stars": 5, "text": "It is difficult to go back to clicking image and videos links after having Hoover Zoom+ installed.  Browsing the internet just isn't the same without this extension.", "date": "Feb 10, 2017"}, {"stars": 2, "text": "Used to work great, really loved it, but recently it seems almost every image just flashes off and on, very annoying. I have tried reinstalling it and still does the same thing on about 75% of images.", "date": "Feb 5, 2017"}, {"stars": 3, "text": "I have installed, uninstalled and reinstalled it more than once. Sometimes it does what it's supposed to do, sometimes not. When it works it's exceptionally good!", "date": "Feb 5, 2017"}, {"stars": 4, "text": "excellent extension, i would have given 5 staars if it could play all youtube video links even inside youtube.", "date": "Feb 3, 2017"}, {"stars": 5, "text": "thank you its good hhhh", "date": "Jan 27, 2017"}, {"stars": 5, "text": "Playing videos from links feature is the BEST!!!", "date": "Jan 23, 2017"}, {"stars": 4, "text": "Great tool, when it doesn't forget the disabler key setting.", "date": "Jan 22, 2017"}, {"stars": 5, "text": "Love this.", "date": "Jan 16, 2017"}, {"stars": 4, "text": "Works well on most sites, however on Instagram pictures appear stretched horizontally", "date": "Jan 6, 2017"}, {"stars": 3, "text": "It's great when it works. \nLately, it hasn't been working like it should.\nSometimes it works fine and other times it does nothing when you hover over a pic. I think this needs tweaking again. I've never had it open up in another tab.  It always pops up a little \"window\" right over the pic. It's 5 stars when it's working right.", "date": "Jan 6, 2017"}, {"stars": 5, "text": "it works nice for me, i love being able to fast forward videos and gif especially", "date": "Jan 6, 2017"}, {"stars": 1, "text": "Very clunky and will open vids/picsin another tab randomly...", "date": "Dec 19, 2016"}, {"stars": 5, "text": "Amazing buttt... let us have more controls for hovered vids like make the keys always work like in google images it gets annoying even tryna use the touchpad gesture lol, but nonetheless it is an intuitive masterpiece, sir.", "date": "Dec 16, 2016"}, {"stars": 2, "text": "Clunky and annoying to use. Enabling video support just sucks, even with a 2.5 second delay it somehow manages to load videos as you move your cursor over any link with a video on it, instantly. Then you have to reload the page to stop the invisible video from playing as you still get the sound! Also doesn't support iob.imgur.com, not like anything else does but still.", "date": "Dec 13, 2016"}, {"stars": 5, "text": "Good", "date": "Dec 10, 2016"}, {"stars": 4, "text": "I'm pretty sure this extension has problems with twitch.tv. Sometimes when I hover over a stream, the whole tab will crash and recover after about 10-20 seconds. This doesn't happen when Hover Zoom+ is disabled.\n\nMaybe it's an interaction with other extensions like BetterTwitchTV or FrankerFaceZ. I'll run some tests in the future.", "date": "Dec 7, 2016"}, {"stars": 2, "text": "Its no longer working", "date": "Dec 3, 2016"}, {"stars": 1, "text": "Not functioning always and misses many photos", "date": "Nov 28, 2016"}, {"stars": 4, "text": "This is a great extension, but it doesn’t work for Streamable.com links. Please fix this and I’ll give it 5/5 stars.", "date": "Nov 26, 2016"}, {"stars": 5, "text": "Works well. Be sure your ad blocker doesn't interfere with any of its functions.", "date": "Nov 20, 2016"}, {"stars": 3, "text": "This extension has great potential. Needs more functions and settings though:\n \n1) Size of picture/video depending on the specific site. It seems like this could be done already, but I can't understand how. Maybe I'm just stupid though.\n\n1.5) At least my \"Plugins\" screens in options are empty, so I don't know what this is for.\n\n2) MORE sites. There should be a list somewhere over the most used sites that you can use. I understand that you probably have to configure them individually, which is... Show more", "date": "Nov 10, 2016"}, {"stars": 3, "text": "Hoverzoom+ not loading thumbnail images & profile pictures on posts on FB timeline.\n\n*This issue was reported by another user at github back in early September.  I added the extension today and experience the same issue.", "date": "Nov 6, 2016"}, {"stars": 3, "text": "The album image counter in the top right corner needs to have a black border around the numbers, otherwise it is impossible to see the album numbers one many images (when the image is a light color or just plain white).", "date": "Nov 1, 2016"}, {"stars": 3, "text": "setting the delay doesn't work, images come up immediately, too fast, very annoying.", "date": "Nov 1, 2016"}, {"stars": 1, "text": "dont do the spyware shash", "date": "Oct 26, 2016"}, {"stars": 5, "text": "Exelent tools", "date": "Oct 24, 2016"}, {"stars": 5, "text": "svemy data", "date": "Oct 3, 2016"}, {"stars": 1, "text": "Doesn't work with new Facebook Albums. Fix it ASAP!", "date": "Sep 30, 2016"}, {"stars": 4, "text": "Feature request: display gifv versions of imgur gifs", "date": "Sep 30, 2016"}, {"stars": 4, "text": "it doesn't work on facebook.", "date": "Sep 24, 2016"}, {"stars": 2, "text": "When I dragged mouse pass something (That seems to work with hoverzoom+) and rest my mouse on any other space (like blank space), It still keep showing on picture that I drag my mouse pass. So it keep show thing up every time I stop moving my mouse on any area of screen. Not working well as previous extension. Uninstalled", "date": "Sep 21, 2016"}, {"stars": 5, "text": "Awesome, a must have.", "date": "Sep 14, 2016"}, {"stars": 5, "text": "excelent zoom in images and in youtube video from google search just excelent", "date": "Aug 31, 2016"}, {"stars": 5, "text": "Absolutely perfect", "date": "Aug 27, 2016"}, {"stars": 5, "text": "I love it, I've used HoverZoom for years but recently I've encountered this problem. Wherever my cursor goes, it keep displaying the last image. I've disabled then enabled it back several times, it does not work out. Hope this problem will be fixed soon. I always love this Extension.", "date": "Aug 21, 2016"}, {"stars": 2, "text": "I did not like it insome cases it works.\n\nBut in some it doesn't even in websites like google.com  or fb.com \n\nBy the way it does not play video in youtube.com as per  me.", "date": "Aug 19, 2016"}, {"stars": 5, "text": "Absolutely perfect. I removed the other one because I didn't like that the mouse stayed when viewing the pic and of course if you moved it the picture would disappear. Yours has the mouse disappear which is so helpful. Thank you so much for improving this extension.", "date": "Aug 16, 2016"}, {"stars": 3, "text": "NEED SUPPORT FOR QUORA", "date": "Aug 15, 2016"}, {"stars": 5, "text": "Everything is working fine now. Thank You!", "date": "Aug 12, 2016"}, {"stars": 1, "text": "It used to work amazingly! Now it only shows the pictures that comes from blogs (ex: When I'm on facebook, the pictures directly posted on fb don't get zoomed when I hover over them... Except the pictures that comes from blogs or articles)... AND it no longer shows the videos!!! It only shows the IMAGE of the videos (thumbnails)... it no longer plays the actual videos!...", "date": "Aug 11, 2016"}, {"stars": 1, "text": "still not working on Facebook?", "date": "Aug 11, 2016"}, {"stars": 5, "text": "It is a very useful program.", "date": "Aug 3, 2016"}, {"stars": 3, "text": "Since a month ago it has started to misbehave. Half of the times it won't load the zoomed image and it's getting really frustrating", "date": "Jul 29, 2016"}, {"stars": 5, "text": "Works superbly, at least this one doesn't sell all your data like the other hover zoom add-on.", "date": "Jul 28, 2016"}, {"stars": 5, "text": "Hey, just wanted to say that when clicking a video (opens in new tab) the audio keeps playing in the original tab. Resulting in a sort of echo of audio. This issue has resurrected itself in 1.0.86! I noticed someone reported this pre 1.0.83 and then it was fixed in 1.0.83. It's back unfortunately. Anyway, take it easy and thanks for a great extension! :D", "date": "Jul 26, 2016"}, {"stars": 5, "text": "Since when does it work on Wikipedia? Amazing!\n\nAlso for whoever has trouble with gifs not playing needs to enable a certain setting in chrome. \n\nYou need to switch chrome://flags/#autoplay-policy", "date": "Jul 14, 2016"}, {"stars": 5, "text": "Suggestion: make it preview videos from youtube also (the same way it previews WebM's)\n\nOther than that, it's near perfect.", "date": "Jul 13, 2016"}, {"stars": 5, "text": "Suggestion: add hotkey to copy image to clipboard", "date": "Jul 5, 2016"}, {"stars": 3, "text": "Not working on Amazon anymore.  Did something change?", "date": "Jun 14, 2016"}, {"stars": 3, "text": "needs an easy way to disable the useless hotkey. i dont want to save every photo my mouse passes over while im typing", "date": "Jun 6, 2016"}, {"stars": 4, "text": "When hovering above a reddit link that has no picture , is only a comments thread, it displays a huge reddit alien. this is incredibly annoying, any fix?", "date": "Jun 2, 2016"}, {"stars": 5, "text": "It was working with gifs when I first got it but now it just shows a still image instead of the gif. If I could get some help that would be wonderful", "date": "Jun 1, 2016"}, {"stars": 5, "text": "Previews a pic? Check.\nPreviews a gif? Check.\nPreviews a video? Check.\n+5", "date": "Jun 1, 2016"}, {"stars": 5, "text": "The extension stopped working yesterday on reddit. I try to hover over anything and it doesn't work. Dev please fix it and il change back my score.\n\nEdit: Imgur isn't the only thing that doesn't work but also everything else. From streamable to any other links.\n\nEdit 2: it's back to working again. That was weird. Don't know what changed.", "date": "May 27, 2016"}, {"stars": 5, "text": "Works great man. Version 50.0.2661.102 (64-bit), using a Mac.", "date": "May 25, 2016"}, {"stars": 5, "text": "Very cool the streamble.com support.", "date": "May 23, 2016"}, {"stars": 4, "text": "No 4chan support? :(\nEdit: hmm, works now. chrome glitch?", "date": "May 19, 2016"}, {"stars": 5, "text": "Very great extension. The only thing I don't like is while on reddit and hovering over a new link, it doesn't turn purple anymore as if it were clicked. The link turned purple in the previous hover zoom I had installed. Anyway to fix this?", "date": "May 17, 2016"}, {"stars": 1, "text": "Doesn't work.  Removed old Hover Zoom and installed new one.  Using Chrome version 44.0.2403.125 (64-bit).", "date": "May 16, 2016"}, {"stars": 5, "text": "Once I was able to change my options so that viewed images went to my browser history (making viewing reddit easier) I was completely satisfied.", "date": "May 15, 2016"}, {"stars": 5, "text": "Plugin request: http://sli.mg/", "date": "May 14, 2016"}, {"stars": 5, "text": "Works well, seems to be a cleaner version of hoverzoom without the ads. Thanks!", "date": "May 12, 2016"}, {"stars": 1, "text": "sucks", "date": "May 10, 2016"}, {"stars": 5, "text": "Only 1 Word\n\"AWESOME\"", "date": "May 10, 2016"}, {"stars": 2, "text": "No way I can find to change the size of the zoomed image.  It's only slightly larger than the original.\n\nKinda worhtless", "date": "May 9, 2016"}, {"stars": 2, "text": "When trying to watch a video, a default title shows up over the video for a good 10-15 seconds, blocking part of the video. I don't understand how they could overlook this.", "date": "Apr 29, 2016"}, {"stars": 5, "text": "awesome!!!", "date": "Apr 29, 2016"}, {"stars": 5, "text": "Hello !\nthis extension not working now :( please fix the issue.i love this extension very much i need it .", "date": "Apr 28, 2016"}, {"stars": 5, "text": "What kind of malware was detected in the original Hover Zoom? I still have it installed and Malwarebytes nor Windows Defender has said a word. I have done multiple scans over the past few months, and they returned clean each time. The extension itself doesn't look very suspicious either. For all we know it could have been a free antivirus product that detected a false positive, which caused the reviews to blow up including the extension along with it.", "date": "Apr 24, 2016"}, {"stars": 1, "text": "Too hard too use!", "date": "Apr 23, 2016"}, {"stars": 5, "text": "good", "date": "Apr 23, 2016"}, {"stars": 4, "text": "Works pretty well", "date": "Apr 19, 2016"}, {"stars": 5, "text": "Awesome!", "date": "Apr 16, 2016"}, {"stars": 5, "text": "rotating image please", "date": "Apr 15, 2016"}, {"stars": 5, "text": "Works Great. \nThank you.", "date": "Apr 14, 2016"}, {"stars": 2, "text": "Broken. The new video support is annoying but shutting it off still starts a download of data.", "date": "Apr 14, 2016"}, {"stars": 5, "text": "best.....", "date": "Apr 13, 2016"}, {"stars": 5, "text": "Works great!", "date": "Apr 7, 2016"}, {"stars": 4, "text": "did it's job well", "date": "Apr 4, 2016"}, {"stars": 3, "text": "Doesn't work everywhere very limited", "date": "Mar 20, 2016"}, {"stars": 4, "text": "So awesome dude! The one thing that would make the new Video player better is if we could control the volume of the video. It sucks that I have to mute it because there is no option other than 100% or 0%... \"0 to 100 real quick\"", "date": "Mar 17, 2016"}, {"stars": 4, "text": "Was working perfectly before. Recent Chrome update makes it freeze the tab for a couple seconds when certain websites are loading. Not sure if this means Google killed this ext. Temporarily disabling this since it slows me down now.", "date": "Mar 17, 2016"}, {"stars": 5, "text": "Great, Love the new youtube support", "date": "Mar 17, 2016"}, {"stars": 3, "text": "Sometimes dont save the picture, because slide picture window. Please fix.", "date": "Mar 16, 2016"}, {"stars": 5, "text": "Works as advertised.", "date": "Mar 14, 2016"}, {"stars": 4, "text": "Is it possible to deactivate showing youtube videos? Really annoying when I browse /r/videos and I have to be careful not to leave my mouse on any video (Hard to do when ~50% of the page are thumbnails and links to videos)", "date": "Mar 12, 2016"}, {"stars": 5, "text": "awesome zoom +", "date": "Mar 8, 2016"}, {"stars": 1, "text": "The zoom image is always flicker, not comfort to see.", "date": "Mar 6, 2016"}, {"stars": 5, "text": "awesome for reddit", "date": "Mar 3, 2016"}, {"stars": 4, "text": "Good, but sometimes not load photos.", "date": "Feb 20, 2016"}, {"stars": 5, "text": "Good one keep up the great work.", "date": "Feb 18, 2016"}, {"stars": 5, "text": "It seems that if you don't want to \"zoom\" an image, you need to press \"X\" on the keyboard while hovering.\n\nJust like the counterpart for Mozilla Firefox.\n\nGood Extension. Thanks.", "date": "Feb 18, 2016"}, {"stars": 1, "text": "Unlike", "date": "Feb 17, 2016"}, {"stars": 5, "text": "now it works", "date": "Feb 13, 2016"}, {"stars": 5, "text": "This is one of the best extensions. I can't stand to be without it. It just makes browsing so much more efficient. Thank you, you brilliant person, for creating this!", "date": "Feb 7, 2016"}, {"stars": 4, "text": "I love the extension other than it's inability to zoom gifv. Is this something you can implement in the next update?", "date": "Feb 1, 2016"}, {"stars": 5, "text": "can't really enjoy viewing images or buying without it! Fantastic", "date": "Jan 24, 2016"}, {"stars": 5, "text": "The best one, look nowhere else", "date": "Jan 23, 2016"}, {"stars": 4, "text": "Hover Zoom+ works well, exactly the same as the original app. :)\n\nUsed the original ''Hover Zoom'' for many years.\nIt suddenly disappeared from my extensions list and read now that there was spyware in the original extension and this is why Google removed it.\n\nThanks, for the good work.", "date": "Jan 19, 2016"}, {"stars": 5, "text": "THE BEST", "date": "Jan 17, 2016"}, {"stars": 5, "text": "love it!", "date": "Jan 11, 2016"}, {"stars": 5, "text": "Great extension, but why the newest version requires to read AND change ALL data on ALL websites I visit? It actually did work without this extreme setting before, right?", "date": "Jan 10, 2016"}, {"stars": 4, "text": "Good, except that the \"Open image in a new window\" action key in Facebook is not working. Instead of opening the image in a new window, it straightaway download the photo. Please rectify. Thanks!", "date": "Jan 10, 2016"}, {"stars": 5, "text": "Great - but alas does not work on Facebook \n:(\n\nEdit 09.01.16: Does work again with facebook :)", "date": "Jan 9, 2016"}, {"stars": 5, "text": "Best!", "date": "Jan 9, 2016"}, {"stars": 5, "text": "Works fine on Facebook with version 1.0.38.\nWorks with GIF files too. ))", "date": "Jan 7, 2016"}, {"stars": 2, "text": "Just deleted hover zoom and added hover zoom+. Did work perfectly, then suddenly stopped working on facebook... shame!", "date": "Jan 7, 2016"}, {"stars": 2, "text": "Does not work on Facebook.", "date": "Jan 7, 2016"}, {"stars": 5, "text": "fb is back to normal! \nthanks", "date": "Jan 6, 2016"}, {"stars": 3, "text": "it does not work with new facebook version", "date": "Jan 6, 2016"}, {"stars": 1, "text": "Does not work after new update.", "date": "Jan 5, 2016"}, {"stars": 3, "text": "it was dece", "date": "Dec 31, 2015"}, {"stars": 4, "text": "I would have loved it if it weren't so glitchy.", "date": "Dec 31, 2015"}, {"stars": 5, "text": "good one! very usefull", "date": "Dec 27, 2015"}, {"stars": 5, "text": "awesome.", "date": "Dec 27, 2015"}, {"stars": 5, "text": "very good, speed", "date": "Dec 25, 2015"}, {"stars": 5, "text": "Soooooo convenient!! I love searching online with this. Google images, DeviantArt, Reddit, even Amazon! Cuts surfing time in half by just hovering over the image instead of having to open everything. Works with gifs and albums too!", "date": "Dec 24, 2015"}, {"stars": 5, "text": "Good App", "date": "Dec 18, 2015"}, {"stars": 5, "text": "One of the most helpfull extensions on chrome", "date": "Dec 17, 2015"}, {"stars": 5, "text": "It lacks Pixiv support, but overall it's great.", "date": "Dec 13, 2015"}, {"stars": 5, "text": "work great", "date": "Dec 12, 2015"}, {"stars": 3, "text": "Doesn't play audio on webM's with sound like the old one, this is a crucial requirement for me, and other users.", "date": "Dec 11, 2015"}, {"stars": 5, "text": "good", "date": "Dec 11, 2015"}, {"stars": 3, "text": "Chrome dont working  plz fix  thank you!!!", "date": "Dec 9, 2015"}, {"stars": 3, "text": "Chrome opening slow with this extension pls fix", "date": "Dec 8, 2015"}, {"stars": 5, "text": "Take all my stars!", "date": "Dec 7, 2015"}, {"stars": 4, "text": "Doesn't work with .gifv", "date": "Dec 4, 2015"}, {"stars": 5, "text": "i love this extension", "date": "Dec 3, 2015"}, {"stars": 5, "text": "Thank you very much for the new update !   \nI love you for the new feature to scroll through the albums with the mouse wheel ^_^", "date": "Nov 27, 2015"}, {"stars": 5, "text": "Great extension!", "date": "Nov 27, 2015"}, {"stars": 5, "text": "glad to find the remake of the hover zoom. very useful extension", "date": "Nov 26, 2015"}, {"stars": 5, "text": "good", "date": "Nov 26, 2015"}, {"stars": 5, "text": "Loved the previous version, just found that this had come out. Works flawlessly so far, must have extenstion imo.", "date": "Nov 26, 2015"}, {"stars": 5, "text": "Everything works. Even have more supported website than the original.\n\nDevs are reactive and most of the issue in the other reviews I read are apparently fixed", "date": "Nov 25, 2015"}, {"stars": 5, "text": "Works well. one thing that I would like to see (if possible) is to let you scroll through a hovered album with your mouse wheel.", "date": "Nov 25, 2015"}, {"stars": 5, "text": "Thank you!!!!", "date": "Nov 24, 2015"}, {"stars": 4, "text": "works well enough, my only complaint is that links are not left purple after hovering over", "date": "Nov 24, 2015"}, {"stars": 4, "text": "is there scroll wheel navigation?", "date": "Nov 24, 2015"}, {"stars": 3, "text": "Needs scroll wheel navigation again", "date": "Nov 24, 2015"}, {"stars": 1, "text": "Gave me adware. browser always crashes.", "date": "Oct 24, 2015"}, {"stars": 5, "text": "This is probably one of my favorite extensions ever.", "date": "Oct 20, 2015"}, {"stars": 5, "text": "Best thumbnail zoom extension I have found for Chrome. Zooms-in quicker than Hover Zoom and more clearly. Works just as well as Thumbnail Zoom Plus in Firefox. I'm sticking with this one in Chrome.", "date": "Oct 13, 2015"}, {"stars": 5, "text": "Works Great!!", "date": "Sep 11, 2015"}, {"stars": 5, "text": "good", "date": "Aug 27, 2015"}, {"stars": 4, "text": "Switched over to this version of Hover Zoom when the original broke, and so far it's worked exactly how I expected it to.\n\nOne thing I've noticed, though, is that downloaded images used with this extension are of significantly lower quality compared to their original image. It's a bit disappointing, and hopefully this can be somehow improved upon on further updates.", "date": "Jul 12, 2015"}, {"stars": 4, "text": "CURRENTLY BROKEN FEATURES: (on Chrome 49, Hover Zoom+ 1.0.55, OS X 10.10)\n\n- Activate full zoom (still does nothing)\n- Disable hover zoom (still adds links to history)", "date": "Jul 10, 2015"}, {"stars": 1, "text": "It's not working.", "date": "Jun 28, 2015"}, {"stars": 5, "text": "Works good. Glad to see someone is still updating it occasionally. Keep up the good work please.\n\nOne request though:\n1)  An option to display the image resolution along the border, like Imagus.\n\nIt's kind of nice to know the size/resolution of the original image.", "date": "Jun 1, 2015"}, {"stars": 5, "text": "genial", "date": "May 28, 2015"}, {"stars": 5, "text": "Works great, way more transparent than original one.\n\nAlso better webm caching support.\n\nSupport this add-on so it gets updated as often as the malware-full version!", "date": "May 6, 2015"}, {"stars": 1, "text": "Still contains spyware: tracks you via Google Analytics without asking.", "date": "Apr 15, 2015"}, {"stars": 5, "text": "Thank you for adfree/spyware free", "date": "Apr 8, 2015"}, {"stars": 5, "text": "iLove this Extension :D", "date": "Apr 8, 2015"}, {"stars": 1, "text": "Using Chrome Apps & Extensions Developer Tool 0.1.18 Develop and Debug Chrome Apps & Extensions. ID: ohmmkhmmmpcnpikjeljgnaoabkaalbgc\n\nI found out this is still spying and and sending analytics and you can't opt out of this one and everything is being sent. in the background. Try it yourself and you'll see that it is indeed misleading us users which is a huge no no!\n\nHover Zoom Original may have analytics but it indeed allows us users to disable the ability giving us a choice. This one doesn'... Show more", "date": "Mar 9, 2015"}, {"stars": 4, "text": "Doesn't work on reddit correctly anymore.", "date": "Mar 9, 2015"}, {"stars": 4, "text": "Works great like Hover zoom, but isn't infected like hover zoom.  Only downside is on reddit it doesn't update that you saw the link already.", "date": "Feb 28, 2015"}, {"stars": 5, "text": "Amazing. Couldn't live without it.\n\nThe other Hover Zoom has google analytics embedded with no option to disable it. The privacy policy acknowledges this, yet states you have the option to disable it. Not true, as of today.", "date": "Feb 12, 2015"}, {"stars": 5, "text": "Spyware-free!\nThank you Oleg!", "date": "Feb 11, 2015"}, {"stars": 5, "text": "Works the same as Hoverzoom did.", "date": "Feb 6, 2015"}, {"stars": 1, "text": "doesn't work", "date": "Jan 11, 2015"}, {"stars": 5, "text": "This works just as well as the original (works fine for me on Facebook, Pinterest and elsewhere). This has some advantages compared to the original extension: the options interface is nicer looking and this doesn't contain any malware. I was very disturbed to learn the original hover zoom has malware as I've been using that extension for at least 5 years now! I highly recommend this one.", "date": "Dec 2, 2014"}, {"stars": 4, "text": "ESC key should close the zoom window.", "date": "Nov 23, 2014"}, {"stars": 5, "text": "Very good", "date": "Nov 23, 2014"}, {"stars": 2, "text": "Doesn't support gfycat, and is mediocre at best.", "date": "Nov 15, 2014"}, {"stars": 1, "text": "this is ripoff from the original hover zoom and it doesnt work as well.", "date": "Oct 16, 2014"}, {"stars": 2, "text": "Doesn't work on FB profile pictures anymore... at least not reliably.", "date": "Oct 7, 2014"}, {"stars": 5, "text": "Cool. Wish it will be more stable and can support every webpages   we want to hover.", "date": "Sep 4, 2014"}, {"stars": 5, "text": "Much faster than the original.", "date": "May 14, 2014"}, {"stars": 5, "text": "good", "date": "May 1, 2014"}, {"stars": 5, "text": "Exactly like HoverZoom but without the supposed spyware and much more useful options. I've had no issues with it. Highly recommend it!", "date": "Mar 9, 2014"}, {"stars": 5, "text": "Finally! All the substitutes for original Hover Zoom were not up to snuff. I missed the ability to cycle through albums as well as the hotkeys. The only thing I could ask for is a more robust algorithm as the zoom feature doesn't work on a few sites. Thank you for this!", "date": "Mar 5, 2014"}, {"stars": 4, "text": "Works well except the album previews are skipping pictures by 2 when arrowing over. For example I may see 1/25, 3/25, 5/25 then after getting to 25/25 I see 2/25, 4/25, etc.", "date": "Feb 3, 2014"}, {"stars": 5, "text": "I was so sad when I figured out the original Hover Zoom was infected!\nThank you very much!", "date": "Feb 1, 2014"}, {"stars": 5, "text": "Awesome! Works just like the original hover zoom, which lets face it is the best in its category. Thank you for making a malware free version!", "date": "Jan 31, 2014"}]