[{"text": "not quite sure whats happening, i have about 2000 tabs open but its only reporting 7 total, even though it says the current window is 150. worked flawlessly before today. possibly a new update causing issues?", "stars": 4, "date": "Nov 17, 2023"}, {"text": "I just love tracking my tabs so much. I know I shouldnt have 200 open but I do", "stars": 5, "date": "Nov 15, 2023"}, {"text": "The number is really difficult to see. Would've better if there's only the number, that means no folder icon, the whole widget will just be a a number!", "stars": 3, "date": "Nov 10, 2023"}, {"text": "It's functional and very easy to use. It doesn't pretend to be anything other than a tab counter, which I like a lot. The interface also isn't fancy or modern at all which makes it easy to read as well.\nI have used this extension for several years at this point and it's hard to live without it at this point.\n\nI personally use it because I like statistics and I'm a tab hoarder so I want to know how many hundreds of tabs I have open, but it can also be useful for people who want to limit the nu... Show more", "stars": 5, "date": "Oct 4, 2023"}, {"text": "probably the best extension of it's kind. counts total tabs and current window tabs separately. one of few counter extensions that doesn't slow down browser in any way. custom color background works in most browsers", "stars": 5, "date": "Apr 1, 2023"}, {"text": "exactly what i need. trustable since open source", "stars": 5, "date": "Mar 29, 2023"}, {"text": "Only shows tab count from all windows, not possible to only show number of tabs from the current window in the extension icon.", "stars": 3, "date": "Jan 8, 2023"}, {"text": "This extension is rather helpful and has been my constant companion for over a year now.  But with the latest Chrome update it's rather hard to read the badge number\n\nBefore the update my background was red with white numbers but now it's red with black numbers\n\nI wish there were an option to change the number color as well as the badge color.  Ideally there'd be an option to change the font size as well but even just being able to change the font color would do wonders for visibility", "stars": 3, "date": "Jun 12, 2022"}, {"text": "Great, does what it's meant to – I originally given it two stars because though it worked, I thought it was the cause behind malware that was hijacking my browser, but it ended up being another PDF converter extension that I'd added to Chrome months ago! Apologies to anyone who may have seen that review! To anyone who may be struggling with a similar issue, I found out which extension was causing the problems by disabling each one and testing them out individually. I would also be suspicious ... Show more", "stars": 5, "date": "Apr 25, 2022"}, {"text": "Works as intended and helps keep my tabs in check!", "stars": 5, "date": "Mar 9, 2022"}, {"text": "Literally great, i always open tab more than 10-20 or more and acutally wanna know the count of the tabs so i can organize it since i am only have 4gb ram.. but just a suggestion, can it have option to show what count is it will show.. like; show tabs,show windows,show current windows tabs. on the badge on the extension. so i don't need to open it if i only wanted to know one of several thing in it, thank you.", "stars": 5, "date": "Jul 28, 2021"}, {"text": "I miss some more advanced options, but I didn't find any better one for this effect so. Anyway thanks for this extension.", "stars": 4, "date": "Feb 14, 2021"}, {"text": "Came here from Krazy Ken", "stars": 5, "date": "Jan 1, 2021"}, {"text": "Thank you. Nice! But what is the difference between Open Tabs and Max Concurrent Tabs?\nAlso, could you please modify the extension with an option to see the dropdown on mouse hover? Thx again. Good work!", "stars": 5, "date": "Dec 11, 2020"}, {"text": "Its very nice tool. It helps me very much. Unfortunately \"Reset\" button don't work. I hope developer fixt it as soon as possible.", "stars": 4, "date": "Nov 13, 2018"}, {"text": "Not good\nadd tab on current window", "stars": 2, "date": "Jan 5, 2018"}, {"text": "Simple and does what it suppose to do.\nVery good job guys :-)\n\n=> I didn't understand the \"All-time tabs\"... what exactly this is?\n\nThank you.", "stars": 5, "date": "Oct 6, 2017"}, {"text": "Of no value to me.  Small white font on gray background makes it very difficult to read.  Oddly, it use a fourth of the space allowed for it.", "stars": 1, "date": "Jun 9, 2017"}, {"text": "Good, but I prefer \"Tab count\", because it gives the list of the opened tabs, and you can switch to them by clicking them in the list.", "stars": 4, "date": "Dec 8, 2014"}, {"text": "It's very functional, does what it says it does.", "stars": 5, "date": "May 10, 2013"}]