[{"text": "As mentioned by 'Liming Yuan', it does resume failed downloads, but only 4-5 times before giving up. I have to keep going back to resume the download after it has done it a small number of times.", "stars": 2, "date": "Feb 12, 2024"}, {"text": "This extension works fine.  After installing simply pin it to your browser bar and restart Chrome.  Then click on the Auto Restart icon, turn it on, and click [Apply].", "stars": 5, "date": "Feb 9, 2024"}, {"text": "it will resume for 5 times then pause again. I have to keep on resume after 5 retry while down load 5G of file.\nAny way to increase the attempts to a higer value?", "stars": 4, "date": "Jan 30, 2024"}, {"text": "works as intended. Must press the extension and turn it on first", "stars": 5, "date": "Jan 25, 2024"}, {"text": "Not worked. Not resumes after internet connection interruption.", "stars": 1, "date": "Jan 13, 2024"}, {"text": "Great extenstion, works as intended. As another reviewer said, don't listen to the people saying it's useless or not working.", "stars": 5, "date": "Jan 7, 2024"}, {"text": "Don't listen to the goofballs saying it's useless. They forgot to open the extension, select their settings and hit apply.", "stars": 5, "date": "Jan 5, 2024"}, {"text": "Absolutely useless. Does nothing at all.", "stars": 1, "date": "Dec 21, 2023"}, {"text": "no longer works", "stars": 2, "date": "Dec 11, 2023"}, {"text": "Simply does not work.", "stars": 1, "date": "Dec 9, 2023"}, {"text": "This is awesome! The reason why I got this is mainly because my internet sucks at downloading things, it's fine playing games, but downloading things with my internet is dog water. When I wanted to download something, I had to keep pressing 'resume' for HOURS ON HOURS on end! But with this, I dont have to woory about that!", "stars": 5, "date": "Oct 8, 2023"}, {"text": "No longer working.\n\nI tried downloading a video from fansnub.com and it would stop and the extension wasn't restarting it.", "stars": 1, "date": "Sep 28, 2023"}, {"text": "Doesn't work at all", "stars": 1, "date": "Sep 13, 2023"}, {"text": "Worked like a charm at first.. \nyou have to re-apply your settings every 6min or so or your downloads remain stopped. Still far, far better than needing to manually check every ~10s or so.\n\nOthers have noted this seems to be a bug with the buffer size in the Log section. Hopefully this would be an easy bug fix for the dev.", "stars": 4, "date": "Apr 10, 2023"}, {"text": "Works fairly well but may have mixed results for people who have a weaker internet connection.", "stars": 5, "date": "Apr 2, 2023"}, {"text": "I had read the reviews before downloading it, and it is true, after a certain number of download \"resume\" it just stops, defeating the only purpose of the app. I know it can be solved by downloading some 3rd party apps but I'm trying to keep me away from filling my browser with more stuff running in the background.", "stars": 2, "date": "Jan 6, 2023"}, {"text": "It seems to fail after resuming a certain number of times, so you still have to baby your downloads. Less so than if you didn't have the extension at all, mind, but you still have to step in sometimes and resume failed downloads manually.", "stars": 2, "date": "Jan 3, 2023"}, {"text": "If you want this plugin always keep on just download second plugin dudee and it will working perfectly. Download second plugin \"Keep Awake\"", "stars": 5, "date": "Dec 31, 2022"}, {"text": "Doesn't work", "stars": 1, "date": "Dec 13, 2022"}, {"text": "working good, just have to switch on manually from clicking th extention itself and selecting to it on mode.", "stars": 5, "date": "Nov 19, 2022"}, {"text": "Like others have noted, it quits working randomly, defeating the purpose. It it worked all the time, it would get 5 stars.", "stars": 3, "date": "Nov 16, 2022"}, {"text": "For me, it does not work at all. It only fills the log, nothing else. No matter what timer I set, no matter how many times I toggle it on/off, no matter whether the log is cleared or full, no matter whether I have toggled the \"appy to paused items\" it just does not work. Maybe it resumes the download occasionally, it is hard to say since it quite often fails to resume it while I am actually sitting at the computer and working.", "stars": 1, "date": "Nov 2, 2022"}, {"text": "Works, but not flawlessly for me.  It stops working after an unknown number of auto-resumes, or after some amount of time.  This requires intervention, which sorta takes away from the value of the app.  It would probably work great on a good connection that only sporadically hangs.", "stars": 3, "date": "Oct 30, 2022"}, {"text": "YES IT DOES WORK", "stars": 5, "date": "Sep 29, 2022"}, {"text": "very nice! thank you", "stars": 5, "date": "Sep 28, 2022"}, {"text": "Works perfectly. You need to disable power savings feature of chrome when using this plugin, or chrome will put this plug in to sleep and it won't auto resume downloads. Get the \"Keep Awake\" plugin, in addition to this plugin, to ensure that chrome does not put this plugin to sleep.", "stars": 5, "date": "Aug 14, 2022"}, {"text": "Other reviewers have observed that it seems to stop working once it reaches a certain number of resumptions, at which point the logs have to be cleared for it to work again.  I had the exact same experience, it works fine but certain downloads hang up so often that they seem to max it out, but continue once I clear the log manually.  There should probably be a way around this, because even if it's an improvement it still somewhat defeats the purpose of the app if I'm still coming back to my c... Show more", "stars": 3, "date": "Jul 21, 2022"}, {"text": "Really Great Extension. Works as intended.", "stars": 5, "date": "Jul 18, 2022"}, {"text": "Doesn't work.", "stars": 1, "date": "Jun 23, 2022"}, {"text": "it works", "stars": 5, "date": "Jun 8, 2022"}, {"text": "It didn't work with auto-resume. It needs to push the apply button manually. if it is just a bug, I hope it to fix asap", "stars": 2, "date": "May 25, 2022"}, {"text": "May '22 -- im on a chromebook, connected to a dd-wrt repeater bridge, WAN connection provided by rooted andoid phone's hotspot, service on T-mobile (Metro) 4G network.  im using this extension, in conjunction with the Webtor.io extension, to DL shareware and open license media via torrent magnet link.\n\nthe problem i was having was with the phone periodically dropping data for brief moment, which would pause my download.  i would have to babysit the chromebook to resume downloads in the chrome... Show more", "stars": 5, "date": "May 8, 2022"}, {"text": "Simple to use and configure, works perfectly.", "stars": 5, "date": "May 3, 2022"}, {"text": "Only works when it feels like it", "stars": 2, "date": "Mar 25, 2022"}, {"text": "Quite handy especially when the network is not so stable..", "stars": 5, "date": "Mar 18, 2022"}, {"text": "Wow, this has solved my downloads, which need resuming all the time, form so many sites these days that try to implement a timeout for each download.", "stars": 5, "date": "Feb 28, 2022"}, {"text": "Very useful extension and has a timer. Nice feature.\nProblem is basic functionality.....started using it less than a day ago and found that it stopped twice already. It had resumed more than 40 times in the logs the first time. Cleared logs then left the computer for a few hours and found it had stopped again and this time I counted log entries; 59 restarts. Maybe it has a limit of 60 or something. Maybe time as it was left for a few hours each time. Not sure. However it doesn't seem to have ... Show more", "stars": 3, "date": "Feb 15, 2022"}, {"text": "Just installed it. Found the checkbox is hidden under dark theme problematically", "stars": 4, "date": "Jan 11, 2022"}, {"text": "not resume automatically, with it like without it unfortunately", "stars": 1, "date": "Dec 6, 2021"}, {"text": "works", "stars": 5, "date": "Nov 9, 2021"}, {"text": "works once, twice if you're lucky, then just stops working all together. it seems like a fairly simple concept I have no idea why this wouldn't work.\n\nedit: after using it for another day and checking the logs i found that it DOES work, but randomly stops for no reason. im changing my rating from 1 to 3 stars for this. do note that it wont work if your computer is locked (had to learn that the hard way)", "stars": 3, "date": "Aug 23, 2021"}, {"text": "I've followed the instructions. It simply doesn't do anything. I've been trying to download the trial version of Adobe Framemaker, which is 2.4GB, and which fails every few seconds. It doesn't resume. I have to keep manually clicking Resume.", "stars": 1, "date": "Jul 19, 2021"}, {"text": "So far it works well. Haven't tried the \"apply to paused items\" but I assume it resumes things paused manually. Seems useful if your connection starts fast and then slows down (like mine).\n\nI ran into a hiccup when installing (kind of my fault) where a download from a few days ago resumed (I hadn't yet closed Chrome) and - because I had my Download History open, the popup didn't open and it was downloading way down the list.\n\nGot me thinking... Might I suggest an option to make this extension... Show more", "stars": 5, "date": "Jun 27, 2021"}, {"text": "No longer works properly.  Will only resume when I toggle off and back on again but not automatically while toggled on.", "stars": 1, "date": "May 17, 2021"}, {"text": "It's really good. Since I installed it, it helped me resume my downloads effortlessly. Thanks", "stars": 5, "date": "Mar 11, 2021"}, {"text": "It stops occasionally, but it works.", "stars": 3, "date": "Mar 11, 2021"}, {"text": "I love it! No need to sit in front of a computer.", "stars": 5, "date": "Mar 9, 2021"}, {"text": "It works great, but sometimes it stops working", "stars": 4, "date": "Mar 7, 2021"}, {"text": "When it resumes, why does it start again at zero every time?  I've got a shaky connection, and I need it to continue adding to what it has already downloaded, not start all over again.  How does that help me?  I never get my file downloaded.", "stars": 3, "date": "Mar 5, 2021"}, {"text": "Works perfectly", "stars": 5, "date": "Feb 24, 2021"}, {"text": "Very Useful", "stars": 5, "date": "Feb 22, 2021"}, {"text": "great", "stars": 5, "date": "Feb 22, 2021"}, {"text": "works well", "stars": 5, "date": "Feb 17, 2021"}]