[{"date": "Mar 2, 2024", "text": "just wow\nthis made scratch so much better for me", "stars": 5}, {"date": "Feb 25, 2024", "text": "amazing but the message notifier would only notify after 2 minutes. please fix this. Other than that I think this is pretty cool I can make scratch look like I want.", "stars": 5}, {"date": "Feb 24, 2024", "text": "can you add the ability to customize the coding background, So i do not mean the backdrop, i mean the actual plain white boring background where you put blocks together", "stars": 3}, {"date": "Feb 22, 2024", "text": "Really majestic! My scratch looks cool! Would you want to change the fonts in scratch? Please add this addon!", "stars": 5}, {"date": "Feb 10, 2024", "text": "i LOVE this i mean it has dark mode and i like dark mode a lot!+the debuger!", "stars": 5}, {"date": "Feb 5, 2024", "text": "MY SCRATCH LOOKS ABSOLUTE MAJESTIC!!! this is awsome, add some addons which gives us new blocks please. we only have debugger type of new blocks.", "stars": 5}, {"date": "Feb 4, 2024", "text": "amazing! \n\nI just dont know what to say or where to start! it has EVERYTHING to make a scratchers life better! from dark mode so you wont have fire as eyes, the onion slicing so you won't have anything too choppy, heck! even just the volume slider is great!", "stars": 5}, {"date": "Feb 3, 2024", "text": "absolutely amazing, has all of the features you'd love, dark mode, colors, you can even change your type of editor!\nyou can put your editor from the right to the left, left to the right,\nchange block colors\nchange block types and make them look like 2.0 scratch\namazing,\ntruly amazing.", "stars": 5}, {"date": "Jan 30, 2024", "text": "Scratch Addons is just Scratch Pro, its amazing", "stars": 5}, {"date": "Jan 20, 2024", "text": "great", "stars": 5}, {"date": "Jan 19, 2024", "text": "Use this all the time, absolutely recommended.", "stars": 5}, {"date": "Jan 18, 2024", "text": "i want to change folder color!", "stars": 2}, {"date": "Jan 14, 2024", "text": "This is amazing", "stars": 5}, {"date": "Jan 7, 2024", "text": "i cannot fathom how cool this application is, i can only say one thing among lots of other adjectives:\nmindblowing", "stars": 5}, {"date": "Jan 3, 2024", "text": "the dark mode is sooo goooooood.", "stars": 5}, {"date": "Dec 31, 2023", "text": "One Word: Incredible", "stars": 5}, {"date": "Dec 30, 2023", "text": "yo this is the best extension ever all scratchers need this", "stars": 5}, {"date": "Dec 18, 2023", "text": "This is the best scratch addons in the world. 11/10 recommend it to all scratchers. This make scratch at it best and it really good for everyone. The best thing about it that it free and no complicated steps or login requied. Really good,", "stars": 5}, {"date": "Dec 16, 2023", "text": "This has greatly helped my experience with scratch, any basic user needs this add on. 5/5 Would definitely recommend.", "stars": 5}, {"date": "Dec 15, 2023", "text": "I accedently added an extention on scratch and I whold like delete it.\nCan you put that in your next update?", "stars": 4}, {"date": "Dec 15, 2023", "text": "horrible! I love it!", "stars": 5}, {"date": "Dec 14, 2023", "text": "It makes scratch easier to look at with dark mode and just has so many benefits!", "stars": 5}, {"date": "Dec 14, 2023", "text": "how did i live without it", "stars": 5}, {"date": "Dec 11, 2023", "text": "Amazing extension. I've been coding in scratch for more than a year now and Scratch Addons has made the experience so much better. 5 stars!", "stars": 5}, {"date": "Dec 11, 2023", "text": "This should be a school approved extension. But unfortunately im stuck with white and purple at school :(", "stars": 5}, {"date": "Dec 8, 2023", "text": "realy good but i have one suggestion make it so you can add your own font", "stars": 4}, {"date": "Dec 7, 2023", "text": "Great. I'm watching griffpatch as I'm writing this.", "stars": 5}, {"date": "Nov 30, 2023", "text": "This extension is what scratch should be.... good, listens to the community, very compatible, and amazing to use. It's pretty much like the perfect extension and I don't think any other scratch extension out there could possibly beat this. The only thing that I would suggest adding on to here or that what I don't like about it, is that there isn't a transparent feature tool. Could be very useful and at the moment I can't get turbowarp, soooo....", "stars": 5}, {"date": "Nov 19, 2023", "text": "There is no  scratch extension better than this! Plus, it's free! What are you wait for?", "stars": 5}, {"date": "Nov 16, 2023", "text": "Sooooooooo Coooooool.", "stars": 5}, {"date": "Nov 11, 2023", "text": "Its good, but i honestly want a merging/cutting/dividing shapes addon. I dont wanna remake the borders of specific shapes just for something i wanna do.", "stars": 4}, {"date": "Nov 11, 2023", "text": "Great! This is so cool!", "stars": 5}, {"date": "Nov 8, 2023", "text": "I love it, like I have so many addons, that the display says \"?\" (is that a sign that something might happen?)", "stars": 5}, {"date": "Nov 4, 2023", "text": "i love it so much", "stars": 5}, {"date": "Oct 29, 2023", "text": "It stopped working after like a year. No addons show up and dark mode does not work. Scratch Addons is terrible. I contacted Scratch Addons and switched to a different Scratch customizor until this problem is fixed.\nEdit: Chrome keeps saying it may be corrupted. Is this Chrome or the extension's fault? It does not do it in Edge. Most likely it's Chrome. DAMN YOU CHROME!!! CONSPIRACY!!!!===", "stars": 1}, {"date": "Oct 17, 2023", "text": "wow cool", "stars": 5}, {"date": "Oct 14, 2023", "text": "Really cool extension...have some bugs but it still make the work alot easier...I would appreciate if they make something like a login feature so that we dont have to import data when we switch browsers or something", "stars": 5}, {"date": "Oct 13, 2023", "text": "This is the greatest scratch mod ever and I wish all of these ideas were in real scratch! My favorite features include the pause button, mouse position display, editor find bar, jump to block definition, convert variable to this sprite only, clone counter, running block border, and the debugger panel because these features make it so much easier to find and fix bugs in scratch games! Everyone who uses scratch a lot because not only does it make coding a lot easier, it also improves other aspe... Show more", "stars": 5}, {"date": "Oct 9, 2023", "text": "This might as well be Scratch 4.0 with how many fully customizable features and quality of life improvements this extention adds. From basic fixes that everyone should be using to more specific features for more experienced scratchers, there's absolutely no reason why you shouldn't get this extention!", "stars": 5}, {"date": "Oct 1, 2023", "text": "amazing, was able to switch all my variables to \"for this sprite only\" and it only took a few seconds, as apposed to the 20 mins it probably would've taken me. pause feature is really great too", "stars": 5}, {"date": "Sep 21, 2023", "text": "i cant see anything no options pls fix i dont see nothin", "stars": 3}, {"date": "Sep 19, 2023", "text": "Loved it! Has so many options, opacity slider (best of all), and much more! Tbh if I could I'd rate it 100 stars out of 5", "stars": 5}, {"date": "Sep 15, 2023", "text": "good", "stars": 4}, {"date": "Aug 30, 2023", "text": "This thing, is so AWESOME! Scratch addons saved me so much time. The only thing is that i don't understand how to use folders.. Great extension!", "stars": 5}, {"date": "Aug 22, 2023", "text": "Good soup", "stars": 5}, {"date": "Aug 11, 2023", "text": "Really epic! I love it!", "stars": 5}, {"date": "Aug 10, 2023", "text": "Filter messages addon makes every message disappear, hopefully it gets fixed", "stars": 4}, {"date": "Jul 24, 2023", "text": "is real good i wish late saw this", "stars": 5}, {"date": "Jul 16, 2023", "text": "This addon for scratch opens many doors, especially when its so easy to get as an extension. All you have to do is click it in your extension toolbar and it works! There are so many options, some which are enabled by default. I recommend this to anyone! [sorry its so big]", "stars": 5}, {"date": "Jul 15, 2023", "text": "This extension is good for Scratchers!", "stars": 5}, {"date": "Jul 14, 2023", "text": "I turned on sync and it wont sync to my device what do i do?", "stars": 5}, {"date": "Jul 3, 2023", "text": "This is the best addon to use on scratch. Many settings so you can customize scratch to your liking! This is really a recommended addon and you should download it!", "stars": 5}, {"date": "Jul 3, 2023", "text": "Its good but the \"Customizeable Navigation Bar\" Setting Breaks Scratch For example \"When you enable it and turn projects/editor To projects/create It shows an ERROR Sign", "stars": 3}, {"date": "Jul 2, 2023", "text": "Honestly its a W, nothing bad about, just don't put on every single add-on like I did...", "stars": 5}, {"date": "Jun 30, 2023", "text": "I don't know what to even say. This is completely broken every time I've tried to use it in the past few days. It opens, but then the addons don't even exist. There's nothing that it shows me, and no videos tell me how to fix this. I'm probably not re-reviewing until it actually explains how to fix it. It worked before hand and was good, but then all my addons got deleted and I couldn't use it anymore.", "stars": 2}, {"date": "Jun 27, 2023", "text": "If you use scratch a lot. Either to make games, play them, and/or just talking through messages, scratch addons covers all of that. Scratch addons can help you by showing possible glitches like more clones then there should be. There's the 60 FPS button, which can be set to 240 FPS, so if you have a boring un-skippable cutscene, you can go through it 8 times as fast, Scratch addon will notify you whenever you receive a message, so if you are talking with someone, you can do other stuffs while... Show more", "stars": 5}, {"date": "Jun 24, 2023", "text": "AWESOME :DDDDD Wait... CAT! CAT! CAT!", "stars": 5}, {"date": "Jun 23, 2023", "text": "It's a good app, but for some reason, it is disabled in my browser and my device is compatible!", "stars": 5}, {"date": "Jun 22, 2023", "text": "i love this but theres a bug where when you install it the thumnail to studios and projects a blanc", "stars": 5}, {"date": "Jun 20, 2023", "text": "If you use Scratch, you use Scratch Addons, it's that simple. The developer community is very active, so don't pay attention to all the reviews about bugs, chances are it's been fixed by now.", "stars": 5}, {"date": "Jun 11, 2023", "text": "even though the ps3 control axis 2&3 is encoded wrong on the game pad extension, I like it.", "stars": 4}, {"date": "Jun 6, 2023", "text": "I love everything about this extension definitely get it there's sooo many things that it adds to scratch. The onion skinning for animation and the clone counter is great. THE MOUSE POSITION THING IS THE BEST OMG.", "stars": 5}, {"date": "May 27, 2023", "text": "GOOD!!!!", "stars": 5}, {"date": "May 23, 2023", "text": "YESSIR ITS SO GOOD BEST ADDON EVER!!!!!!!!!!!!!!!!!!!", "stars": 5}, {"date": "May 16, 2023", "text": "Extremely useful!\n\nThere is an issue where the invite followers button is missing.\nNot sure if scratch maybe got rid of it.", "stars": 5}, {"date": "May 14, 2023", "text": "THIS IS AMAZING!!!!11!11!!!!11!!1       You can add SO MANY FREAKING THINGS TO SCRATCH. The most helpful ones to me were the volume slider and the pause button. I LOVE IT!1", "stars": 5}, {"date": "May 13, 2023", "text": "This is really good I made really good animations with this thing. Though the opacity slider doesn't show up even if I am on vector.", "stars": 4}, {"date": "May 11, 2023", "text": "alright so the extensions good, never saw bugs yet, so i recommend it for scratchers who need help", "stars": 5}, {"date": "May 5, 2023", "text": "I love scratch addons because it adds features that should be in the website in the first place. also the cat blocks are cool.", "stars": 5}, {"date": "Apr 17, 2023", "text": "Hmm... Ok There Is A Massive BUG That Really Really Effects Me Because,\n1.No Addons Show Up Its Just A Blank Page Even In Editor Its Still Blank\n2.Cant Acess Dark Mode So Without Dark Mode My Eyes Are Burning Like\n3.Opacity Slider Is The 2nd Most Important Because,\n~~~~~~~~~~~~~~~~~~~~~Reasons Why Opaity Slider Is The 2nd Most Important~~~~~~~~~~~~~~~\n1.I Make Art On It\n2.It Makes Better Text Shadows \n3.I Dont Like Turbo Wrap Cause It Takes Up My PC's Memory\n..................................... Show more", "stars": 3}, {"date": "Apr 9, 2023", "text": "Every extension suddenly stopped working. Dark mode was no longer applied, and options just showed a blank page.", "stars": 1}, {"date": "Apr 4, 2023", "text": "cat blocks dosent work bruh", "stars": 3}, {"date": "Apr 3, 2023", "text": "It was amazing, but I cant figure out how to get back to the pop-up, because I made it look ugly and I can't figure out how to change it", "stars": 5}, {"date": "Apr 1, 2023", "text": "Awesome, but what happened to Scratch Avocados?", "stars": 5}, {"date": "Mar 31, 2023", "text": "VERY COOL AND FUN!!!!! :D ❤ I HIGHLY recommend!!!!!!! :D great job!", "stars": 5}, {"date": "Mar 30, 2023", "text": "Scratch Is Now So Much Better Than Ever! I Want You To Download It Plz!", "stars": 5}, {"date": "Mar 25, 2023", "text": "It works and sometimes dont. Like on certians moments it shows and works but some dont and only shows name and bar", "stars": 3}, {"date": "Mar 21, 2023", "text": "It's great! There are so many great and useful features that work well.", "stars": 5}, {"date": "Mar 14, 2023", "text": "I was so excited when I got it and I loved it. (I'm a kid using my dads profile)", "stars": 5}, {"date": "Mar 8, 2023", "text": "An actually useful extension, works almost flawlessly.", "stars": 5}, {"date": "Mar 5, 2023", "text": "This extension has many useful features.", "stars": 5}, {"date": "Mar 5, 2023", "text": "love it", "stars": 5}, {"date": "Mar 2, 2023", "text": "Loved it, only problem is: it's broken. Everything ABOUT it just BROKE. Especially on MacOS. Would love if this glitch is fixed.", "stars": 5}, {"date": "Feb 27, 2023", "text": "I like the extension!", "stars": 5}, {"date": "Feb 21, 2023", "text": "Amazing, I love the dark mode so my eyes don't burn out at night", "stars": 5}, {"date": "Feb 20, 2023", "text": "it good", "stars": 5}, {"date": "Feb 18, 2023", "text": "For some reason all my addons turned off and when I opened scratch addons it was a blank page, would give 5 star if it didnt happen", "stars": 3}, {"date": "Feb 15, 2023", "text": "There are so many features. I like all of them!!", "stars": 5}, {"date": "Feb 14, 2023", "text": "crashes scratch", "stars": 1}, {"date": "Feb 7, 2023", "text": "Very Good", "stars": 5}, {"date": "Feb 7, 2023", "text": "Literally the best addon in existance", "stars": 5}, {"date": "Feb 6, 2023", "text": "So Glad this is free!", "stars": 5}, {"date": "Feb 5, 2023", "text": "This is such a good extension! I reccomend it to all Scratch user, new and old, because this has blown me away! Dark mdoe, 60FPS support, GAMEPAD SUPPORT - like how is this a real thing?", "stars": 5}, {"date": "Feb 5, 2023", "text": "how this possible", "stars": 5}, {"date": "Feb 4, 2023", "text": "I didn't know all this was possible", "stars": 5}, {"date": "Jan 31, 2023", "text": "working on getting it fixed yippie", "stars": 3}, {"date": "Jan 8, 2023", "text": "I could now be in dark mode! Why hasn't dark mode not been added to the official website...? I have no clue, THANK YOU FOR THIS!!", "stars": 5}, {"date": "Jan 6, 2023", "text": "This is amazing! When I started using this, my scratch experience got better. I really love the dark mode feature, and the one the saves me the most is the inbox notifications. I rate this 10/10!", "stars": 5}, {"date": "Dec 22, 2022", "text": "This is amazing! You can change the whole website just to make it feel right because there is one feature for everyone", "stars": 5}, {"date": "Dec 21, 2022", "text": "It stopped working... What do I do to fix this?", "stars": 5}, {"date": "Dec 11, 2022", "text": "\"Why does scratch look like that man\"\n\"Why does YOUR scratch look like THAT?\"\ndownload this please i beg of you", "stars": 5}, {"date": "Dec 4, 2022", "text": "Everyone on scratch needs this frkin` extension", "stars": 5}, {"date": "Nov 28, 2022", "text": "Makes receiving notifications way easier without needing to visit scratch to know if I had recieved any! Oh, and the onion skinning tool, as well as the ability to find my cursor's X and Y point on the screen, and all the other add-ons from adjusting profile appearance to swapping variables makes Scratch far more easier to use than before :)\n\nThe only thing I'd suggest is a way to have the same settings across different devices since it's a pain to search through 100+ setting options multiple... Show more", "stars": 5}, {"date": "Nov 20, 2022", "text": "This extension makes the Scratch website and project editor so much better.", "stars": 5}, {"date": "Nov 19, 2022", "text": "Well hello to a person who is smart to make sure this is not a bad app, well its not bad actually i use scratch often and it actually really good and has features that should be in scratch", "stars": 5}, {"date": "Nov 18, 2022", "text": "this made scratch like 100 times better", "stars": 5}, {"date": "Nov 14, 2022", "text": "All (140+) addons are optional, and this has everything from major features to minor tweaks. Plus, it's open source! If you use Scratch, then there's really no reason not to use this.", "stars": 5}, {"date": "Nov 13, 2022", "text": "Incredible...", "stars": 5}, {"date": "Nov 6, 2022", "text": "It's amazing but for some reason today it isn't working. Would give 5 star review if it wasn't broken.", "stars": 4}, {"date": "Nov 5, 2022", "text": "Amazing! it help me animate a ton! I don't know what to do without it!", "stars": 5}, {"date": "Oct 30, 2022", "text": "i just got it and saw all the features, 4 start because it looks cool", "stars": 4}, {"date": "Oct 30, 2022", "text": "Best Extension For Scratch 3.0!", "stars": 5}, {"date": "Oct 28, 2022", "text": "This made my scratch experience Much better", "stars": 5}, {"date": "Oct 27, 2022", "text": "I can finally leave a studio without finding myself or doing hard tutorials.", "stars": 5}, {"date": "Oct 9, 2022", "text": "I can finally use scratch when its late with out my eyes burning!\n\nHooray for dark mode!!", "stars": 5}, {"date": "Oct 6, 2022", "text": "never mind it works now ! i just had to scroll down to find it!", "stars": 5}, {"date": "Sep 25, 2022", "text": "this was AMAZING. everyything changed in a very good way. all those customizable themes, the dark mode, own colors, new textures, blocks, warnings, clickable featured projects - I love it. it's amazing. install it quick!", "stars": 5}, {"date": "Sep 19, 2022", "text": "Incredible! I just love this", "stars": 5}, {"date": "Sep 17, 2022", "text": "It's absolutely amazing, extremely useful, but it would be even more useful if i could make an account or something to save my settings, because when i keep switching computers or keep resetting my stuff i have to go over every single god damn setting again because of course i didn't save my settings in a json file lol", "stars": 4}, {"date": "Sep 15, 2022", "text": "Use this if you use scratch. Just do it.", "stars": 5}, {"date": "Aug 27, 2022", "text": "I could just insta-leave any studio, and it helped me not get muted for no reason. (Because apparently, saying : ''YESS I FINALLY LEFT USING SCRATCH ADDONS'' will mute me for 5 minutes. Love it, it's so cool and I love it. Totally reccomend!", "stars": 5}, {"date": "Aug 20, 2022", "text": "Amazing", "stars": 5}, {"date": "Aug 19, 2022", "text": "I love this!! It's perfect for playing at 60 FPS, using controller support, editing the UI, and a lot more!! There is one thing I want, for this to be able to be used for older versions of Scratch, like 2.0 and 1.4!", "stars": 5}, {"date": "Aug 18, 2022", "text": "i love it\n\nthe problem is the little message window when you clicked the addon icon\n\nafter like a few minutes or so (or when it reaches the project messages) scratch addons crashed, showing a \"can't show messages, please log in on scratch\" message, even though i'm signed in\n\nplease fix", "stars": 4}, {"date": "Aug 15, 2022", "text": "I can finally remix my own projects! :D", "stars": 5}, {"date": "Aug 6, 2022", "text": "WORST EXTENSION EVER!!!!!!!!!!!!!!!!!! ADD A CONFIRMATION MESSAGE TO CONFIRM IF YOU REALLY WANT TO MARK ALL YOUR MESSAGES AS READ!!!!!!!!!!!!!!!!!!!!", "stars": 1}, {"date": "Aug 5, 2022", "text": "I have a ps4 controller in my house with no use for it, until i found out that you can use a controller on scratch! I rate this 5/5", "stars": 5}, {"date": "Jul 16, 2022", "text": "Amazing extension enabled all and works!", "stars": 5}, {"date": "Jul 10, 2022", "text": "Its nice, but it keeps getting corrupted. I need to reinstall it and set it up all over again. other than that, great work :)", "stars": 4}, {"date": "Jul 8, 2022", "text": "its the best i can finally now clean up my scripts like @griffpatch (THIS IS A BLESSING IN DESGUISE) i will always find this as the perfect tool for every project hope yo guy add it as well", "stars": 5}, {"date": "Jul 8, 2022", "text": "this is THE BEST scratch addon ever. It helps me organize and even has a clean up blocks+ feature which arranges your code in the position you put it. Great! go get it now.", "stars": 5}, {"date": "Jul 5, 2022", "text": "It is a great extension for better Scratch projects. Scratch Addons helped me with a lot of thing in Scratch, like making Scratch 3.0 (sort of) resemble Scratch 2.0 and help myself with making costumes.\nI hope that Scratch will introduce more people to start coding.", "stars": 5}, {"date": "Jul 3, 2022", "text": "very epic\nits working pretty well\ni love dark mode", "stars": 5}, {"date": "Jun 21, 2022", "text": "Amazing for scratch and eazy to use", "stars": 5}, {"date": "Jun 13, 2022", "text": "Great experiance!", "stars": 5}, {"date": "Jun 12, 2022", "text": "it was working fine until my browser wiped all extension data, tampermonkey let me know about it, now scratch addons is completely unuseable. please fix.", "stars": 4}, {"date": "Jun 3, 2022", "text": "They give you good tools to make coding faster, and easier! Also you can check your messages in it, view projects or search project more efficiently", "stars": 5}, {"date": "Jun 1, 2022", "text": "I enjoy extendion", "stars": 5}, {"date": "May 19, 2022", "text": "i absolutely love this, but how do i change the language to english. Bc it automaticly changed it to dutch.", "stars": 5}, {"date": "May 18, 2022", "text": "This is really good for lots of reason totally recommend getting it.", "stars": 5}, {"date": "May 14, 2022", "text": "Amazing. No words can describe it.", "stars": 5}, {"date": "May 12, 2022", "text": "wow m8", "stars": 5}, {"date": "May 7, 2022", "text": "Added My Scratch Pause Button, Block Color, And More!", "stars": 5}, {"date": "May 3, 2022", "text": "its ok but i wanna enable all but i cant any suggestions on how i do it", "stars": 4}, {"date": "Apr 27, 2022", "text": "Great addon for scratch! If you use it a lot you will quickly see how much it does, makes things 100X times easier. 9-10", "stars": 5}, {"date": "Apr 27, 2022", "text": "IT WAS AMAZING!", "stars": 5}, {"date": "Apr 20, 2022", "text": "chicken bone, i'm always home, this is amazing.", "stars": 5}, {"date": "Apr 14, 2022", "text": "Good Extension I Use It", "stars": 5}, {"date": "Apr 9, 2022", "text": "this app is like scratch premium,because there are addons like pause, dark screen, cat blocks andHHD images.", "stars": 4}, {"date": "Apr 5, 2022", "text": "i love this extension because  you can use the dev tools without the extension", "stars": 5}, {"date": "Mar 31, 2022", "text": "I used this to impress my classmates with my scratch \"4.0\" lolz", "stars": 5}, {"date": "Mar 19, 2022", "text": "i like it i want to add it to msedge on my monter sorry for the bad spelling.", "stars": 5}, {"date": "Mar 16, 2022", "text": "Too good to be true 😆", "stars": 5}, {"date": "Mar 13, 2022", "text": "Great! now I can bend the contents of scratch to my will!", "stars": 5}, {"date": "Mar 10, 2022", "text": "The only thing i would like to see added is folders for the backpack.", "stars": 5}, {"date": "Mar 5, 2022", "text": "It is really good for adding dark mode and being able to search to add a block. It would be five stars if it worked with scratch lab tho.", "stars": 4}, {"date": "Mar 2, 2022", "text": "This extension was the BEST! So many addons to choose from! This is so cool! I will use this forever!", "stars": 5}, {"date": "Feb 24, 2022", "text": "Sa is epic", "stars": 5}, {"date": "Feb 22, 2022", "text": "WAY BETTER THAN BETTER3.0", "stars": 5}, {"date": "Feb 21, 2022", "text": "I love it! You can customise so much!", "stars": 5}, {"date": "Feb 13, 2022", "text": "This extension is awesome I highly recommend it. It is such a useful tool", "stars": 5}, {"date": "Feb 8, 2022", "text": "Yo Bro Thank You So Much It Really Works No bugs, the best scratch extension!", "stars": 5}, {"date": "Feb 7, 2022", "text": "Doesn't Work, Cant figure out how to get the addons to actually do anything.", "stars": 1}, {"date": "Feb 2, 2022", "text": "Its the best extension i ever had Great Job Developers!", "stars": 5}, {"date": "Feb 1, 2022", "text": "(I'm from Ukraine) Very cool extension, it helps me a lot and made my work on this site easier, thank you again for this great extension!", "stars": 5}, {"date": "Feb 1, 2022", "text": "this is very good but the only problem is when i go to my profile, the navigation bar turns green and the links turn green too. can you please fix that? thank you :)", "stars": 4}, {"date": "Feb 1, 2022", "text": "Can you please update to version v1.24.0? I'm using Google Chrome.", "stars": 5}, {"date": "Jan 14, 2022", "text": "3rd party addons aren't allowed on scratch", "stars": 1}, {"date": "Jan 12, 2022", "text": "only scratch 2.0? or 3.0 or both?", "stars": 3}, {"date": "Jan 11, 2022", "text": "Wow! Cool! really! But! One thing is that I'm switching browsers and I need to once again install this, and Do the same options turn on and off. Can you add a feature to save your current features and load it too? That wll help when you are switching browsers or devices. \n\nThanks Scratch addons!\nScratch On!", "stars": 5}, {"date": "Jan 8, 2022", "text": "This is the best scratch extension! It has all the things you need to code.", "stars": 5}, {"date": "Dec 22, 2021", "text": "yay", "stars": 5}, {"date": "Dec 20, 2021", "text": "This is amazing! There's no reason why you shouldn't download it, it makes Scratch way easier to use and has lots of amazing features! \nI have one suggestion and that would be the option to block people. One of my friends has someone spamming their profile and can't really go on Scratch without the fear of that person talking to them.", "stars": 5}, {"date": "Dec 18, 2021", "text": "very epicness", "stars": 5}, {"date": "Dec 17, 2021", "text": "I love it! Its the best and has very super options!!!!! \nleaving and removing and promoting on studio, and upload pics on forum are the best options! could it have one more option to search a message? Just a feedback. I love this so much!! best extension for scratch.", "stars": 5}, {"date": "Dec 11, 2021", "text": "great extention", "stars": 5}, {"date": "Dec 9, 2021", "text": "The best adition to Scratch! I cant imagine Scratch without it.", "stars": 5}, {"date": "Dec 8, 2021", "text": "I didn't know I needed this until I got it, the devs behind this project are true legends and deserve a pat on the back.", "stars": 5}, {"date": "Nov 30, 2021", "text": "very cool i recommend to every single human being who has scratch. i liked the new columns addon", "stars": 5}, {"date": "Nov 27, 2021", "text": "This extension is probably the best extension I have ever downloaded and that's no exaggeration. I loved it, it creates a great and helpful experience for the user with lots of customizable options. I don't have any complaints just one idea/suggestion. Would you be able to make it easier to show all the sprites instead of having to scroll down. Maybe have them horizontally so more fit on the screen, thanks again for creating this extension", "stars": 5}, {"date": "Nov 21, 2021", "text": "Its a good thing that helps with coding on scratch!", "stars": 5}, {"date": "Nov 14, 2021", "text": "This extension is a total game changer for Scratch.  Is there a little quirk about the editor that always gets in your way?  Do you hate having to restart your entire project every time you make a change instead of just pausing?  Do you wish that the full screen button actually made the project, you know, full screen?  Well, there's a very good chance that this extension can fix nearly all of those issues!  Without this extension, I'm honestly not sure if I would enjoy using Scratch nearly as... Show more", "stars": 5}, {"date": "Nov 3, 2021", "text": "this extension is soooooo AWSOME. it helps me very lot. I love this extension.  thanks.", "stars": 5}, {"date": "Oct 31, 2021", "text": "Very cool but how its find messages in scratch???", "stars": 5}, {"date": "Oct 31, 2021", "text": "What Happened? My Scratch Addon Don't Work, Help Fix It Please...", "stars": 4}, {"date": "Oct 27, 2021", "text": "Can you use the Debugger addon in scratch for public uses?", "stars": 4}, {"date": "Oct 15, 2021", "text": "It edits scratch!  And it makes scratching waaaaaaaaay easier. \nIts one of those extensions that actually works and is being updated constantly", "stars": 5}, {"date": "Oct 13, 2021", "text": "This is the best Scratch browser extension that ever existed. It has 110+ addons, endless customization, and more. You guys should try it out.\n\nP.S. don't mention it on Scratch, you will get reported.", "stars": 5}, {"date": "Sep 26, 2021", "text": "i love it", "stars": 5}, {"date": "Sep 18, 2021", "text": "it help me", "stars": 5}, {"date": "Sep 12, 2021", "text": "Great Extention for scratch, I like how you can make scratch dark and you can clean up blocks better", "stars": 5}, {"date": "Sep 7, 2021", "text": "I made 3.0 look like 2.0 in the editor, but now I already forgot what the 3.0 editor looks like normally without it looking weird. :T But that's a good thing! Because now I can upload using Vector, pause the project without restarting it, and save Vector art as SVGs! Thank you Griffpatch, World_Languages, and many others for this AMAZING and USEFUL extension!", "stars": 5}, {"date": "Sep 6, 2021", "text": "can you add a clear all coments button", "stars": 5}, {"date": "Sep 5, 2021", "text": "Yes i do like it but uhh.... wheres support for incognito mode.", "stars": 3}, {"date": "Sep 3, 2021", "text": "#1 Addons for Scratch", "stars": 5}, {"date": "Aug 28, 2021", "text": "its awesome really good i used 60fps and cat blocks and it worked. thanks", "stars": 5}, {"date": "Aug 26, 2021", "text": "very good working extension!", "stars": 5}, {"date": "Aug 26, 2021", "text": "Great! I have been using this for weeks and the scratch notfier helps me reply to lots of messages quickly.", "stars": 5}, {"date": "Aug 20, 2021", "text": "this is soo cool", "stars": 5}, {"date": "Aug 6, 2021", "text": "Very good. The amount of easter eggs and thing to help like griffpatch's dev tools is a very useful amount. Scratch extensions has honestly made things easier.", "stars": 5}, {"date": "Jul 26, 2021", "text": "Better than chocolate cake! 🎂", "stars": 5}, {"date": "Jul 23, 2021", "text": "Very good extension! All the addons are AMAZING!", "stars": 5}, {"date": "Jul 20, 2021", "text": "Terrific!", "stars": 5}, {"date": "Jul 8, 2021", "text": "The amount of quality of life changes Scratch Addons introduces are plentiful, and I refuse to use Scratch without it.", "stars": 5}, {"date": "Jul 8, 2021", "text": "i have not used it yet, but soon i will sacrifice my sanity to becoming a user of the extension. wish me luck", "stars": 4}, {"date": "Jul 8, 2021", "text": "If it has a function that can auto generate some blocks in the new sprite that we create it, that will be very very very very very useful!", "stars": 5}, {"date": "Jul 1, 2021", "text": "this is pretty useful!", "stars": 5}, {"date": "Jun 30, 2021", "text": "I love it! and I want Scratch have a block Connet to database. Please Make it heppend", "stars": 5}, {"date": "Jun 29, 2021", "text": "This is so good, helps me a lot, love you griffpatch and the devs.✌️", "stars": 5}, {"date": "Jun 25, 2021", "text": "Was extremely great to use, Made project development and the rest of the website so much easier. Unfortunately, Following my ban from Scratch (might be able to come back no idea) I will have to leave this behind. Farewell!", "stars": 5}, {"date": "Jun 7, 2021", "text": "look way better", "stars": 5}, {"date": "Jun 5, 2021", "text": "I don't know why my clone counter automatically disapeared even though I enabled it and reloads the web several times.", "stars": 4}, {"date": "Jun 2, 2021", "text": "LOVE it I use scratch everyday. It's like a scratch 4.0!", "stars": 5}, {"date": "May 29, 2021", "text": "Great!", "stars": 5}, {"date": "May 28, 2021", "text": "Best extension ever", "stars": 5}, {"date": "May 27, 2021", "text": "Best!", "stars": 5}, {"date": "May 24, 2021", "text": "This is INSANELY good! It's easy to use, fun, and useful! I mean, I've always needed sprite folders! 5/5 stars. You definitely deserved it!", "stars": 5}, {"date": "May 21, 2021", "text": "This is very good for those who dont have the time to go on the scratch website, and it gives a better characteristic of scratch.", "stars": 5}, {"date": "May 18, 2021", "text": "It doesn't work for chrome anymore :(", "stars": 5}, {"date": "May 12, 2021", "text": "so cool . I can do scratch so easy\nThanks for create it", "stars": 5}, {"date": "May 7, 2021", "text": "I have used the TurboWarp version of this before, but for some reason when I use this version, and I click the settings Icon, it just shows me a blank dark gray screen, Might it have something to do with the browser? Has anyone else had the same problem?", "stars": 4}, {"date": "May 6, 2021", "text": "omg bro HOW did you do it?! i love it!", "stars": 5}, {"date": "May 6, 2021", "text": "works great, does everything it says plus more\nhas tools for the editor that should be in normal scratch. it can show your notification count on the icon, show sprite count, remix trees, onion skins, highlights any block that's running, mouse coordinates, game pause, controller compatibility, just spend some time browsing the features as there is basically everything you always wanted and never knew you always wanted.", "stars": 5}, {"date": "May 5, 2021", "text": "Amazing. Helps me on my scratch projects. Great customization and a lot of good features made by talented Scratchers!", "stars": 5}, {"date": "May 2, 2021", "text": "Awesome!", "stars": 5}, {"date": "Apr 29, 2021", "text": "I love it", "stars": 5}, {"date": "Apr 23, 2021", "text": "What an amazing extension! It really helps me a lot in coding!", "stars": 5}, {"date": "Apr 22, 2021", "text": "This is one of the best extensions I've ever had for scratch, but wouldn't it be cool to convert pages from 3.0 back to 2.0 so there is both ways? for example it could make the top bar the scratch 2.0 style then call that option scratch 2.0 bar or something!", "stars": 5}, {"date": "Apr 20, 2021", "text": "Hi this is ilovescratchcie on google, i tried this and it worked!!", "stars": 5}, {"date": "Apr 15, 2021", "text": "This enhanced my scratch experience. i can now pause scratchnapped whenever i get interrupted!", "stars": 5}, {"date": "Apr 14, 2021", "text": "Perfect", "stars": 5}, {"date": "Apr 5, 2021", "text": "NOICE I loved this addon because of the dango rain, the cool dark mode, and other features", "stars": 5}, {"date": "Apr 2, 2021", "text": "It is literally the best thing ever! It literally make everything the best! I was losing interest of scratch then I found this!!! This is firealarmfun btw.", "stars": 5}, {"date": "Apr 2, 2021", "text": "I tried again, and it's very more optimized, best extension ever!", "stars": 5}, {"date": "Mar 31, 2021", "text": "This is awesome!!! He should add always have cat hatblocks.", "stars": 5}, {"date": "Mar 30, 2021", "text": "This addon really helps for the tryhard developers of scratch, and it has things I would greatly appreciate in vanilla Scratch 3!\n\nThis addon provides so many quality of life features, its pretty much impossible to develop scratch games with out it! I would 100% recommend this addon to any experienced scratch developer for helping out with their games. It's a miracle that this kind of thing exists.", "stars": 5}, {"date": "Mar 29, 2021", "text": "its cool and all, but is the cat block option in there?", "stars": 5}, {"date": "Mar 28, 2021", "text": "This extension is absolutely phenomenal! I absolutely LOVE it! If only it wasn't blocked on my organization's computers, which is where I typically use Scratch, but oh well.", "stars": 5}, {"date": "Mar 18, 2021", "text": "A good way to check if you have messages without even going to the website. also the onion shading helps a lot when i'm animating in bitmap.", "stars": 5}, {"date": "Mar 16, 2021", "text": "I totally love this extension and would always use it", "stars": 5}, {"date": "Mar 15, 2021", "text": "The onion feature is awesome for animating. I finally get notified when people comment on my projects. The extension is so helpful. These people might as well develop scratch 4.0 lol.", "stars": 5}, {"date": "Mar 15, 2021", "text": "This is much needed thanks!", "stars": 5}, {"date": "Mar 14, 2021", "text": "For some reason one of my scratch projects lag in the editor with this extension.", "stars": 4}, {"date": "Mar 12, 2021", "text": "Perfect.", "stars": 5}, {"date": "Mar 10, 2021", "text": "All of the features were awesome! I sadly had to uninstall for now because it wouldn't let me use any buttons (green flag, my stuff, messages, etc.). I would really appreciate if you could fix this!", "stars": 3}, {"date": "Mar 5, 2021", "text": "Can be buggy now and then, but I like it", "stars": 3}, {"date": "Mar 5, 2021", "text": "It's very good!", "stars": 4}, {"date": "Mar 3, 2021", "text": "Perfect for coding and just having fun on scratch, lol.", "stars": 5}, {"date": "Feb 25, 2021", "text": "Super awesome. Gives you access to things sometimes essential to the Scratch website, or just for fun, Its so very useful. 10/10, check it out!", "stars": 5}, {"date": "Feb 24, 2021", "text": "The developers of this extension are really great people! I love the cat blocks addon (Made by @TheColaber), 60 FPS addon (Made by @Jeffalo & @TheColaber), and all the other amazing features of this amazing extension. I would not be on Scratch if not for the 2.0 > 3.0 addon (Made by @Maximouse) or the Pause button addon (Made by @Jeffalo & @GarboMuffin). \n(Also, this extension was not made by @griffpatch. It is managed by @World_Languages.\nAnd little secret: If you type \"↑↑↓↓←→←→BA\" on the ad... Show more", "stars": 5}, {"date": "Feb 23, 2021", "text": "This extension solves a lot of problems since when Scratch moved from 1.4 to 2.0 and that the Scratch Team (more involved in the simple uses of Scratch) isn't interested in solving. Strongly suggested.", "stars": 5}, {"date": "Feb 23, 2021", "text": "This is really useful and I recommended it to all my friends, thank you so much for making this! I found out that using the inspect tool you can make the \"follow\" button red, which got me thinking; could you guys please make a red theme? It doesn't have to be red too, you could have a variety of colors. Thank you!", "stars": 5}, {"date": "Feb 22, 2021", "text": "Thank you! The reviews here seem to be focused on checking messages and comment management, but I find it super useful for the editor!", "stars": 5}, {"date": "Feb 22, 2021", "text": "This really was amazing :D i was only looking for dark mode but this reall- tysm for making this. Everyone who did", "stars": 5}, {"date": "Feb 17, 2021", "text": "it helps you with everything imaginable.", "stars": 5}, {"date": "Feb 15, 2021", "text": "Love it.", "stars": 5}, {"date": "Feb 4, 2021", "text": "Its an awesome plugin, the dark mode works very well and it makes it easer on my eyes. I love how there are lots more addons that are really useful with only 1 plugin. Keep up the good work!", "stars": 5}, {"date": "Feb 1, 2021", "text": "Really nice there is so much you can do with it", "stars": 5}, {"date": "Jan 31, 2021", "text": "Incredibly useful extension! Provides so many features that should be in Scratch to begin with, and doesn't affect performance at all.", "stars": 5}, {"date": "Jan 29, 2021", "text": "can you add scratch 2.0 style to the editor and website pleaseeeeeee", "stars": 5}, {"date": "Jan 19, 2021", "text": "some how when i enabled profile banner and i did not see the ban button", "stars": 3}, {"date": "Jan 12, 2021", "text": "The Extension Help With Reading Messages A Lot!", "stars": 5}, {"date": "Jan 12, 2021", "text": "Its amazing, but the 2.0 to 3.0 is broken.", "stars": 4}, {"date": "Jan 11, 2021", "text": "9/10, my only problem is that you should be able to select the 60 FPS thing without pressing ALT. I have a MAC and my keyboard doesn't have ALT :/", "stars": 5}, {"date": "Jan 8, 2021", "text": "This is pretty cool", "stars": 5}, {"date": "Jan 5, 2021", "text": "Epic Addon, adds thumbnails, Load More on whats happening and more!", "stars": 5}, {"date": "Jan 4, 2021", "text": "I open this addon every day. My scratch account is @JPRO_mobile.\nI've installed this extension with the old version (scratch messages or something like that...)\nThe new version is amazing!", "stars": 5}, {"date": "Jan 1, 2021", "text": "Excellent, would very easily reccomend.", "stars": 5}, {"date": "Jan 1, 2021", "text": "this is the best thing ever", "stars": 5}, {"date": "Dec 31, 2020", "text": "5 out of 5 ....Why?...Becuase It's Pretty\nUseful and really makes everything on \nscratch easier a lot and i like that...Smooth\nDesign...Easy to Understand..I Reccomend it \nFor A New Scratchers And People On Scratch\nBut Please...Add More Languages So People\nFrom Around the World Can Use this To Make\nCoding Easier!...Thank you!", "stars": 5}, {"date": "Dec 31, 2020", "text": "This is amazing! They added an onion!", "stars": 5}, {"date": "Dec 31, 2020", "text": "This is just perfect, it has EVERYTHING that scratch doesn't have. My suggestion here is that someone should add an editor option that allows you to group sprites in a \"folder\" so you have a much neater workspace, oh, and of course only those with this extension would be able to see it.\n\nI hope you take my idea into account, you are the best :)", "stars": 5}, {"date": "Dec 29, 2020", "text": "i really like the adding of others. and having dark mode and all the other things such as onion skinner. some parts of it i don't like. one being dark mode you can only select a few bits of dark modes and the blue buttons hurt. but a really good addon", "stars": 4}, {"date": "Dec 28, 2020", "text": "THIS IS THE GREATEST THING EVER!!! I use practically every setting, and projects are so much easier to make with the right settings! I doooo have a suggestion though. There should be a setting to automatically add a blank sprite for reducing lag on both project pages and your own., I think this would help a lot!", "stars": 5}, {"date": "Dec 28, 2020", "text": "This is an amazing extension! Reminds me of Drawception's ANBT script. You don't notice it too much, but if you turn it off you realize just how much you can't live without it!", "stars": 5}, {"date": "Dec 28, 2020", "text": "Absolutely amazing. Does what it says, and is very useful.", "stars": 5}, {"date": "Dec 27, 2020", "text": "Fantastic!!!!! Very useful!!\nPlease add me to contributors page because I've been translating it", "stars": 5}, {"date": "Dec 27, 2020", "text": "like it controlling and knowing from any where", "stars": 5}, {"date": "Dec 26, 2020", "text": "Very well made and works great. Very useful and makes the overall Scratch experience much better.", "stars": 4}, {"date": "Dec 25, 2020", "text": "maybe add shortcuts to your favorite projects and all cloud projects not just griffpatch but overall, its the best", "stars": 4}, {"date": "Dec 24, 2020", "text": "Works, Features, Easy to use, EPIC", "stars": 5}, {"date": "Dec 23, 2020", "text": "It's so useful! I LOVE IT!!!", "stars": 5}, {"date": "Dec 21, 2020", "text": "amazinggg", "stars": 5}, {"date": "Dec 20, 2020", "text": "I say that this extension has many improvements for Scratch. Thank you very much for all this! :D", "stars": 5}, {"date": "Dec 19, 2020", "text": "It's amazing!", "stars": 5}, {"date": "Dec 17, 2020", "text": "It Is WONDERFUl!!!! allows me to pause which is SOOO useful!! its Worth it!", "stars": 5}, {"date": "Dec 14, 2020", "text": "Amazing in every way—vastly improves the quality-of-life experience on Scratch.", "stars": 5}, {"date": "Dec 13, 2020", "text": "THE ONIONSKIN FEATURE WORKS BUT IT LITERALLY GROUPS EVERYTHING AND MAKES IT IMPÓSSIBLE TO ANIMATE PLEASE REMEDY THIS OR ELSE", "stars": 1}, {"date": "Dec 13, 2020", "text": "Amazing 100/100.", "stars": 5}, {"date": "Dec 9, 2020", "text": "It wasn't made on scratch tho... But it was made by people on scratch... I'm AumsumTheGreatHulk on scratch.. Many people learn coding there so that they can make real and useful things.", "stars": 5}, {"date": "Dec 6, 2020", "text": "Awesome and totaly the best thing for Scratch.\nAwesome UI, awesome addons, works, and makes everything eazy.", "stars": 5}, {"date": "Dec 2, 2020", "text": "OKAY, so, ehy is it in portuguese, why does it do it based on location? I'd like to change it back to english, like a language selector", "stars": 4}, {"date": "Dec 2, 2020", "text": "The dark mode has saved me from going blind.", "stars": 5}, {"date": "Dec 1, 2020", "text": "This extension is really convenient to use! On my PC, my Scratch loads really slow, and it's not worth the time to wait to just look at messages/notifs. This extension is just made for people who hates waiting. It also points out every Cloud Multiplayer games, which I really likes for some reason.", "stars": 5}, {"date": "Nov 28, 2020", "text": "If you use scratch and don't use this, I feel bad for you.", "stars": 5}, {"date": "Nov 27, 2020", "text": "its epic to use in scratch!", "stars": 5}, {"date": "Nov 25, 2020", "text": "NEVER Seen anything like this.\nWish I had this before.", "stars": 5}, {"date": "Nov 20, 2020", "text": "Excellent. Polished UI, little bugs, and tons of functionality.", "stars": 5}, {"date": "Nov 20, 2020", "text": "Saved my life", "stars": 5}, {"date": "Nov 20, 2020", "text": "It deleted a bunch of my variables and reset the properties of basically every go to or point in direction block. Completely messed up my scratch project with no way to get it back.", "stars": 1}, {"date": "Nov 20, 2020", "text": "SO GOOD USE 100%", "stars": 5}, {"date": "Nov 18, 2020", "text": "wow! this helps me do features in scratch that i dreamed of!!!", "stars": 5}, {"date": "Nov 17, 2020", "text": "I am one of the Scratch Addons Developers. I am happy to be one among the 33 developers of the world's most used scratch extension. I will highly recommend this for scratchers. U can acctually customize the whole of the scratch web with this.", "stars": 5}, {"date": "Nov 16, 2020", "text": "I absolutely Love using this! It adds features that i have wanted for a while and i know lots fo people who want them to!", "stars": 5}, {"date": "Nov 12, 2020", "text": "Very Very Helpful! Suggestion: If we name a sprite SA(Number) - (Sprite Name) it should put it in a FOLDER. Maybe implement this into variables aswell.\n\neg: SA3 - Banana\n\nit would put all SADigits into seperate folders to make scratch easier to navigate", "stars": 4}, {"date": "Nov 10, 2020", "text": "the features are not working just the messaging feature", "stars": 1}, {"date": "Nov 9, 2020", "text": "Amazing! Using it as I work on a new huge game! Thanks to these tools I can work way more efficiently than before!", "stars": 5}, {"date": "Nov 8, 2020", "text": "AMAZING!!!", "stars": 5}, {"date": "Nov 8, 2020", "text": "GREAT AND HELPFUL!! This extension changed my life!", "stars": 5}, {"date": "Nov 8, 2020", "text": "The extension has so many tools to make Scratch much better to use. Editing projects are much easier with a search bar, mouse coordinates and more.", "stars": 5}, {"date": "Nov 6, 2020", "text": "I love it a lot!", "stars": 5}, {"date": "Nov 6, 2020", "text": "super duper it help's me during exams. when I am not allowed to touch scratch during exam's\ncompetitive exam's and holiday's I can comment see my hearted and loved and remixed projects and people following me", "stars": 5}, {"date": "Nov 5, 2020", "text": "Everything is great, except for the dark mode option, when scripts are running, it shows text boxes as blank.", "stars": 4}, {"date": "Nov 2, 2020", "text": "this is good", "stars": 5}, {"date": "Oct 31, 2020", "text": "This extension was AMAZING!\nI was VERY used to the Scratch 2.0 layout AND dark theme, and this can bring it all back!", "stars": 5}, {"date": "Oct 29, 2020", "text": "It's the best, has all the best extensions with even more tucked into it.", "stars": 5}, {"date": "Oct 28, 2020", "text": "This is awesome!", "stars": 5}, {"date": "Oct 27, 2020", "text": "This is so good I can do like so much its just SO GOOD! :D :D\n\nhelps me check my messages anywhere", "stars": 5}, {"date": "Oct 25, 2020", "text": "This made the editor so much easier to use, plus fixed the inconsistency between scratch 2.0 & 3.0. i don't really use the messaging though. i love how you can see how many people are on multiplayer games.", "stars": 5}, {"date": "Oct 25, 2020", "text": "Best thing ever created", "stars": 5}, {"date": "Oct 20, 2020", "text": "AWESOME! But one problem; when there is only one studio promote, it shows 1 on the extension but when I click it it says no messages.", "stars": 5}, {"date": "Oct 18, 2020", "text": "The available addons are amazing, and I'm excited to see what's added in the future!", "stars": 5}, {"date": "Oct 17, 2020", "text": "This extension's really great for extra Scratch features. There are some bugs, but otherwise, good job! 4 stars.", "stars": 4}, {"date": "Oct 16, 2020", "text": "This was one of the most helpful things I have ever seen!\n\n\nThanks Griffpatch!", "stars": 5}, {"date": "Oct 15, 2020", "text": "loved it 5/5.", "stars": 5}, {"date": "Oct 15, 2020", "text": "Amazing!", "stars": 5}, {"date": "Oct 14, 2020", "text": "Literally the best extension I have ever had. Go griffpatch!", "stars": 5}, {"date": "Oct 9, 2020", "text": "So, Griffpatch don't get me wrong I love everything you make! Just i was really hoping that there would be a dark theme that works outside of editor :(", "stars": 3}, {"date": "Oct 4, 2020", "text": "WOW", "stars": 5}, {"date": "Oct 3, 2020", "text": "dark mode works :D", "stars": 5}, {"date": "Sep 9, 2020", "text": "Nice.", "stars": 5}, {"date": "Aug 15, 2020", "text": "Its not showing up on my scratch account. It doesn't work, from what I know. Just a warning!", "stars": 2}, {"date": "Aug 13, 2020", "text": "Does not work. Takes forever to load", "stars": 1}, {"date": "Jul 7, 2020", "text": "Great , now i can read messages while making a project . i can even reply !!! It is also made by my favorite scratcher griffpatch !!!", "stars": 5}, {"date": "Jun 28, 2020", "text": "Nice but does not load", "stars": 3}, {"date": "Jun 24, 2020", "text": "I'd really hate to mark it one star because what it should do looks amazing, but... it just straight up doesn't work! When clicked it says 'Please Wait' forever and never loads my messages, despite the number of messages I have showing up next to the icon.", "stars": 2}, {"date": "Apr 12, 2020", "text": "It worked fine until it started loading forever really slowly and never finishing, but I'm not sure if it's just my laptop. I'm on Asus windows 7", "stars": 2}, {"date": "Apr 4, 2020", "text": "thanks griff!", "stars": 5}, {"date": "Apr 3, 2020", "text": "AMAZING", "stars": 5}, {"date": "Sep 20, 2019", "text": "very usefull :)", "stars": 5}, {"date": "Sep 16, 2019", "text": "I luv it!", "stars": 5}, {"date": "Mar 3, 2019", "text": "AMAZING!!!!", "stars": 5}, {"date": "Oct 23, 2018", "text": "This is an amazing addon! Not only can I see what messages I recieved on my profile, I can even reply to them as if I'm on the actual website! I'm glad one of my Scratch friends reccommended this to me. You deserve my 5 Stars.", "stars": 5}, {"date": "Aug 26, 2018", "text": "Cool", "stars": 5}, {"date": "Aug 25, 2018", "text": "Now I can check my mail on Scratch without going on the website when I'm not supposed to!", "stars": 5}, {"date": "Aug 3, 2018", "text": "too good!", "stars": 5}, {"date": "Jul 17, 2018", "text": "I love it!", "stars": 5}, {"date": "Jul 5, 2018", "text": "I didn't know that programming on scratch helps people learn to program real and useful things, such as this! I'm inspired.", "stars": 5}, {"date": "Jun 29, 2018", "text": "too useful!", "stars": 5}, {"date": "May 19, 2018", "text": "Keeps telling me that I \"Must be logged into scratch.\"", "stars": 3}, {"date": "Apr 21, 2018", "text": "Stupid. It says \"you have to log into Scratch to use this\" I AM LOGGED IN", "stars": 1}, {"date": "Apr 6, 2018", "text": "Great, but was slower than the one by World_Languages", "stars": 4}, {"date": "Mar 29, 2018", "text": "Works perfectly. Great for people who want to always stay informed.", "stars": 5}, {"date": "Mar 15, 2018", "text": "AMAZING THIS ALWAYS HELPS ME WHEN I TRY T MAKE A PROJECT WHILE COMMENTING", "stars": 5}, {"date": "Mar 3, 2018", "text": "ITS AMAAZING", "stars": 5}, {"date": "Feb 27, 2018", "text": "very help full", "stars": 5}, {"date": "Feb 13, 2018", "text": "THIS IS REALLY GOOD NICE", "stars": 5}, {"date": "Dec 8, 2017", "text": "REALY GOOD INSTALL IT I RATE 5 :DD", "stars": 5}, {"date": "Nov 14, 2017", "text": "really good", "stars": 5}, {"date": "Sep 13, 2017", "text": "Don't use it often to check my messages... rather to see if I do have messages.", "stars": 3}, {"date": "Jun 3, 2017", "text": "Impressive griffpatch! I don't know how you did it, but this probably one of your best creations yet!", "stars": 5}, {"date": "May 11, 2017", "text": "Great!", "stars": 5}, {"date": "Apr 15, 2017", "text": "This is really good!", "stars": 4}, {"date": "Apr 5, 2017", "text": "Great job griffpatch!", "stars": 4}, {"date": "Mar 19, 2017", "text": "This is so cool! I don't have to go on scratch to see if I have a message! YES!", "stars": 5}, {"date": "Mar 16, 2017", "text": "Very good when compared to other Scratch Extensions", "stars": 5}, {"date": "Mar 16, 2017", "text": "okay i guess", "stars": 3}, {"date": "Feb 28, 2017", "text": "Good. now  i can see when i have messages", "stars": 4}, {"date": "Feb 18, 2017", "text": "This is a great Extension. The only thing I would like this to have is a notification *DING* or something like that. If you could add that, it would be great! PEACE!", "stars": 4}, {"date": "Jan 30, 2017", "text": "Awesome extension and awesome games you're awesome griffpatch", "stars": 5}, {"date": "Jan 15, 2017", "text": "wow", "stars": 5}, {"date": "Dec 5, 2016", "text": "It is so sooooooo good the only bad thing is the first fake follower named explore i told you on scratch but you did't listen so fix that please", "stars": 4}, {"date": "Nov 23, 2016", "text": "Like the way it works, I love your projects, and you can improve it by adding posts that you followed because I always have messages, but it doesn't display them because they were posts.", "stars": 4}, {"date": "Oct 7, 2016", "text": "I use scratch a lot, this is super helpful!", "stars": 5}, {"date": "Aug 24, 2016", "text": "I love not having to refresh my page every 5 seconds to check for new messages.\nAnother job well done by Griffpatch!", "stars": 5}, {"date": "Jun 27, 2016", "text": "This is an awesome Scratch extension, and probably the best one I have seen! And the only one... This will be very helpful, as I check my messages a lot. My username on Scratch is PotatoApocalypse. I rate this extension 5 stars!", "stars": 5}, {"date": "May 15, 2016", "text": "Awesome! Your the best scratcher ever, and you made this extremely cool extension. Not only can you check your messages but you can also see how many people are online on your multiplayer games and get there on the click of a button. This also work on the laggiest laptop ever (referring to mine).", "stars": 5}, {"date": "May 11, 2016", "text": "This is fabulous and so convenient! You can reply to the messages right from the extension and that is awesome. Thank you so much for making it! You're my favorite scratcher.", "stars": 5}, {"date": "Apr 21, 2016", "text": "cool", "stars": 5}, {"date": "Apr 19, 2016", "text": "Wow! Nice job griffpatch! This is really helpful and well made!", "stars": 5}, {"date": "Apr 18, 2016", "text": "I don't know what I would do without this extension! It helps so much! I couldn't imagine a day without it!", "stars": 5}, {"date": "Apr 13, 2016", "text": "THE BEST! I USE IT MORE THAN MY INBOX AND I LOVE THE CLOUD GAMING PART! BEST SCRATCH PROGRAMMER!", "stars": 5}, {"date": "Apr 10, 2016", "text": "This is a great extension, really intuitive, nonobstructive, and convenient, the best kind of extension. One suggestion I'd like to make is an option to order and group messages by date and to add date stamps", "stars": 4}, {"date": "Apr 8, 2016", "text": "GriffPatch you are my favorite scratcher on scratch you create the best projects and I can not believe you made this. This is very a helpful extension because when you are creating a game you can't see if you have any messages but with this it makes it easy to find out if you have any the only thing I would recommend is when you open the extension it will have a message box at the top right with the number of how many messages you have and if you click on it it will show you all your resent m... Show more", "stars": 5}, {"date": "Mar 22, 2016", "text": "now i can sort through spam", "stars": 5}, {"date": "Mar 13, 2016", "text": "Nice. I was thinking of building a similar project, but this covers it except for 1 feature: \n\nQuickly compose a message to any username, which posts to that person's profile.", "stars": 5}, {"date": "Mar 10, 2016", "text": "This really is handy, but a bit kumbly.", "stars": 4}, {"date": "Mar 2, 2016", "text": "This is so organized! I love the formatting, and just... everything? Honestly?", "stars": 5}, {"date": "Feb 26, 2016", "text": "This is a very useful extension, my only problem is that because you can write comments on the extension instead of actually on scratch, it can serve as a workaround to the filter-bot! Unfortunately, when my brother got into my laptop, he figured this out and I got an alert! :O I think there should be some sort of filter added so that this can be prevented from happening again.", "stars": 1}, {"date": "Feb 18, 2016", "text": "Best suggested if the font changed to Arial for realistic typing.", "stars": 5}, {"date": "Feb 16, 2016", "text": "This is really cool! I can now see new messages outside of scratch, and without refreshing too! :D", "stars": 5}, {"date": "Feb 14, 2016", "text": "Great! I like going through my messages without opening Scratch, it saves me a lot of time! To make it better, you could put a \"New\" slot to see all new messages.\n:)", "stars": 5}, {"date": "Feb 10, 2016", "text": "Nice Now I can See If I have messages on youtube!", "stars": 5}, {"date": "Feb 10, 2016", "text": "This is wonderful! Now I don't have to keep logging onto scratch to check if I have notifications. I can finally do my homework in peace.", "stars": 5}, {"date": "Feb 9, 2016", "text": "This is very Helpfull", "stars": 5}, {"date": "Feb 8, 2016", "text": "Very useful :D", "stars": 5}, {"date": "Feb 3, 2016", "text": "Life", "stars": 5}, {"date": "Feb 2, 2016", "text": "Awesome I and something I always wanted to be there.", "stars": 5}, {"date": "Feb 2, 2016", "text": "Great creation by griffpatch once again.  Love the storage feature! But would like to share projects using the extension. -MCAnimator3D", "stars": 5}, {"date": "Jan 31, 2016", "text": "Nice for when you are playing one of Griffpatch's online games. Maybe that's why he designed it?", "stars": 5}, {"date": "Jan 31, 2016", "text": "Extremely useful while working on a project.", "stars": 5}, {"date": "Jan 27, 2016", "text": "Awesome job, griffpatch! I'm sure this will be a great help to many users :)", "stars": 5}, {"date": "Jan 26, 2016", "text": "It really helps to use this! I love how it means I don't have to keep checking my messages!", "stars": 5}, {"date": "Jan 26, 2016", "text": "Woah. I really like this and the little popup that tells you how many messages you have is awesome. :)", "stars": 5}, {"date": "Jan 26, 2016", "text": "Saves having to run an extra tab if you want to keep up with your messages. In short, brilliant.", "stars": 5}, {"date": "Jan 26, 2016", "text": "This is soooooo COOL :) (PS: Ur the best scratcher who ever lived, I don't know how you make all of your games).", "stars": 5}, {"date": "Jan 25, 2016", "text": "Already loving it :D", "stars": 5}, {"date": "Jan 25, 2016", "text": "Really useful! :D", "stars": 5}]