[{"text": "i have been using this since 2008 back when it was rikaichan. always helpful. thank you so much", "stars": 5, "date": "Mar 3, 2024"}, {"text": "Been using this for a while now!! its really useful.", "stars": 5, "date": "Feb 13, 2024"}, {"text": "It isn't working at all for me.  No pop ups or anything.  It does have the  \"On\" tag over the extension logo but it doesn't seem to do anything at all. Alero Inyang seems to have had a similar experience.\n\nEdit: ... I just had to refresh the browser after downloading the extension... バカみたいだ！(^_^;)", "stars": 4, "date": "Feb 4, 2024"}, {"text": "can't live without this extension thank you for my life", "stars": 5, "date": "Jan 12, 2024"}, {"text": "It's working on other sites, but I really need this for Wikipedia and it's not working there. Any way you can help?", "stars": 3, "date": "Jan 11, 2024"}, {"text": "I don't understand this... Rikaikun doesn't work at all! Nothing happens when I hover over Japanese text. No pop-up definition or reading, no text-to-speech, even though I enabled it in the Extension options. I thoroughly examined all the settings, and they remain default except for these:\nI've selected \"On click\" for site access, \nI've pinned the extension to my toolbar, \nI've enabled text-to-speech. \n\nIt used to work well when I installed it the first time, but then it stopped abruptly. I r... Show more", "stars": 1, "date": "Dec 30, 2023"}, {"text": "Hello Extension Creator, wouldn't it be possible to use an AI API to translate the text into other languages?", "stars": 5, "date": "Dec 7, 2023"}, {"text": "I love it, but I can't find a way to make it start when I start the browser.", "stars": 5, "date": "Oct 11, 2023"}, {"text": "Could have more languages besides english. I have to use the translator anyway, so it's not useful.", "stars": 1, "date": "May 7, 2023"}, {"text": "Doesn't work at all...But maybe we need to do something about settings but not information about it so useless.", "stars": 1, "date": "Apr 18, 2023"}, {"text": "This extension is perfect but I notice some bugs:\n1. It gets on the way whatever japanese text I am typing exp when the cursor is near the text\n2. It often turns on the \"hide definitions and show only reading\" by itself. It's not like there is shortcut to it, right??", "stars": 4, "date": "Nov 20, 2022"}, {"text": "Love the app.\n\nbut keyboard shortcut without clicking the icon would be super useful.\n\nThank you.", "stars": 5, "date": "Nov 18, 2022"}, {"text": "Good for reading difficult Japanese words on the fly, but not that great for studying to put words into your long-term memory because there is no integration with Anki (AnkiConnect). If you can add Anki integration I would use this over Yomichan since the popup design is prettier.", "stars": 4, "date": "Sep 4, 2022"}, {"text": "I use this extension on a daily basis. It's extremely handy, and I enjoy it.", "stars": 5, "date": "Jun 20, 2022"}, {"text": "cool but maybe pls change the color of the english translations like i mean the text color because it blends w the blue background and i hardly can read it", "stars": 4, "date": "Mar 30, 2022"}, {"text": "I love this extension. Its super helpful. If you could get it to work on PDF files while in chrome, that would take away my only complaint.", "stars": 5, "date": "Mar 30, 2022"}, {"text": "Thank you for making wonderful tool. I always introduce this function to Japanese Teacher who teach student with dyslexia. It works great.", "stars": 5, "date": "Mar 15, 2022"}, {"text": "I really love the extension. It looks like it uses JMdict under the hood, which makes its translations consistent with many other learning tools.\n\nHowever, I have not been able to use it today on google Doc. I don't know whether this is because of an update from either Rikaikun or google, or just because of an issue on my end.\n\nHopefully the issue will be fixed in the future, or will fix itself if my environment's to blame.\n\nGreat tool anyaway.", "stars": 5, "date": "Mar 8, 2022"}, {"text": "Is it possible to enable text-to-speech, not automatically, but when I press a key? This is so it only pronounces the word when I want it to. Best is if the pronunciation could be repeated when my cursor is pointing at the word.", "stars": 5, "date": "Feb 28, 2022"}, {"text": "Pretty useful extension. For some reason, it won't let me translate phrases after a comma, so I'm forced to delete commas in sentences to use rikaikun to translate a word. Fixing this issue would be good for user experience.", "stars": 4, "date": "Feb 4, 2022"}, {"text": "I really really really love it, but sometimes it cannot be used, any tip to fix that?", "stars": 5, "date": "Jan 10, 2022"}, {"text": "No longer works on legacy versions of chrome before version ~90 or so.\n\nThe way this extension works is that you need to click the icon to enable it, then hover over the kanji/kana that you want to read and provides several potential readings up to 4 character long or so. Very straightforward and does the job well.", "stars": 5, "date": "Nov 21, 2021"}, {"text": "Helpful, but they should allow users to bind the keys. When a page is full of text with nowhere to put your mouse and the Enter key is stuck shifting the dictionaries, it's infuriating. Please allow users to change the controls.", "stars": 4, "date": "Oct 10, 2021"}, {"text": "It's great! Very useful extension.", "stars": 5, "date": "Sep 14, 2021"}, {"text": "very good", "stars": 5, "date": "Aug 30, 2021"}, {"text": "This is an absolute lifesaver. While I wish there was a slightly more comprehensive tutorial and list of commands in the options menu (I only discovered the names dictionary after coming back to the store page many months later), it does everything it needs to do and packs in so much functionality! While there are possibly some other quality of life changes that could be made, I don't think I can give this any less than 5*, especially seeing as it's totally free!", "stars": 5, "date": "Aug 22, 2021"}, {"text": "Absolutely amazing tool that made my life many times easier. However I think a font colour option would be helpful since the contrast is not ideal.", "stars": 5, "date": "Jul 11, 2021"}, {"text": "Only seems to work for Japanese websites, not Japanese text across the web in general; i.e. - doesn't translate if you're on an English site that uses Japanese text.", "stars": 3, "date": "Jul 9, 2021"}, {"text": "Love it!!! Very useful!!! Japanese salvation.", "stars": 5, "date": "Jun 29, 2021"}, {"text": "It's AMAZING! but saldly to make it work u have to install it and uninstall it over and over again cause IT WILL STOP WORKING after 1 o 2 days without any reason, and it's always the same, it works for 1 day or 2 and then it stops, so, 1 star for the idea! 0 star for the bad programming of the app! :/", "stars": 1, "date": "Jun 21, 2021"}, {"text": "I love this!! It has helped me a lot while reading Twitter and other websites in Japanese. The best part is you can check in a fast and easy way the reading of the word you want and at the same time, see the English definition so is a great way to learn kanji and vocabulary. \nThank you for creating this!!! I always recommend this extension to other Japanese learners.", "stars": 5, "date": "Jun 8, 2021"}, {"text": "way too convenient to be true", "stars": 5, "date": "Jun 7, 2021"}, {"text": "I really like this extension, but it sometimes stops showing the English translations, so I have to remove  the extension and then add it back again. This happens every couple weeks. ;(", "stars": 3, "date": "May 29, 2021"}, {"text": "Is good but doesn't seem to work with certain fonts.", "stars": 4, "date": "May 26, 2021"}, {"text": "Seriously the best Japanese learning extension I've ever used. It makes everything easier to study. Thank you so much!", "stars": 5, "date": "Apr 21, 2021"}, {"text": "Doesn't work. Nothing is happening.", "stars": 1, "date": "Apr 20, 2021"}, {"text": "nice", "stars": 5, "date": "Apr 2, 2021"}, {"text": "great but would be better if:\n\n-they'd remove the pinyin entries\n-make it so \"画像\" doesn't pop up when you scroll over an image", "stars": 4, "date": "Mar 2, 2021"}, {"text": "Makes it really easy to go through a kanji heavy page. Thanks a million!", "stars": 5, "date": "Feb 21, 2021"}, {"text": "I love this extension, I've used it for years and it's helped me study so much. Big thank you to the creator <3", "stars": 5, "date": "Feb 8, 2021"}, {"text": "Rikaikun has been a life saver for over a decade.\n\nI do have one problem... Recently it keeps resetting the highlight text setting, which is really annoying when you're trying to fill out a form and the text boxes keep losing focus. Not sure why this suddenly started happening, but it's the only problem I've ever had with the extension since it was first released.", "stars": 5, "date": "Dec 2, 2020"}, {"text": "This is amazing！（I would only work on adding popular authors’ and historical figures' names and book titles etc. to the database) (Also, when I try to copy paste with my keyboard, the extension bubble shows up, because I press SHIFT A or SHIFT V and then ENTER)\n\nOtherwise, this add-on saves lives. Thank you so much for the effort of making it！", "stars": 5, "date": "Nov 30, 2020"}, {"text": "Works Great But How I wish it had Romji like RikaiChamp has for FireFox, O well I don't use chrome much anyways. ツ", "stars": 4, "date": "Nov 21, 2020"}, {"text": "very comfortable but sometime meaning not show how do I do. I try to enter/shift but not work", "stars": 4, "date": "Nov 12, 2020"}, {"text": "this is the best chrome extension i ever installed in my life. seriously.\nboth in term of usefulness and quality.\nthank you very much.", "stars": 5, "date": "Sep 18, 2020"}, {"text": "Fantastic. One suggestion, it would be great it it could be disabled for cetain sites, instead of having to disable it manually. Thanks!", "stars": 5, "date": "Sep 11, 2020"}, {"text": "It gets the job done instantly. After moving to a NVMe SSD powered computer this extension starts up instantly. Now I'm able to use this in local .html files (like game manuals) just by activating all access rules in the extension config page of Opera GX.\nA cool feature will be... \"Go to some portal repository to search the highlighted text and see its real usage\" I mean... perform a \"Example Search\" search in Kanshudo.", "stars": 5, "date": "Aug 30, 2020"}, {"text": "It's perfect!! However, a week ago it stopped working, it'll show how it's written but it won't say what does it mean, and it was lacking information. As the last update was from 2019 I thought it stopped working, but I decided to reinstall it just in case and now it works perfectly again. I should have done that sooner.", "stars": 5, "date": "Aug 19, 2020"}, {"text": "Enormously helpful extension. At some point, when language-learning, textbooks stop becoming useful and you just need to read constantly, and this is an indispensable tool.\n\nThat said, several very basic flaws that severely damage its functionality. 1) It never automatically loads upon start-up. 2) It insists on copy-pasting a definition (rather than the actual text), when I have never wanted to do that. And the definitions stick around even when you take your cursor away from the window, so ... Show more", "stars": 3, "date": "Jul 19, 2020"}, {"text": "It unfortunately doesn't seem to work with Youtube (titles and comments), otherwise it is good.", "stars": 4, "date": "Jul 2, 2020"}, {"text": "works everytime and is very helpful when understanding kanji", "stars": 5, "date": "Jun 26, 2020"}, {"text": "It's a great tool if you're trying to read single kanji's, but it's difficult to use when hiraganas are mixed in the words.", "stars": 2, "date": "Apr 14, 2020"}, {"text": "Works great for most sites but for some reason doesn't work on twitter. Otherwise I love it. Please fix that problem!", "stars": 4, "date": "Apr 14, 2020"}, {"text": "Great, This is tool that I'm looking for. please keep develop it. love them.", "stars": 5, "date": "Mar 27, 2020"}, {"text": "It doesn't show popup in Facebook website", "stars": 4, "date": "Mar 18, 2020"}, {"text": "I just downloaded it, but it doesn't seem to work for me? I turned it on, and started highlighting kanji, but nothing seems to pop up...help please", "stars": 3, "date": "Feb 23, 2020"}, {"text": "I've been using Rikaikun for years and it works great. Only thing is that it's missing some newer vocabulary terms as well as some expanded definitions/translations. If Jisho.org was integrated into rikaikun, that would be perfect. Also please consider adding the pitch shift number found in some dictionaries that can help with pitch accent pronunciation!\n\nFor those experiencing problems with it opening up, make sure your chrome is updated and try re-adding the extension.", "stars": 5, "date": "Jan 26, 2020"}, {"text": "powerful combo with Anki", "stars": 5, "date": "Jan 23, 2020"}, {"text": "I have using rikaikun for a couple of years now and I'm not going to stop any time soon. I use rikaikun to look up vocabulary and kanji. My Japanese have really improving thanks to rikaikun.", "stars": 5, "date": "Dec 27, 2019"}, {"text": "Really useful and saves my time to copy-and-paste to jisho or other translate/dict websites.", "stars": 5, "date": "Nov 29, 2019"}, {"text": "I love it but I realize sometimes I can't see the kanjis translated in English? I can saw the reading in hiragana or katakana instead. I turn off the extension and open again but it seems it doesn't work? I'll try to reinstall it.", "stars": 4, "date": "Nov 15, 2019"}, {"text": "Love it normally, but recently it started not showing translation, just reading. Gives no English unless I press shift/enter which just gives me the meaning (and translation) of the first kanji, not the word/phrase. Not sure why...", "stars": 3, "date": "Oct 15, 2019"}, {"text": "too good", "stars": 5, "date": "Oct 8, 2019"}, {"text": "Probably my first review on Chrome store. I am learning Japanese, and this app is super helpful.", "stars": 5, "date": "Oct 4, 2019"}, {"text": "Please add Romaji support", "stars": 3, "date": "Sep 9, 2019"}, {"text": "It's pretty great. If only it offered romaji transcription, it would be perfect.", "stars": 4, "date": "Sep 4, 2019"}, {"text": "This is my favorite extension that does what this does. However, it doesn't work properly on Google Docs (it only analyzes single characters), and works weirdly in general in text fields, like Google Translate (doesn't seem to know exactly where characters really are).\nAlso, C as non-changeable shortcut for copying sucks big time, because sometimes I want to copy the selected text, and it copies the entry. Actually, I'd expect to be able to customize or even deactivate all shortcuts separatel... Show more", "stars": 3, "date": "Aug 20, 2019"}, {"text": "Really helps", "stars": 5, "date": "Jul 24, 2019"}, {"text": "Excellent app. A wall I had in learning Japanese was my vocabulary. Having this app installed allows me to practice reading in context without having to use an online dictionary like Jisho every 5 seconds. \n\nIt is not 100% flawless. Just wanted to make sure that is known, Ctrl+C will take the whole dictionary definition instead of the highlighted text. Manually right clicking and selecting Copy bypasses the issue but of course that's substandard.\n\nAdditionally, Rikaikun has difficulty on raw ... Show more", "stars": 5, "date": "Jun 26, 2019"}, {"text": "Extremely helpful! I would suggest this for all Japanese learners", "stars": 5, "date": "May 26, 2019"}, {"text": "Very Nice. Thank you for porting this extension to the Chrome Web Browser", "stars": 5, "date": "May 9, 2019"}, {"text": "Very good extension for reading Japanese website for non-native Japanese.", "stars": 5, "date": "Apr 14, 2019"}, {"text": "It's a great extension! Would be amazing if the romaji was shown too.", "stars": 5, "date": "Mar 19, 2019"}, {"text": "Rikaikun is very useful when reading newspaper articles etc. as I don't have to check a dictionary or skip every time there's a word I don't recognise. However, I've noticed a persistent problem - every few weeks or so, it just suddenly stops displaying English definitions, only displaying the kanji and onyomi/kunyomi when I hover over a word. I then need to remove and reinstall the extension and it starts working normally again. Toggling the on/off switch is also sometimes very slow and lagg... Show more", "stars": 4, "date": "Feb 27, 2019"}, {"text": "Thanks for this! Very helpful! But i have some troubles when i want to copy text, the whole dictionary is copied too with my text selection...", "stars": 3, "date": "Feb 19, 2019"}, {"text": "the only popup dictionary work with input text area, hhope you make another language like chinese and korean.", "stars": 5, "date": "Feb 6, 2019"}, {"text": "I like it but pressing on doesn't mean its on. it's annoying to have to press everytime i start up chrome, please fix this", "stars": 3, "date": "Jan 19, 2019"}, {"text": "Almost perfect, it does tell you the meaning of kanas and kanjis, but it does not do transliteration, or at least I didn't find it, so you will know what it means but you wont know the real word", "stars": 4, "date": "Jan 10, 2019"}, {"text": "This extension really helps me when I wanna read some article or something in Japanese. It's so good", "stars": 5, "date": "Dec 14, 2018"}, {"text": "Popular reading should be the first one.", "stars": 2, "date": "Dec 11, 2018"}, {"text": "Long startup lag. Often accidentally trigger hotkeys (which cannot be reassigned) when typing.\n\nBiggest problem I have though is it now no longer works inside Google documents. I do some translating (J->E) and used to get a lot of use from rikaikun when editing a Japanese document in Google docs. I don't know if this issue was caused by Chrome, Google docs, or some change in rikaikun, but this is enough for me to take off another star.", "stars": 3, "date": "Sep 27, 2018"}, {"text": "Thank you. Sooo helpful.", "stars": 5, "date": "Sep 2, 2018"}, {"text": "The app itself is very good, but sometimes it just stops showing the english translations, I have to reinstall it everytime to make it work again.", "stars": 3, "date": "Jul 11, 2018"}, {"text": "pretty good, I can read with having to copy/paste to google translate for the kanji", "stars": 5, "date": "Jul 5, 2018"}, {"text": "I used to use it all the time. Now nothing pops up at all. Great.", "stars": 1, "date": "May 31, 2018"}, {"text": "Its really the best app I found until now for Kanjis. Most other get the reading wrong.\n\nMy only annoyance is that the popup window is too striking, it should have an option let it be a bit more transparent.", "stars": 5, "date": "May 13, 2018"}, {"text": "As someone who struggles with kanji, this is perfect! Works well on most sites, and the results are easy to read, although getting used to what all the information displayed means takes some getting used to.", "stars": 4, "date": "May 12, 2018"}, {"text": "If you know how to read Hiragana, this is the extension for you.\n\nWhen hovering the mouse pointer above any Kanji, it will search and a popup will appear with the meaning.\n\nVery helpfull!", "stars": 5, "date": "May 7, 2018"}, {"text": "Very useful when I'm reading long articles in Japanese rather than having to open up a Japanese dictionary. It even tells you what kind of conjugation the word is using and its other possibilities.", "stars": 5, "date": "Apr 18, 2018"}, {"text": "Copy/Paste is a problem! \n\nI don't have any real complaints about this extension, but I was wondering whether there had been an update recently that changed how copy-paste works with the extension. I feel like in the last month or two, hitting Cmd+C copies the dictionary entry for selected text. I know C is supposed to be the hotkey for copying to clipboard, but I'm getting really sick of selecting something, having the definition pop up, hitting Cmd+C and having the whole dictionary entry pa... Show more", "stars": 4, "date": "Apr 17, 2018"}, {"text": "very helpful, thank you", "stars": 5, "date": "Apr 15, 2018"}, {"text": "Learning Japanese, and only thing I don't have in Japanese is a large vocabulary, this is such a truly useful extension which already is helping me a lot as I learned more Japanese words today than I have in a week.", "stars": 5, "date": "Mar 13, 2018"}, {"text": "works well but doesn't work on pdf files opened with chrome", "stars": 4, "date": "Mar 10, 2018"}, {"text": "someone please update it it's open source", "stars": 5, "date": "Mar 3, 2018"}, {"text": "thank you for make Rikaikun. i love it", "stars": 5, "date": "Feb 28, 2018"}, {"text": "I'm Japanese, and there are a lot of words even I can't read or understand.\nThis add-on is amazing! I wish I knew this much earlier.", "stars": 5, "date": "Feb 26, 2018"}, {"text": "Working after refresh!", "stars": 5, "date": "Feb 23, 2018"}, {"text": "It is a good extension, but it needs to be updated.", "stars": 4, "date": "Feb 20, 2018"}, {"text": "Great tool", "stars": 5, "date": "Feb 18, 2018"}, {"text": "Its frozen upon Chrome's start and I've gotta click on it a thousand times until it shakes back in to life.", "stars": 3, "date": "Feb 7, 2018"}, {"text": "this is amazing :O", "stars": 5, "date": "Feb 6, 2018"}, {"text": "Really useful when you need it and the clever identification of full words is fairly effective.\n\nWould be great if it has hotkey to disable and enable as clicking on the icon is a hassle at times.", "stars": 4, "date": "Jan 18, 2018"}, {"text": "great :) this helps me a lot reading", "stars": 5, "date": "Dec 30, 2017"}, {"text": "Excellent dictionary! easy to use and lookup the original form of Japanese vocabulary.", "stars": 5, "date": "Dec 23, 2017"}, {"text": "want japanese to thai", "stars": 5, "date": "Dec 5, 2017"}, {"text": "I'm glad my textbook showed me this extension. Kanji is so hard to learn but this makes it so I can still read lots of websites! I hear that the Firefox version has some very useful features like saving vocabulary. I'd love to see some of those here.", "stars": 4, "date": "Nov 15, 2017"}, {"text": "perfect! good job!!!", "stars": 5, "date": "Oct 31, 2017"}, {"text": "Amazing extension for any Japanese student.", "stars": 5, "date": "Sep 13, 2017"}, {"text": "I used rikaichan in FF and recently started to use rikaikun in Chrome. Now many improvements and I happy to use.\nIt works good, but not able to set specific tabs. Its shows all tabs. Tab setting is available in FF. If comes here, more useful...", "stars": 4, "date": "Sep 12, 2017"}, {"text": "Fantastico, utilissima se state studiando il giapponese come sto facendo io.\nありがとうございました！！\n(to fix: if you close chrome while rikaikun still on, next time you open chrome, the \"on\" label still displayed, but the plugin is off.", "stars": 5, "date": "Sep 3, 2017"}, {"text": "This app is so amazing and helpful :D", "stars": 5, "date": "Aug 10, 2017"}, {"text": "It doesn't work in chrome since a few days D,:, it's an extremely useful extension so it's  a pain not be working ):", "stars": 5, "date": "Jun 28, 2017"}, {"text": "out-of-date dictionary, they should update the entries with the ones in\n\nhttp://nihongo.monash.edu/cgi-bin/wwwjdic?1C: \n\n(the dictionary it seems they used for the application)", "stars": 2, "date": "Jun 8, 2017"}, {"text": "Incredibly useful for browsing. It has a surprising amount of knowledge about specific areas. For example, knowing 圏 as \"category\" in the context of category theory.", "stars": 5, "date": "Jun 2, 2017"}, {"text": "This is a fantastic app. It's one of the best and in some cases it's a make or break extention when determining which computer to use for work. I'd even say I'm very grateful to the developers. \n\nThat said, it works well on Firefox and only there. Its cousin's potential here in Chrome hasn't been realized. This is the only reason I have fully switched to  Chrome. \n\nI wish it would equally as well on both browsers. It's a huge disappointment that it so underperforms on Chrome. \n\nIf you haven't... Show more", "stars": 2, "date": "May 29, 2017"}, {"text": "Cannot turn it on on Chrome :(", "stars": 1, "date": "May 25, 2017"}, {"text": "Wanna learn japanese? You need this!", "stars": 5, "date": "May 24, 2017"}, {"text": "help me alot", "stars": 5, "date": "May 23, 2017"}, {"text": "This app got me really excited! It still does, but it doesn't seem to work on most sites, which is disappointing. The sites I was hoping this app would help me with, seem to be immune to it's power. If this app worked on all sites/documents etc, I would pay for it. I hope you find a way to fix this - お願いします！", "stars": 2, "date": "May 13, 2017"}, {"text": "Fast and useful.", "stars": 5, "date": "Apr 3, 2017"}, {"text": "It is useful of course, but it's so much worse than it's contemporary in Mozilla Firefox. On Rikaikun is slow to start up. It's almost instant in Mozilla. And recently, I've been having problems where it's only showing the reading of the word (that is, it shows how to pronounce it) and doesn't show the meanings of the words, which defeats the purpose. This needs to be fixed!", "stars": 3, "date": "Mar 21, 2017"}, {"text": "Absolutely amazing tool for understanding/learning Japanese.", "stars": 5, "date": "Mar 7, 2017"}, {"text": "Very useful.", "stars": 5, "date": "Mar 7, 2017"}, {"text": "when it works it is good and really is helping. when it works, that is. bcs 80% of the time i can't even turn on the feature", "stars": 1, "date": "Mar 6, 2017"}, {"text": "This has got to be the most helpful thing I have encountered thus far in my study of Japanese.", "stars": 5, "date": "Mar 2, 2017"}, {"text": "It's great, but I need it to show the pronunciation in romaji, not hiragana. It does everything except that.", "stars": 2, "date": "Mar 2, 2017"}, {"text": "MUST HAVE!!!!", "stars": 5, "date": "Feb 18, 2017"}, {"text": "great for reading", "stars": 5, "date": "Feb 17, 2017"}, {"text": "good port, but would really need the save vocabulary to file feature the firefox version has.", "stars": 3, "date": "Feb 5, 2017"}, {"text": "my favourite", "stars": 5, "date": "Feb 1, 2017"}, {"text": "The translation works just fine, but the extension has SO MUCH TROUBLE turning on that I can't use it maybe 80-90% of the time.", "stars": 2, "date": "Jan 3, 2017"}, {"text": "Simply the best way to learn japanese and read japanese articles. PERIOD!", "stars": 5, "date": "Jan 2, 2017"}, {"text": "Super helpful and reliable!", "stars": 5, "date": "Dec 5, 2016"}, {"text": "amazing app, helps me a lot with kanji that I don't recognize.", "stars": 5, "date": "Nov 12, 2016"}, {"text": "Good", "stars": 5, "date": "Nov 5, 2016"}, {"text": "I love it when it works but it doesn't work so often !!!", "stars": 2, "date": "Oct 31, 2016"}, {"text": "Pretty nice port. Functionality is perfect, identical to the one on Firefox (Rikaichan), with one EXCEPTION: it takes a little too long to load compared to the original extension on Firefox.", "stars": 4, "date": "Oct 20, 2016"}, {"text": "needs spell the word\nand consider if making a review dictionary to practice words you`v check or store in", "stars": 4, "date": "Oct 10, 2016"}, {"text": "Just. Amazing. Get it!", "stars": 5, "date": "Oct 6, 2016"}, {"text": "It helps a lot.", "stars": 4, "date": "Oct 1, 2016"}, {"text": "Really nice tool. As remarked in a previous comment, it would be better to be active only by pressing some key, or some other way to avoid interference when not needing the popup.", "stars": 4, "date": "Sep 28, 2016"}, {"text": "Great Extension!", "stars": 5, "date": "Sep 17, 2016"}, {"text": "Although there is no Chinese that I wanted, but I have to say this is really helpful for learning Kanji. Really fast and convenient.\nThank you very much!", "stars": 5, "date": "Sep 16, 2016"}, {"text": "super", "stars": 5, "date": "Sep 13, 2016"}, {"text": "I love this extension because it has saved me so much time looking up word definitions. Sometimes, you just want to check that you remember the reading or meaning of a word, or what an unknown kanji means, and rikaikun is great for that!", "stars": 5, "date": "Sep 7, 2016"}, {"text": "Thank you soooooo much for this!!!! I find it indispensable all the time!", "stars": 5, "date": "Aug 22, 2016"}, {"text": "Why haven't I installed it earlier? It would have saved me so much time.", "stars": 5, "date": "Aug 18, 2016"}, {"text": "I am on Chrome (oviously xD) and i will turn it on and go to the Japanese website thatsfull of kanji (cause I cant read kanji....) and it dosent work so then i try it on Clip Studio Paint because i wa investing on the trial but could read it (due yet again to kanji) and tried it there. I heard a lot of positive stuff about it but when I cant use it because something dosent work then I can only rate it negitively. It should be fixed somehow because when it is I will be usings it 24/7 basiclly xD", "stars": 2, "date": "Aug 8, 2016"}, {"text": "Great tool but if you are not careful will ultimately cripple your ability to read. I like the option to change what pops up. I wish this had an additional flashcard option where you could save certain words for a flashcard system like Anki or something.", "stars": 4, "date": "Aug 8, 2016"}, {"text": "Indispensable.", "stars": 5, "date": "Aug 5, 2016"}, {"text": "It's extremely amazing, it has great word detection. I love it. However i hope this extension can work offline.", "stars": 5, "date": "Jul 30, 2016"}, {"text": "A MUST HAVE for 日本語 (JP) studying. I teach a lot of JP online and this is one of the first things I have my students grab, for every level.", "stars": 5, "date": "Jul 29, 2016"}, {"text": "Great for looking up words and phrases that you don't know. The only reason I put 4 stars is because if you are reading the news (for example) and your mouse is in the middle of the page you are going to be picking up readings of words that you don't want (aka the pop-up box will get in the way). So you need to learn how to precariously position the mouse to get through long articles", "stars": 4, "date": "Jul 28, 2016"}, {"text": "Best extension to translate Japanese page.", "stars": 5, "date": "Jul 21, 2016"}, {"text": "This extension has been very helpful, Thanks so much!", "stars": 5, "date": "Jul 11, 2016"}, {"text": "good application.\nvery useful.\nthanks to the development team.", "stars": 5, "date": "Jul 6, 2016"}, {"text": "very useful extension,..\nBut many people did not have the chance to know this apps", "stars": 5, "date": "Jul 6, 2016"}, {"text": "It is an extremely handy tool for Japanese learners.", "stars": 5, "date": "Jun 23, 2016"}, {"text": "Th addon you wish would be available on all your system.", "stars": 5, "date": "Jun 19, 2016"}, {"text": "Just what I needed! Very helpful for beginners. Now I don't have to use Jisho every five minutes. Thanks!", "stars": 5, "date": "Jun 9, 2016"}, {"text": "love it", "stars": 5, "date": "Jun 6, 2016"}, {"text": "4.9 stars. Excellent extension that is an incredibly helpful for me. The good far outweighs the minor issues. \nBTW, the minor issues are (1) it says \"ON\" even when not, especially when chrome is started up, (2) loading time is very long (perhaps this is a chrome issue? but rikaichan for firefox was quite fast.\nThanks to the developer for the super useful extension!!", "stars": 5, "date": "Jun 6, 2016"}, {"text": "There're many problem... Most of the time, the definition didn't appear and it has slow respond, I don't know maybe it's just me but the fact is it is inconvenient to me.", "stars": 2, "date": "Jun 5, 2016"}, {"text": "Rikaichan loads a lot faster and can be enabled with a context menu entry.", "stars": 3, "date": "Jun 4, 2016"}, {"text": "Extremely helpful for studying and navigating japanese web pages!\n\nHelps immensely when you forget that one kanji you need to know.", "stars": 5, "date": "Jun 3, 2016"}, {"text": "It's alright. Doesn't show all the definitions of a word and has trouble figuring out words without kanji/problems figuring out where one word ends and another begins. Nowhere near as versatile or full of features as Firefox's rikaichan. This extension is just a bare minimum copy paste job, even after all these years. :/", "stars": 3, "date": "May 29, 2016"}, {"text": "I cannot activate it at all, it doesn't work unlike rikaichan which I don't have any issues with.", "stars": 2, "date": "May 28, 2016"}, {"text": "It doesnt work on my device. I think the options should show to activate it or not because I cant activate it by clicking it. Or it shows that it's activated and still wont work. I heard a lot of positive stuff about it but when I cant use it because something doesnt work then I can only rate it negatively. It should be fixed somehow because I think then it will be really good.", "stars": 2, "date": "May 22, 2016"}, {"text": "Thank you so much. It's been very helpful. This app is awsome and you're awsome.", "stars": 5, "date": "May 22, 2016"}, {"text": "Very cool extension", "stars": 5, "date": "May 19, 2016"}, {"text": "It doesn't work for me. I much prefer the Firefox version, Rikaichan.\n\nI finally looked at the Support tab and realized that it's because I have uBlock on! Wish I didn't have to choose one or the other, but I'll work around the issue until there is a solution!", "stars": 5, "date": "May 18, 2016"}, {"text": "very helpful", "stars": 5, "date": "May 15, 2016"}, {"text": "love it", "stars": 5, "date": "May 13, 2016"}, {"text": "Seems to be the best of its kind for chrome.", "stars": 5, "date": "May 5, 2016"}, {"text": "Perfect for those times you can almost understand the sentence so don't want to paste the whole thing into a translation engine.", "stars": 5, "date": "Apr 20, 2016"}, {"text": "I'm not going to lie, it is flipping amazing. I use it every day at my job. I know that the amazing developers will come up with something to make it even better. :) Why 4 stars? I wanna push you guys! :P", "stars": 4, "date": "Mar 28, 2016"}, {"text": "takes a long of time to turn on", "stars": 4, "date": "Mar 16, 2016"}, {"text": "I love rikaikun, I have used it for years and years, first in Firefox and now on Chrome. It is one of the first extensions I get and it has yet to let me down. \nSo useful for anyone working with/using/loving Japanese, a must-have most certainly!", "stars": 5, "date": "Mar 8, 2016"}, {"text": "Very useful for me who is learning Japanese. It saves me a lot of time to search the meaning especially the furigana as I always forget the newly learned words.", "stars": 5, "date": "Feb 29, 2016"}, {"text": "Very useful, but why doesn't it work with offline files? I have to put the files on a local server and access them through localhost to be able to use rikaikun on them, because opening them directly with Chrome doesn't work :/", "stars": 4, "date": "Feb 17, 2016"}, {"text": "Best companion for the Japanese learning netizens!", "stars": 5, "date": "Feb 10, 2016"}, {"text": "Nice plugin. Would it be possible to make it work like the google translate plugin?\nThere you can select text then a popup appears allowing you to translate the selected text.\nThis is not as intrusive and better for reading.\n(many people use the mouse cursor to follow text whilst reading)\n\nThanks :)", "stars": 5, "date": "Feb 2, 2016"}, {"text": "Better than google translate.", "stars": 5, "date": "Jan 31, 2016"}, {"text": "Wonderful extension", "stars": 5, "date": "Jan 27, 2016"}, {"text": "I love it. but it seem slow to loading . mean that when i started chrome and drag move to Kanji, it does not popup furigana. it take a while 5 ~ 10 minutes then everything work fine. \n\nIs it seem a bug", "stars": 5, "date": "Jan 20, 2016"}, {"text": "Am I missing something? I've used this awhile ago but recently it's not working at all. Any ideas?", "stars": 3, "date": "Jan 18, 2016"}, {"text": "This is a great extension that I will be using whenever there's a kanji I don't know or a sentence I get confused over. But I can also see how it can become a problem after using it for a while, considering how it highlights near to everything and it does so right away instead of waiting until you hover over a character for a second or two. I also wish there was a way to disable hiragana and katakana reading for us who already know how to read those.", "stars": 3, "date": "Jan 14, 2016"}, {"text": "Awesome extension. I use it every time I read something in Japanese.", "stars": 5, "date": "Jan 10, 2016"}, {"text": "I've been looking for something like this for YEARS! Now I can finally say baibai to NJStar JP and be more efficient with my translations!", "stars": 5, "date": "Jan 7, 2016"}, {"text": "I use it on a daily basis...It comes in hand all the time...In fact I feel like I've memorized more kanji through rikaikun than anything else. A+\n\np.s. it enven has a pinyin reader for chinese! although it can't read all Hanzi it does read all Kanji", "stars": 5, "date": "Jan 2, 2016"}, {"text": "thank", "stars": 5, "date": "Dec 28, 2015"}, {"text": "is there a way to change the default dictionary to another language as in rikaichan for firefox? Thanks!", "stars": 5, "date": "Dec 24, 2015"}, {"text": "Best addon ever. I have been using it for 10 years working in a Japanese company, on Firefox and Thunderbird (mail client), and more recently on Chrome. This literally saved my business life in Japan.\nAwesome!\nPS: No french in the Chrome version so I'll give only 4 stars :`(", "stars": 4, "date": "Dec 21, 2015"}, {"text": "its really help full for Japanese student like me..", "stars": 4, "date": "Dec 17, 2015"}, {"text": "Great plug-in, but have had to reinstall 3 times because I switched dictionaries somehow and couldn't get it working properly again. Beyond that it works near flawlessly.", "stars": 4, "date": "Dec 14, 2015"}, {"text": "very helpful application to read news in japanese language. Great! Ilove it so much...", "stars": 5, "date": "Dec 10, 2015"}, {"text": "THIS IS THE APP, EXPLAIN THE MEANING OF  EVERY WORD ,AND WITH EXAMPLES TOO", "stars": 5, "date": "Dec 8, 2015"}, {"text": "Jesus...?\nIs that you?", "stars": 5, "date": "Dec 1, 2015"}, {"text": "Prevents japanese kanji conversion.", "stars": 3, "date": "Nov 30, 2015"}, {"text": "This extension really helps me to learn Japanese better and faster.", "stars": 4, "date": "Nov 18, 2015"}, {"text": "The only downside is yourself getting too lazy to remember all the words rikaikun translate for you.", "stars": 5, "date": "Nov 7, 2015"}, {"text": "it's very usefull and comfortable.", "stars": 4, "date": "Oct 21, 2015"}, {"text": "This plugin is a godsend. It has been extremely useful to me. Does it have some downsides? Sure. But it's overwhelmingly positive. I have Henshall's Kanji book and it references what number the Kanji is so I can look up alternate definitions/pronunciations, etymology, radicals, history - whatever is available. Plus it allows you to switch dictionaries. I do wish that you could customize the keys (e.g. \"N\" allowing me to switch dictionaries as enter isn't always my best option for what I'm doi... Show more", "stars": 5, "date": "Sep 18, 2015"}, {"text": "Holy moly, it actually works! I love it!! Despite that it's working, I think being able to \"completely understand\" what I'm reading in Japanese is still too advance for me. So, I'll need to study some more. :D", "stars": 5, "date": "Sep 15, 2015"}, {"text": "Expediates the Japanese learning process by 1000. Can't believe I didn't know about this sooner>.<", "stars": 5, "date": "Sep 14, 2015"}, {"text": "Extremely helpful.", "stars": 5, "date": "Sep 9, 2015"}, {"text": "Amazing app. It helped immensely with my Japanese learning..", "stars": 5, "date": "Sep 2, 2015"}, {"text": "This is really convenient and useful tool indeed!!\n\nHowever, comparing to the Firefox version, this one take quite long time to start this extension.\n\nIt would be greatly appreciate if you could improve that point.\n\nAnyhow, convenient tool! I use it a lot!", "stars": 3, "date": "Aug 30, 2015"}, {"text": "This worked like a charm! Thank you for inventing such a wonderful plugin for Japanese learners like me.", "stars": 5, "date": "Aug 24, 2015"}, {"text": "Takes forever to start up. It's way slower than rikaichan on Firefox.", "stars": 3, "date": "Aug 22, 2015"}, {"text": "Yes, the 'D' thing is quite annoying ..", "stars": 4, "date": "Aug 15, 2015"}, {"text": "i love it", "stars": 5, "date": "Aug 14, 2015"}, {"text": "This is the best!", "stars": 5, "date": "Aug 11, 2015"}, {"text": "Extremely helpful!", "stars": 5, "date": "Aug 5, 2015"}, {"text": "I love this, I use it on both Chrome and Firefox XD It has some glitchy moments here and there but its super worth it for those learning the language.", "stars": 5, "date": "Jul 22, 2015"}, {"text": "omg so far it is great i can enable it of turn it off  ( O -_- O)  (O U O )", "stars": 5, "date": "Jul 22, 2015"}, {"text": "Pretty good overall.\nIt helps a lot when you're learning Japanese.", "stars": 5, "date": "Jul 9, 2015"}, {"text": "Very useful, but the pop-up is so annoyed! Can you add a \"trigger-key\" function for this extension?", "stars": 4, "date": "Jul 7, 2015"}, {"text": "it's great, Erek. i want to put there jap-rus dict, but my skills doesn't let me yet. can You?", "stars": 5, "date": "Jun 27, 2015"}, {"text": "Didn't work", "stars": 1, "date": "Jun 21, 2015"}, {"text": "Didn't work", "stars": 2, "date": "Jun 20, 2015"}, {"text": "Great! Awesome app! Like this :)", "stars": 5, "date": "May 26, 2015"}, {"text": "Have used it for quite a while and am quite happy with how well it works. Thank you!", "stars": 5, "date": "May 26, 2015"}, {"text": "Very helpful for those learning japanese.", "stars": 5, "date": "May 9, 2015"}, {"text": "Great add-on for learning Japanese. But can you make it turned on by default. It is a pain to turn it on everytime", "stars": 5, "date": "May 8, 2015"}, {"text": "Great! Useful", "stars": 5, "date": "May 6, 2015"}, {"text": "I seem to have to toggle it on or off and back on but other than that I find this to be really helpful.", "stars": 5, "date": "May 5, 2015"}, {"text": "The Standard and Leading Program in it's class, very technical, designed to be turned on and turned off when needed, there is a setting that turns off highlighting text, which may cause an end to some bad comments about deleted text which absolutely can happen if your typing in japanese and come across your cursor, highlight your text and the program trys to read what you wrote, if you keep typing over highlighted text, well, you can see the potential for some incidents there. but there are s... Show more", "stars": 5, "date": "Apr 22, 2015"}, {"text": "Pretty great, but I never thought I'd see something that runs faster in Firefox than Chrome. It takes so long to activate that I wonder if it's trying to load at all. If I have it turned on and I then toggle off/on on a single tab it should be basically instant since it's already loaded everything and shouldn't need to again.", "stars": 4, "date": "Apr 22, 2015"}, {"text": "Very helpful for Japanese learners!", "stars": 5, "date": "Apr 21, 2015"}, {"text": "Works like a charm!", "stars": 5, "date": "Apr 9, 2015"}, {"text": "This is as helpful as it is annoying :D it is quite necessary though for learning Japanese, but just, really, really annoying.", "stars": 3, "date": "Apr 8, 2015"}, {"text": "This is one of the most useful extensions I have ever come across!! It is really helpful for those who want to learn kanji over the internet.", "stars": 5, "date": "Mar 29, 2015"}, {"text": "This thing blows, gonna go back to using firefox because at least perapera japanese works.\n\nMega long delay when trying to turn it on and have to fiddle with it on and off before I can finally get it to work showing popups.\n\n I thought a previous update was suppose to fix this.", "stars": 1, "date": "Mar 27, 2015"}, {"text": "It's great and useful, but a bit glitchy. I wish they fixed the bugs.", "stars": 4, "date": "Mar 26, 2015"}, {"text": "Amazing... if you have issues read the controls to define where it pops up.", "stars": 5, "date": "Mar 17, 2015"}, {"text": "Really helpful!", "stars": 5, "date": "Mar 1, 2015"}, {"text": "One of the best app for learning Japanese!", "stars": 5, "date": "Feb 15, 2015"}, {"text": "Oh my gosh! Words cannot express how helpful this plugin is to me! It is so nice to be able to read articles AND! If you use the \"shift\" key when highlighted over a compound kanji you can analyse EACH CHARACTER! You can get the key words for each kanji singularly AND also get the NANORI (name) readings! There are three dictionaries to switch in between from (using the shift key). This plugin is really seamless! I HIGHLY RECOMMEND that you learn how to use the controls for this plugin n the op... Show more", "stars": 5, "date": "Feb 13, 2015"}, {"text": "I'm very happy with it!", "stars": 5, "date": "Feb 5, 2015"}, {"text": "Cool. It saved my so many copy paste cycles.", "stars": 5, "date": "Jan 28, 2015"}, {"text": "I hope it could add a feature, just show beside the word like 現在（げんざい） and highlight those word with different color when it have a lot of pronunciation, since a lot of people aren't liking it keeps pop up everywhere", "stars": 5, "date": "Jan 11, 2015"}, {"text": "Brilliant! Works perfectly and helps me learn Japanese. Thanks!", "stars": 5, "date": "Jan 7, 2015"}, {"text": "Works really well and saves me the trouble of looking up unknown words on a dictionary! :D", "stars": 5, "date": "Jan 7, 2015"}, {"text": "Love it! Even comes with a names dictionary~", "stars": 5, "date": "Jan 5, 2015"}, {"text": "great app havent tried it yet, im sure im going to love it and i will come back and bump my rating", "stars": 3, "date": "Dec 19, 2014"}, {"text": "Very helpful for on-the-fly jisho access.", "stars": 5, "date": "Dec 6, 2014"}, {"text": "It's a great tool, but starting it up is really slow compared to the Firefox-version. It takes several seconds, while it activates instantly on Firefox..", "stars": 3, "date": "Dec 1, 2014"}, {"text": "superb", "stars": 5, "date": "Dec 1, 2014"}, {"text": "thankyou", "stars": 5, "date": "Dec 1, 2014"}, {"text": "A great app", "stars": 5, "date": "Nov 26, 2014"}, {"text": "Really Helpful!\nThanks", "stars": 5, "date": "Nov 19, 2014"}, {"text": "Works fairly well. It doesnt read full long words too well though.", "stars": 4, "date": "Oct 23, 2014"}, {"text": "It's good, just not as good as rikaichan (the Firefox extension it's based on).\n\nThere are several instances I've found of text it won't 'see' where chan sees it fine. Also, it often seems to 'drift'; think the text is lower or higher than it is. Also, it doesn't get along with input boxes. Chan doesn't either, but Kun seems worse in that regard.\n\nWhen it works, it's great, and it works most of the time. You may find yourself disappointed if you've come from Firefox, however.", "stars": 3, "date": "Oct 23, 2014"}, {"text": "very useful :D", "stars": 5, "date": "Oct 17, 2014"}, {"text": "loved it", "stars": 5, "date": "Oct 16, 2014"}, {"text": "Works fantastic, love it!", "stars": 5, "date": "Oct 16, 2014"}, {"text": "I'm in the group of people who cant get it to work at all on chrome.  I don't use firefox anymore and want something stable for chrome. Please tell us what we are doing wrong?", "stars": 1, "date": "Oct 1, 2014"}, {"text": "Use this daily.\nTurn it ON when needed, Off when not.", "stars": 5, "date": "Sep 29, 2014"}, {"text": "I gave five stars but it's more like 4.75 stars. I love this thing minus the few glitches that come along with it. Sometimes the \"on\" indicator stays on after closing the browser even though it's off and then clicking it four times is needed. Also, when looking at some loan words on some sites, it gets confused. Even though most loan words are derived from English or English-sounding words, it's not always the case and it would be nice to just know.\n\nAlthough, overall, I love this, and it's g... Show more", "stars": 5, "date": "Sep 24, 2014"}, {"text": "NEED to turn on\\off to work on Win7 Chrome x64 to work sometimes and wait 15+ SECONDS to work on an i5 Intel processor quad-core but it is a good extension when it does work. PLEASE fix so it does work instantly upon boot. GREAT APP OTHERWISE!!! :D\nlooking forward to advancement!\ntwitter: @Codeine_Bourbon :)\n\nvery good that it handles conjugation of verbs and recognizes such when it sees it. Very impressed!", "stars": 3, "date": "Sep 21, 2014"}, {"text": "great extension, easy to use", "stars": 5, "date": "Sep 16, 2014"}, {"text": "Very useful when reading news articles online in Japanese!", "stars": 5, "date": "Sep 15, 2014"}, {"text": "the UI is not beautiful!", "stars": 4, "date": "Sep 12, 2014"}, {"text": "A possible feature for future updates could be that it would show the romaji as well?", "stars": 4, "date": "Sep 9, 2014"}, {"text": "I really love this extension. It gives the amount of help I want when I'm stumbling through a translation. I only want for a keyboard shortcut to quickly enable and disable it (since it can get in the way when browsing a page).", "stars": 5, "date": "Sep 8, 2014"}, {"text": "Great app, I've been using it for years", "stars": 5, "date": "Sep 6, 2014"}, {"text": "If it worked on gmail I'd have given it 5 stars. Excellent for web pages. My favorite feature is that it gives the readings for the kanji. Great app!", "stars": 4, "date": "Aug 23, 2014"}, {"text": "It doesn't works at times. Only furigana appears with no meaning.", "stars": 3, "date": "Aug 18, 2014"}, {"text": "This is good to use for reading Japanese Kanji.", "stars": 5, "date": "Aug 15, 2014"}, {"text": "I really love this extension, but lately now  it doesn't show the definition of the highlighter word. It just shows me the word in hiragana form. \n\nPlease fix that!", "stars": 4, "date": "Aug 14, 2014"}, {"text": "I was simply looking for a way for the furigana to appear above the kanji, but hey, this is pretty useful too!", "stars": 5, "date": "Aug 8, 2014"}, {"text": "Huge fan of Rikaikun and Rikaichan, thanks so much for developing. \n\nNo negatives at all, my settings changed by themselves and took me a while to figure out how to change back (so couldn't see english translation), if this happens to anyone, change in settings and make sure you click save, then refresh the page you are translating and viola, back in business.", "stars": 5, "date": "Jul 28, 2014"}, {"text": "Extremely useful! For someone who has to deal with japanese and isn't native, it is a must have extension.\n\nIt consumes a fair amount of RAM (about 200MB I think) so it may not be wise to use it in a very old PC.\n\nIf you don't activate highlight text boxes in rikaikun settings, it may be a little buggy when you try to use it in an input text box.\n\nIf it doesn't translate, you may have accidentally \npressed some shortcut like \"D\" (it hides translation and leaves only the hiragana pronunciation... Show more", "stars": 5, "date": "Jul 23, 2014"}, {"text": "it doesn't working,why?? please help!", "stars": 1, "date": "Jul 21, 2014"}, {"text": "Saved my life in japan", "stars": 5, "date": "Jul 12, 2014"}, {"text": "Really helpful.", "stars": 5, "date": "Jul 10, 2014"}, {"text": "I like it a lot, but like Ola Nordqvist said it is becoming really annoying. My mouse is not even near a word and it just randomly highlights a word. lately i have been turning it off because it will delete my word/sentence. Not sure why, but I don't remember raikachan for firefox doing this. Please correct this issue.", "stars": 3, "date": "Jul 6, 2014"}, {"text": "its helping me quite a lot when im trying to read webpages in japanese.", "stars": 4, "date": "Jul 3, 2014"}, {"text": "I use it in Chromium for Ubuntu. It works nicely, and it's a very useful dictionary when reading websites in Japanese.", "stars": 4, "date": "Jun 20, 2014"}, {"text": "Very usefull extension!", "stars": 5, "date": "Jun 16, 2014"}, {"text": "subarashi!\nvery helpful tool - nice work", "stars": 5, "date": "Jun 13, 2014"}, {"text": "Use it all the time. Excellent aid to reading Japanese.", "stars": 5, "date": "Jun 9, 2014"}, {"text": "Sometimes there are issues with input (parts of your message being deleted upon window popup) but the overall usefulness of the app outweighs the cons.", "stars": 5, "date": "Jun 7, 2014"}, {"text": "this is great! but could you add the romani next to the hiragana please? that would be very useful while learning. Thanks and great program.", "stars": 5, "date": "Jun 5, 2014"}, {"text": "saves me so much time. Wish I'd found this a long time ago.", "stars": 5, "date": "Jun 4, 2014"}, {"text": "Very helpful!\n\nWell they don't have the romaji of how to read it, so assuming you're already mastering the katakana and hiragana.\n\nBut it's all right, it's good practice.", "stars": 5, "date": "Jun 2, 2014"}, {"text": "Useful, i love it so much. Without this extension, my japanese skill would not improve a mili.", "stars": 5, "date": "Jun 1, 2014"}, {"text": "Excellent tool, and I recommend it to anyone learning japanese. One quirk, and it's a small one, is that even if it says it's \"on\" I still have to click on it to activate it. This is required every time I open the browser, but it works great otherwise.", "stars": 5, "date": "Jun 1, 2014"}, {"text": "wouldn't try to read japanese without it. works perfectly each time.", "stars": 5, "date": "May 31, 2014"}, {"text": "This is a great extension, but recently it stopped translating? It just shows the hiragana pronunciation of the kanji without any more information. Not sure if this is a new bug or what?\n\nEdit - if you press D on your keyboard with a Rikaikun popup open, definitions come back!!", "stars": 4, "date": "May 31, 2014"}, {"text": "Great Extension!", "stars": 5, "date": "May 30, 2014"}, {"text": "This addon just has so many problems when translated over to Chrome for some reason. I have no experience in the matter so I can't say for myself, but there are just so many annoying problems that just don't occur in Firefox. I wouldn't even be here bitching about it if I didn't have to use this horrible browser.", "stars": 2, "date": "May 29, 2014"}, {"text": "It was still usable some days ago, but now it decides to stop working completely, reinstall doesn't do any good either...", "stars": 1, "date": "May 23, 2014"}, {"text": "I loose this app today, and now understand how important it was for me. It is great, great, great, and I must thank to the authors thank thank thank", "stars": 5, "date": "May 18, 2014"}, {"text": "Quite useless.\nI click on it: it toggles on. Then I hover over Japanese text: no pop-up.\n\nOther times, I click on it to toggle on: nothing happens.\n\nI've uninstalled and installed several times.\n\nThe Rikaichan version works on Firefox but it's buggy too.\n\nRikaikun is totally unusable on Chrome.", "stars": 1, "date": "May 6, 2014"}, {"text": "why the translation doesn't work now ? only the pronunciation works", "stars": 3, "date": "Apr 24, 2014"}, {"text": "Soooooooo helpful!", "stars": 5, "date": "Apr 22, 2014"}, {"text": "Way too slow, devours the RAM, full of bugs, constantly crashes.\nNevertheless, it doesn't work any more on my machine.", "stars": 2, "date": "Apr 12, 2014"}, {"text": "It doesn't even work.", "stars": 1, "date": "Mar 28, 2014"}, {"text": "seems not work in MAC", "stars": 2, "date": "Mar 22, 2014"}, {"text": "The name dictionary is a great addition, but a little bit of explanation would be nice (eg. in the settings panel). I mean what are the letters stand for, like...\nf: female?\nm: male?\nu: unisex?\ng: ??\ns: surname?\np: place?", "stars": 4, "date": "Mar 20, 2014"}, {"text": "This app is great.\n\nOne feature I would really like is a setting to add a delay before the popup appears. \n\nI don't need it to look up every word as i am moving my cursor across the page, just ones where I hover my cursor over the word for like 1sec or something.", "stars": 4, "date": "Mar 19, 2014"}, {"text": "Amazing!! especially for Japanese learners!!", "stars": 5, "date": "Mar 16, 2014"}, {"text": "The text in the popups is a bit too small for my liking. It would be nice to be able to specify the size. Just started using it, but it looks fairly helpful.", "stars": 4, "date": "Mar 16, 2014"}, {"text": "Amazing little tool.\n\nSimple to toggle on/off and gives several readings for any Japanese you may bump into.\n\nHighly recommended!", "stars": 5, "date": "Mar 11, 2014"}, {"text": "I couldn't get by without it. It is a bit annoying at times as it constantly pops up so you are forced to turn it off and on when browsing a page.", "stars": 5, "date": "Mar 11, 2014"}, {"text": "An amazingly useful plugin for anyone learning Japanese on the web!", "stars": 5, "date": "Mar 7, 2014"}, {"text": "Useful, but really annoying. I've been using this and rikaichan for many years and the most annoying aspect (find several complains about this) that focus is lost and potentially part of your message gets deleted whenever the popup is shown makes it almost impossible to use.", "stars": 2, "date": "Mar 2, 2014"}, {"text": "Very helpful, but when I type text and go over it to make sure I used the correct kanji it will sometimes delete the words I wrote. Other than that it works well.", "stars": 4, "date": "Mar 1, 2014"}, {"text": "works very well!!!\nI love it!", "stars": 5, "date": "Feb 23, 2014"}, {"text": "I just noticed the new settings page, and so the names dictionary! Now I don't have to consider going back to using Firefox. Cheers!", "stars": 5, "date": "Feb 22, 2014"}, {"text": "I can't surf the web without using rikaikun!~ It is great. I haven't used rikaichan before so I can't compare the two.", "stars": 4, "date": "Feb 17, 2014"}, {"text": "Incredible. Thank you!", "stars": 5, "date": "Feb 12, 2014"}, {"text": "started using this when I first started learning japanese, havent stopped using it since. Best app. for japanese learners!\n大好きだよ！cant read it?  install rikaikun :)", "stars": 5, "date": "Feb 10, 2014"}, {"text": "change color font?", "stars": 4, "date": "Feb 6, 2014"}, {"text": "It's a great tool! It would be nice if there were more languages available like in the Mozilla Ad on Rikaichan though.", "stars": 4, "date": "Feb 1, 2014"}, {"text": "2 stars just because it the VERY MINIMUM. rikaikun fails in comparison to rikaichan. Development for this app is dead since September 2013 and any hope of improvements are now gone unless you want to update it yourself. As for why the low score, rikaikun cannot recognize names, places, and other essentials. Many options were not implemented and is unresponsive at many times. My advice to people reading my review is to either learn almost everything yourself and only use rikaikun as a undepend... Show more", "stars": 2, "date": "Jan 23, 2014"}, {"text": "haven't used it much so far, but this is REALLY great!", "stars": 3, "date": "Jan 14, 2014"}, {"text": "The MOST HELPFUL extension imaginable for a student of Japanese. You can read anything without having to pause to look up a pesky kanji you don't know. Rikai also knows a ton of words, even slang, so it's a great instant dictionary too. I highly recommend this extension!!", "stars": 5, "date": "Jan 4, 2014"}, {"text": "I just recently started using it and it helps me a lot. Works on jukugo and separate kanji. Excellent! Thanks!", "stars": 5, "date": "Jan 1, 2014"}, {"text": "I've been using this for a couple weeks and it's really nice.\n\nIf you're trying to learn kanji and find them occasionally in your daily browsing, definitely get this.\n\nEdit: I've been using this plugin for over a year now and still love it.", "stars": 5, "date": "Dec 31, 2013"}, {"text": "this extension is really helping me a lot.. arigato gozaimasu..", "stars": 5, "date": "Dec 23, 2013"}, {"text": "Thank you. I really love it", "stars": 5, "date": "Dec 17, 2013"}, {"text": "Perfect.", "stars": 5, "date": "Dec 3, 2013"}, {"text": "Been using Rikaichan on firefox , recently moved to chrome ,Rikaikun for the most part gets the job done although i did notice that there are some memory issues and it slows chrome down .Also there is no name support as of yet.Would be perfect with these improvements.", "stars": 3, "date": "Nov 29, 2013"}, {"text": "The best extension for people living in Japan. Keep the good work!", "stars": 5, "date": "Nov 19, 2013"}, {"text": "it would be better to be able to stick", "stars": 5, "date": "Nov 16, 2013"}, {"text": "cant be work in MAC.", "stars": 5, "date": "Nov 12, 2013"}, {"text": "I've been using this extension for a year now after using rikaichan on firefox. I have not had a single problem with it, and it has helped me immensely to read japanese texts. I can even OCR scanned texts, convert them to basic HTML pages and then use chrome and rikaikun to read them faster! If I have to make a small complaint, it would be that when I am writing emails, and I forget to turn off rikaikun, it pushes my screen curson into random places. Other than that, it's awesome. Keep up the... Show more", "stars": 5, "date": "Oct 2, 2013"}, {"text": "Great extension, for japanese learners and who try to read japanese texts. Work perfectly.", "stars": 5, "date": "Sep 26, 2013"}, {"text": "Great extension, major benefit to quality of browsing. Unfortunately seems to no longer be working properly for me. After I turn it on it works for maybe a minute, then promptly doesn't work at all (I have to repress the button, even though it says \"on\").\n\nNot sure if it's my comp, my account, or the extensions fault, cause this just started happening", "stars": 5, "date": "Sep 25, 2013"}, {"text": "Not as good as Rikaichan, I don't even know where to install the name dictionary(not even polarcloud works). And sometimes this app doesn't work.\n\nNothing appears when I hover over a word, but this issue is apparently fixed for rikaichain...?\n\nAnd on the extension menu, there's nearly not enough customization other than the colour(lol).\n\nEdit: and lol haters hate(not), I've used this extension before on my XP PC and it worked flawlessly, but on my Win 7 one it just fails so badly. It's kind o... Show more", "stars": 1, "date": "Sep 19, 2013"}, {"text": "Good!", "stars": 3, "date": "Sep 8, 2013"}, {"text": "Absolutely essential for Japanese learners.", "stars": 5, "date": "Aug 30, 2013"}, {"text": "Great for helping me study Japanese. Works flawlessly.", "stars": 5, "date": "Aug 11, 2013"}, {"text": "Has all the basic functionality of the original Firefox plugin with no issues here. Great work!\n\n(Hint: Shift click to display individual Kanji radical derivations)\n\nWill this be available in any other languages?", "stars": 5, "date": "Jul 24, 2013"}, {"text": "Awesome!!! It's really helpful for my Japanese learning", "stars": 5, "date": "Jul 24, 2013"}, {"text": "Thank you so much, this will help me a lot!", "stars": 5, "date": "Jun 3, 2013"}, {"text": "I have just got this extension and it doesn't work at all. I don't know what wrong with it, but it really is not worth having.", "stars": 1, "date": "Jun 1, 2013"}, {"text": "I find it quite helpful when I teach my Japanese class but this extension seems to be most popular with casual users so I believe an implementation of a romaji system would be very helpful for them.", "stars": 4, "date": "May 23, 2013"}, {"text": "It is extremely helpful when it comes to translating Japanese. It's like having a dictionary but easier to find what I need to know.", "stars": 5, "date": "May 15, 2013"}, {"text": "It's very useful... :)", "stars": 5, "date": "May 10, 2013"}, {"text": "It just didn't work for me. Can someone please tell me what I am doing wrong? I only did what the overview said to do...", "stars": 1, "date": "Apr 23, 2013"}, {"text": "Occasionally it bugs and won't show the translations any more unless you clean browser cache and reinstall it. please fix this and plus the thing about the popup going behind flash! \n\nAlso a hotkey for keeping the pop up sticky so you can copy stuff from there  would be useful", "stars": 2, "date": "Apr 18, 2013"}, {"text": "Can not find a better one. Always use, always useful. Many thanks to the author.", "stars": 5, "date": "Apr 8, 2013"}, {"text": "wow really awesome dude!\nreally I don't know such super tool exist in chrome", "stars": 5, "date": "Apr 7, 2013"}, {"text": "I really like this extensions. However, it'd nice to have an options to control the position of the popup, \"below\", for example. Many times que popups covers the text and it's imposible to properly use it. Many thanks!", "stars": 4, "date": "Apr 4, 2013"}, {"text": "Best extension for reading in japanese. I love it!", "stars": 5, "date": "Mar 21, 2013"}, {"text": "This is Soooooooooooooo great!\nWork like a magic. Thank you very much. It's sooo helpful", "stars": 5, "date": "Mar 17, 2013"}, {"text": "Excellent tool - its ability to identify conjugations and tenses has been endlessly helpful.", "stars": 5, "date": "Mar 13, 2013"}, {"text": "Saved my day on many occasion! Great free app!", "stars": 5, "date": "Mar 8, 2013"}, {"text": "Really invaluable for anything Japanese-related!", "stars": 5, "date": "Feb 25, 2013"}, {"text": "I super like it. I want to give it 7 starts but only 5 are available. So, it's a 5 star high 5 for this.", "stars": 5, "date": "Feb 25, 2013"}, {"text": "An essential for any Japanese learner!", "stars": 5, "date": "Feb 20, 2013"}, {"text": "This extension is awesome!!\n\nI tend to read a lot InuYasha fanfics, and sometimes the author a story will put the kanji in the story, and I would always think, 'I wonder what these kanji mean' but now I just hover my mouse over them and read the pop-up!!! though. i'd like to have more than the first tab of options... but other than that, THIS IS ONE OF THEE BEST EXTENSIONS I'VE EVER HAD!!!!", "stars": 5, "date": "Feb 12, 2013"}, {"text": "Great. Love it. Anyway I could be easier for beginers if it has an option to show Romanji", "stars": 5, "date": "Jan 30, 2013"}, {"text": "It's a pretty good extension. It works pretty well.\n\nBut I think it would be much more great if it could translate the words on a HTML file.", "stars": 4, "date": "Jan 28, 2013"}, {"text": "If you're studying Japanese, this is a must-have extension!", "stars": 5, "date": "Jan 16, 2013"}, {"text": "Thanks for making this available in Chrome too.", "stars": 5, "date": "Jan 6, 2013"}, {"text": "Works well, but does not include romanization of hovered word. Also does not work for dynamically  inserted content.", "stars": 3, "date": "Dec 21, 2012"}, {"text": "This makes reading Japanese websites much, much easier.", "stars": 5, "date": "Dec 15, 2012"}, {"text": "awesome.", "stars": 5, "date": "Dec 13, 2012"}, {"text": "Exactly what you need if you understand enough Japanese but are still stuck with not knowing enough kanji - thanks!", "stars": 5, "date": "Nov 27, 2012"}, {"text": "When there are verbs like 来ない, or other conjugated forms of a verb, it would be nice to see its pronunciation, especially if there are multiple pronunciations for the base verb, but only one that fits the conjugated form. Like for 回る, which can be either まわる or もとおる. They can be differentiated in some conjugations, and it would be nice to know the exact pronunciation then", "stars": 4, "date": "Nov 24, 2012"}, {"text": "Amazing! contains kanji, meaning, furigana, compounds and more! a must have for any serious japanese learner", "stars": 5, "date": "Nov 18, 2012"}, {"text": "Lifesaver.", "stars": 5, "date": "Nov 13, 2012"}, {"text": "Works fine in FF, but having trouble in chrome. Hovering over kanji (when RK is activated) doesnt come up with any popup box =/", "stars": 2, "date": "Nov 6, 2012"}, {"text": "AWESOME", "stars": 5, "date": "Nov 5, 2012"}, {"text": "it is good.. but i felt there is something missing", "stars": 3, "date": "Nov 3, 2012"}, {"text": "I love it, but - when you  hover with your mouse over big chunk of text, the translating window pops up to fast(it is being activated by every piece of text that i hover over while moving to the exact word i want to look up), this makes it harder to point the right word, because the pop up covers large areas of the page. IT WOULD BE GREAT IF WE COULD SLOW DOWN THE FEEDBACK FOR A TINY BIT, OR ACTIVATE THE POP UP MANNUALY AT WILL. THANKS", "stars": 5, "date": "Nov 3, 2012"}, {"text": "Still lacks some of the nice features of the Firefox version, like being able to easily create word lists for studying, but it's far better than using a separate dictionary website.", "stars": 4, "date": "Oct 29, 2012"}, {"text": "Loved it back when I used Firefox, and the port works like a charm in Chrome. Kudos!", "stars": 5, "date": "Oct 23, 2012"}, {"text": "Outstanding", "stars": 5, "date": "Oct 17, 2012"}, {"text": "Looking for Japanese-French option!!!", "stars": 4, "date": "Oct 13, 2012"}, {"text": "This is a very useful extension, but there is one frustrating glitch--if there is any bold text immediately before a kanji compound you want to highlight, the extension won't work on it.", "stars": 4, "date": "Oct 11, 2012"}, {"text": "It is not working for me. It did some months ago, but at some point, it failed and now it won't start. I click on the icon, and after a few seconds, the extension crashes and I get a Chrome message asking me if I want to load it again. I've reinstalled the extension and even Chrome, with no luck :(", "stars": 1, "date": "Oct 7, 2012"}, {"text": "It's working fine when I'm browsing but I when I hover over posts or comments on facebook nothing happens...", "stars": 4, "date": "Oct 3, 2012"}, {"text": "Pretty good! It helps me a lot to remember some kanjis...", "stars": 5, "date": "Oct 1, 2012"}, {"text": "Very handy translator at the tip of your fingers. Would be even more useful if it has the \"Save\" function Rikaichan has; it is incredibly useful for making a .txt file of words to study, which can then be imported to Anki as easy-to-use flashcards.", "stars": 5, "date": "Sep 29, 2012"}, {"text": "I really love using this and have used rikaichan on Firefox for ages now. Recently I switched to chrome and of course I got rikaikun! \n\nIt's great and all, but one thing I miss is being able to right click a page to activate it. I guess I'll just have to get used to clicking it at the top of the page..", "stars": 4, "date": "Sep 15, 2012"}, {"text": "Excellent tool. It's so handy!", "stars": 5, "date": "Sep 14, 2012"}, {"text": "One of the greatest and most useful extension of chrome store, especially for people who are learning Japanese!", "stars": 5, "date": "Sep 12, 2012"}, {"text": "Works well and a very welcome port, but it could really use the \"names\" dictionary available for the original Rikaichan.\nAlso keyboard shortcuts would be nice, otherwise a great port and still the best browser-based dictionary tool I know of.", "stars": 4, "date": "Sep 11, 2012"}, {"text": "So useful!", "stars": 5, "date": "Sep 7, 2012"}, {"text": "Works perfectly!\n\n...except with TweetDeck webapp :(", "stars": 5, "date": "Sep 6, 2012"}, {"text": "Couldn't get through Japanese class (or read emails from professors) without it.", "stars": 5, "date": "Sep 3, 2012"}, {"text": "Love the app however it is lacking some of the features that are available in the firefox edition. In particular the feature to save vocabulary to a word file which is useful for revision. please include this in the chrome edition and you will have my love forever.", "stars": 5, "date": "Aug 25, 2012"}, {"text": "Awesome Extension.", "stars": 5, "date": "Aug 25, 2012"}, {"text": "素晴らしい有用！\nA great extension that is very useful.  Some options still need to be implemented, but the main functionality is present and does not disappoint.  Recommended!", "stars": 5, "date": "Aug 15, 2012"}, {"text": "The Chrome version has a serious bug that has bothered me. After I do a Google search for a Japanese term, if I hover over that sentence, there  is an issue. If I highlight a word with Rikaichan which is right after the search term, it will not display the Rikaichan results. Instead, it will loop over to the beginning of the sentence or title.\n\nFor example, if I search for \"勉強\" I may hover over the title for a site called \"アメリカで勉強します\". If I hover over します with Rikaichan, it will incorrectly g... Show more", "stars": 3, "date": "Aug 15, 2012"}, {"text": "I used first this extension in firefox. It's very nice.\nRight now I found this extension in Chrome app.\nI love it.\n\nbut in Chrome cannot setting anymore look like firefox add-on yet.\n\nI hope it better look like firefox add-on.", "stars": 4, "date": "Aug 13, 2012"}, {"text": "This is awesome! So easy to use and extremely handy.\nI'm looking forward to future updates!", "stars": 5, "date": "Aug 10, 2012"}, {"text": "Please please please - add an option to make the popup sticky. Right now it disappears once you move mouse away, and you can't really c&p anything from the popup or click any of the links there.", "stars": 4, "date": "Aug 6, 2012"}, {"text": "great, but i'm wondering if there will be other languages in the future (french for example)", "stars": 5, "date": "Aug 5, 2012"}, {"text": "This is amazing. But it will be easy for Japanese learner by adding Romanji feature.", "stars": 4, "date": "Aug 2, 2012"}, {"text": "works well !", "stars": 5, "date": "Aug 1, 2012"}, {"text": "Works really well. Time saver and a good learning tool.\n\nUsing Google Chrome with Mac OSX 10.7.4", "stars": 5, "date": "Jul 23, 2012"}, {"text": "DON'T WORK ON FACEBOOK? D:", "stars": 3, "date": "Jul 11, 2012"}, {"text": "I love it so much !!!", "stars": 5, "date": "Jun 26, 2012"}, {"text": "This is great to have of course, but please give us some more options with it. Like not highlighting link text..", "stars": 4, "date": "Jun 16, 2012"}, {"text": "Vocabulary database not complete enough. Some Japanese words/Expressions could not be highlighted with Rikaikun and I had to Google translate all the way long or something like that.\n\nAlso, please add the Japanese internet chattalk vocabulary database.\n\nOther than that, it's a very useful tool for learning Japanese.\n\n**Also this:It's VERY annoying whenever I'm on Niconicodouga...and there are several cases of...bugs?\n1-Why can't the title of [insert video title here] be highlighted with Rikai... Show more", "stars": 3, "date": "Jun 3, 2012"}, {"text": "I loved Rikaichan Id give it 5 Stars but I have to give 4 to Rikaikun. It is still very useful, just that I wish I can activate it by right clicking anywhere (like in Firefox). Please add that feature!! Thanks!", "stars": 4, "date": "May 29, 2012"}, {"text": "This extension has improved my kanji study greatly. It's fantastic!", "stars": 5, "date": "May 25, 2012"}, {"text": "I just activated rikaikun and scanned a web page of a Japanese political party in the Japanese language. It works! I skimmed over every Kanji on the page and it translated each word perfectly!\n\nThis is a great translation tool to use with others! \n\nGreat job!", "stars": 5, "date": "May 20, 2012"}, {"text": "This is a godsend.", "stars": 5, "date": "May 18, 2012"}, {"text": "One of the best and most useful learning tools available.  Reading and trying to improve your vocabulary in Japanese can be a rather daunting task, but with Rikaikun you can mouse over characters you might not recognize and suddenly learning and reading is alot easier.", "stars": 5, "date": "May 14, 2012"}, {"text": "Incredible usefull tool. Fast and easy to use it will save you a lot of time, all the info you need with a mouse over. Just remember the shortcuts (specially Shift to show Kanji info)", "stars": 5, "date": "Apr 22, 2012"}, {"text": "I love it. Helps me a lot with my studies, works perfectly.", "stars": 5, "date": "Mar 12, 2012"}, {"text": "Very good for learning kanji", "stars": 5, "date": "Feb 29, 2012"}, {"text": "It is really frustrating that they are ignoring our feedbacks and bug reports.", "stars": 1, "date": "Feb 29, 2012"}, {"text": "I've been using rikaikun for like.. 2 years maybe?  Loved it, but now I'm not sure if it got updated or something and it's just not working the way it used to, especially in text boxes, it's all buggy now. It's interrupting me while I'm typing and it's gotten really annoying, I have to deactivate it to be able to type properly now... please look into it :)\n\ncheers", "stars": 5, "date": "Jan 25, 2012"}, {"text": "This is a great tool for learning Kanji. I use it to understand what I am reading. It also allows for direct cut and paste by hovering over the kanji set, and pulling it over to a word document for further study. I use a self-made graph to help me with memorization. Blessed is technology. Learning kanji was much more time consuming before I started using this.\n\nJust one suggestion might be to correct the issue that sometimes it does not separate the kanji set into its elements.\n\nThank you so ... Show more", "stars": 5, "date": "Jan 17, 2012"}, {"text": "It works okay for me. I've only had it for a few minutes now and I've already tested it out on a few websites. One problem I had was when I hovered over 「．．．のミス．．．」. When I hovered の it included ミ as part of the word with it. It's obviously incorrect considering の is Hiragana and ミ is Katakana. I hope for that to be fixed soon.", "stars": 4, "date": "Jan 15, 2012"}, {"text": "Perfect! Priceless tool for japanese learning!", "stars": 5, "date": "Jan 10, 2012"}, {"text": "This is absolutely the single most useful Chrome extension available. I would not have been able to transition from Firefox without it!", "stars": 5, "date": "Dec 14, 2011"}, {"text": "it doesn't work :(((", "stars": 3, "date": "Dec 13, 2011"}, {"text": "The best extension for Japanese !", "stars": 5, "date": "Dec 13, 2011"}, {"text": "This is just perfect! All professional articles in Japanese make sense to  elementary Japanese readers like me", "stars": 5, "date": "Nov 29, 2011"}, {"text": "I stuck with a buggy firefox for years because I didn't know there was a chrome version of rikaikun. This is what made me switch to chrome as my main broswer.", "stars": 5, "date": "Nov 7, 2011"}, {"text": "A must have !", "stars": 5, "date": "Nov 2, 2011"}, {"text": "This extension is the most useful one I have ever found. Thanks for all your hard work!\n\nThere are only two wishes I have: one is for the option to auto-load on start up. I use it so much that I wish I didn't have to always manually activate it. Two is for the overlay to appear on top of videos. Frequently youtube videos or other video overlays display above the rikaikun overlay, so I can't read rikaikun.", "stars": 5, "date": "Sep 16, 2011"}, {"text": "Simply fantastic. You are a god among men.", "stars": 5, "date": "Apr 12, 2010"}]