[{"date": "Feb 16, 2024", "text": "Doesn't work anymore, stale issue.", "stars": 1}, {"date": "Jul 12, 2023", "text": "works well !", "stars": 5}, {"date": "Aug 24, 2021", "text": "I don't know is this worked or not, but thank you for making this! There's an extension that been removed from chrome web store and I must install it from github, and since I need to update it manually  I afraid that I will miss the latest update and got problem with it. Fortunately I found this extension\n(I will edit the review when i know this working or not)", "stars": 5}, {"date": "Apr 6, 2021", "text": "Used to work well prior to the new github token format. Now when you paste the new format, extension does not recognize it. Will be worth it to upgrade it.", "stars": 4}, {"date": "May 14, 2019", "text": "Very simple, but useful", "stars": 5}, {"date": "Aug 28, 2018", "text": "Have been a happy user until it started prompted for permission to read my browser history. I'm not sure why this should be a requirement and denying it causes the same permission prompt to keep appearing.\n\nI have removed it rather than give away my browser history.", "stars": 2}, {"date": "Jul 27, 2018", "text": "love it", "stars": 5}, {"date": "Jul 25, 2018", "text": "A must have for my daily work. Excellent extension. Thanks", "stars": 5}, {"date": "Jul 25, 2018", "text": "I've been a big fan of this extension for a long time and I figured I'd finally review it. I was a little bummed by the update on 2018-07-25 (version 18.7.25.917) because it changed the icon and removed the functionality that if you click on the extension icon it will take you to the GitHub Notifications page but all in all it's still extremely helpful and I'm a big fan.", "stars": 5}, {"date": "Mar 3, 2018", "text": "A very good app :)", "stars": 5}, {"date": "Jul 20, 2017", "text": "Couldn't do a day of work without it. Love it!", "stars": 5}, {"date": "Mar 31, 2017", "text": "Constantly says \"OFF\" until I visit GitHub, which defeats the point of having it.", "stars": 2}, {"date": "Sep 19, 2016", "text": "Kind of attached to it more than GitHub homepage itself.", "stars": 5}, {"date": "May 13, 2016", "text": "loving this plugin, simple and to the point :)", "stars": 5}, {"date": "Apr 25, 2016", "text": "Started using it a month ago it seems I can't work without it anymore", "stars": 5}, {"date": "Nov 11, 2015", "text": "Does what it says on the label. Nothing more, nothing less.\n\nThough I would love to have multiple github account integration (For example, one for public GitHub and the other for Enterprise GitHub)", "stars": 5}, {"date": "May 25, 2015", "text": "I got used to this extension, it is really great and the developer community is friendly too.", "stars": 5}, {"date": "Mar 14, 2014", "text": "Does exactly what it says and doesn't try to get access to all my web history, browsing, etc for something simple. Works great!", "stars": 5}, {"date": "Aug 19, 2013", "text": "I always loved this handy little tool in Opera.\n\nJust found out about Chrome's version and installed it in Opera 17. Thanks :)", "stars": 5}, {"date": "Apr 7, 2013", "text": "It doesn't display any of my notifications :<", "stars": 2}, {"date": "Oct 10, 2012", "text": "Finaly some nice and simple notifier that works. Thanks!", "stars": 5}]