[{"text": "I discovered this extension a couple of months ago, and it is amazing! It really helps me me aware of the time and stay on task. I love that it's easily accessible and you can customize the sounds, alert, and timing of the focus and break times. \nI think some small tweak and additional customizable features could improve the extension further. As others have said, I think it would be useful to be able to have the timer automatically start when you open Chrome (I often forget!). I also would l... Show more", "stars": 5, "date": "Mar 6, 2024"}, {"text": "I just found this extension today and oh how I wish I found this chrome extension sooner. It gave me the extra push I needed to get through my wall of awful (https://www.adhdessentials.com/essentials/the-wall-of-awful/). \n\nI love the features so much, starting with the variety of choice we have for the timer sound and the fact that we can have different transition sounds from the the focus sessions, to short breaks and to long breaks. One wish I have though is that for a feature to be added i... Show more", "stars": 5, "date": "Feb 25, 2024"}, {"text": "Simple, effective. The pop-ups are convenient. The source code and the data of your pomodoros over a set amount of time being exportable into multiple types of tables is just chef's kiss, all for free. It does its job and it does it excellently, that's about it.", "stars": 5, "date": "Feb 21, 2024"}, {"text": "easy and good extension", "stars": 5, "date": "Feb 17, 2024"}, {"text": "Useful and simple. Brilliant!", "stars": 5, "date": "Feb 13, 2024"}, {"text": "Love this! Very minimal. Wondering if there can be a feature to auto start the focus timers and break timers?", "stars": 4, "date": "Jan 29, 2024"}, {"text": "Its a great focus assistant!", "stars": 5, "date": "Jan 25, 2024"}, {"text": "It just works - all the functionality is logical and works as you'd expect. I haven't found a bug yet and it's definitely helping my productivity.", "stars": 5, "date": "Jan 23, 2024"}, {"text": "It's so simple, but so effective. I'm definitely more focused, and the tabbed pop-up reminders are fantastic for getting me back on track.", "stars": 5, "date": "Jan 23, 2024"}, {"text": "awesome stuff, slight request if you can add an option to put in a task you want to do whenever you pressed focus session.", "stars": 5, "date": "Jan 4, 2024"}, {"text": "wish u had an extension for Safari browser too", "stars": 4, "date": "Jan 1, 2024"}, {"text": "Best app!", "stars": 5, "date": "Dec 26, 2023"}, {"text": "Simple and precise", "stars": 5, "date": "Dec 23, 2023"}, {"text": "best", "stars": 5, "date": "Dec 21, 2023"}, {"text": "I agree with the minimalist approach you're taking with this app. But a feature where it blocks me from accessing certain websites that I know would divert my attention (a URL blacklist) and that also allows me to access certain websites that are critical to my work (a URL whitelist) would be much appreciated.", "stars": 5, "date": "Dec 16, 2023"}, {"text": "Hey thank you for this great extension. I have a small request, please let users name their pomodoro with tags since it can also help to know where have we used pomodoro in.", "stars": 4, "date": "Dec 7, 2023"}, {"text": "A suggestion of a new feature to a great simple app.\n\nCan you please add a feature so that on the extn, the user can choose time of the next pomodoro.. rather than opening the settings and changing it?", "stars": 4, "date": "Dec 4, 2023"}, {"text": "Great app, but i really feel like calculating time spent would be usefull along with how many pomodoros i did. The instance is that on a week i did some 1 hour pomodoros and some half hour ones, so i dont really know how much time i actually spent.", "stars": 4, "date": "Dec 1, 2023"}, {"text": "Awesome app, Its minimalism makes it so powerful.", "stars": 5, "date": "Nov 30, 2023"}, {"text": "I wish you would add a feature, which is that the first click on a tomato makes a sound appear, and this has a psychological dimension or psychological effect on the beginning. It is true that it is present between periods, but it is necessary in the first click, which is better.", "stars": 5, "date": "Nov 22, 2023"}, {"text": "Best pomodoro app ever", "stars": 5, "date": "Oct 31, 2023"}, {"text": "I've been using the Pomodoro technique for a few years. I have ADHD and have really hard time keeping focused unless I have a goal (like work for 25 minutes then a break). A little over a month ago I learned about the Marinara chrome extension and just wanted to try it out. I was highly impressed about how easy it was to use making doing school work more efficient. My favorite aspect of the extension is that when my time is up, a new tab with the notification pops up to alert me that my time ... Show more", "stars": 5, "date": "Oct 28, 2023"}, {"text": "best and the simplest", "stars": 5, "date": "Oct 19, 2023"}, {"text": "Great productivity tool. It is very simple but does exactly what is needed. Thank you, guys!", "stars": 5, "date": "Oct 13, 2023"}, {"text": "Great tool for time management and productivity. I have been using it as a daily tool, really helpful.\n\nWould love if you could introduce a skip break feature, because sometimes when you in the middle of a task, you do not wish to take that break and might prefer to continue the next work session without the break.", "stars": 5, "date": "Oct 9, 2023"}, {"text": "Please keep it free for lifetime , i love this extension so much 😍, it provides a good boost in productivity. And export features are just bonus . Thank you so much for all your efforts . I never ever care to review any extension but this is UNIQUE and i loved it ,\nso here's my rating :⭐⭐⭐⭐🌟 (5/5)", "stars": 5, "date": "Oct 4, 2023"}, {"text": "Nice a simple, but needs a simple graph showing how many you have done each day. The weekly distribution graph makes no sense", "stars": 3, "date": "Sep 14, 2023"}, {"text": "You know what would be nice? Something, ANYthing, explaining how youre supposed to use this thing. You know, like directions on what your product does and what you do with it. Because as far as I can tell, this thing does nothing and is absolutely pointless....", "stars": 3, "date": "Sep 9, 2023"}, {"text": "I would like suggest this to my grandmother for her to focus on sewing my pants! 10/10 Recommend", "stars": 5, "date": "Aug 25, 2023"}, {"text": "Reduced my eye fatigue and back pain a lot. One thing that bothered me is new tab notification while timer is done, but then realized it can be turned off from settings. Editing time duration is quite helpful, I set it to 30mins instead of regular 25mins. Simple, to the point, great job! 👏👍💖", "stars": 5, "date": "Aug 24, 2023"}, {"text": "It's very basic. It seems it stops working  if the screen goes in battery saving mode.", "stars": 2, "date": "Aug 22, 2023"}, {"text": "Its not there! Its just not there. added it to Chrome, just can't see it. Tried repeatedly. Maybe it doesn't show on a Linux computer.", "stars": 1, "date": "Aug 14, 2023"}, {"text": "I love the functionality and features, especially that the break times are adjustable and I actually like the white noise!\n\nMY BIGGEST WISH is that after your break it automatically starts the timer!!! Without this, I'll just keep being on break. \n\nMy second wish is that the desktop notification was customizable (where we can enter text or a photo)\n\nAlso, as others have mentioned, I wish that the cycle would start automatically once we open Chrome, or goes on automatically based on a schedule... Show more", "stars": 4, "date": "Jul 26, 2023"}, {"text": "Amazing equipment for focusing. Specially the feature of counting all progress where interface the same like commits in github. I love this. 100 pomodoros out of 100.", "stars": 5, "date": "Jul 16, 2023"}, {"text": "I am quite happy with it's functionality. \nAlso! I request you to add a count down for the short break and long break following up with disappearing of the count down tab as it ends.\nSometimes, I go back to doing my work as soon as I click on short break button because my work tab pops back.\nI would be really thankful if you made it true. 😊🙏🏻", "stars": 5, "date": "Jul 5, 2023"}, {"text": "Pleasee make an option to automatically start it, after we open chrome. This will help me to immediately focus.", "stars": 5, "date": "Jun 21, 2023"}, {"text": "brilliant", "stars": 5, "date": "Jun 15, 2023"}, {"text": "Please add shortcut", "stars": 4, "date": "Jun 7, 2023"}, {"text": "Love it! Would be great for an option to continually have the timer roll without me having to click in on each time it goes off. Not sure if there is one as I couldn't find a way to enable that.", "stars": 5, "date": "Jun 7, 2023"}, {"text": "Amazing visualisation of progress in history page! thank you so much!\nPlease save history in DB, so it's accessible from different computers, export/import not very convenient..", "stars": 5, "date": "May 19, 2023"}, {"text": "Does a great job of doing what it has to do! However, I would like for the devs to add a volume control setting for the timer sound such as the brown noise. I listen to lectures in the back ground but some times the brown noise overpowers the professors noise and if I turn up the volume, then the brown noise volume also increases. It would be an awesome feature if you guys could!", "stars": 5, "date": "May 3, 2023"}, {"text": "After 5 minutes break, the sound does not ring. How am I supposed to know my break time is over. It is a bug, not serveing my purpose, so will undownload/uninstall it from the internet. \nPlease remove your extension from web. Or keep it, its your choice", "stars": 3, "date": "Apr 29, 2023"}, {"text": "I would love the possibility to change when the daily session-counter resets, so that i can count pomodoros per study session (if i for example study between 20:00 and 02:00 with a 45/15 pomodoro, it would count 4 pomodoros to the first day and 2 pomodoros to the 2nd day). Seeing as I often study late (when it goes from one day to the next I am often in the middle of my session), this gives me difficulty tracking how much I actually studied during each day since pomodoros can carry over to th... Show more", "stars": 5, "date": "Apr 19, 2023"}, {"text": "please add start weekday to Saturday beside Monday\nalso I hope you and other teammates develop for ios and both of them integrated with each other\nthanks for your great extension", "stars": 5, "date": "Apr 13, 2023"}, {"text": "It's ok does it's job as a timer, very simple with almost no features.", "stars": 3, "date": "Apr 6, 2023"}, {"text": "Rated 4 Star because, There is so much room for improvement that can be done to the extension. I am not going to write a paragraph as you already have so many suggestions from the extension users.\n\nKindly add a timer mode, timer mode shall work once the pomodoro cycle is complete, to be more clear, i use 60 minutes pomodoro cycle for focus, there are times when i am not in a mood to take rest and want to continue focusing on completion of work, rather than taking a break. Hope you will consid... Show more", "stars": 4, "date": "Apr 6, 2023"}, {"text": "Great app. But can we have a restart cycle option? Isn't that what the notification is for to just say that cycle is over, start break or vice versa without me having to click start. At least let it be an option for us who need it.", "stars": 3, "date": "Apr 6, 2023"}, {"text": "<3<3<3 ty 4 oss", "stars": 5, "date": "Mar 23, 2023"}, {"text": "Easy to use. To the devs, can you off dark mode and also a bigger visual timer instead of a small timer on the plugin icon.", "stars": 5, "date": "Mar 16, 2023"}, {"text": "Super good but please turn the tomato icon on the bar to red. No grey tomatoes :(", "stars": 5, "date": "Mar 10, 2023"}, {"text": "really good and helpful, just put the timer and then you will feel like you have to focus during that particualr time period and even if you are accustomed to it, sooner or later you will be all good with focusing on your work. there are various of alarm tones too.", "stars": 5, "date": "Mar 7, 2023"}, {"text": "Great extension; please improve one thing\nif the user clicks on it after 5 minutes, it should directly start focus mode \n : Sometimes, I forget to click on it after a focus mode to take a break, and if I return after 20 minutes and click on it. It starts the break timer. Please add an option that if the user clicks on it after 5 minutes, it should directly start focus mode", "stars": 3, "date": "Mar 5, 2023"}, {"text": "love it. simple and light, has everything. great work!", "stars": 5, "date": "Feb 22, 2023"}, {"text": "Very useful and minimal pomodoro app. Highly recommended for students!", "stars": 5, "date": "Feb 18, 2023"}, {"text": "Very helpful, super simple, not even required to open an app. Just takes one click", "stars": 5, "date": "Feb 14, 2023"}, {"text": "Thank you so much for making one of the best pomodoro timers on the market, and making it free!! I appreciate it.", "stars": 5, "date": "Feb 12, 2023"}, {"text": "This is the best version of pomodoro I have every experienced. My favorite feature is the calendar history that give you a brief information of how well you perform. This is important to me because of the convenience in tracking your performance.\n\nThank the developers so much for making this free!", "stars": 5, "date": "Feb 8, 2023"}, {"text": "Thank you for this kind of extension! Lifesaver! I spend too much time near my PC, and this extension manages me to do breaks and does eye relaxing exercises.", "stars": 5, "date": "Feb 7, 2023"}, {"text": "Very helpful extension for productivity for me(a student).", "stars": 4, "date": "Jan 26, 2023"}, {"text": "One of the best pomodoro extensions if not the best.", "stars": 5, "date": "Jan 24, 2023"}, {"text": "Really helpful for productivity and the app works perfectly!", "stars": 5, "date": "Jan 18, 2023"}, {"text": "Love it! But...\n\nIt'll be better if it can automatically start the next focus or break session. Like Windows' focus session.", "stars": 4, "date": "Jan 10, 2023"}, {"text": "It's just awesome. It helps me to increase my productivity more than I expected.", "stars": 5, "date": "Jan 7, 2023"}, {"text": "great extension, please add the ability to backup and restore the timer settings. thanks!", "stars": 5, "date": "Jan 7, 2023"}, {"text": "Super solid. Very simple and easy to use + effective!", "stars": 5, "date": "Dec 18, 2022"}, {"text": "İt is like that i want. Very useful and very good", "stars": 5, "date": "Dec 6, 2022"}, {"text": "It's super helpful and I thank you for develop it. I have a soft feedback, that is can you develop it such that it can block (automatically block would be the best!) websites I do not want to visit during the pomodoro cycle? Youtube, facebook, twitter, and customized websites as I want them to be blocked, let's say! It would be perfect if it can be so, but the extension is already very useful!", "stars": 5, "date": "Dec 1, 2022"}, {"text": "J'adore this app. Best app for time measuring.", "stars": 5, "date": "Dec 1, 2022"}, {"text": "Great tool! Thank you devs, you guys are awesome!", "stars": 5, "date": "Nov 23, 2022"}, {"text": "Amazing extension, helped me in time management. And can know how much of the time I've utilized in the right way. One suggestion: Can add website blockers, so that we can block unwanted websites.", "stars": 5, "date": "Nov 23, 2022"}, {"text": "loved everything, I also want to applaud you guys for the great work. Only one feature I would like to have here is sync with gmail, if I am using this extension in my both work and personal laptops, I need to export and import my history each and everytime, and Chris Schmich & Contributors- I think you guys can automate this particular stuff. Lots of love to you guys for trying to make this world a better place", "stars": 5, "date": "Nov 12, 2022"}, {"text": "Great app, It's help me to get focus on my work and manage my time.", "stars": 5, "date": "Oct 27, 2022"}, {"text": "NB", "stars": 5, "date": "Oct 27, 2022"}, {"text": "Cool app, could you add sync with Iphone, to block it until this timer is done?", "stars": 1, "date": "Oct 20, 2022"}, {"text": "I heard of the Pomodoro productivity technique for a long time now.\n\nWhen I finally decided to give it a try because my productivity has been slacking lately, I stumbled upon a competitor extension, not Marinara's.\n\nThe extension was very overwhelming and I found it very off-putting tbh. I just wanted something user-friendly, simple, and straight to the point.\n\nThis is exactly what Marinara: Pomodoro Assistant offers. No BS Pomodoro Technique tool.\n\nI commend it and commend the developer.\n\nAd... Show more", "stars": 5, "date": "Oct 13, 2022"}, {"text": "We added history of tomato, it is cull! Thanks for your job!", "stars": 5, "date": "Oct 11, 2022"}, {"text": "Simple and easy to use. Just enough features to be smart without being bloated", "stars": 5, "date": "Oct 7, 2022"}, {"text": "will give another star when these guys will allow me to sync", "stars": 4, "date": "Sep 30, 2022"}, {"text": "Been using this for a while now. I just wish there'd be a possibility to connect this to our discord accounts so it would show in our status when we're in the middle of a pomodoro session.", "stars": 5, "date": "Sep 21, 2022"}, {"text": "best extension", "stars": 5, "date": "Sep 19, 2022"}, {"text": "I love it, but why you don't sync data between different devices?", "stars": 5, "date": "Sep 15, 2022"}, {"text": "love this extension!", "stars": 5, "date": "Aug 11, 2022"}, {"text": "Great extension! Ideally, allow the user to control the volume for the timer sound.", "stars": 5, "date": "Aug 9, 2022"}, {"text": "Wow incredible app", "stars": 5, "date": "Aug 9, 2022"}, {"text": "the best extension ever", "stars": 5, "date": "Aug 7, 2022"}, {"text": "Great app for better health.", "stars": 5, "date": "Aug 6, 2022"}, {"text": "Been using it for years. Works great for counting work sessions", "stars": 5, "date": "Aug 3, 2022"}, {"text": "Very usefull. Love it", "stars": 5, "date": "Jul 30, 2022"}, {"text": "Super cool feature for finding the flow while studying! Clear recommendation! :)", "stars": 5, "date": "Jul 30, 2022"}, {"text": "Simple and Effective\nThis extension has helped me manage my time well, whether I am in the flow or on days when I find it difficult to keep my productive pace. This extension allows you to adjust / program the duration and frequency of your work stints and your short and long breaks. This extension and I are friends -- it is a guide that allows me to work comfortably and push my productivity, instead of being a strict timekeeper that turns me into an automaton. Love this Pomodoro extension.", "stars": 5, "date": "Jul 29, 2022"}, {"text": "Honestly best one so far, I really love how customizable is and how you can put different alarm sounds and even ambient sound, I would love if there was a way to control de volume for the ambient sound when concentrating tho, STILL it's sooo gooood!!!!", "stars": 5, "date": "Jul 26, 2022"}, {"text": "I really like this app, please can you update it so you can skip a break or focus time for example? Eg if you take a phone call you cant then reset a timer.", "stars": 4, "date": "Jul 26, 2022"}, {"text": "Good!", "stars": 5, "date": "Jul 23, 2022"}, {"text": "Love this extension! This has helped me a ton with productivity.", "stars": 5, "date": "Jul 19, 2022"}, {"text": "Magnificent, is exactly what I want in a pomodoro timer, easy-to-use, non-obtrusive.", "stars": 5, "date": "Jul 19, 2022"}, {"text": "the best", "stars": 5, "date": "Jul 19, 2022"}, {"text": "Great and very useful extension. Just a suggestion. Maybe it will be more useful to be able to set up a \"Start sound\" instead a \"Complete sound\". When focus time is completed, same sound is played even if next is a short or long break. By the other side, when a break is complete, you can define 2 different sound (short and long break), when the meaning is the same, that is \"go back to focus\". If it was possible define a \"When start\" sound instead of \"When complete\" sound, when the action is c... Show more", "stars": 5, "date": "Jul 17, 2022"}, {"text": "Awesome and very useful. Thank a lot for the great product.", "stars": 5, "date": "Jul 13, 2022"}, {"text": "This is the best pomodoro timer that there is!\nAnd they have a feature to extract your data...! *chefs kiss*", "stars": 5, "date": "Jul 7, 2022"}, {"text": "Please add option to adjust clocks sound volume", "stars": 5, "date": "Jul 7, 2022"}, {"text": "sometimes, I don't want to use the rest time period. But now it's at least 1 min.\nI just want to bypass it, not reminding me. Is there a way or the developer can make a customization option for me to do what I like to use.", "stars": 4, "date": "Jul 6, 2022"}, {"text": "I would like to see total hours of work/break as well", "stars": 4, "date": "Jun 27, 2022"}, {"text": "Please add a feature to still count pomodoros even if you take a break in between. Karma, man", "stars": 3, "date": "Jun 22, 2022"}, {"text": "Usually I don't write reviews but I like this app. This is wonderful Extension but, IT WOULD BE GREAT IF YOU ALSO SHOW BREAKS TAKEN ALSO with productive sessions, it would be wonderful.", "stars": 4, "date": "Jun 19, 2022"}, {"text": "Super. I like statistic view", "stars": 5, "date": "Jun 8, 2022"}, {"text": "Please add login with google id so i can access by stats from another system.", "stars": 5, "date": "Jun 2, 2022"}, {"text": "It is wonderful but I think sounds are a bit loud. I wish there was a setting for volume.", "stars": 5, "date": "May 22, 2022"}, {"text": "very good", "stars": 4, "date": "May 19, 2022"}, {"text": "Superb extension and very useful.\n\nWhen we start the timer( or end), can we get an option to write a short note what are we working on. \n\nThe benefit of that could be further commitment to focus on that one thing and keep a record on what you have worked on during the day/week", "stars": 5, "date": "May 17, 2022"}, {"text": "Thanx for the app you are legend", "stars": 5, "date": "May 8, 2022"}, {"text": "I love this extension. It's made studying much easier, allowing me to focus on the task at hand, without needing to think about taking breaks or burning out. It's simple to use and the fact that you can keep track of your history is a nice feature.", "stars": 5, "date": "May 7, 2022"}, {"text": "Best one so far. Quick and easy. Would just want to set up different types of tasks with different durations", "stars": 5, "date": "May 7, 2022"}, {"text": "Cool app. Awesome d*ck.", "stars": 5, "date": "May 6, 2022"}, {"text": "This is an awesome pomodoro time tracker with extreme simplicity, all for free. I'm giving it a 4 star just to tell the developer that everything in this extension is super cool except the report UI. Kindly upgrade the report UI to a better form something like use of a pie chart or a line graph or both along with the existing UI - the bar graph. Anyways thank you so much and keep growing! Wish you all the very best 🤗👍🏼", "stars": 4, "date": "May 2, 2022"}, {"text": "Love the simplicity! Keep up the good work. 🍅", "stars": 5, "date": "Apr 28, 2022"}, {"text": "Wonderful extension, very easy to use and the design is beautiful!", "stars": 5, "date": "Apr 27, 2022"}, {"text": "Best pomodoro extension out there! ❤️🙏", "stars": 5, "date": "Apr 21, 2022"}, {"text": "very useful", "stars": 5, "date": "Apr 20, 2022"}, {"text": "I personally do like it however it would be nice to have a feature that blocks websites. Sometimes you can't help but click on youtube when you should be studying, so website blockers are very useful in those situations", "stars": 4, "date": "Apr 19, 2022"}, {"text": "Too early for me to rate the app/extension. I didn't want to give a high rating before I use it for a month.\n\nOne thing I thought would help me is being able to specify a color to the extension icon. For me it appears a black/white blob and given other extensions it is difficult for me to locate this one.", "stars": 1, "date": "Apr 11, 2022"}, {"text": "Absolutely love this app!  Complete game changer for me. Thank you!", "stars": 5, "date": "Apr 2, 2022"}, {"text": "I like it very much. Simple, nice design, having every required option in preferences.", "stars": 5, "date": "Apr 2, 2022"}, {"text": "I just love this extension,\nThough i found it little late but this is helping me to focus 🧘 with the background sound 🎧", "stars": 5, "date": "Mar 31, 2022"}, {"text": "I really like it! But I wish it would show time in minutes/hours", "stars": 4, "date": "Mar 28, 2022"}, {"text": "Love this plugin. I use it everyday.", "stars": 5, "date": "Mar 28, 2022"}, {"text": "I love the simplicity of this extension and would love something this simple as a phone app. All of the pomodoro phone apps have too many features for me. I appreciate just having it say when to take 5 min vs 15 min breaks without cross referencing a ton of other task parameters (which distracts me into rabbit holes setting things up and constantly tweaking them).", "stars": 5, "date": "Mar 26, 2022"}, {"text": "ABSOLUTELY GREAT!!!!", "stars": 5, "date": "Mar 17, 2022"}, {"text": "I really like this pomodoro extension. It works really well. Though its too septic. I would have liked to have at least 3 different pomodoro profiles that I could customize and switch though them rather than having to go though settings to change the time for every different length session. Even with this short comming, I think its a great extension.", "stars": 4, "date": "Mar 14, 2022"}, {"text": "Love this! It's very simple to use and straightforward. No extra features or anything that you end up wasting time on. It's a timer, and it times you. It does what it says it does. The webpage is also very simple (in a good way) and has a  pleasant, minimalistic design. I feel like a lot of productivity extensions have a lot of extra features like creating to-do lists and projects and making an account, but for someone like me who does all of that stuff on a planner, I just needed a timer. Wh... Show more", "stars": 4, "date": "Mar 12, 2022"}, {"text": "it would be nice to see duration in actual time as well. good app though! I just wish the 'history' section was a little bit more comprehensive.", "stars": 4, "date": "Mar 8, 2022"}, {"text": "Great Extension", "stars": 5, "date": "Mar 4, 2022"}, {"text": "more tasks such as: study (use 25', rest 5'), others (use 50', rest 15')", "stars": 4, "date": "Feb 27, 2022"}, {"text": "just the meaning of perfect, congrats!", "stars": 5, "date": "Feb 20, 2022"}, {"text": "love this extension - really helps me deal with my procrastination and curb work related anxieties. I've never felt more productive and on track with my studying!", "stars": 5, "date": "Feb 20, 2022"}, {"text": "Really liked the simplicity of the app, the only thing that I'm afraid is to lose my data. It would be great to have sign-in account and using the extension across multiple devices rather than locally stored.", "stars": 4, "date": "Feb 16, 2022"}, {"text": "It would be nice if you could add sounds like ocean waves sounds, forest firecamp, nature sounds for focusing. Please rest of all the Extension is perfect. only 3 noise sounds are not enough", "stars": 5, "date": "Feb 16, 2022"}, {"text": "amazing for productivity and studying for med school! Thank you!\nJust one request: if we could have a customizable setting to start the day at a certain time, that would be great. I often study past midnight but I would like that block to be counted toward the previous day. So, I would want to set the start day time at around 4 or 5am.", "stars": 5, "date": "Feb 9, 2022"}, {"text": "Very nice and useful extension", "stars": 5, "date": "Feb 2, 2022"}, {"text": "just wow!", "stars": 5, "date": "Feb 1, 2022"}, {"text": "Amazing!!! Helps with my procrastination a lot!", "stars": 5, "date": "Feb 1, 2022"}, {"text": "This is exactly what a Pomodoro Timer should be like. Simple and easy to customize without any distracting frills.", "stars": 5, "date": "Jan 29, 2022"}, {"text": "I've tried a whole lot. This is by far, my favourite.\nI use it for both school and work. \n+ seeing it up in Chrome and the thing ticking down\n+ adjusting long break time (I want 25 minutes, not 15)\n+ changing to different sounds when it's time for a break, or when break is done\n+ easily re-start a pomodoro if you want to skip the break\n+ just press the little tomato in the chrome bar to pause (many lack this, but I do need to go to the little mens room ASAP sometimes)\n\nI prefer this over my p... Show more", "stars": 5, "date": "Jan 28, 2022"}, {"text": "Great extension. Would love a dark mode.", "stars": 5, "date": "Jan 26, 2022"}, {"text": "Really nice tool. The code on github looks great and the tool itself is well designed and pleasurable to use.\nThanks a lot for your work.", "stars": 5, "date": "Jan 19, 2022"}, {"text": "Prefect to worktime - pause organization", "stars": 5, "date": "Jan 13, 2022"}, {"text": "Highly recommended. Simple and glitch free. Works like a charm, the way it is intended to. I use it everyday to help me to notice the passage of time, without making me too conscious of it.", "stars": 5, "date": "Jan 13, 2022"}, {"text": "I really love this extension. I'd love if it has a feature to sync the Pomodoro process across devices since I usually switch between my laptop and desktop to work.", "stars": 5, "date": "Jan 13, 2022"}, {"text": "I totally love this extension. but i have a suggestion for you and that is pls add a part to see focus time in hour not pomodoros.", "stars": 5, "date": "Jan 11, 2022"}, {"text": "This extension is very useful but can you develop more feature :\nif user use some specific website => timer will pause automatically.\nor if user open specific website => timer will start autumatically", "stars": 5, "date": "Jan 7, 2022"}, {"text": "THANK YOU SO MUCH! I easily get distracted with my surroundings and this tool tremendously helped me stay on track when working and keeping me focused. The 25-min working timeframe is shorter for me so I adjusted it to 50-min which is absolutely really helpful. Thank you again so much! :)", "stars": 5, "date": "Jan 5, 2022"}, {"text": "loved the extension👌👌👌👌", "stars": 5, "date": "Dec 31, 2021"}, {"text": "Would love for the Pomodoro History section of the app to have an option to view older dates.", "stars": 4, "date": "Dec 29, 2021"}, {"text": "All killer, no filler.  Easy to use, and I absolutely love the statistics it captures to allow me to review the days and times I'm most productive.  I can't think of any reason someone shouldn't use this to make themselves more productive.  I wish I could give it six stars, but 5 is the max.", "stars": 5, "date": "Dec 22, 2021"}, {"text": "Simple yet fully functional.", "stars": 5, "date": "Dec 21, 2021"}, {"text": "All you need and nothing more -- excellent!", "stars": 5, "date": "Dec 20, 2021"}, {"text": "This is exactly what I needed!  Easy and to the point.  This will for sure help me stay focused and keep doing what I need to do until the alarm goes off.   Thank you SO much!", "stars": 5, "date": "Dec 17, 2021"}, {"text": "I see no one has mentioned one quirk, that you cannot view in the history how many pomos one has one a particular day; it just registers an averge for that day of the week. Perhaps I overlooked something.", "stars": 4, "date": "Dec 16, 2021"}, {"text": "Super cool plugin!!! Light and useful", "stars": 5, "date": "Nov 27, 2021"}, {"text": "What a good idea! It make me take a break to recharge myself.", "stars": 5, "date": "Nov 23, 2021"}, {"text": "I would like to see the data on how many hours of learning I have done so far.", "stars": 4, "date": "Nov 22, 2021"}, {"text": "Thank You ! :-)", "stars": 5, "date": "Nov 22, 2021"}, {"text": "This is an excellent lightweight app ... functional and relevant. for those who want to practice pomodoro technique of prducitivity, look no further!!", "stars": 5, "date": "Nov 20, 2021"}, {"text": "Hi, I would love to have different categories such as: lessons, to-do, software ...  and it would be lovely if you add subfolders: math, english, pyshics, python, js and C ... if you add these features I would really appreciate  to you. Thanks for your time and making this extension free for us. Have a nice day.", "stars": 4, "date": "Nov 19, 2021"}, {"text": "I'd like to see in some fashion a dark or more eye-friendly mode because when I use it at my study sessions in the evening, it simply blows my eyes with a suddenly white screen. Otherwise, it is a very very useful plugin and I achieved a lot with this! If you make a darker version (maybe switchable, meaning bright/dark mode) then I will be willing to donate some money to you guys. Thank you!", "stars": 4, "date": "Nov 18, 2021"}, {"text": "Awesome: easy to use, open source, and not intrusive (privacy and permissions wise). Thanks", "stars": 5, "date": "Nov 16, 2021"}, {"text": "Awesome!! if it has A tab where I can watch time that could be fabelous like focus to do extension \nIs the only thing that he miss otherwise everything is great!!!!", "stars": 5, "date": "Nov 13, 2021"}, {"text": "I really like this app, it's very useful for me to keep focus on what I'm working on. Currently use it to do writing sprints for NaNoWriMo.", "stars": 5, "date": "Nov 11, 2021"}, {"text": "Great extension. Simple, clean. Would love to see a volume feature.", "stars": 4, "date": "Nov 8, 2021"}, {"text": "Love this extension! Helps me with my workflow and remembering to take breaks! Super simple and easy to use. Great for us NDs who struggle with hyper-focus or no focus at all. :)", "stars": 5, "date": "Nov 4, 2021"}, {"text": "I love this extension. Is very useful to organize the time. Is very simple to use.", "stars": 5, "date": "Nov 4, 2021"}, {"text": "This extension is awesome! keep up the good work guys! I think it'd be great to modify after how many pomodoros we're gonna have a long break. Like for me I set the 25min to 28min and would like to have a long break after 3 pomodoros. \nThanks!", "stars": 5, "date": "Oct 27, 2021"}, {"text": "I really like it! I just wish there was a way I could reset the timer. It's telling me to take a long break when I'm just starting my day. \n\nI'm not sure if I'm missing something, but it keeps going in the cycle of four pomodoro's and then a long break, but yesterday I only did three, then today I did one and now it wants me to take a long break that I don't need.", "stars": 4, "date": "Oct 27, 2021"}, {"text": "Great extension! I love it very much and always recommend it to my friends. But there are a couple of things that can do this better:\n1. Configurable start of the week. Sometimes I work on Sunday, but I want to include this time in the previous week. In my country, the week starts on Monday.\n2. Configurable time of the day start. I often work at night, and I want to include this night time in the previous working day.\nThanks a lot!", "stars": 5, "date": "Oct 25, 2021"}, {"text": "i think you may add a feature that blcoks some sites which are set by users in case that they can’t help to see through when focusing!", "stars": 5, "date": "Oct 12, 2021"}, {"text": "A complete pomodoro timer experience packed in a single free extension.", "stars": 5, "date": "Oct 5, 2021"}, {"text": "Good extension", "stars": 5, "date": "Oct 4, 2021"}, {"text": "Suggestion: Please add a feature where the extension reminds you when you're closing the browser and a timer is running, sometimes I just close off the browser and forget that.", "stars": 4, "date": "Oct 4, 2021"}, {"text": "i like it so far!", "stars": 5, "date": "Oct 3, 2021"}, {"text": "i like it so far!", "stars": 5, "date": "Oct 3, 2021"}, {"text": "This extension is awesome", "stars": 5, "date": "Oct 3, 2021"}, {"text": "This is the best pomodoro timer I have ever used. It's not intrusive. I don't have to go to a separate app/window to see it and it's super easy to start the timer. The numbers don't draw my attention towards them. It tells me just enough about my statistics. I love the sounds it comes with, better than ocean and cafe sounds. The wristwatch sound really helps me to stay focused. I have been struggling to stay focused and this timer has helped so much!", "stars": 5, "date": "Oct 1, 2021"}, {"text": "Very good, it would be better if there was a sync feature like Anki", "stars": 5, "date": "Sep 30, 2021"}, {"text": "Been using it for many years now. The best Pomodoro extension out there.", "stars": 5, "date": "Sep 27, 2021"}, {"text": "As I build a freelance practice, I'm having to learn from scratch how to manage my time and FEEL productive instead of permanently overwhelmed. Honestly just started using this today (used to use something else) and the timer features and ability to track my time are... incredible. I think this is a game changer for me. Thank you!!!", "stars": 5, "date": "Sep 24, 2021"}, {"text": "Perfect!", "stars": 5, "date": "Sep 23, 2021"}, {"text": "Great extension I have used it for many hours. Is there a possibility of exporting this to Microsoft Edge as it is my preferred browser?", "stars": 5, "date": "Sep 4, 2021"}, {"text": "Thanks, It's really very very helpful in my studies , my usmle exam is in 4 months and my biggest prob was focus . One thing, can u please add a feature that ring continue ringing unless we stop it ... coz sometimes at break, i go out and the next cycle ring just pop out once when i come back, it's already 5 6 minutes late... Overall , this app is no match , if this extra feature is added it would be very helpful. Thanks again for your efforts ........", "stars": 5, "date": "Sep 1, 2021"}, {"text": "This extension is awesome. I love how simple and easy it is to use. I hope to be able to make software as beneficial as this one day.", "stars": 5, "date": "Aug 31, 2021"}, {"text": "I loved this app. It would be a nice feature if we could create an account and log in in different devices, having my access to my history everywhere!\n\n\nThanks guys!", "stars": 5, "date": "Aug 30, 2021"}, {"text": "Love the app. The thing I would like to see is presets with different settings. Like so for example I can have one preset for learning and one for programming. Right now I have to change multiple options every time I want to change what I'm doing at the moment. With presets I could do this with one click.", "stars": 5, "date": "Aug 23, 2021"}, {"text": "Great extension!  Simple. Effective.  The *only* think that might make it better is the ability to control the volume of the background sounds.  It's really a great.", "stars": 5, "date": "Aug 19, 2021"}, {"text": "tks for app", "stars": 5, "date": "Aug 18, 2021"}, {"text": "really helpfull", "stars": 5, "date": "Aug 16, 2021"}, {"text": "This is wonderful. I've been using it to study. Would be nice if there's a Thunderstorm or Fireplace effect for timer sound since i listen to them whilst focusing. The brown noise effect and bpm sounds make me anxious and i get headache afterwards", "stars": 5, "date": "Aug 12, 2021"}, {"text": "Great", "stars": 5, "date": "Aug 3, 2021"}, {"text": "This extension is simply a banger, thank you guys, however I would love to have the app on windows, so as to use it without opening chrome", "stars": 5, "date": "Aug 2, 2021"}, {"text": "I love it ! Absolutely cool extension, it's really useful. \nThis Pomodoro has user-friendly UI like github, Special thanks for this.", "stars": 5, "date": "Jul 31, 2021"}, {"text": "Good extension. Would love to see a desktop, standalone version.", "stars": 5, "date": "Jul 26, 2021"}, {"text": "I hope more functions can be added\n1.Customizable task with hourly statistics（for example, Sectoral Statistical Chart)\n2.Customizable time sound", "stars": 4, "date": "Jul 25, 2021"}, {"text": "Best Pomodoro app! This gets installed on all my workstations.", "stars": 5, "date": "Jul 21, 2021"}, {"text": "The best pomodoro app I've ever used, fast, flexible, easy to use and lots of reports.", "stars": 5, "date": "Jul 15, 2021"}, {"text": "One of the best extensions of Google chrome. A recommended one for persons who want to finish their tasks on time.", "stars": 5, "date": "Jul 12, 2021"}, {"text": "Love that! It's really helpful to schedule my day and to see how I worked till now.", "stars": 5, "date": "Jul 9, 2021"}, {"text": "Simple. I love it.", "stars": 5, "date": "Jul 4, 2021"}, {"text": "I really liked the extension. It really helps you with all the fundamental functionalities required for productivity using Pomodoro technique.", "stars": 4, "date": "Jul 1, 2021"}, {"text": "simple and perfect", "stars": 5, "date": "Jun 28, 2021"}, {"text": "Loved the app, exactly what I've been looking for. Really handy and minimalistic app to enhance my productivity!", "stars": 5, "date": "Jun 24, 2021"}, {"text": "I loved it, I used app in my phone, just I saw in at chrome store for try and is absolutely what I need that most better than mobile app.", "stars": 5, "date": "Jun 23, 2021"}, {"text": "a mute option on context menu or volume option will be nice", "stars": 4, "date": "Jun 21, 2021"}, {"text": "Don't you love apps that just work? Easy to use but customisable if you need it. Love the history function. :-)", "stars": 5, "date": "Jun 21, 2021"}, {"text": "Great job!  Still works great in 2021.", "stars": 5, "date": "Jun 16, 2021"}, {"text": "Simple great app for manage our time, thanks guys!", "stars": 5, "date": "Jun 15, 2021"}, {"text": "EXcellent", "stars": 5, "date": "Jun 12, 2021"}, {"text": "I never write reviews for anything, but this extension is so simple, intuitive and effective that I have to thank the creator.", "stars": 5, "date": "Jun 12, 2021"}, {"text": "THIS IS SO GREAT extension omg, i love the way they track my pomodoro LOVE YOU MARINARA <3", "stars": 5, "date": "Jun 11, 2021"}, {"text": "Love this extension! Would you consider a way to add tasks to each Pomodoro focus period? Focus To Do does this but I prefer the Marinara user experience", "stars": 5, "date": "Jun 10, 2021"}, {"text": "I just started using this extension and I liked how it allowed me to personalize the time and sounds. I just wish it would have an option where the end of a focus time/session would automatically trigger the start of the break time/session so that I don't have to keep going back and forth in different tabs.", "stars": 4, "date": "Jun 9, 2021"}, {"text": "I like the app but wish I could turn up the volume of the bell. I find it's far too quiet and just disappears into my music", "stars": 4, "date": "Jun 8, 2021"}, {"text": "Would like to see a dark mode so my eyes aren't blasted with white light when the timer runs out :)", "stars": 5, "date": "Jun 4, 2021"}, {"text": "OMG! This is one of the best extensions I've come across: simple, effective, extraordinarily well thought out...and just fun to use. The Pomodoro stuff works as expected, but try it out just for the sounds! (In Options, Timer sounds include from very subtle (wristwatch) to the outrageously un-ignorable (try Antique Clock or Wood Block), the \"time to get back to work after a short break\" sounds go from Pin Drop to Ship Bells and beyond, and the \"get back to work after a long break\" sounds go f... Show more", "stars": 5, "date": "Jun 3, 2021"}, {"text": "I really like this especially with its performance/data feature. Hoping that you can block specific websites when the pomodoro timer starts", "stars": 4, "date": "May 31, 2021"}, {"text": "This is an outstanding chrome extension and really motivating to get focused and start getting things done. I really appreciate the tracker in the \"view history\" where I can see the metrics of when I'm most productive on a daily basis, and which days I'm more productive. Please keep updating this extension! Thank you!", "stars": 5, "date": "May 30, 2021"}, {"text": "I love this it's so helpful. \n1 suggestion: can we have multiple sets of different timeframes like 25/5, 45/15, 50/10, etc. for various purposes? \nChecking email often takes less focus time like 15-20 minutes each\nWhile writing an essay or designing a project usually takes a flow of 40-60 minutes. \nPlease consider it. \nThank you so much.", "stars": 5, "date": "May 29, 2021"}, {"text": "Best extension for productivity.", "stars": 5, "date": "May 28, 2021"}, {"text": "it's very good, but it would be nice to have the option to set the timer to start automatically.", "stars": 4, "date": "May 28, 2021"}, {"text": "Can we modify the sound level?", "stars": 5, "date": "May 27, 2021"}, {"text": "great extension, totally recommend ! definitely helped me manage my time a bit better. thank you for making this !!", "stars": 5, "date": "May 25, 2021"}, {"text": "God I love this app! So helpful. You guys should start a Patreon.", "stars": 5, "date": "May 23, 2021"}, {"text": "Amazing", "stars": 5, "date": "May 22, 2021"}, {"text": "Brilliant Extension.!! It helped me to streamline the study hours.\nThank you Chris and Team.", "stars": 5, "date": "May 10, 2021"}, {"text": "can we have fireplace sound for Timer Sound? please please please", "stars": 5, "date": "May 4, 2021"}, {"text": "I like this extension but I would love if it has an option to block distracting sites.", "stars": 5, "date": "Apr 30, 2021"}, {"text": "Finally what I've been looking for after trying a couple different apps. \n\nThanks and good luck.", "stars": 5, "date": "Apr 29, 2021"}, {"text": "Love how simple it is, and don't mind the little edge cases.\nWould just ask to collect the feedback of what I've done by the end of each pomodoro.", "stars": 5, "date": "Apr 28, 2021"}, {"text": "This is getting me through university - seriously. I love it. thank you.", "stars": 5, "date": "Apr 28, 2021"}, {"text": "Absolutely perfect.  Does everything I need in a pomodoro timer!", "stars": 5, "date": "Apr 21, 2021"}, {"text": "Awesome! realing helping me to distract here when I need to focus? would you mind on the sound adding some raining sound ?", "stars": 5, "date": "Apr 19, 2021"}, {"text": "this extension is amazing! due to the increasing problems and privacy concerns with google chrome, i wont be using chrome anymore. since this is only on chrome, i was wondering if you could create an addon on firefox? thank you anyway! i loved using this extension <3", "stars": 5, "date": "Apr 14, 2021"}, {"text": "This is by far one of the best Pomodoro timers I have ever used. It's minimalistic and it allows you to see your stats for the month and week if you want. It was interesting to find out that my most productive days are on Tuesdays and Saturdays between 1pm and 2pm. It's also very easy to use; just click on the tomato in your browser and you're ready to go!", "stars": 5, "date": "Apr 10, 2021"}, {"text": "Very good as is, I'd suggest an option to add \"x, 5 or 10\" minutes to a concentration period.", "stars": 4, "date": "Apr 9, 2021"}, {"text": "Good extension. The recommendation I'd give is to also show the seconds in the timer. I have a physical timer and also this extension and find myself more drawn to the physical one because it shows me the seconds as well.", "stars": 4, "date": "Apr 7, 2021"}, {"text": "Great extensions. \nOne suggestion. When the pomodoro ends, next to the button to start the break please add a button that allows to start a new pomodoro.\nIt's helpful to stay in the zone.", "stars": 5, "date": "Apr 6, 2021"}, {"text": "Pretty good pomodoro extension.", "stars": 5, "date": "Mar 30, 2021"}, {"text": "Almost perfect, it would be cool if you could recover the time from before you turn off the pc, if you don't finish the pomodoro and you are 10 mins short of finishing it, when you turn it off and turn on pc again you lost your 15 minutes :(,else, the extension is perfect and beaitufl", "stars": 5, "date": "Mar 24, 2021"}, {"text": "Generally this extension is good, just one minor issue: the alarm sound volume is too low. Sometimes I cannot hear it as I often play loud music.", "stars": 4, "date": "Mar 24, 2021"}, {"text": "This is my first time ever writing a review for a Chrome extension but I just had to because it's amazing! Such a simple extension, and yet makes me much more productive than without it. I love how simple the settings are as well in terms of being able to set custom lengths for the focus periods, short breaks, and long breaks. Best extension I've ever used!", "stars": 5, "date": "Mar 22, 2021"}, {"text": "Simple, effective and does exactly what I need it to do! One of my top 5 productivity tools!!!", "stars": 5, "date": "Mar 20, 2021"}, {"text": "Thanks for developing an simple, but elegant extension. It has helped me to start practicing Pomodoro, and to improve my productivity and attention span.\n\nInteresting features: \n+ Daily Distribution shows # of pomos for different granularity (say every hour, every 2 hours, etc)\n+ \"Pomodoros in last 9 months\" gives a glance of productivity for last 9 months.\n+ Weekly Distribution shows which day is more productive\n+ CSV Export\n\nRequest for additional features:\n1) Apart from showing # of Pomodo... Show more", "stars": 5, "date": "Mar 19, 2021"}, {"text": "Literally the best extension out there! Very customizable, options for sounds, rings, and tabs. For the first time ever basically, I actually like an extension⭐⭐⭐⭐⭐\nThanks!", "stars": 5, "date": "Mar 4, 2021"}, {"text": "An excellent app overall. one nitpick, i would like an option to prevent the number of minutes remaining from displaying. not enough to cost the fifth star though!", "stars": 5, "date": "Mar 3, 2021"}, {"text": "AMAZING!!!!!", "stars": 5, "date": "Feb 28, 2021"}, {"text": "The product is good but it should have one extra feature to add a title of work like reminder for some work and to set notification time.", "stars": 4, "date": "Feb 28, 2021"}, {"text": "Love the pink noise background. Thanks.", "stars": 5, "date": "Feb 25, 2021"}, {"text": "DELICIOUS", "stars": 5, "date": "Feb 24, 2021"}, {"text": "Simple and good.", "stars": 5, "date": "Feb 19, 2021"}, {"text": "This in my opinion one of the best out there. I love how it's so simple and easy to use.\nI have a suggestion to maybe add syncing, where you can sync the extension on multiple devices? Otherwise, it's great.", "stars": 5, "date": "Feb 19, 2021"}, {"text": "nice! maybe I don't know how to use it properly but I'd like to suggest something to further simplify its operation: \n\nI just want a beep INFORMING the transition between break or focus sessions. No clicking any buttons, just a non-blocking notification (a beep or something flashing briefly, nothing that disrupts more than this).\n\nIt could be a settings toggle \"non-blocking mode\". Maybe it's doable to patch a work-around on source file background/Observers.js lines:\n\n197: await this.notificat... Show more", "stars": 4, "date": "Feb 18, 2021"}, {"text": "just what I was looking for in a timer. has the most important features and easy to use. thanks!", "stars": 5, "date": "Feb 10, 2021"}, {"text": "I love this timer! It is easy to use and very simple! I love that it tracks the history of your pomos great job guys!", "stars": 5, "date": "Feb 8, 2021"}, {"text": "One of the best Chrome extensions for productivity, Kudos to developer !!", "stars": 5, "date": "Feb 7, 2021"}, {"text": "Great extension, has helped a lot with my productivity. However, I'd really appreciate if there would be a way to edit the Pomodoro history so if I start a session at 11:35pm and finish at 12am I can make it count for the previous night instead of the next day", "stars": 5, "date": "Feb 7, 2021"}, {"text": "It is very greate and useable.God Bless YAA guys", "stars": 5, "date": "Feb 5, 2021"}, {"text": "Great extension. Just one minor suggestion: allow users to upload our preferred notification tone. Thanks!", "stars": 5, "date": "Feb 5, 2021"}, {"text": "I just got this extension today and I already love it! It's a lot better then having an extra tab open to start a Pomodoro Timer on YouTube. The features are amazing and I'm overall really loving this! :)", "stars": 5, "date": "Jan 30, 2021"}, {"text": "amazing. simply amazing", "stars": 5, "date": "Jan 28, 2021"}, {"text": "Morning, thank you for this extension, it's definitely making a difference to my productivity. I would just like to add, one thing that is bothering me is that I cannot reset the timer for the start of a new day. So, today I'm starting with 1 pomodoro away from a long break. Is there any way that I can reset or circumvent this? It's driving me a little crazy.", "stars": 4, "date": "Jan 28, 2021"}, {"text": "FEATURE_REQUEST:\nA lot of times we are lost in the internet while surfing...from one YouTube video to another, from one blog to another...and we forget the goal of the Pomodoro session. \nWouldn't it be nice if as a user, I would be able to set goals for the specific Pomodoro Session? I would love if you guys can include this feature. \nThe user should be able to write goals of a particular session, and that goal (3-4 word goal) should float on the screen at a corner; the entire time (irrespect... Show more", "stars": 5, "date": "Jan 27, 2021"}, {"text": "Easily 5 stars, definitely recommend this to anyone who values their time and productivity! Best feature is the white/pink/white noise feature during focus time.", "stars": 5, "date": "Jan 26, 2021"}, {"text": "It's great.  Only ask would be to add a seconds display on where the timer is in the chrome bar.", "stars": 5, "date": "Jan 25, 2021"}, {"text": "Simply beautiful <3", "stars": 5, "date": "Jan 23, 2021"}, {"text": "Easy to use and user-friendly application. Thanks to the authors and developers.", "stars": 5, "date": "Jan 21, 2021"}, {"text": "I enjoy using this extension a lot and I've been using it for a few years now, the only slightly annoying detail about it is that the icon in the top bar has a very small white horizontal line on top, which can be seen when you use a dark theme and is kinda annoying once you notice it.", "stars": 5, "date": "Jan 19, 2021"}, {"text": "dark mode", "stars": 4, "date": "Jan 15, 2021"}, {"text": "I love all the unique options and simple clean interface!\nVery cute!", "stars": 5, "date": "Jan 5, 2021"}, {"text": "I love this extension!  For future versions, would it be possible to include settings which would store different Pomodoros.  Sometimes I like to use one time period when I'm casually browsing and doing housework, other times I like to use another when for other activities.", "stars": 5, "date": "Jan 3, 2021"}, {"text": "EMMANUEL", "stars": 5, "date": "Dec 23, 2020"}, {"text": "its very help full for student like me  thank's for the person who invented this app", "stars": 5, "date": "Dec 22, 2020"}, {"text": "Perfect extension, simple and elegant. Would be great if there was an option to schedule and block websites.10/10", "stars": 5, "date": "Dec 17, 2020"}, {"text": "I was looking for a minimalist pomodoro timer for a very long time, and I am so glad I found this extension. Don't get me wrong, I have tried a lot of pomodoro timers but I can't seem to use them effectively. This though is different. I don't know why but I seem to be more productive, and I love that I can see my history. Overall great extension. It's simple yet very effective.", "stars": 5, "date": "Dec 15, 2020"}, {"text": "Love the features and sounds it comes with ! Only problem is that there is no volume settings to adjust the sound of just for the extension! \nI like having the white noise on, while I watch my lectures but it's too loud together.", "stars": 4, "date": "Dec 12, 2020"}, {"text": "You should add block sites while focusing like Strict Workflow extensions, it completely makes me focus on my work.", "stars": 4, "date": "Dec 12, 2020"}, {"text": "Could you please allow me to change the type of sound alarm that I hear at the START of my long break?", "stars": 4, "date": "Dec 10, 2020"}, {"text": "Would be great if it had a function that blocked us from accessing certain websites (e.g., Facebook, Instagram, Twitter, etc.) while we were on the work timer.", "stars": 4, "date": "Dec 10, 2020"}, {"text": "This extension is fantastic, simple to use and provides exactly what's needed.\nI really like the fact that there's a history screen as well.", "stars": 5, "date": "Dec 5, 2020"}, {"text": "Good but can you make it so I can see total HOURS/minutes as opposed to total pomodoros? Makes it seem like I'm more productive using three 15-minute timers as opposed to one 60-minute timer for a longer task, and I have no idea how many hours of work I've done which is a little annoying. Otherwise, it's really great and you're awesome keep going!", "stars": 4, "date": "Dec 3, 2020"}, {"text": "Great Pomodoro timer, very useful and simple! Thank you!", "stars": 5, "date": "Dec 2, 2020"}, {"text": "This is the best extension for pomodoro, handsdown. Thank you for creating this.", "stars": 5, "date": "Nov 26, 2020"}, {"text": "I love it.", "stars": 5, "date": "Nov 23, 2020"}, {"text": "Best Pomodoro Timer! Keep up the good word Chris. I love this extension and it helps me be more productive.", "stars": 5, "date": "Nov 23, 2020"}, {"text": "I turn on my computer just so I can use this extension. \n\nCan you add a feature where we can see where we are in the pomodoro cycle? (In other words, how many pomodoros since the last long break and/or how many until the next?) That's the only thing missing that would make this extension perfect for me. Right now I have to look at my day's history and do the math. However, I often have to take a long break before finishing all 4 pomodoros in a cycle so I never know exactly where I am in the c... Show more", "stars": 5, "date": "Nov 20, 2020"}, {"text": "After setting the timer .if click the extension icon it was going on pause but I want to see the exact timing counter like remaining Min:Sec counter etc ,if it is done it would really helpful.", "stars": 4, "date": "Nov 19, 2020"}, {"text": "My first and best Pomodoro extension. I love it.", "stars": 5, "date": "Nov 17, 2020"}, {"text": "This is the best Pomodoro extension, that I have used.", "stars": 5, "date": "Nov 15, 2020"}, {"text": "Good app mostly, I just wish there was an option to see your history including time and date of each pomodoro session without downloading a separate file?", "stars": 4, "date": "Nov 5, 2020"}, {"text": "I love this extension. Are there any plans for an Iphone app and sync functionality?", "stars": 5, "date": "Nov 1, 2020"}, {"text": "This is a great extension and I've been looking for something like this for a long time. But I think there is an important feature that is missing: We can't see the exact time of the pomodoros for the day. The calendar only shows how many pomodoros were done that day. The only way to see when the pomodoro was done is to save the history as CSV, which is not functional.", "stars": 4, "date": "Oct 31, 2020"}, {"text": "amazing app", "stars": 5, "date": "Oct 29, 2020"}, {"text": ".Very Easy And Consistent.", "stars": 5, "date": "Oct 29, 2020"}, {"text": "Excellent and free. The only thing I wish it had was a mobile app or a way to add to my history when away from my computer, but the extension itself is perfection.", "stars": 5, "date": "Oct 28, 2020"}, {"text": "This is the best Pomodoro extension I have come across. I've tried so many extensions & apps but I keep coming back to this one. It's simple, minimalistic and useful. \nThanks for this wonderful extension ☺", "stars": 5, "date": "Oct 27, 2020"}, {"text": "This might just be the best pomodoro app that I've tried. I tried several in the past, all the features that I need is in this, nothing more, nothing less, no paywall. I find the timer notif to be super simple and non-intrusive, it even shows how many sessions I've done. The history tracking and the calendar heatmap is easily the reason why I switched to this app.", "stars": 5, "date": "Oct 26, 2020"}, {"text": "Super... ! TNX create like this", "stars": 5, "date": "Oct 26, 2020"}, {"text": "Excellent!\nSimple and with nice statistics of your pomodoro production.", "stars": 5, "date": "Oct 25, 2020"}, {"text": "I loved the extension. Just a suggestion: you can offer the possibilitie to block some sites during the period of time. For example: during the 25 minutes of concentration we can't enter on the facebook or whatsapp, we can enter only when the rest time starts.", "stars": 5, "date": "Oct 21, 2020"}, {"text": "Love it, super simple and easy to use. Having a chrome tab pop up is a great reminder for working and taking breaks. My only request is I'd love to customize it a little more to add an additional long break window for lunch so that I can use the timer all day consistently.", "stars": 5, "date": "Oct 19, 2020"}, {"text": "Good. Thanks", "stars": 5, "date": "Oct 17, 2020"}, {"text": "I loved this extension because like many others i procrastinate. I wanted some of my free time.... While doing 'some' work. Eventually, i realized that it was not getting me anywhere (this assignment is late!!!). So i searched up nice ways to keep organised and i found the pomodoro technique. I didn't really have a good stopwatch so i searched up one from google extensions and i found this. A few weeks later i was able to catch up on my work while being able to have my breaks, i also like how... Show more", "stars": 5, "date": "Oct 14, 2020"}, {"text": "Wonderful app! Just try it and you will be hooked!", "stars": 5, "date": "Oct 14, 2020"}, {"text": "Awesome app! Really has helped me stay focused when working from home. If I could suggest one thing– it would be great if you could label your pomodoros for different categories of tasks. I'd love to be able to separate professional and personal work in my pomodoros so I could track productivity more accurately.", "stars": 5, "date": "Oct 12, 2020"}, {"text": "developed my productivity", "stars": 5, "date": "Oct 11, 2020"}, {"text": "i love it man", "stars": 5, "date": "Oct 8, 2020"}, {"text": "Lite and beautiful extension but I can't find how delete note and bookmark.", "stars": 4, "date": "Oct 7, 2020"}, {"text": "Very nice pomodoro timer. Extension looks good and has good features and settings.", "stars": 5, "date": "Oct 2, 2020"}, {"text": "This extension has changed my work life and made me so much more productive that I feel the difference on the bottom line. I just wish I could go back sometimes and record \"forgotten Pomodoras\".", "stars": 5, "date": "Sep 30, 2020"}, {"text": "Absolutely love the add on. It would be fine to just use a clock or timer on my phone, but Marinara allows me to track my time spent, and the stats really help push me. I am constantly trying to do more than my daily, weekly and monthly average and trying to outperform myself. It makes it into a game for me, trying to beat myself!\n\nI was really hoping for the ability to add pomodoro sessions to previous days. Some days, I didn't have my laptop, so I did pomodoros off my ipad, but I have no wa... Show more", "stars": 5, "date": "Sep 29, 2020"}, {"text": "Does not provide your typical interface when clicked on, taking the user time to figure out how the extension even works.", "stars": 2, "date": "Sep 29, 2020"}, {"text": "I wish there was a feature to have two types of pomodoro. One 50 minute \"big pomodoro\" and the other 25 minute \"small pomodoro\"; Exactly like there is a short and a long break. I wish this because there are times when I am working on a hard task and I know I will be working on it for a longer duration to make progress. Sometimes, when I am working on an easy task / am short on energy, the \"small pomodoro\" makes sense.\n\nEven if this feature wasn't added, your application is pure gold. Thank yo... Show more", "stars": 5, "date": "Sep 27, 2020"}, {"text": "I love this extension. This is the only way I can study for more than 10 minutes at a time. Thank you!!", "stars": 5, "date": "Sep 26, 2020"}, {"text": "It's perfect.", "stars": 5, "date": "Sep 23, 2020"}, {"text": "I have used this on Firefox, and now have it on Chrome. This is an excellent extension and helps to keep me focussed", "stars": 5, "date": "Sep 23, 2020"}, {"text": "It helped me manage my time on online class. I love the option beats per minute because I'm now using 129 bpm to induce adrenaline rush to me. Also, I love the option where you can choose the tone for the alarm. I can pause it easily and I can track the number of pomodoros I've used in a week. Thank you for this!", "stars": 5, "date": "Sep 23, 2020"}, {"text": "Hi - \n\nYour extension has increased my productivity many-fold. Thank you, you really helped me. \n\nParry", "stars": 5, "date": "Sep 22, 2020"}, {"text": "Love it, but please add a to do list!", "stars": 5, "date": "Sep 17, 2020"}, {"text": "perfect tool for pomodoro webdev workflow", "stars": 5, "date": "Sep 17, 2020"}, {"text": "I want dark mode. I just got flash banged with a bright white screen when the timer finished", "stars": 4, "date": "Sep 16, 2020"}, {"text": "This extension is the most useful I've ever used and the best timer I've ever seen.  So many options, yet easy to use.  Reliable.  Awesome", "stars": 5, "date": "Sep 14, 2020"}, {"text": "I like this very much but I forgot to use it many times, if this would have 1or2 features extra would be excellent. For example: 1 the moment you click it (open a dialog box: which allows me to write the desired result I except to get done in 1 pomodoro. When ends open dialog box again with the desired result written and add the actual result) sth like a feedback for each pomodora. 2 look at this android app Routinery they way you seed the feedback for each activity is excellent.", "stars": 5, "date": "Sep 13, 2020"}, {"text": "It's almost perfect. Very reliable with what it says it does. Only thing I can add is the ability to block websites during focus periods.", "stars": 4, "date": "Sep 9, 2020"}, {"text": "Amazing Chrome Extensions!   Very effective & I love how easy it integrates into my workday.  Thank you Dev team!!", "stars": 5, "date": "Sep 8, 2020"}, {"text": "It would be great if there was a feature that you can auto play the next event.", "stars": 5, "date": "Sep 8, 2020"}, {"text": "The best pomodoro assistant I have ever used...", "stars": 5, "date": "Sep 7, 2020"}, {"text": "Nice extension,but in history iam unable to track time , like how many hours i studied.", "stars": 4, "date": "Sep 4, 2020"}, {"text": "aaaaaaaaaaaaaaaaaaaaaaaawwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwssssssssssssssssssssssoooooooooooooooooommmmmmmmmmmmmmmmeeeeeeeeeeeeeeeeee  extension", "stars": 5, "date": "Sep 2, 2020"}, {"text": "OMG! This made my life so easy and this is a must for everyone who studies. I highly recommend this extension and this method of studying.", "stars": 5, "date": "Aug 28, 2020"}, {"text": "I really enjoy using it. It's very simple.Ssometime I wish for a small app on my phone to let me know when my break is over (as the computer is far). I've got different settings for different projects (2*40+10 for development and 3*25+5 for research) and I would love to be able to toggle between them. Thank you!", "stars": 5, "date": "Aug 27, 2020"}, {"text": "It's the best! Thank you so much for this, I hope karma repays you as brilliantly, since you've provided it for free. Just one thing.. could you maybe have a line-timer option added to it? You know, like a line along the search bar that keeps shortening as minutes pass.. The \"time-left\" reminder is too tiny, is my only objection. :))", "stars": 5, "date": "Aug 20, 2020"}, {"text": "yes all right", "stars": 5, "date": "Aug 19, 2020"}, {"text": "Excellent extension.  One useful feature i'd like to see is upon starting a session is the display of an input box that used to capture what you are working on and in you history is a list that displays all the specific items you worked on and how much time you spent on it.", "stars": 5, "date": "Aug 17, 2020"}, {"text": "its so nice", "stars": 5, "date": "Aug 12, 2020"}, {"text": "+ve nice clean interface, easy to tailor settings\n- i could not find a way to pause timer", "stars": 3, "date": "Aug 10, 2020"}, {"text": "Really awesome extension, thank you to Chris Schmich I hope you will add more features to it and possibly create a mobile app version.", "stars": 5, "date": "Aug 10, 2020"}, {"text": "Brilliant work.  Thank you for making it available", "stars": 5, "date": "Aug 10, 2020"}, {"text": "Best pomodoro app in chrome for sure", "stars": 5, "date": "Aug 6, 2020"}, {"text": "This extension is great! It's really helpful to remind me to take breaks, since I'm one of those people who always forgets to restart my timer after it goes off. I have two suggestions: 1. have a place where you can write what the tasks are (I know this is a much-requested addition); 2. allow people to play a Youtube video (on loop) as your background noise/music during focus. I would really appreciate it if these additions could be made! Overall, this is a wonderful extension!!! Thank you!", "stars": 5, "date": "Aug 3, 2020"}, {"text": "3000 likes for developer", "stars": 5, "date": "Aug 1, 2020"}, {"text": "Amazing extension! Definitely seen a boost in productivity from using it. Love the way that you can track your pomodoros per week and over the last year. The visualisation/interface is similar to Github for tracking commits which I really like. Keep up the great work Chris and team!", "stars": 5, "date": "Aug 1, 2020"}, {"text": "Very useful extension. For me it would be perfect w/ an option for the timer to automatically advance, after it goes off. My work flow includes some tasks not done on my laptop, & sometimes in another room. I like being able to vary the length of time for focus sessions & breaks, but I always keep the full \"cycle\" (focus, short break, focus, long break) to exactly an hour. I use a paper form I created to schedule what I will work on & when, but if I miss when the timer goes off, I have to res... Show more", "stars": 5, "date": "Jul 23, 2020"}, {"text": "Marinara is the best pomodoro extension ever! It's simple, clean and runs flawlessly. Thank you, Chris!", "stars": 5, "date": "Jul 19, 2020"}, {"text": "Loved it, but have to start every pomodoro manually which makes it completely useless for me. Alas, will have to look for another extension for now. I hope it is implemented in future.", "stars": 3, "date": "Jul 19, 2020"}, {"text": "100% amazing extension .. very simple and a great way to track your progress", "stars": 5, "date": "Jul 19, 2020"}, {"text": "Very simple yet efficient design. It would be very useful if you included the option to sync across browsers from different devices. Waiting for the feature to be added in future. Other than that, this is most ergonomic Pomodoro timer I have used till now. Great job!", "stars": 5, "date": "Jul 9, 2020"}, {"text": "I used multiple apps both on my phone and laptop but this extension is arguably the simplest and best. Pomodoro history helps to adhere to pomodoro practice. Thanks Chris!", "stars": 5, "date": "Jul 9, 2020"}, {"text": "Excellent!", "stars": 5, "date": "Jul 6, 2020"}, {"text": "Its a great tracker, sweet, simple and no bugs :)\n\nI would love if we can add a line chart showing progress and also ability to view previous months data separately so we can compare how performed each month", "stars": 5, "date": "Jul 4, 2020"}, {"text": "Really goods but miss atmosphere sounds like nature, train, coffee shop", "stars": 4, "date": "Jul 1, 2020"}, {"text": "Very useful for my study preparation. But history tracking feature can be even more better. I used one iOS app called (Focus Keeper), the tracking mechanism in it was very nice. I am using laptop for my studies. So, you can improve this history check.", "stars": 5, "date": "Jun 26, 2020"}, {"text": "Almost perfect. Can't seem to reset the whole app and as such, in the morning my pomodoro recommends me to take a long break after one pomodoro today. Shouldn't it go \"oh she only did one today, thats not time for a long break yet\" ?", "stars": 4, "date": "Apr 15, 2020"}, {"text": "it would be better to put a noisy background during break, not during acrivity time, so that I get disconfort browsing.", "stars": 3, "date": "Apr 12, 2020"}, {"text": "Pretty good.  One feature I'd love is an option to prevent you from pausing the timer.  Kinda defeats the purpose if you can just cut time in half and I'm using this app because my willpower is weak!  lol", "stars": 4, "date": "Apr 7, 2020"}, {"text": "Feature Request:\n* Allow the user to supply a list of websites as \"Banned\" or \"Blocked\" websites that cannot be accessed while in Focus Mode!", "stars": 5, "date": "Apr 6, 2020"}, {"text": "GREAT!", "stars": 5, "date": "Apr 6, 2020"}, {"text": "It's fine but it doesn't block certain sites during a focus session. Other apps do so it gets a \"just ok\" from me.", "stars": 3, "date": "Apr 6, 2020"}, {"text": "So good, and open source as wel!!!! Perfect.", "stars": 5, "date": "Apr 3, 2020"}, {"text": "Maybe I'm missing something, but it looks like I have to click on it to start every work and break period. I just want it to ding on move on. Other than that, it works", "stars": 3, "date": "Apr 3, 2020"}, {"text": "Helps a lot! Thanks you, devs <3", "stars": 5, "date": "Apr 2, 2020"}, {"text": "this timer helpful for me. i ask please don't remove chrome web store, thank you", "stars": 5, "date": "Mar 28, 2020"}, {"text": "Great app, love it very much", "stars": 5, "date": "Mar 27, 2020"}, {"text": "its good, but i you add a simple todo with the ability of assigning a number of pomodoro cycle to it, it will be great", "stars": 5, "date": "Mar 25, 2020"}, {"text": "Absolutely excellent. Makes being productive easy. I also use another extension called xTab to limit the number of tabs I can have open. Together they go great and keep me on track towards my goals.", "stars": 5, "date": "Mar 25, 2020"}, {"text": "Very easy to understand and you can adjust time measurements.", "stars": 5, "date": "Mar 17, 2020"}, {"text": "It's just amazing! I wish you add desktop app and safari extensions.", "stars": 5, "date": "Mar 16, 2020"}, {"text": "Thank you Chris", "stars": 5, "date": "Mar 13, 2020"}, {"text": "Love it! Help me a lot on focusing and also have some breaks to move and rest.", "stars": 5, "date": "Mar 11, 2020"}, {"text": "would love a reset button", "stars": 4, "date": "Mar 10, 2020"}, {"text": "Just started yesterday but it already seems very useful. It helps me to concentrate !", "stars": 4, "date": "Mar 5, 2020"}, {"text": "the best out there", "stars": 5, "date": "Mar 1, 2020"}, {"text": "verygood！！！thanks", "stars": 5, "date": "Mar 1, 2020"}, {"text": "If it is possible, I want you can add the setting of the target number in the tool.", "stars": 5, "date": "Feb 25, 2020"}, {"text": "This extension is almost perfect. I would have liked some kind of label/tag system but I am able to manage these using an alternate method. I understand that it's a more involved feature.\n\nHowever, the feature which can be added easily is providing buttons for \"Skipping the Short Break and Starting the Long Break\" on the new tab page after a session ends.\n\nActually, this has been discussed at https://github.com/schmich/marinara/issues/67 and https://github.com/schmich/marinara/issues/200.\n\nUn... Show more", "stars": 4, "date": "Feb 21, 2020"}, {"text": "The best timer I ever used. Just if it had the option of a linked account saving the history accross all devices, it would be perfect", "stars": 4, "date": "Feb 17, 2020"}, {"text": "Loved it, more than enough, before this extension I was using windows 10 clock, Just add a reminder at the startup of chrome.Can you please link it to the google drive so the history may be saved in google drive? Thanks a lot. 👌😊\nEdit: 4 stars because there is no auto backup option. Lost a lot of progress accidently", "stars": 4, "date": "Feb 14, 2020"}, {"text": "Thanks a lot for this extension. It has all the features I wanted.", "stars": 5, "date": "Feb 13, 2020"}, {"text": "good job", "stars": 4, "date": "Feb 13, 2020"}, {"text": "Awesome extension with a clean and simple interface. It's a totally killer productivity-booster. Thanks devs!", "stars": 5, "date": "Feb 10, 2020"}, {"text": "So far, so good. Serves its purpose and it's free. I do just wish there was an option to hide the countdown so I'm not tempted to watch the time countdown.", "stars": 5, "date": "Feb 8, 2020"}, {"text": "I loved this app , I would like to have a shortcut key to start Marinara (focus 25min) and as mentioned in previous review the option to have it start when you launch chrome.", "stars": 5, "date": "Feb 4, 2020"}, {"text": "Simple and effective. Easy to use and keeps my productive!", "stars": 5, "date": "Feb 4, 2020"}, {"text": "Is it possible to add task name for each pomodoro?", "stars": 3, "date": "Jan 27, 2020"}, {"text": "This honestly is life changing, I used to use these back in University but have rediscovered them and whoa what a productive week I have had!!! Thanks a million", "stars": 5, "date": "Jan 17, 2020"}, {"text": "I'm using it to keep track of my studies. Thank you for making this extension.", "stars": 5, "date": "Jan 15, 2020"}, {"text": "best", "stars": 5, "date": "Jan 15, 2020"}, {"text": "Really clean and easy app. Really like the history feature, shame it cant sync between computers automatically. Must be a way to achieve this at least through google drive?", "stars": 4, "date": "Jan 4, 2020"}, {"text": "This extension helps me a lot to manage my working hours and also reminding me to take small breaks in between. One suggested improvement is to make this extension run automatically once chrome is launched or opened. Cause sometime I forgot to activate the extension, and apparently I'm not the only one.", "stars": 5, "date": "Dec 6, 2019"}, {"text": "Good job!", "stars": 5, "date": "Nov 26, 2019"}, {"text": "This is the most valuable extension in Chrome!", "stars": 5, "date": "Nov 19, 2019"}, {"text": "I love it and the pomodoro method, it's fantastic and I've been using Marinara for years! I just have one feature request: the option to \"tell\" the app what you'll be working on for each section. Instead of just popping up to say start, I'd love the option to type in what I'll be doing for the next 21 minutes.\n\nIt's all but perfect as it is though!", "stars": 5, "date": "Nov 16, 2019"}, {"text": "does  not have custom time entry , custom time names", "stars": 3, "date": "Nov 10, 2019"}, {"text": "Really love the extension, I use it a lot. Is there a way though to add some sort of warning say, 5 minutes before the 25-minute focus mode is up so that we can wrap up whatever we're doing at that moment and get ready to take the 5-minute break (i.e. switch our mind to \"break\" mode)? I oftentimes forget to look at the timer and just continue with what I'm doing, and when the time is up it kind of jerks me off my \"flow\". Otherwise, really great app and thanks for making it free!", "stars": 5, "date": "Nov 8, 2019"}, {"text": "Great tool. One minor suggestion for improvement. \nIt is difficult to see when pomodore was completed say today and this week. \nIt only has statistics with longer time period.", "stars": 5, "date": "Nov 7, 2019"}, {"text": "Helps me keep focus, especially the dreaded beginning, and that time before lunch when my mind starts to wonder. It's great for keeping pace of how much time you spend on a piece of work as well.", "stars": 5, "date": "Nov 2, 2019"}, {"text": "Fantastic Extension, Thank you", "stars": 5, "date": "Oct 28, 2019"}, {"text": "Hi, I use the pomodoro with the timer sound, that periodic tick helps me to keep focused. It would be nice though if you could modify the volume, sometimes I have to watch a tutorial and the sounds interfere.", "stars": 5, "date": "Oct 28, 2019"}, {"text": "The BEST Pomodora App I have used!", "stars": 5, "date": "Oct 27, 2019"}, {"text": "Very good app.\nHowever, please try to make a option for a ranking system so that each week the users can see global ranking and the top 100 list. It will add a competitive flavor to the thing and people will be more likely to follow pomodoro method of work.", "stars": 4, "date": "Oct 22, 2019"}, {"text": "Great app.", "stars": 5, "date": "Oct 18, 2019"}, {"text": "This is the best pomodoro technique I've ever seen", "stars": 5, "date": "Oct 17, 2019"}, {"text": "This is the best Pomodoro timer I've used. I like how it has a desktop notification or new tab notification or both when a session is done.", "stars": 5, "date": "Oct 17, 2019"}, {"text": "This is a great tool.  All the features you need.  No extra bloated features to make it confusing.  Super simple to use.   Just perfect.", "stars": 5, "date": "Oct 16, 2019"}, {"text": "Very neat design. Really like the \"noise\" option. Thank you for making this.", "stars": 5, "date": "Oct 16, 2019"}, {"text": "great app , almost include all needed features , i hope you included on mobile \nthanks", "stars": 5, "date": "Oct 11, 2019"}, {"text": "Excellent. Too useful for me. Thanks a lot for creating it.", "stars": 5, "date": "Oct 9, 2019"}, {"text": "LOVE IT", "stars": 5, "date": "Oct 6, 2019"}, {"text": "It does what I need it to do but it also doesnt. Sometimes i dont finish a pomodoro or dont want to take a break but i have no choice but to let the thing finish its countdown. there is no reset. like right now for instance it is saying i have just finished a pomodoro and it is time for a break when that is not true, i am actually just starting a pomodoro and need it to reset but it cant, it has to finish the break countdown cycle before i can start a pomodoro. A glaring oversight. like WHY d... Show more", "stars": 3, "date": "Sep 30, 2019"}, {"text": "The extension helps me a lot to concentrate on my daily work. Simple and user-friendly interface. 5 stars and a recommendation to friends from me. Thank you!", "stars": 5, "date": "Sep 23, 2019"}, {"text": "If u add some ambient sounds (like \"noisli\") as timer tune this would be great. In my opinion its hard to focus listening to the sound of the clock. Thank you.", "stars": 5, "date": "Sep 23, 2019"}, {"text": "Great extension, simple and really helpful.", "stars": 5, "date": "Sep 21, 2019"}, {"text": "Well designed and easy to use. Its easily the best pomodoro app that I've used.", "stars": 5, "date": "Sep 17, 2019"}, {"text": "A wonderful feature would be to automatically start the break timer/pom session", "stars": 4, "date": "Sep 14, 2019"}, {"text": "Love this, no need to spend money. Give you everything you need. \n\nKeep up the good work guys!", "stars": 5, "date": "Sep 11, 2019"}, {"text": "Does all I need but one. Please add a feature of profiles. Or maybe labels for the task doing. Such as college, code, etc.", "stars": 3, "date": "Sep 8, 2019"}, {"text": "Thank you so much for making Marinara! It has all the features I need, and an amusing name to boot :)", "stars": 5, "date": "Aug 30, 2019"}, {"text": "I've tried a few different Pomodoro timer extensions and this one was definitely the best and easiest to use! My only request would be to add keyboard shortcuts to control the timer. Would allow everyone to be just a tad more productive!", "stars": 5, "date": "Aug 27, 2019"}, {"text": "I would like to mention the name of the task I work on. Pomodoro task -wise naming will be useful. This gives me a clear picture on time I spend on a task on a daily basis.", "stars": 4, "date": "Aug 27, 2019"}, {"text": "Great extension. I'd like to request a feature to record what I was working on, it feels good to look back and see a project from start to finish and the pomodoro associated with each milestone. Motivates me to keep moving forward.", "stars": 5, "date": "Aug 24, 2019"}, {"text": "Excellent Excellent. Love it. Very easy to use, and not in the way. The only thing I wish, we had the ability to choose our own mp3 play at the back ground while focusing. Because I like to listen to jazz while focusing. Thank you, soo much.", "stars": 5, "date": "Aug 23, 2019"}, {"text": "Wish there is an option to add description about on going task, this can be optional though. This way there will be a track of daily activity/task list as well.", "stars": 3, "date": "Aug 20, 2019"}, {"text": "So great! That little grey tomato up there is calling out, hey get to work, I'm just grey now, but I could be ... RED if you get on it! The gong sound is great. \n*It would be nice to individually adjust the different volumes of white noise, as in change volume of \"Timer sound\" to make it more quiet white noise vs \"When Complete, Play Sound\" to make the gong just a little bit more audible but not too disturbing.", "stars": 5, "date": "Aug 18, 2019"}, {"text": "Great App I love it, and I love God, I love peoples, I love my life. You are the best, Thanks", "stars": 5, "date": "Aug 16, 2019"}, {"text": "Great Extension. \nIt would be awesome if it could run on my android device as an app. and share data with the desktop extension so I can keep score when I am not working on the desktop..", "stars": 4, "date": "Aug 16, 2019"}, {"text": "Feature Request: Notifications in the top bar ; most of the timers on Ubuntu suck balls. so I have been using this for a while now.\nConsider adding persistent notifications that it can function as a full fledged timer.", "stars": 5, "date": "Aug 14, 2019"}, {"text": "This extension is great! It has everything I was looking for, for example: It asks before starting next pomodoro interval, I can customize the sounds, etc. Best pomodoro extension!", "stars": 5, "date": "Aug 13, 2019"}, {"text": "It is good. Simple and clear. I have a idea. Please consider is it cool to you. \n\nA \"to do list\". Pomodoro is counting all the time but people can decide to go to next task or keep in the same one. For the case of going to next task, number of pomodoro are recorded with name of task. The finish task and its number of pomodoro can be found in the history. It will be nice. People can know how many work they did in the past and also for each task how many pomodoro they spend on tasks. It will be... Show more", "stars": 5, "date": "Aug 11, 2019"}, {"text": "Hi, is there a way to include a website blocker, that just blocks specific chosen blacklisted sites. THE perfect app for what I want if so.", "stars": 4, "date": "Aug 11, 2019"}, {"text": "I usually don't write reviews but these guys get it. I've been using other pomodoro apps before but they are just to lazy to improve their app. (Maybe they gotta use their own app to help them be productive ? eh?)  They don't have any customization and alarm sounds are just too loud and annoying. These guys at marina gets it.", "stars": 5, "date": "Aug 8, 2019"}, {"text": "This is exactly what I needed. My productivity has already risen and I am excited to see what I can accomplish with the help of this app. Thank you so much for providing it!", "stars": 5, "date": "Aug 3, 2019"}, {"text": "I am very critical but this app is functional and has a very clean interface.", "stars": 5, "date": "Jul 24, 2019"}, {"text": "I must say that I love this extension.  I've been trying to apply pomodoro technique relying on an app without too much success.  This one is the right one.  The sound, the tab, the notification.  I like it.  Kudos to the devs!", "stars": 5, "date": "Jul 17, 2019"}, {"text": "Fit & Useful with myself & my job", "stars": 5, "date": "Jul 10, 2019"}, {"text": "Amazing app, appreciate the team who built this. I'd love to add a feature where this starts when Chrome loads. Thanks!", "stars": 5, "date": "Jul 9, 2019"}, {"text": "Hi ! I really like the app so thank you ! I have a suggestion; it would be super cool to have more kinds of pause (like a lunch one) to customize instead of just one :) Great job tho!", "stars": 5, "date": "Jul 2, 2019"}, {"text": "I have never really believed in productivity apps, since they never proved useful or habit-building to me.  As a full-time student, this is potentially disastrous: the ability to organize work and time is vital to success. I began using Marinara simply to keep track of time, and nearly a month after it has seamlessly integrated into my studies in a beautiful and unexpected manner: I love being able to keep track of the time I spend working hourly/daily/weekly/monthly/yearly. Without this app,... Show more", "stars": 5, "date": "Jun 30, 2019"}, {"text": "Outstanding!  intuitive, minimal and effective.", "stars": 5, "date": "Jun 21, 2019"}, {"text": "Great.\nSuggestion: in the pop up, to be possible not only to start the next break but also, if you are still focused (it happens under high stress), to start another concentration period. Right now I have to dismiss the notification and get back to the browser to \"restart\" a concentration period, three clics.\nThanks.", "stars": 5, "date": "Jun 19, 2019"}, {"text": "I loved the app. It is simple and awesome. However, I would like to add one more feedback as I there is only one focus available. I can set my timer to 25/5 or 50/10 (focus/break). I wonder if it would be possible to create different focus profile and start the timer.", "stars": 5, "date": "Jun 17, 2019"}, {"text": "I really like this extension compared to other pomodoro extensions. \nIt has a nice layout imo, it has customizable timers for both working and pauses, it keeps track of how many times you have done a pomodoro within days/weeks/months, it gives you motivation or atleast for me to see that I have done X amount of pomodoros within a week fx.,\nUse with Excel, Google Sheets, or other spreadsheet software.\n\nYou can also:\n\nExport your history\nFor backup or for importing on another computer.\n\nImport ... Show more", "stars": 5, "date": "Jun 15, 2019"}, {"text": "Really appreciated.\nIt is simple and efficient to check my working time or surfing around internet.\nIf there are some more functions like start automatically when each functional timer ends(for example: focus-short break-focus-short break - focus - long break-focus...... automatically), it would be much useful.\nThx.", "stars": 5, "date": "Jun 15, 2019"}, {"text": "It's best timer ı have seen.I loved pomodoro history but if wish ı can see the time which ı spend with pomodoros.", "stars": 5, "date": "Jun 11, 2019"}, {"text": "Love the extension so far! Question - does the extension always require you to click something to start a short break? I was hoping the break would just start automatically once the \"focus\" period is over. I also noticed one thing where if I set the break timer to 0 minutes, when the focus period is over, it does ask if I want to start the break but it defaults to 5. Shouldn't it take the 0 minutes that I have set in the preferences?", "stars": 5, "date": "Jun 11, 2019"}, {"text": "great app, but u should add:\n- and option to block sites while working\n-a bigger timer icon in the extension", "stars": 5, "date": "Jun 7, 2019"}, {"text": "I love how simple and easy it is to use. It's crazy how something so simple can improve my productivity. THANK YOU!", "stars": 5, "date": "Jun 7, 2019"}, {"text": "Very light, easy to use.  Love it! The only thing I wish for is if I can add title to each session. Would help me organize my tasks better.", "stars": 5, "date": "Jun 4, 2019"}, {"text": "Simple and useful! Thanks for this extension!", "stars": 5, "date": "Jun 2, 2019"}, {"text": "Great app! Any chance it can have a setting which auto starts the next session/break (but still pops up a notification), without asking the user each time?", "stars": 5, "date": "Jun 1, 2019"}, {"text": "Excellent Pomodoro timer, but I wish it included a website blocker. For me personally there is not much value in using just a timer. Sadly, I'll need to use a different extension, but I would love to return to this one if a website blocker is added.", "stars": 4, "date": "May 29, 2019"}, {"text": "Where oh where have you been these last few years - only now do I find the perfect time management tool (at the end of 6 years of uni!).  This is brilliant - technology used in the right way to monitor and enhance productivity.  Bravo", "stars": 5, "date": "May 28, 2019"}, {"text": "Such a minimalistic approach. One of the best extensions for productivity!", "stars": 4, "date": "May 27, 2019"}, {"text": "I heard about this extension in Siraj Raval's video on good study habits and I am so grateful to all you guys making cool apps like this. This is so valuable!!! \nRock On and Thank you !!!", "stars": 5, "date": "May 27, 2019"}, {"text": "Good extension, please could you add an option to block websites as well?", "stars": 5, "date": "May 26, 2019"}, {"text": "I use this application every day, actually the best pomodoro timer in my life.", "stars": 5, "date": "May 17, 2019"}, {"text": "Extremely love it. \n\nThank you so much for offering this amazing extension.", "stars": 5, "date": "May 15, 2019"}, {"text": "oh it saves my energy, i absolutely like this extension, it's perfect!!", "stars": 5, "date": "May 13, 2019"}, {"text": "Best Pomodoro app I have tried so far. Though, If I'm really nitpicking,  I would love there to be a simple way to know how many hours I've done today at a glance. I know it is all in the graphs but I'm a simple guy :]", "stars": 5, "date": "May 9, 2019"}, {"text": "Very good extension. If we could enter a list of tasks in the configurations and optionally assign a task to each pomodoro would be fundamental to have statistics for each task.", "stars": 5, "date": "May 9, 2019"}, {"text": "Amazing customization with sounds - I used to play YouTube videos of metronomes while I was working, but it turns out, this app has a metronome built in during the timer...plus brown noise, pink noise, and white noise -- my favorites!  Then, the tracking aspect of it gives you an idea of how long (and when) you've logged hours on a project.  Very cool - will help keep me accountable and make be a better person, as a result!  Thanks Chris Schmich!", "stars": 5, "date": "May 9, 2019"}, {"text": "Works great for me! I set the timer for 25 minutes and the breaks for 5 minutes. If I can knock out 8-10 pomodoros in a day I feel like I've had a good day at work.", "stars": 5, "date": "May 8, 2019"}, {"text": "Hi big fan of this extension but would like to have the option disable the short break as well as the long break. Thanks ☝️👌👍!", "stars": 4, "date": "May 7, 2019"}, {"text": "It is my default productivity app on the laptop. It's quick, easy to set up and does one thing really well, which is all I expect in this app", "stars": 5, "date": "May 7, 2019"}, {"text": "I can't understand why there is no option to cycle automatically...? I mean... I start the Focus, and then it beeps, and then everything stops? Can't it start the timer for Break automatically if I want to? Everything else is perfect... Simple interface, good selection of non-intrusive sounds, but it should really cycle on itself or at least have an option for it.", "stars": 3, "date": "May 6, 2019"}, {"text": "i love this app so much! Now work is fun for me with this app! And i think i also need to manage my time.", "stars": 5, "date": "May 4, 2019"}, {"text": "very impressive. This is the tool i'm looking for.\nTo author: Would you consider add a block function in this app? for example, i dont want to open youtube or facebook when i am working, but those website would be unblocked during the break time.", "stars": 5, "date": "Apr 29, 2019"}, {"text": "An extension that I use continually. Excellent. Simple and effective.", "stars": 5, "date": "Apr 26, 2019"}, {"text": "Nice extension. In my opinion there is only one thing missing: An option to not show the remaining time at the chrome toolbar.. I think it distracts me to see how much time left to end the section. I know I can hide the extension from the toolbar, however, it would be nice to see the icon of the app and not the time left.", "stars": 5, "date": "Apr 24, 2019"}, {"text": "I LOVE IT!\nThank you for this amazing app! I use linux KDE and there is no decent pomodoro app. This app is just what i needed. Thank youuuuuu!", "stars": 5, "date": "Apr 22, 2019"}, {"text": "Please Fix the Continue Function . SOme times it shows 17 minutes but when i click it RESETS to 25 MIN !!!!!!!!!!", "stars": 3, "date": "Apr 20, 2019"}, {"text": "Excellent extension.  It has the most relevant statistics.  I like the daily and weekly numbers of pomodoros. I used to aim for 4 pomos and now I can easily finish 6.  Changed my life. I must say I have a better work ethics now.", "stars": 5, "date": "Apr 18, 2019"}, {"text": "Best things are the choices of sounds at the end (although it would be nice to hear something when a new one starts). I wish there was a way to know which pomodoro finished & which is starting.", "stars": 4, "date": "Apr 17, 2019"}, {"text": "Is it possible to show running time on the tab so it can be seen when chrome window is minimized?", "stars": 5, "date": "Apr 16, 2019"}, {"text": "This is so useful. I used the pomodoro method when I was studying and now I am back learning a language so I use the pomodoro method to make sure I learn on my desktop app duolingo and memrise both for 50 minutes daily. It is a great app and I hope to continue to use it for the next few months in order to achieve success in my exam. Thank you for this extension to Chrome.", "stars": 5, "date": "Apr 14, 2019"}, {"text": "I looked at 3 pomodoro extensions - this is the only one that didn't want to look at the HTML/JavaScript in running pages, and so this is the only one that is guaranteed to be just a pomodoro rather than an attempt to gather my traffic.   Thank you for asking only for needed privileges.", "stars": 5, "date": "Apr 12, 2019"}, {"text": "Love the extension. Is it possible to modify the number of pomodoros manually? I didn't realize that the timer was running when I came back from eating, so now I have an extra pomodoro that I don't deserve (haha).", "stars": 5, "date": "Apr 11, 2019"}, {"text": "Suggestion: Allow users to set multiple timers for things instead of having to always chance the default timer. For example, I like setting larger blocks of time when I study but when I am trying to not procrastinate, I like to set the standard 20 minute timer. Its a pain to have to keep redoing them each time which is what I really think could be improved.", "stars": 3, "date": "Apr 8, 2019"}, {"text": "Great, the most convenient Pomodoro app. stats are very helpful to manage study time. Well Done.", "stars": 5, "date": "Apr 4, 2019"}, {"text": "I really like it but many you could add a blocker for websites that are a destraction", "stars": 5, "date": "Apr 3, 2019"}, {"text": "Super awesome.. Thanks", "stars": 5, "date": "Apr 2, 2019"}, {"text": "Would be really cool if you can get track of how many hours and minutes you logged in.", "stars": 4, "date": "Mar 31, 2019"}, {"text": "Simple, but does everything it needs to do. Would like it if there's an option to hide how much time is left for focus sessions.", "stars": 5, "date": "Mar 23, 2019"}, {"text": "Very good app, but you should add an option for tasks, that way you can split time spent on each task and not only have the total time tracked.", "stars": 4, "date": "Mar 20, 2019"}, {"text": "Great chrome extension!!!", "stars": 5, "date": "Mar 19, 2019"}, {"text": "Thank you I love it  I used just 2 days but i seen change in my life Thank you Again", "stars": 5, "date": "Mar 17, 2019"}, {"text": "Great tool but it would be better if it has an option to auto switch session (no click needed anymore)", "stars": 5, "date": "Mar 14, 2019"}, {"text": "You'd better export your history before uninstalling the app, Chrome or resetting your profile as the app doesn't offer you an account logon.", "stars": 5, "date": "Mar 6, 2019"}, {"text": "Nice", "stars": 5, "date": "Mar 5, 2019"}, {"text": "i'm still getting used to this system, but this version of the pomodoro is very convenient. only one thing jumps out at me as something that i would change if i could. i wish i could have multiple focus session durations in the way that there are multiple break durations. a long and a short would be cool, but it would be even cooler if there could be more and with labels set by the user.", "stars": 4, "date": "Mar 1, 2019"}, {"text": "Really nice simple Pomodoro extension. Works very nicely to easily time work sessions, and has a more convenient visual reminder than when I used to use a timer!\n\nA few features that would be really nice, which I used to do when I used pen, paper and timer:\n- An option to add 5 minutes to the pomodoro time if you feel the task isn't quite finished and you're in a groove. (Simply, without needing to open settings, change the pomodoro length, start a new pomo, and change it back later.)\n- An op... Show more", "stars": 4, "date": "Mar 1, 2019"}, {"text": "Good tool for managing structured study sessions for major national exams! It would be great if the extension linked to a page with a countdown timer. The extension only links to the \"options, settings, feedback\".", "stars": 4, "date": "Feb 27, 2019"}, {"text": "Simple and powerful. The most amazing pomodoro app/extension I've ever used!", "stars": 5, "date": "Feb 25, 2019"}, {"text": "In Hancock Style \"Good Job!!\"  👍", "stars": 5, "date": "Feb 24, 2019"}, {"text": "Excellent productivity tool.\nThank you!!", "stars": 5, "date": "Feb 23, 2019"}, {"text": "Very simple, easy to use, well-designed, product that does exactly what it is supposed to do without any of the fluff.", "stars": 5, "date": "Feb 21, 2019"}, {"text": "My top extension. I recommend to add:\n- adjusting the sound volume (for clock sound)\n- team synchronization (with common account or something like that)\n- time-date format localization \n- \"continue work\" button, when you want to skip the rest\nSorry if I repeat for someone.", "stars": 5, "date": "Feb 21, 2019"}, {"text": "great extension, i used different pomodoro apps and never really thought that there is a chrome extension, liked that there is a graph for productivity nothing beats the feeling that i did some work without forgetting to take a break. will definitely buy premium just to support you guys for this", "stars": 5, "date": "Feb 18, 2019"}, {"text": "Perfect.", "stars": 5, "date": "Feb 12, 2019"}, {"text": "I Loved this extension I would like to have one more feature added here is to start the pomodoro when I launch chrome or at least remind me to start the timer. Many times I just forget to start the timer.", "stars": 5, "date": "Feb 8, 2019"}, {"text": "Simple and genius! Why complicate it?!", "stars": 5, "date": "Jan 31, 2019"}, {"text": "Wonderful extension.. had it have the option to select a particular set of from and to time.. i would rate is as 5", "stars": 4, "date": "Jan 29, 2019"}, {"text": "Have you guys thought about making it social and integrating for synced pomodoros with co-workers/friends?\nWe've thought it would be pretty useful", "stars": 5, "date": "Jan 22, 2019"}, {"text": "Works as advertised.  Flexible settings.", "stars": 5, "date": "Jan 8, 2019"}, {"text": "Neat, simple implementation for the Pomodoro technique; Not a lot of bells n whistles. The historical stats view is good for retrospection. Helps me stay focused! Does one thing, does it well.", "stars": 5, "date": "Jan 5, 2019"}, {"text": "I find this extension to be very well designed! Settings are clear, precise and useful. Additional statistics such as \"daily distribution\", and GitHub-like graph with the ability to import/export data make for some serious desire to concentrate and get things done once you get a streak going! Fantastic work! Congrats to Chris and other contributors!", "stars": 5, "date": "Jan 3, 2019"}, {"text": "This is a perfect app. I agree with other users that there should be an option for syncing in multiple desktops", "stars": 5, "date": "Jan 1, 2019"}, {"text": "Pros:\n- customize work and break durations\n- customize \"begin to work\" and \"begin to take break\" sounds\n- pretty graphs\n\nCons:\n- can't export data to csv/other data formats for custom analysis", "stars": 5, "date": "Dec 29, 2018"}, {"text": "This extension is an absolute perfect fit for someone who wants to keep track of ones productivity. The only single downside is the inability to synchronize history on different desktops. Is this feature still coming soon? I think people would be ready to pay for it as a premium feature", "stars": 5, "date": "Dec 15, 2018"}, {"text": "This is the best pomodoro extension which I seen. Thanks a lot!", "stars": 5, "date": "Dec 14, 2018"}, {"text": "I like that it's simple and light. Love the work :D\nHowever, I hope the hover to hear audio was also available for \"SHort break\" and \"Long break\".\nThanks!", "stars": 4, "date": "Dec 13, 2018"}, {"text": "Love the extension! Can I offer a recommendation? Please provide the option of entering a task. I think this fundamental to the pomodoro technique. Other than that, works perfectly! Thanks!", "stars": 5, "date": "Dec 10, 2018"}, {"text": "It's very helpful so far. I personally find this extension more effective than a real-life pomodoro which I keep ignoring when time's up.", "stars": 5, "date": "Dec 10, 2018"}, {"text": "The best Pomodoro Method extension in the store.\n I love it because the notification system is simple, and  calls your attention when needed. You have  to hit a buttom to start a cycle which is different from other Pomodoro trackers that counts the cycle nonstop and ended up tracking non realistic focus time.\nAnd finally the graphs helps me understand better my productivity period of time and keeps me motivated to always do more. I just wished it was available on a mobile version that could s... Show more", "stars": 5, "date": "Dec 8, 2018"}, {"text": "Brilliant extension, Love using it.\n\nThe Graphs, Gtihub like Streaks gives great data clarity. Thanks a lot for creating this extension.", "stars": 5, "date": "Dec 3, 2018"}, {"text": "Very satisfied!!", "stars": 5, "date": "Nov 25, 2018"}, {"text": "no more to say, very good!", "stars": 5, "date": "Nov 23, 2018"}, {"text": "very good extension. Firstly, we I change pomodoro time. Secondary I can pause time if I need to pay attention to other subject. \nStatistic data provided is also very useful because I can see day time distribution for pomodoros and understand time to be more productive.", "stars": 5, "date": "Nov 23, 2018"}, {"text": "Thanks for share this extesion!", "stars": 5, "date": "Nov 22, 2018"}, {"text": "Well, this is what happened. With this app, I managed on the first day to do 9 hours straight through. Then, on the second day, I did 10 hours.  Here I am now on my third day with this superb app and adding it to my Tablet and Laptop.  If you are having problems with this app, you ain't using it right. This app is out of sight, if I could add it to my android phone, as sure as there's light in the day, I would. Thank you app makers, I appreciate you.", "stars": 5, "date": "Nov 17, 2018"}, {"text": "Excellent!", "stars": 5, "date": "Nov 13, 2018"}, {"text": "This extension has been an integral part of my daily routine for the past two years. I definitely take this extension for granted, but here I am giving it my fullest support and rating because it's that good. Thanks for reading.", "stars": 5, "date": "Nov 8, 2018"}, {"text": "Really awesome, would be perfect if you could synchronize pomodoros and choose a custom song", "stars": 4, "date": "Nov 6, 2018"}, {"text": "One of the usefull extensions on google webstore. \nto devs: Please creat an ios app with sync, but not for free. People should have a possibility to donate you for a great assitant.", "stars": 5, "date": "Nov 4, 2018"}, {"text": "In general its a good add-on but it lack 1 good thing - write a note about what has been done during pomodoro focus time. Looking for this feature in next release ;)", "stars": 5, "date": "Oct 30, 2018"}, {"text": "It would be really helpful if this synced with your google/chrome account automatically. having to export your history doesn't help very much.\n\nthere also are a few more little tweaks that would be helpful. automatically adding up your time spent over selected days or a period, allowing more customization in terms of breaking up different blocks for nonstandard amounts of time, or even building in additional kind of activity besides \"work\" and \"break\" would all go far towards turning this per... Show more", "stars": 4, "date": "Oct 29, 2018"}, {"text": "Love the app, it helps gamify productivity which is fantastic. Thanks for continually upgrading the features! One suggestion, and maybe this is out of pomodoros scope, is to have a website blacklist while in focused mode. I would even play a small monthly subscription ($2/mth) for this kind of feature.", "stars": 5, "date": "Oct 28, 2018"}, {"text": "Great timer, and easily set-up to my needs. I like the history tab, but it lack one thing for me and it's a \"reset history\" button.", "stars": 5, "date": "Oct 26, 2018"}, {"text": "It does its job! Nothing fancy or complicated. Great for studying!", "stars": 5, "date": "Oct 15, 2018"}, {"text": "Good and Simple", "stars": 5, "date": "Oct 15, 2018"}, {"text": "i love the extension, so simple and helpful, providing the history in an informative way. i hope one day the developers will create the mobile app too!", "stars": 4, "date": "Oct 13, 2018"}, {"text": "simple, but it needs a feature where i could register a task name and know how much pomodor's i made to each task, nothing big", "stars": 4, "date": "Oct 12, 2018"}, {"text": "make myself focus", "stars": 5, "date": "Oct 10, 2018"}, {"text": "how to just reset settings", "stars": 5, "date": "Oct 4, 2018"}, {"text": "It's very nice!\nI love this app.\nsimple and completeness!", "stars": 5, "date": "Oct 3, 2018"}, {"text": "Very good, the only thing missing is that different types of tasks can be defined, for different statistics (thesis, work, etc.).", "stars": 4, "date": "Oct 3, 2018"}, {"text": "If Marinara can put the options out of restart timer the second level menu and directly list them in the first level menu.", "stars": 5, "date": "Oct 3, 2018"}, {"text": "very easy to use", "stars": 5, "date": "Oct 3, 2018"}, {"text": "Simple & Clean! Warns you and is somewhat customizable.\nHave nice charts and history.", "stars": 5, "date": "Oct 2, 2018"}, {"text": "This is by far the best of the simple Pomodoro apps for Chrome that I have tested.", "stars": 5, "date": "Sep 25, 2018"}, {"text": "Its a good pomodoro app and very useful in preparation", "stars": 5, "date": "Sep 25, 2018"}, {"text": "Hello! I loved this app. It's improving my productivity. If there is something that i would love to have in this app it is being possible to download in a format that i can open on Excel to make better analysis.", "stars": 5, "date": "Sep 24, 2018"}, {"text": "This is an excelent app! However, it would be outstanding If I could fixate certain amount of pomodoros with certain amount of time to each other so I can manage effectively which tasks require to be done in a threeshold time.", "stars": 5, "date": "Sep 17, 2018"}, {"text": "Great app, I wish it would translate the actually pomodoro sessions into actual total minutes or hours and tally that up, because I change my focus times", "stars": 5, "date": "Sep 7, 2018"}, {"text": "Cool thing!", "stars": 5, "date": "Sep 6, 2018"}, {"text": "Love it! I'm a big procrastinator and I used to have problems with going back to work after a break, however this extension really keeps me working and keeps my breaks short and regular. Also the tracker/statistic option keeps me motivated to do at least one pomodoro more than the day before. It has saved me during exam season! Thank you!", "stars": 5, "date": "Sep 5, 2018"}, {"text": "If Marinara can provide function of task editing, the tool will be wonderful.", "stars": 4, "date": "Sep 3, 2018"}, {"text": "great apps. suggestion: notify with fullscreen option", "stars": 5, "date": "Sep 3, 2018"}, {"text": "Very nice, the right way to get things done :)", "stars": 5, "date": "Aug 29, 2018"}, {"text": "Thank you! Works great.", "stars": 5, "date": "Aug 27, 2018"}, {"text": "Thanks for this great helping extension.\nIt would be great if we can control the notification position.", "stars": 4, "date": "Aug 17, 2018"}, {"text": "Unobtrusive, but still effective. This is a perfect way to guarantee those stretch breaks. I love the Github-style progress grid in the history too. I've tried a few Pomodoro apps, and this is my favorite by far.", "stars": 5, "date": "Aug 13, 2018"}, {"text": "I've tried them all, this is the one to go for. Excellent!", "stars": 5, "date": "Aug 12, 2018"}, {"text": "This is the only pomodoro timer I've found that provides an obvious visual cue - which I personally prefer much more than a sound alert. Love it, thanks guys!", "stars": 5, "date": "Aug 7, 2018"}, {"text": "Fantastic extension! It has everything to have productive sessions: timers (adjustable), a pack of sound notifications, option for desktop/new tab notifications and - particularly important for me - the history, which you can import and export! Thank you very much for such a great piece of software.", "stars": 5, "date": "Aug 6, 2018"}, {"text": "B E S T\nE X T E N T I O N\nE V E R", "stars": 5, "date": "Aug 6, 2018"}, {"text": "Very simple and useful!", "stars": 5, "date": "Aug 4, 2018"}, {"text": "It is excellent, it can be helpful if we can have an option to start the Pomodoro cycle as soon as browser is launched, that way we may not forget to start the cycle", "stars": 4, "date": "Aug 3, 2018"}, {"text": "Is there a way to sync your history between browsers?\nfor example chromes in laptop and PC", "stars": 4, "date": "Jul 31, 2018"}, {"text": "It´s good enough! It´s helpful, simple, efficient. Five stars!", "stars": 5, "date": "Jul 30, 2018"}, {"text": "First Impression :\nI have tried many such apps, everything had some imperfections and diluted my purpose, but this one seems perfect in all aspects that i looked for.\n\nAfter a months use :\nI am cutting one star because the app don't auto start upon starting browser. Sometimes I forget to turn this on and thus forget taking breaks.", "stars": 4, "date": "Jul 27, 2018"}, {"text": "Super simple and useful. Best one I saw for Chrome. Really helps with my productivity!", "stars": 5, "date": "Jul 20, 2018"}, {"text": "good - rất tôt\nuseful in time management", "stars": 5, "date": "Jul 17, 2018"}, {"text": "VERY HELPFUL & PRODUCTIVE.", "stars": 5, "date": "Jul 3, 2018"}, {"text": "you made what anyone made!! you put the option \"beats per minute\" very usefull, I like to listen the tictac to remember pomodoro is running but I hate too many beats per minute (60). Thanks for this feature", "stars": 5, "date": "Jun 29, 2018"}, {"text": "best of all pomodaros", "stars": 5, "date": "Jun 28, 2018"}, {"text": "I absolutely love this extension. It does everything that I need. The interface is easy to use and I love being able to see my history. \n\nHere's a few suggestions that I think could turn this app into a superb productivity tool:\n1. A compatible app or other way to use Marinara with a mobile device. Oftentimes I find myself away from my laptop but still wanting to be productive. I usually just use the timer on my phone for this purpose, but I'd love to that that productive time away from my la... Show more", "stars": 5, "date": "Jun 28, 2018"}, {"text": "Best pomodoro app for chrome hands \ndown.", "stars": 5, "date": "Jun 27, 2018"}, {"text": "Clean, easy to use. Love it!", "stars": 5, "date": "Jun 26, 2018"}, {"text": "Very good!", "stars": 4, "date": "Jun 22, 2018"}, {"text": "It would be great if we could click on one day and see not only the quantity of pomodoros done that day, but the distribution, and the option of adding a note to each pomodoro, and still better if we could put a tag and see how many of each tag we did in a period of time. For me it would be awesome cause I'd put the subjects I'm studying on the tags, and then I'd know how much I've studied for that subject.", "stars": 4, "date": "Jun 21, 2018"}, {"text": "easy to use", "stars": 5, "date": "Jun 11, 2018"}, {"text": "Exactly what I was looking for! Thank you! What I really appreciate is that you can change the length of the timer since in my first work block I am shooting for 90 minutes and 50 minutes after that one.", "stars": 5, "date": "Jun 10, 2018"}, {"text": "I love this app. Help me a lot to boost up my productivity. It will be better if we are able to add a pomodoro manually when we forget to turn it on in the first round. Thanks.", "stars": 4, "date": "Jun 7, 2018"}, {"text": "Amazing app that has helped me focus. I really do like the data it shows though I do wish that for the history distribution to show minutes instead of the number of pomodoros. Depending on what I am studying i'll increase or decrease the pomodoro rep.", "stars": 4, "date": "Jun 6, 2018"}, {"text": "Hey, Is there an android app that sync with the extensions data? Thanks!", "stars": 5, "date": "Jun 4, 2018"}, {"text": "This app has JUST enough features to keep me productive. Anything more would be clutter and overkill. I use it for work, and I don't want anything fancier than this. I have ADHD and this app is perfect for me.", "stars": 5, "date": "May 20, 2018"}, {"text": "I like it, but I really wish you could adjust the volume of the sounds that play during and after sessions. If that was added, I'd give this five stars.", "stars": 4, "date": "May 14, 2018"}, {"text": "Love the simplicity and history dashboard :)\n\nI use this to help me focus when I just can't get started. I like that it's a Chrome web extension; it's less intrusive than the desktop and website apps I've used in the past. I don't have to keep an application running/then close it, or keep a tab open/then close it.", "stars": 5, "date": "May 9, 2018"}, {"text": "Awesome tool:)", "stars": 5, "date": "May 7, 2018"}, {"text": "Awesome, I started using it every time I work on laptop \nThanks a lot.\nIt might sound simple or stupid for some, maybe it is but it's working super !! so thanks again", "stars": 5, "date": "May 4, 2018"}, {"text": "Awesome!", "stars": 5, "date": "May 4, 2018"}, {"text": "Best pomodoro app out there. I love the interface, pause/resume, flexibility, and productivity history. Beautiful", "stars": 5, "date": "May 2, 2018"}, {"text": "Very useful extension. I am a web developer and it helps me making my day productive. Also, taking periodic breaks keep you relaxed. Highly recommended to everyone.", "stars": 5, "date": "May 1, 2018"}, {"text": "I've used this tool and love it. I agree - it would be amazing to have a way to track interruptions by noting time and brief description. That would be info I could then share with my manager.", "stars": 5, "date": "Apr 26, 2018"}, {"text": "Really simple and convenient tool. It's exactly what I was looking for!", "stars": 5, "date": "Apr 26, 2018"}, {"text": "Hello Guys, I love this extension. It helps to avoid distractions. We can do lot more on this. \n\nHow can I get pr on git? I have few suggestions to improve this.", "stars": 5, "date": "Apr 24, 2018"}, {"text": "I love this extension. My problem isn't distractions, it's sitting down in one place for too long. This app reminds me to get up every once in a while to move around!\n\nOne feature I'd like to see added: I want the ability to give my Pomodoro sessions a short, 1-line label, and have that captured in history. This way, at the end of the week, I could see something like (6 Pomodoros on Project X, 3 Pomodoros on Project Y, 4 Pomodoros on Project Z, etc.). That would really help me summarize and p... Show more", "stars": 4, "date": "Apr 21, 2018"}, {"text": "The only pomodoro timer I like of the many I have tried. The pomodoro technique has changed my life and this timer has been the enabling tool for that life change.", "stars": 5, "date": "Apr 17, 2018"}, {"text": "Thanks, best pomodoro extension for Chrome", "stars": 5, "date": "Apr 15, 2018"}, {"text": "Really great extension. I just missed the option to edit and/or remove a pomodoro session. This would be very useful when I get interrupted and forget to turn thr timer off. Otherwhise, it's really good.", "stars": 4, "date": "Apr 15, 2018"}, {"text": "Very useful extension.\n\nHope will be created Android app with synching support between extension & app. Maybe with own service.\n\nThank you, dev.", "stars": 5, "date": "Apr 9, 2018"}, {"text": "Love it !", "stars": 5, "date": "Apr 5, 2018"}, {"text": "I like this app, but I can't seem to get the cycles to start automatically. It stops after a focus session, and I have to manually start a rest session. It'd be so much better if they just started automatically.", "stars": 3, "date": "Apr 3, 2018"}, {"text": "amazing thanks", "stars": 5, "date": "Apr 1, 2018"}, {"text": "I love the simplicity of this.... Set your session length. Set your short break and long break length. Choose sound and/or screen notifications. And get to work.\n\nMy productivity has increased tremendously. It's also a fun challenge.", "stars": 5, "date": "Mar 27, 2018"}, {"text": "I have Pomodoro on my phone, but I find myself using this Chrome extension more and more -- it's one less distraction not having to pick up the smartphone!\n\nWould love the ability to label the task I'm working on (not a lot of detail, short 1-3 word descript), and have that visible in the \"history\" section, so at the end of a week, I can quickly see what I focused on during the week.", "stars": 4, "date": "Mar 26, 2018"}, {"text": "Its good. But just enough to make it work. The functionality of having different types of work sessions and later integrating them as a total work time is lacking. I wish you fix that. That will definitely take this extension a level up.", "stars": 3, "date": "Mar 23, 2018"}, {"text": "It only lacks a sound volume bar. Great extension", "stars": 5, "date": "Mar 22, 2018"}, {"text": "This extension is awesome. My only gripe is that I can't reduce the volume of the timer ticking sound.\n\nI really want the ticking on, but it's too loud. However I don't want to just turn my system sound down, because then the alarms will be too quiet.\n\nOtherwise very good.", "stars": 4, "date": "Mar 21, 2018"}, {"text": "My favorite extension, thank you, Chris Schmich!", "stars": 5, "date": "Mar 20, 2018"}, {"text": "Thanks for this extension. Perfectly done indeed.", "stars": 5, "date": "Mar 19, 2018"}, {"text": "I love this extension. It really is very helpful. I wish it had the ability to note distractions, for eg everytime i'm distracted I can click somewhere (seperated by external and internal distractions, so for eg a phone call, colleague, etc are external and me going to look for something on google and going down a youtube spiral is an internal distraction) and it notes that and where i'm working so when I look back I can see where i'm most and least distracted and as well as what types of dis... Show more", "stars": 5, "date": "Mar 16, 2018"}, {"text": "great extension , simple ,  easy to use", "stars": 5, "date": "Mar 16, 2018"}, {"text": "Excellent extension, easy to use and very customisable. I hope soon there will be a mobile app too", "stars": 5, "date": "Mar 14, 2018"}, {"text": "Excellent, excellent, excellent!", "stars": 5, "date": "Mar 9, 2018"}, {"text": "Simple, easy to use. Works! Love it, thank you for making this wonderful extension.", "stars": 5, "date": "Mar 8, 2018"}, {"text": "It is simple and straightforward to use which is important for productivity assistant", "stars": 5, "date": "Mar 7, 2018"}, {"text": "Great app! Can we get a land page with a big clock and simple stats in it?", "stars": 5, "date": "Mar 6, 2018"}, {"text": "Nice App - what I am missing is larger representation of the time ticking, i.e. how much of the current pomodoro is left", "stars": 4, "date": "Mar 6, 2018"}, {"text": "Best Pomodoro app I've ever used! Thanks guys! :)", "stars": 5, "date": "Mar 1, 2018"}, {"text": "This extension has revolutionized my workflow and improved my focus immensely! The options and sounds are wonderful and I appreciate the history feature immensely - it helps me challenge myself to be more productive! I'm thrilled to hear that mobile and desktop versions are in the works, too. I'd like to thank the developers a million times over.", "stars": 5, "date": "Mar 1, 2018"}, {"text": "Needs a repeat/loop option.", "stars": 4, "date": "Feb 24, 2018"}, {"text": "Love this extension, I use it daily to help me keep focused on the task at handle. Great Job!", "stars": 5, "date": "Feb 23, 2018"}, {"text": "Great app, used for half year already. Hope it can sync stats between different PC and maybe one day there will be an app for IOS.", "stars": 5, "date": "Feb 21, 2018"}, {"text": "My dreams has come true. A real Pomodoro app which keeps your track instead of being solely timer. However the history should be kept in the cloud not in the local drive.\n\nEdit (2 year later)\nCan you add the sync function with Drive. I am using more than one computer.", "stars": 4, "date": "Feb 13, 2018"}, {"text": "Excellent app, tested for 3 days already and it works as fine in my Chrome browser. Thank you very much!", "stars": 5, "date": "Feb 8, 2018"}, {"text": "Excellent - simple, easy to use and update times, the history is great. I would love an Android app.", "stars": 5, "date": "Feb 8, 2018"}, {"text": "Doesn't have the blocking domains feature", "stars": 3, "date": "Feb 7, 2018"}, {"text": "i absolutely love it", "stars": 5, "date": "Feb 5, 2018"}, {"text": "I would give 10 stars if we could set custom sounds!", "stars": 5, "date": "Jan 31, 2018"}, {"text": "Better than most desktop implementations!", "stars": 5, "date": "Jan 26, 2018"}, {"text": "Excellent. I've tried various apps, pieces of software, physical timers and more. But this one is the best by far! The one missing feature: have an alert option to play in a loop so it has to be acknowledged. I've been out of the room for a moment and then missed the alert.", "stars": 5, "date": "Jan 24, 2018"}, {"text": "This is the best Pomodoro timer I've found. I've tried probably 5-7 others. I would give ANYTHING - really, anything - for an Android version that would run in sync (or even just freestanding).  I would certainly pay for that.  I mean, I walk away from the computer on a break and I can't hear the timer, so I have to watch my phone or a clock anyway. Combining this with app blocking capacity would be amazing.", "stars": 5, "date": "Jan 23, 2018"}, {"text": "It's really helped me stay on track!", "stars": 5, "date": "Jan 17, 2018"}, {"text": "Easy to use. I tried others but this app suits me the best. I wish there would be a site blocking feature soon.", "stars": 5, "date": "Jan 14, 2018"}, {"text": "Have been using this Pomodoro Technique using a timer on my phone for a while. I was able to write a book within 6 weeks! But this app is way easier then setting the timer on my phone and help me to be even more focus. Love it!!", "stars": 5, "date": "Jan 14, 2018"}, {"text": "An absolutely excellent extension that is boosting my productivity levels! Thanks", "stars": 5, "date": "Jan 9, 2018"}, {"text": "Great.", "stars": 5, "date": "Jan 9, 2018"}, {"text": "this is the best app i used", "stars": 5, "date": "Jan 8, 2018"}, {"text": "very good!", "stars": 5, "date": "Jan 7, 2018"}, {"text": "It's a really good pomodoro extension. I like the customization options, including tick sounds.\n\nThe only feature I would like to have that I haven't found anywhere yet is to receive a reminder notification every morning and/or after some time with the timer disabled or paused. Some people forget to come back to their pomodoro cycles after a long meeting, for instance. Specially beginners who are still getting used to the method.", "stars": 5, "date": "Jan 5, 2018"}, {"text": "Never been so productive. The graphics in the history section are really motivating.", "stars": 5, "date": "Jan 3, 2018"}, {"text": "Just perfect.", "stars": 5, "date": "Jan 3, 2018"}, {"text": "really helpfull!! amazing app!!", "stars": 5, "date": "Jan 2, 2018"}, {"text": "User friendly and great concept. Few points to improve:\n1) Ability to block access to a set of websites while in focus mode.\n2) Let the user rank his/her performance (even comment) for each Pomodoro. This way we can track our progress/performance better.\n3) Share settings & data cross multiple computers.\n4) Ability to configure the volume and duration of alerts.\n\nThank you!", "stars": 5, "date": "Dec 30, 2017"}, {"text": "Helpful thing", "stars": 5, "date": "Dec 28, 2017"}, {"text": "Help me on practicing Pomodoro everyday, and can be perfect if can synchronize between different devices", "stars": 5, "date": "Dec 27, 2017"}, {"text": "Really like the stats feature. 5 stars after blocked websites are added.", "stars": 4, "date": "Dec 23, 2017"}, {"text": "Simply Great.", "stars": 5, "date": "Dec 19, 2017"}, {"text": "This is really great! I would love to have the option to reset my history... Thanks!", "stars": 5, "date": "Dec 17, 2017"}, {"text": "It was simple and easy but if there are short cuts for keyboard to take break and start focus etc., that would be very helpful.", "stars": 3, "date": "Dec 14, 2017"}, {"text": "I simply love this extension: how it works and feels. Maybe it could include an option to track the time spent on different projects separately, but otherwise it's a gem.", "stars": 5, "date": "Dec 14, 2017"}, {"text": "Pretty good Pomodoro timer to help you focus or take a rest.", "stars": 5, "date": "Dec 10, 2017"}, {"text": "This is great and simple, but I think the Daily Distribution feature can be improved - maybe mine has a glitch or something, but it seems to be overlapping my Pomodoros with Pomodoros done yesterday! So it gets confusing when I'm trying to track my current day history.", "stars": 4, "date": "Dec 6, 2017"}, {"text": "simple to use. Exactly what I wanted", "stars": 5, "date": "Dec 5, 2017"}, {"text": "Absolutely the best Pomodoro Timer.", "stars": 5, "date": "Dec 3, 2017"}, {"text": "It would be great if there will be different colors to choose from other than the red pomodoro icon always.", "stars": 5, "date": "Dec 2, 2017"}, {"text": "perfect for a pomodoro app!", "stars": 5, "date": "Nov 21, 2017"}, {"text": "Hi Chris, this is very good I like it a lot its smooth compared to others. A cool feature would be too filter it for a certain task or type of task. Like one for work and another for after work hours so you can compare output at your job vs when your working for yourself. Or by task would work too.\n\n// Edit: 11-19-17\nChris, does the weekly pomodoro tracker restart on Sundays? As in Sunday is the first day of the week when a new pomodoro cycle starts?", "stars": 5, "date": "Nov 14, 2017"}, {"text": "Excellent tool helping me to keep focused on my work! Thank you Chris for offering such a nice timer!", "stars": 5, "date": "Nov 13, 2017"}, {"text": "Great program! Helps combat my history of professional procrastination.", "stars": 5, "date": "Nov 13, 2017"}, {"text": "Top!", "stars": 5, "date": "Nov 11, 2017"}, {"text": "love its able for you to custom like what you want sound time :))", "stars": 5, "date": "Nov 4, 2017"}, {"text": "Great extension. I really like the history stats. I wish that if you didn't click on the start break or start a Pomodoro (focus) the app would continue to count it toward one or the other.", "stars": 4, "date": "Oct 31, 2017"}, {"text": "Perfect! All the times are adjustable, desktop notifications, review function, starts timer with one click and doesn't distract by being a new open tab.\nThe only thing I would wish to be improved is that I can set the starting day of the week to Monday - otherwise, the best pomodoro gadget I could  find!", "stars": 5, "date": "Oct 22, 2017"}, {"text": "Please add synchronization between different workstations with one same google account.", "stars": 5, "date": "Oct 20, 2017"}, {"text": "I do my best work using the pomodoro system, and this is by far my favorite timer/tracking tool. I've used desktop and mobile apps, but this extension is the most useful.\n\nThe ability to track history, see trends over time, and understand what days of the week/time of day I'm most productive has been an asset in my work planning.\n\nIt is a simple and easy-to-use extension, but has all the functionality I need!", "stars": 5, "date": "Oct 12, 2017"}, {"text": "Great tool for tracking my productivity hours. Just one thing though; if you could add what task we are performing in given pomodoro then this would be a killer app.", "stars": 5, "date": "Oct 5, 2017"}, {"text": "I find this to be the best free Pomodoro app available for computers. It's really simple, configurable, and does exactly what you need with none of the nonsense.\n\nI'd like a clearer timeline/history of Pomodoros, however. Right now you only get general trends and that kind of stuff. There's no exact history of the last day/week/whatever. Sometimes I want to know exactly how many pomodoros I did on a given day and when exactly I did them, and that information isn't available.", "stars": 5, "date": "Sep 26, 2017"}, {"text": "I am finding this very effective.", "stars": 5, "date": "Sep 21, 2017"}, {"text": "Really cool updates!\nGood job!\n\nI hope it stay be free :)", "stars": 5, "date": "Sep 12, 2017"}, {"text": "i downloaded this by accident and i have no way to remove it.need a way to remove this from my computer.", "stars": 2, "date": "Sep 10, 2017"}, {"text": "I would like to have better statisctics so that I can better judge my performance. HOw many hours did I work in a day, how many per week? Heat map of the times for a day and for month.", "stars": 5, "date": "Sep 4, 2017"}, {"text": "Great! Use it all the time. Thanks!", "stars": 5, "date": "Aug 25, 2017"}, {"text": "Great app\nP.S. may be you can add 24 hours format in setting", "stars": 5, "date": "Aug 25, 2017"}, {"text": "Nice!", "stars": 5, "date": "Aug 17, 2017"}, {"text": "Use it every day.", "stars": 5, "date": "Aug 17, 2017"}, {"text": "It is sooooo good!  I love the history tab!1", "stars": 5, "date": "Aug 16, 2017"}, {"text": "I love it. simple and reliable. I would love to have sites blocking during pomodoro session though.", "stars": 4, "date": "Aug 16, 2017"}, {"text": "So happy with Marinara; I recommend turning off the new tab notification. I found that I'd lose my place if I already had lots of tabs open and it was a rather jarring end signal. \n\nThis is such a simple and convenient extension. Thank you!", "stars": 5, "date": "Aug 15, 2017"}, {"text": "Keep up the good work.\nIs it possible to change the time of the pomodoros?", "stars": 4, "date": "Aug 12, 2017"}, {"text": "Awesome, no bloat and does just what it's supposed to.", "stars": 5, "date": "Aug 8, 2017"}, {"text": "Really cool update. They added a story, improved ux. Well done guys.", "stars": 5, "date": "Aug 8, 2017"}, {"text": "Nice Chrome extension fer helping to practice the Pomodoro technique.", "stars": 5, "date": "Aug 7, 2017"}, {"text": "Great!", "stars": 5, "date": "Aug 2, 2017"}, {"text": "totally happy with the recent changes. Simple yet very practical. Have tried other extensions, this one is the best", "stars": 5, "date": "Jul 31, 2017"}, {"text": "Chris, it is awesome, very clear and fine application. Thanks a lot!", "stars": 5, "date": "Jul 30, 2017"}, {"text": "Does what it says!", "stars": 5, "date": "Jul 28, 2017"}, {"text": "Quite a brilliant extension. Use it every day.", "stars": 5, "date": "Jul 21, 2017"}, {"text": "Hi Guys awsome extension! Would be nice to have some simple tracking for each pomodoro time... some text place to describe shortly what u have done in that time. Usefull for those who work with lot of different tasks and want to have a overview about it later...\nThanks again! Peace and Love =)", "stars": 5, "date": "Jul 21, 2017"}, {"text": "Very convenient to use. \nCould it be possible to add a log/history function to track all the \"tomatoes\" one has used?", "stars": 5, "date": "Jul 19, 2017"}, {"text": "Update- Pomodoro history functionality added.\n\nWell done. \n\nSo simple, yet so powerful. Just waiting for the update when \"statistics\" feature will get added.", "stars": 5, "date": "Jul 17, 2017"}, {"text": "Nice work, thanks!", "stars": 5, "date": "Jul 14, 2017"}, {"text": "Excellent extension with great functionality. Actively developed, dev responds to requests made on Github and continues to add new functionality. Also, notification tones have been picked well and are pleasant to hear.\n+1", "stars": 5, "date": "Jul 13, 2017"}, {"text": "since the last update with long break and number of pomodoros, LOVE IT", "stars": 5, "date": "Jul 12, 2017"}, {"text": "Latest update is beautiful. The new break intervals and UI is great.", "stars": 5, "date": "Jul 12, 2017"}, {"text": "Latest version has implemented what makes a timer Pomodoro which is the varies break interval. Perfect!", "stars": 5, "date": "Jul 12, 2017"}, {"text": "Awesome update!", "stars": 5, "date": "Jul 12, 2017"}, {"text": "lover", "stars": 5, "date": "Jul 6, 2017"}, {"text": "Missing an important feature: blocking some websites while on a work stretch. Other tools have this. Uninstalled this.", "stars": 2, "date": "Jun 27, 2017"}, {"text": "Hello, I really appreciate this extension. I would like to suggest TWO things: 1. Bigger number on the icon to see time remaining at a quicker glance. \n2. a history to see how many cycles you have done. \n\nWhat a great tool - I am a student and using the pomodoro method has greatly increased my productivity and enjoyment - your timer is really convenient to use.", "stars": 4, "date": "May 17, 2017"}, {"text": "Is there a way to alternate between short and long breaks? That would be awesome to have!", "stars": 3, "date": "May 5, 2017"}, {"text": "Sometime we forget to start this timer when we open chrome. If there is an option to auto start when the chrome starts, then it will be so helpful and I have seen this feature available in other extension.", "stars": 5, "date": "Apr 25, 2017"}, {"text": "I liked the update, but I did not like the change that forces me to click once more on Start Focus or Start Long Interval.\n\nBy the way, thank you for this very useful extension.", "stars": 5, "date": "Apr 15, 2017"}, {"text": "Its great that it gives you the option to stop in the middle and take a break instead of forcing you to wait till the whole time.", "stars": 5, "date": "Mar 31, 2017"}, {"text": "Today: I was learning about different strategies when I came across the Pomodoro timer strategy. I felt like it was the kind of strategy I needed to incorporate in my life and so I found this extensions and it works perfectly! Just a little recommendation (you might have this feature already) but can you add in a little sound when the break is over?", "stars": 5, "date": "Mar 31, 2017"}, {"text": "+1 simple and perfect :-) Can't thank the developer enough.", "stars": 5, "date": "Mar 28, 2017"}, {"text": "Excelent.\n\nThe best i´ve tried.\n\nThank you so much!!!!", "stars": 5, "date": "Mar 15, 2017"}, {"text": "it's good. but it needs some statistics to be perfect.", "stars": 5, "date": "Mar 6, 2017"}, {"text": "It does only and exactly what I need. Alerts me when I need to transition to the next task or break, but doesn't lock me down if I need to extend the period a bit.", "stars": 5, "date": "Mar 3, 2017"}, {"text": "simple, easy & configurable. perfect.", "stars": 5, "date": "Mar 3, 2017"}, {"text": "Simple and Perfect.", "stars": 5, "date": "Feb 23, 2017"}, {"text": "Best pomodoro browser extension I've tried. Notifies you with more than a little toast that is easily ignored :)", "stars": 5, "date": "Feb 16, 2017"}, {"text": "very good", "stars": 5, "date": "Feb 14, 2017"}, {"text": "Best pomodoro timer I've tried. Flexible and user friendly. And works well.", "stars": 5, "date": "Jan 17, 2017"}, {"text": "Tried so many poromodo timer, this is the best for me.", "stars": 5, "date": "Nov 4, 2016"}, {"text": "very good!", "stars": 5, "date": "Sep 9, 2016"}, {"text": "Simple, well designed, customizable, and effective. This is the perfect pomadoro companion!", "stars": 5, "date": "Jan 7, 2016"}, {"text": "That's the one you need. Good notifications, minimal interface. Nothing artificial :)", "stars": 5, "date": "Oct 7, 2015"}, {"text": "Best one :D", "stars": 5, "date": "Sep 16, 2015"}]