[{"text": "like it", "stars": 5, "date": "Mar 6, 2024"}, {"text": "very effective and convenient. I primarily use it to undetectably get rid of ads", "stars": 5, "date": "Feb 21, 2024"}, {"text": "It is a very good extension\nThe problem is that linking to cloud using Google drive does not work", "stars": 5, "date": "Feb 19, 2024"}, {"text": "Stopped using Dark Reader because of this as it was causing lag on a lot of sites. This is the PERFECT replacement for dark themes.", "stars": 5, "date": "Feb 16, 2024"}, {"text": "Much better and less buggy compared to the old Stylish extension", "stars": 5, "date": "Feb 7, 2024"}, {"text": "Great! It works amazing to change the boring old sites that we like, nitrotype.com is where I use it, and it is the best, leave a like if you think Stylus is the GOAT. Let's make this comment the most liked here.", "stars": 5, "date": "Jan 31, 2024"}, {"text": "Outstanding ext. Simple, easy to use and the better part: NO MALWARE.", "stars": 5, "date": "Jan 21, 2024"}, {"text": "The last update (today, Jan.17th, along with Vivaldi update) broke it. Styles don't load, can't create a new style either (the link in the toolbar button dropdown menu is dead). Will update the rating when it's fixed. Thanks.", "stars": 3, "date": "Jan 17, 2024"}, {"text": "bienn", "stars": 3, "date": "Jan 9, 2024"}, {"text": "D O P E", "stars": 5, "date": "Jan 4, 2024"}, {"text": "Stylus is a masterclass on how to do userstyle extensions right, has a button that redirects you to 4 pages (at the time of this review), has a nice, small menu, and is one of the extensions I can't stop thinking about.", "stars": 5, "date": "Dec 19, 2023"}, {"text": "the 1000th review", "stars": 5, "date": "Dec 4, 2023"}, {"text": "IT DOES NOT EVEN WORK THIS STUPID SCAM", "stars": 2, "date": "Nov 29, 2023"}, {"text": "This is one of the MOST IMPORTANT EXTENSIONS I'VE HAD EVER.\n\nThey allow me to tweak websites, I used this for a 2013 YouTube layout transformation, I've made websites look a thousand times better, I've even wrote my own userstyles before (logan on userstyles world, id 430), basically if userstyles never existed, I wouldn't have as good as an experience on the internet I have now.", "stars": 5, "date": "Nov 12, 2023"}, {"text": "super awesome! love that i can force dark mode onto any website i want. gone are the days where i have burned retinas by bright white websites!!", "stars": 5, "date": "Nov 11, 2023"}, {"text": "I didn't understand it at first, but it's cool", "stars": 4, "date": "Sep 27, 2023"}, {"text": "i dont know on how to get the styles but its confusing on how to open it and try to get it at the same time, i tried to watch the youtube video but it didnt help. if anyone knows how to do it please reply", "stars": 3, "date": "Sep 19, 2023"}, {"text": "It's awesome, very good, the best thing is that it doesn't collect your data too, unlike the other ones. Very simple to use too. 10/10", "stars": 5, "date": "Sep 9, 2023"}, {"text": "its hard to figure out how to get themes ngl", "stars": 3, "date": "Sep 9, 2023"}, {"text": "Absolutely perfect!", "stars": 5, "date": "Jul 4, 2023"}, {"text": "Goodbye Stylish, hello Stylus!", "stars": 5, "date": "Jun 21, 2023"}, {"text": "great Stylish alternative, been using it for a while now", "stars": 5, "date": "Jun 1, 2023"}, {"text": "Everything Stylish use to be.  It just lets you write offline CSS for pages, no hassle, no bother, no spam.\n\nThank you for being a viable replacement when Stylish killed its self.", "stars": 5, "date": "May 19, 2023"}, {"text": "Perfect extension for creating custom CSS quickly and painlessly, does everything I want it to do", "stars": 5, "date": "Apr 1, 2023"}, {"text": "this is the go two extension for theming sites. solid 8/10 because there is some questionable themes ive seen. but overall good extension", "stars": 4, "date": "Feb 22, 2023"}, {"text": "why did it download something on my laptop, i saw the download bar thing appear at the bottom but i dont see it in downloads or google downloads", "stars": 3, "date": "Jan 31, 2023"}, {"text": "Best extension to add custom CSS. So glad this exists!", "stars": 5, "date": "Jan 26, 2023"}, {"text": "This is the extension to use if you want to add user CSS. I hope it stays the same.", "stars": 5, "date": "Jan 7, 2023"}, {"text": "The \"URLs starting with\" and \"URLs matching the regexp\" don't work. Everything else's fine though.", "stars": 2, "date": "Dec 16, 2022"}, {"text": "What an impressive extension, this has been very useful for our team that syncs together the CSS styling updates!", "stars": 5, "date": "Nov 30, 2022"}, {"text": "THIS is the extension to trust, even if it has fewer users. get educated about the history: https://en.wikipedia.org/wiki/Stylish\nstay away from \"Stylish\", it was sold to some analytics/SEO company. they likely gather all kinds of data on your surfing behavior and sell it.", "stars": 5, "date": "Nov 16, 2022"}, {"text": "fixed the new youtube layout, thank you", "stars": 5, "date": "Nov 1, 2022"}, {"text": "Experienced an accidentally crash then I lost all my userstyles.", "stars": 1, "date": "Oct 31, 2022"}, {"text": "I love this extension", "stars": 5, "date": "Oct 25, 2022"}, {"text": "Best Stylish replacement. Thanks!", "stars": 5, "date": "Oct 23, 2022"}, {"text": "none of the styles work its just like stylish", "stars": 1, "date": "Oct 19, 2022"}, {"text": "Used it to create a (free) dynamic dark theme as supplemental to \"ChromeTabMouse\".", "stars": 5, "date": "Oct 16, 2022"}, {"text": "this is one of my favorite extensions, it's great for websites that don't have dark mode", "stars": 5, "date": "Oct 13, 2022"}, {"text": "It was all fine until one day it started to make my YouTube very slowwww!!!!!", "stars": 3, "date": "Oct 12, 2022"}, {"text": "Amazing extension overall.\n\nExcept I have just a single concern. Web exclusions dont work. When I try to get a theme for one site, for example, \"instagram.com\". It goes for other websites I visit.\n\nOverall, amazing extension. Will top Stylish with time if you listen to the community :)", "stars": 4, "date": "Oct 11, 2022"}, {"text": "95% of all styles DO NOT WORK!", "stars": 1, "date": "Oct 7, 2022"}, {"text": "Clean and useful!  Great app!", "stars": 5, "date": "Sep 28, 2022"}, {"text": "I forgot to save my work before I shutdown my laptop.\nThe next morning I noticed, that my latest styles are not applied, so I opened stylus and get a popup asking me if I want to restore my latest work which I forgot to save yesterday. I pressed \"YES\" of course but then ALL of my work was gone and I have to start all over again!", "stars": 2, "date": "Sep 16, 2022"}, {"text": "A lot better than Stylish", "stars": 5, "date": "Sep 9, 2022"}, {"text": "this extension is amazing it's a lot more better then stylish", "stars": 5, "date": "Sep 5, 2022"}, {"text": "goddamn finally i can use dark mode instagram instead of stupid stylish :)", "stars": 5, "date": "Aug 31, 2022"}, {"text": "Pretty good honestly!!", "stars": 5, "date": "Aug 20, 2022"}, {"text": "this is better than stylish.", "stars": 5, "date": "Aug 20, 2022"}, {"text": "I'm so glad I found this when I looked up Stylish alternatives, It doesn't have much users currently but with the way Stylish is currently the users will increase in no time especially with the fact that we no longer can edit our own styles, and that we have to pay to use Stylish. \n\nThis is more developer friendly, for free, safe and I should have used it ages ago.", "stars": 5, "date": "Aug 15, 2022"}, {"text": "exporting has little numbers making the css unuseable in some parts", "stars": 1, "date": "Aug 11, 2022"}, {"text": "Great extension, doesn't work on some sites though. (Eg. Codecademy's course interface)", "stars": 4, "date": "Aug 10, 2022"}, {"text": "This is great. For people who look for alternatives to Stylish, you might be happy to know that you can import Stylish JSON backups into Stylus.", "stars": 5, "date": "Jul 23, 2022"}, {"text": "I write my own styles for enhancing specific websites and I'm so glad I migrated to this from Stylish. This is more developer friendly and powerful. I should have migrated years ago.", "stars": 5, "date": "Jul 20, 2022"}, {"text": "Kinda some inappropriate stuff on it. But other than that. It's ok.", "stars": 3, "date": "Jul 15, 2022"}, {"text": "Nicely done!", "stars": 5, "date": "Jul 14, 2022"}, {"text": "Switched to this because Stylish got assumed by some company and has become a mess.  This is pretty much what it used to be and what I need it to do.", "stars": 5, "date": "Jul 13, 2022"}, {"text": "love this extension and mainly use it for roblox but recently all styles have gone completely white (other than the side and top bar) im not sure if this issue is a roblox problem or not but i really hope it gets fixed!", "stars": 3, "date": "Jul 8, 2022"}, {"text": "So recently stylus stopped working on my roblox website, which is very sad bcs I spent a lot of time on it. Please fix this soon, I really do love this extention!", "stars": 3, "date": "Jul 4, 2022"}, {"text": "I tried to use stylish, but it just didn't work. Took the same style I wrote in stylish, copied it to stylus, and it immediately worked.", "stars": 5, "date": "Jul 4, 2022"}, {"text": "I use this every day on nearly every website. Total lifesaver.", "stars": 5, "date": "Jul 2, 2022"}, {"text": "Good for sites like roblox dev fourms where ur eyes burn lmao (using dark modeeee)", "stars": 4, "date": "Jun 29, 2022"}, {"text": "Its a good extension but i cant use it on roblox because the background is only white i tried to see if other themes worked but it was the same problem", "stars": 4, "date": "Jun 29, 2022"}, {"text": "I came here from stylish since that didn't work out and at first it was great until it stopped working in Roblox, it would only show white aside from the side and top bar idk it might be just me.", "stars": 3, "date": "Jun 29, 2022"}, {"text": "Switched to this one from stylish. It is decent.", "stars": 5, "date": "Jun 27, 2022"}, {"text": "I love this extension but on roblox the background is completely white. why is this??", "stars": 5, "date": "Jun 27, 2022"}, {"text": "I've seen recent reviews of other people saying that it isn't working on Roblox for them either. I was very confused when I came onto Roblox and saw that my theme/style wasn't there anymore. I can't tell if this is a bug or new update? Hopefully one of the staff can help resolve this issue and allow us to be able to use the themes on Roblox again. (I've used Stylus for about 8 months now, and this has been the only problem I've seen with it.)", "stars": 4, "date": "Jun 25, 2022"}, {"text": "ROBLOX Styles completely turned white, i'm very sad now.", "stars": 4, "date": "Jun 24, 2022"}, {"text": "I love this extension and I use it for my Roblox, I've had it for maybe.. 2 years? Or more. Today is randomly worked on half my screen but then the background of my Roblox was completely white, I thought this was a glitch so I installed another one but it did the same thing. I hope this gets fixed soon since I really liked this extension.", "stars": 5, "date": "Jun 24, 2022"}, {"text": "It's great I loved using it for nostalgia To get the old Roblox back.", "stars": 5, "date": "Jun 22, 2022"}, {"text": "This is great! If possible, update the Manifest version to v3. Manifest v2 is going away soon...", "stars": 5, "date": "Jun 3, 2022"}, {"text": "its working again now thank you!", "stars": 5, "date": "Jun 1, 2022"}, {"text": "Excellent extension for customizing CSS styles but sadly with recent Chrome update, it stopped working entirely, and it even seems all my custom CSS styles I spent time writing are gone! Hopefully they're still saved somewhere and recoverable with a fix... otherwise, as of this writing (May 31, 2022) this extension is unfortunately utterly broken with latest Chrome update -- dunno if it was the Chrome update or extension update but don't update if you want to keep the extension working! Happy... Show more", "stars": 5, "date": "Jun 1, 2022"}, {"text": "was a great extension, i use it all the time but i think an update came along and it stopped working only on my chromebook. still fine on pc.", "stars": 3, "date": "Jun 1, 2022"}, {"text": "While not only, as reported before, the styles are gone with the update. I cannot create new ones, or use my backups as replacement either.", "stars": 4, "date": "Jun 1, 2022"}, {"text": "Like others have said, a recent update broke it.", "stars": 5, "date": "Jun 1, 2022"}, {"text": "new update broke the extension style browser lol", "stars": 5, "date": "Jun 1, 2022"}, {"text": "The extension is usually great, but with today's update it stopped working and appears as if I have lost all my styles... Hoping that's not true.", "stars": 2, "date": "May 31, 2022"}, {"text": "Works great. A little complex at a first glance, but works very well.", "stars": 5, "date": "May 31, 2022"}, {"text": "Always loved having it, sadly it seems to be broke at the moment, so I hope there will be a fix for this extension very soon.", "stars": 5, "date": "May 31, 2022"}, {"text": "broke overnight\nalso why does this have browser history reading permissions?", "stars": 2, "date": "May 31, 2022"}, {"text": "Pretty good. But recently they updated the extension, and it no longer works. I lost u a style I had been working on for a year.", "stars": 3, "date": "May 31, 2022"}, {"text": "Liked it for the first...maybe 5 months? Then it stopped working.", "stars": 3, "date": "May 31, 2022"}, {"text": "Guys, that new update erased all my styles!", "stars": 5, "date": "May 31, 2022"}, {"text": "Still Stylin' after all these years. Does exactly what it says: It allows me to override styles on websites with CSS rules. In my work, it allows me to remove some \"features\" that making working on our website a pain.", "stars": 5, "date": "May 26, 2022"}, {"text": "awesome! I use gmail styles from here https://dark-by-dm-website.now.sh", "stars": 5, "date": "May 15, 2022"}, {"text": "it is a good extension i like how easy it is and how many websites it supports. my one problem with it is that it makes the website go a bit slow a lot of the time", "stars": 4, "date": "May 13, 2022"}, {"text": "genuinely an amazing extension, as a former stylish user this isn't better in terms of being user friendly but I quickly learned how to use it. I branched off of stylish due to their redundant privacy practices letting them know everything about my personal life. To any stylish users, this is the right way to go.", "stars": 5, "date": "Apr 13, 2022"}, {"text": "i love it, finaly i can remove anoying divs", "stars": 5, "date": "Mar 29, 2022"}, {"text": "I am a long time user of Stylish, and it has recently come to my attention that Stylish is now charging $4 a month just to let me write/use CSS. $4 is half the price of a Disney+ subscription. I am still the one writing the CSS, so $4 to use an extension is straight up robbery. They deserve nothing more than a one-time-fee of $1.99\n\nStylus works just as good. It's interface is a mess compared to Stylish, so I am docking 1-star.", "stars": 4, "date": "Mar 14, 2022"}, {"text": "I had dropped fiddling with CSS, but when I found this inspiring extension, I started again.\nI've never tried Stylish, but Stylus definitely seems like the winner.. at least in philosopy.\n(5/27 ok, I found one issue that might make me try Stylus. It has been noted that Stylus extension does not always work smoothly with new userstyles, I can't get my style to show outside the Style Manager, though if I modify an imported one, that might work)\nAt no fault of the author, I would say that the St... Show more", "stars": 4, "date": "Feb 21, 2022"}, {"text": "this worked on NOTHING absolute garbage", "stars": 1, "date": "Feb 18, 2022"}, {"text": "Better than \"stylish\" this extension not track ur pc and u still can use \"stylish\" theme", "stars": 5, "date": "Feb 10, 2022"}, {"text": "There are lots comments here comparing \"Stylus\" to \"Stylish.\" I'm a former user of Stylish, so I've had a few years to experience both of these extensions. Here is what I have found:\n\nBoth are used to change the themes of web sites to your preferences, using \"style\" scripts, that are added to the extension, which are assigned to activate for specific websites e.g. Amazon, YouTube, etc. If you have the Stylus extension pinned, it shows a badge when your installed styles are activated for your ... Show more", "stars": 5, "date": "Jan 12, 2022"}, {"text": "Like it!", "stars": 5, "date": "Jan 10, 2022"}, {"text": "It can read my browser history", "stars": 2, "date": "Jan 9, 2022"}, {"text": "Srry Just No Use For Me It Rlly Don't Work", "stars": 1, "date": "Dec 7, 2021"}, {"text": "Amazing Works great!😄", "stars": 5, "date": "Oct 27, 2021"}, {"text": "A must-have tool on my list.", "stars": 5, "date": "Oct 23, 2021"}, {"text": "It's really good. I've been using this extension for a long time now. I can confirm it works but depending on the device it may be slow.", "stars": 4, "date": "Aug 29, 2021"}, {"text": "I still dont know how to change my backround my friend will teach me that but its perfect accept for the fact that i cant change my backroub and and stuff", "stars": 3, "date": "Aug 26, 2021"}, {"text": "did not work", "stars": 1, "date": "Aug 25, 2021"}, {"text": "God it's so good", "stars": 5, "date": "Aug 25, 2021"}, {"text": "i have no idea how it works", "stars": 1, "date": "Aug 23, 2021"}, {"text": "This Extension is fantastic. The one I use the most. However, since a week ago, I can not see my ISSUES pointed on the EDITOR as it use to do before, similar to spell check. I have searched and searched and searched and I could not find how to enable this again. Is there any one who kindly help me with it?", "stars": 5, "date": "Aug 18, 2021"}, {"text": "Excellent. I would like to see the style sheet editor open in a separate window without unnecessary things like tab bars, which take up a lot of space here.", "stars": 5, "date": "Aug 16, 2021"}, {"text": "It very laggy the website so it takes forever for the page to load.(My wifi is completely good)Next I delete some of the styles which then after still appear.I've really like it but it just these 2 major problems that I struggle with.One thing I'm not really ticked off about but is a little mad is,that some styles don't work and they show a review saying it's bad which I'm wondering why even put that in the front page for people to download it?So if your a person who can't wait awhile this is... Show more", "stars": 3, "date": "Aug 11, 2021"}, {"text": "finally got old roblox back", "stars": 5, "date": "Aug 7, 2021"}, {"text": "The only bad things are:\n1) You can't upload to uso.kkx.one\n2) You can't search from UserStyles World\nOtherwise this is amazing, follows its motto and I strongly reccommend it to anyone, from the youngest gamers to the greatest programmers.", "stars": 5, "date": "Aug 3, 2021"}, {"text": "Its good, but i'm just not sure its safe.", "stars": 3, "date": "Jul 31, 2021"}, {"text": "Doesn't work. I tried Stylish and it is 100x better than this. 0/10 would not recommend. Also the interface looks sketchy.", "stars": 1, "date": "Jul 30, 2021"}, {"text": "seems good in vids and stuff but I have no idea how to get to the website", "stars": 3, "date": "Jul 30, 2021"}, {"text": "This is the best extension I've ever seen.", "stars": 5, "date": "Jul 30, 2021"}, {"text": "Its a bit slow but All I need to do is be paitent", "stars": 4, "date": "Jul 30, 2021"}, {"text": "very nice and worked, better than stylish. i couldn't fine my desired theme but, overall 10/10.", "stars": 5, "date": "Jul 29, 2021"}, {"text": "it was good but it had a few bugs", "stars": 3, "date": "Jul 14, 2021"}, {"text": "It personally worked for me!!!! It's very nice and sets a better mood. It was really easy setting up and I did it with not tutorial. I have a question though.....Is there a way to add your own things?", "stars": 5, "date": "Jul 8, 2021"}, {"text": "im no coder", "stars": 3, "date": "Jun 29, 2021"}, {"text": "I love it it work's grate unlike stylish", "stars": 5, "date": "Jun 11, 2021"}, {"text": "The works Perfectly and its not called \"stylish\" its called \"stylus\" it made my google chrome not plain boring white ty", "stars": 5, "date": "Jun 11, 2021"}, {"text": "it worked fine at first. then after a while, it stopped working. now, when i try to install a style it just says \"The style is installed but it doesn't apply to the current site URL.\".", "stars": 3, "date": "Jun 7, 2021"}, {"text": "i like it i played roblox since 2016 and this logo is really nice i dont have UGLY cheezit logo", "stars": 5, "date": "May 31, 2021"}, {"text": "works... but i get 40 percent cpu usage in google sometimes", "stars": 3, "date": "Apr 24, 2021"}, {"text": "BROO ITS SO GOOD I WOULD GET IT IF IT COSTED LIKE 100000 DOLLARS XD", "stars": 5, "date": "Apr 19, 2021"}, {"text": "Can't sync with google drive [Failed to acquire lock] on Mac Big Sur", "stars": 2, "date": "Apr 12, 2021"}, {"text": "This is... BEAUTIFUL! I honestly LOVE this extention. I was about to cry when I installed stylish and IMMEDIATELY uninstalled it when i saw this. I love it so much! Recommended!", "stars": 5, "date": "Apr 11, 2021"}, {"text": "it worked! i tried it on another account", "stars": 5, "date": "Mar 27, 2021"}, {"text": "All I want to say is that thank you!", "stars": 5, "date": "Mar 22, 2021"}, {"text": "Advanced customization with css", "stars": 5, "date": "Mar 20, 2021"}, {"text": "Love you guys! Keep up the amazing work!", "stars": 5, "date": "Mar 16, 2021"}, {"text": "After Stylish stopped working for me at all. I tried this and it works amazingly!!! I just got this today and I'm already impressed", "stars": 5, "date": "Mar 15, 2021"}, {"text": "so when ever i add it to chrome it downloads a file of spam called like dhuewjhjfjrekfujadswhjfl or something which freaks me out i think thats malware so ima remove it overall pretty much pretty well made", "stars": 5, "date": "Mar 13, 2021"}, {"text": "amazing!! i love this extension so much, its super safe and it doesn't take like an hour to load. i would recommend this to anyone who wants to customize a site they use. there are also custom cursors!!!!", "stars": 5, "date": "Mar 10, 2021"}, {"text": "Thumbs for not collecting user data", "stars": 5, "date": "Mar 8, 2021"}, {"text": "very nice extension", "stars": 5, "date": "Mar 5, 2021"}, {"text": "bad, i can not open it I NEED HELPPPPPP ;-;", "stars": 1, "date": "Mar 5, 2021"}, {"text": "Its okay but it changed my cursor and also bugs out my google whenever i change a theme", "stars": 3, "date": "Mar 2, 2021"}, {"text": "this sucks if i try to import styles nothing happens\n\n>:(", "stars": 1, "date": "Feb 22, 2021"}, {"text": "i like it but it takes a long time for the website to load not gonna lie", "stars": 4, "date": "Feb 13, 2021"}, {"text": "i love this!!", "stars": 5, "date": "Feb 9, 2021"}, {"text": "I like this much better than stylish. stylish didn't even work. but i have one problem. i am on macOS and it claims to work on mac and window but some of the styles dont work. i mostly wanted the anime ones but those and more wont show up on my google tab. some work but not all.", "stars": 3, "date": "Feb 6, 2021"}, {"text": "Keeps opening google login popup", "stars": 2, "date": "Feb 5, 2021"}, {"text": "Why does the new version randomly pop up a new window every few hours for like 2 seconds? What is it doing? Any way to disable it?", "stars": 5, "date": "Feb 5, 2021"}, {"text": "Hey there! So, I love this extension. But when I load the userstyles page everything takes forever to load. Is anyone else having this issue?", "stars": 5, "date": "Jan 30, 2021"}, {"text": "Horrible and confusing", "stars": 1, "date": "Jan 24, 2021"}, {"text": "this doesnt take browser data its awesome!", "stars": 5, "date": "Jan 23, 2021"}, {"text": "very slow (minutes!) to load styles inline when pressing \"find styles\".. makes it close to bein useless with suh delays..", "stars": 3, "date": "Jan 20, 2021"}, {"text": "To the people saying stylish is better, stylish collects your browsing history.", "stars": 4, "date": "Jan 16, 2021"}, {"text": "It's good from what I've heard, but idk how to use it- LOL", "stars": 5, "date": "Jan 15, 2021"}, {"text": "I was actually just looking for some dark GitLab style, but this is even better! Highly customizable, works like charm.", "stars": 5, "date": "Jan 15, 2021"}, {"text": "I used this for ROBLOX and I loved it! 5/5!!!", "stars": 5, "date": "Jan 8, 2021"}, {"text": "It's cool but it loads pretty long. It is better than Stylish though because Stylish barely has any themes and it collects browser data.", "stars": 3, "date": "Dec 15, 2020"}, {"text": "Why does the \"find more themes\" lead me to Stylish's site?", "stars": 1, "date": "Dec 12, 2020"}, {"text": "Clean and functional way to apply style changes by domain or URL. Great CSS editor included.", "stars": 5, "date": "Dec 3, 2020"}, {"text": "This is very awesome! I use it for Roblox, and unlike Stylish, it doesn't contain spyware.", "stars": 5, "date": "Dec 2, 2020"}, {"text": "How many people only download this for a Github Dark theme?", "stars": 4, "date": "Nov 16, 2020"}, {"text": "this is garbage. first of all i cant even set a wallpaper for roblox and many other youtubers have it. when i go to creat my own, its asking me for a programming code???? WORST EXTENSION EVER AND WAYY WORSE THAN STYLISH(stylish is also bad so im out of luck) plss share this is really bad", "stars": 1, "date": "Oct 27, 2020"}, {"text": "umm... this just takes me to the stylish website", "stars": 1, "date": "Oct 12, 2020"}, {"text": "this extension is so good, i have done one style for my horrible virtual class and is awesome, thanks for making this c:", "stars": 5, "date": "Oct 11, 2020"}, {"text": "ok", "stars": 4, "date": "Oct 8, 2020"}, {"text": "It was cool and allowed you to change themes and made everything fancier, but the problem is that on startup, it won't load properly, you had to reload a page before it would work. But today, Stylus decided to stop working altogether. Please improve this problem so I could use this app nicely again.", "stars": 2, "date": "Oct 1, 2020"}, {"text": "I love that unlike the \"Stylish\" extension (on which this one is based) it doesn't steal my private data, and the backups actually work! Good job & thx to the contributors!", "stars": 5, "date": "Sep 15, 2020"}, {"text": "This plugin was originally very helpful, and had a great community. For the last couple months, it's extensive, community curated list of styles has been down. This means that any styles you want to use you are required to write yourself, which becomes taxing and annoying when apps like DarkReader already exist. Stylus's library of already created styles was it's strongsuit, and with that gone, this plugin doesn't really have much reason to exist.", "stars": 2, "date": "Sep 13, 2020"}, {"text": "SLOWEST. EXTENSION. EVER!!!! Sure, it does work, but it takes 15-20 minutes for its own site to load! Don't get this product, it's horrible!", "stars": 2, "date": "Sep 13, 2020"}, {"text": "good", "stars": 4, "date": "Sep 12, 2020"}, {"text": "bye it runs so slow , and none of my other tabs do that.", "stars": 3, "date": "Sep 12, 2020"}, {"text": "Userstyles site has been running slowly and is frequently down. Googling the issue revealed a lot of discussion on the problem, and it may be the project has been abandoned.\n\nEven if you manage to get into the Userstyles site, the search functionality is pure garbage. You can't search by recent or recently updated, only a handful of styles are shown on each page (so have fun browsing through 100+ pages with 20+ second load times on each page) and the whole thing reeks of a highschool student'... Show more", "stars": 1, "date": "Sep 11, 2020"}, {"text": "this is more than amazing its perfect!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!! omg i love this", "stars": 4, "date": "Sep 6, 2020"}, {"text": "That is so CUTEEEE i love it!", "stars": 5, "date": "Aug 28, 2020"}, {"text": "cooler than Stylish", "stars": 5, "date": "Aug 27, 2020"}, {"text": "i dont undrestand how to use it it doesn't work sorry 1 star only", "stars": 1, "date": "Aug 25, 2020"}, {"text": "Please dont steal my data. Every youtube video says Stylus and stylish. Please someone tell me this exstention is safe", "stars": 3, "date": "Aug 25, 2020"}, {"text": "Back in late 2018 - 2019 using this extension was absolutely fantastic - I was able to find and create different themes easily, but since early 2020, the userstyles site always took ages to load up, and now I always get a 504 Gateway Time-out error when I try to access the site.\n\nI hope at one point that the site gets back up again - there are a few userstyles I miss and really want to import again, but sadly I cannot.\n\nIf the site did not flop, I would give this a 5 star, no questions asked,... Show more", "stars": 4, "date": "Aug 24, 2020"}, {"text": "Works 1% of the time. Worst extension in this store.", "stars": 1, "date": "Aug 14, 2020"}, {"text": "LOVE IT USE it for scratch love it", "stars": 5, "date": "Aug 13, 2020"}, {"text": "Just perfect; love it!", "stars": 5, "date": "Aug 9, 2020"}, {"text": "It adds customization to websites, though the website has to be mostly popular for it to have any styles.  Definitely adds more style to YouTube and other sites alike.", "stars": 5, "date": "Aug 5, 2020"}, {"text": "Sometimes it just looses all your styles. 😐", "stars": 3, "date": "Aug 1, 2020"}, {"text": "Write me roblox so zap star code bla bla bla", "stars": 5, "date": "Jul 26, 2020"}, {"text": "I depend on Stylish as a daily driver for my web app design work. I can't imagine having a browser without it. IMPORTANT: TURN ON Manage > Options > Sync to Cloud! I almost lost 400 hand-crafted styles to the browser marking the extension as \"corrupted,\" but a backup saved the day.\n\nAfter mourning the commercialization of Stylish, which I'd used for years until its desecration, I was blown away by the high-quality work done on the StylUS fork.", "stars": 5, "date": "Jul 24, 2020"}, {"text": "Worked perfectly fine until it completely broke a few days ago. All my styles are gone, and I can't even find styles when I search for them via the extension. What happened? Hoping it gets fixed and I get my styles back", "stars": 3, "date": "Jul 11, 2020"}, {"text": "GREAT! <3             it is awesome and you can do soooo much  with it", "stars": 5, "date": "Jul 9, 2020"}, {"text": "Cant find any styles without waiting for the site to load for 10 minutes. It is like their website is using dial up or something. The styles are cool once it loads though.", "stars": 2, "date": "Jul 6, 2020"}, {"text": "Very useful extension, surprisingly lightweight.", "stars": 5, "date": "Jul 2, 2020"}, {"text": "It didn't show any styles on any website. Even the Stylus website did not load at all\nwhat happened", "stars": 3, "date": "Jun 30, 2020"}, {"text": "nothing is working. no styles are functional. please fix ASAP", "stars": 2, "date": "Jun 30, 2020"}, {"text": "So is this \"Stylus\" or \"Stylish\"? The extension say Stylus but at the bottom of the page it says Stylish. Also, I'm no developer or anything but trying to add a new theme takes FOREVER! Everything else I do on my computer is amazingly fast but each theme or refresh takes about 3 minutes to load.", "stars": 1, "date": "Jun 28, 2020"}, {"text": "Stylus vs. Stylish\ntl;dr: Stylus is good, Stylish is bad\n\nStylus\n⭐ Features and functionalities are built for free by open-source contributions by the open-source community.\n⭐ Still actively updated even now as the time of writing.\n⭐ Superior interface design, usability for both target types: end-users and stylesheet editing users.\n⭐ They care about your happiness.\n\nStylish\n🔪 Stylish is for-profit software with zero interest in improving users' experience, non-existence customer support\n🔪 S... Show more", "stars": 5, "date": "Jun 28, 2020"}, {"text": "its perfectly fine but recently deleted all my styles and its kinda annoying. good thing i copied it to a google docs document before it happened. however, it wont let me save the style i pasted onto the page", "stars": 4, "date": "Jun 27, 2020"}, {"text": "I LOVE IT but... it only lets me go to 2 pages of the styles for websites but then it stops other than that it is AMAZING!!", "stars": 4, "date": "Jun 25, 2020"}, {"text": "Was working great until recently, now the search often returns a \"0\", and today it deleted all my styles!", "stars": 2, "date": "Apr 9, 2020"}, {"text": "This Extension is Perfect for Users who have a Job, or Other Help. The Coding Seems hard tho, and what I don't know is that if you have something else installed that's a Theme, and you would put Another theme, but by Stylus Extension, would it Glitch together? Anyways, what I don't like is that you can't put themes on some Sites, maybe it's for Safety, or whatever. I love Stylus, and i'm sure you'll do as-well!", "stars": 4, "date": "Apr 9, 2020"}, {"text": "All settings were cleared including all styles I had. Second time this has happened. Good thing I had a backup.", "stars": 2, "date": "Mar 31, 2020"}, {"text": "Good tool :)", "stars": 5, "date": "Mar 29, 2020"}, {"text": "It was okay...but now it's not working on my tumblr and i'm upset. Please fix!", "stars": 3, "date": "Mar 28, 2020"}, {"text": "Was working great but not sure whats happening now. \nAll styles get deleted randomly and I can't reproduce it. Sometimes its within the day, sometimes in a week.", "stars": 3, "date": "Mar 24, 2020"}, {"text": "So um! People who are scared if this Dose something or Changes ur data..WELL IT DOSENT! As you see Stylish was doing it-And now Sylish is now Removed! So no need to worry! And I love this mAkes me Really HAppy :3", "stars": 5, "date": "Mar 19, 2020"}, {"text": "This is such a good thing. It made me smile every \ntime I changed the background or my screen.", "stars": 5, "date": "Jan 26, 2020"}, {"text": "An extension that allows custom userstyles by using CSS (mostly). I created some styles myself and with a bit of practice it goes really easy. Do not download stylish, because it's basically malware. Stylus is where it's at.", "stars": 5, "date": "Jan 22, 2020"}, {"text": "its GREAT it let me change my rolblox background", "stars": 5, "date": "Dec 30, 2019"}, {"text": "It's great! not only does it change the theme, some have scripts to enchance your experience! just like on roblox, everyone wished to get a custom background. Voila! here it is, stylus unlike stylish", "stars": 5, "date": "Dec 22, 2019"}, {"text": "This is a great extension to add on websites like: Roblox, Youtube, and more! I hope everyone enjoys it.  I like it!", "stars": 4, "date": "Dec 21, 2019"}, {"text": "better than styl\"ish\"", "stars": 5, "date": "Dec 8, 2019"}, {"text": "The best. Thanks", "stars": 5, "date": "Dec 4, 2019"}, {"text": "Love it.", "stars": 5, "date": "Nov 19, 2019"}, {"text": "Really good for jira and confluence", "stars": 5, "date": "Nov 7, 2019"}, {"text": "nice", "stars": 5, "date": "Oct 31, 2019"}, {"text": "Okay, so, I was dumb enough to accidentally download \"Stylish\", the spyware version of this. Luckily, my friend told me what was up and I managed to delete it and change all of my passwords just in time. I tried this one out, and speaking from the reviews, this one is completely safe! The styles are so cute too!", "stars": 5, "date": "Oct 30, 2019"}, {"text": "I just asked myself \"why doesn't Stylus sync my styles across my browser sessions opened under my Google account?\" And then I saw the import/export capability. Yet another feature catches me by surprise. I imported my work styles to my home desktop--styles originating from the community and enhanced by me for my needs. You rock, Stylus.", "stars": 5, "date": "Oct 24, 2019"}, {"text": "Thank you for saving my eyes", "stars": 5, "date": "Oct 6, 2019"}, {"text": "I installed this to fix a sites' recent \"redesign\" that made their site just dreadful to use. Thanks!", "stars": 5, "date": "Sep 26, 2019"}, {"text": "No longer functioning, cannot download new styles. Wallpapers are broken images files. Website gives error message. Please fix. Used to love this extension.", "stars": 1, "date": "Sep 21, 2019"}, {"text": "Works as good if not better than stylish, has smaller icons for activating and deactivating styles, so if you have more than 2 you don't need to scroll like you do in stylish. And best of all they aren't know for tracking all your browser data to an extreme degree like stylish is.", "stars": 5, "date": "Sep 15, 2019"}, {"text": "Amazing!", "stars": 5, "date": "Sep 11, 2019"}, {"text": "i can't open https://userstyles.org", "stars": 5, "date": "Sep 2, 2019"}, {"text": "Discovered this at the perfect time. So clean. <3", "stars": 5, "date": "Aug 31, 2019"}, {"text": "I have used this app for a while now, and it has not gave me any problems at all while using it.\nI would say, if you added something like colour themes, it would be much easier.\nThis app is very good at changing the backgrounds, it's excellent in my opinion.\n\nThank-you for taking the time out of your day to read this.", "stars": 4, "date": "Aug 25, 2019"}, {"text": "Why everytime i download it, it automatically removed?", "stars": 4, "date": "Aug 23, 2019"}, {"text": "Works perfectly, thank you!", "stars": 5, "date": "Aug 19, 2019"}, {"text": "Works great for giving me dark mode on Google Calendar and other sites. Thanks.", "stars": 5, "date": "Aug 16, 2019"}, {"text": "Love this extension but the options panel is all shaking: https://i.imgur.com/XMQKvhv.gifv", "stars": 5, "date": "Aug 12, 2019"}, {"text": "I hate this... this is a very decent copy of ''Stylish''!", "stars": 1, "date": "Aug 3, 2019"}, {"text": "It was an awesome app until it triggered a Bing Redirect Virus on my browser. Easy to get rid of, all I did was uninstall the app and everything was fixed. But until that's addressed and taken care of, I won't be using it anymore.", "stars": 2, "date": "Jul 16, 2019"}, {"text": "This app is one of my favorite apps to use and customize my roblox page! This app is amazing!!", "stars": 5, "date": "Jul 15, 2019"}, {"text": "At least its stylish without malware servers attached to it! I don't want my browser data collected thankyou very much! This is stylish thats actually being dev'd so can't complain. I've written ten nocturnal stylesheets in the past few days.", "stars": 5, "date": "Jul 13, 2019"}, {"text": "Its Very Awesome Its VERY COOL!!", "stars": 5, "date": "Jul 12, 2019"}, {"text": "well \nWhen I look at all my stuff I dont see it", "stars": 2, "date": "Jul 9, 2019"}, {"text": "better than stylish", "stars": 5, "date": "May 31, 2019"}, {"text": "Worked perfectly.", "stars": 5, "date": "May 29, 2019"}, {"text": "This is probally my favorite extension or chrome, i can easily make my own userstyles and put them online.", "stars": 5, "date": "May 15, 2019"}, {"text": "great work", "stars": 5, "date": "May 7, 2019"}, {"text": "Does what Stylish did without spying on you. Magic CSS (https://chrome.google.com/webstore/detail/live-editor-for-css-less/ifhikkcafabcgolfjegfcgloomalapol) is a great visual tool for creating scripts that you can paste into Stylus. I'm not affiliated with Magic CSS, only a user. FOR DEV: I would suggest giving an option to use openusercss.org instead of userstyles.org for searching for userstyles.", "stars": 5, "date": "Apr 23, 2019"}, {"text": "It's ok, but interface could be better", "stars": 5, "date": "Apr 20, 2019"}, {"text": "This makes the internet so much more pleasurable to browse, especially at night! Night modes FTW!", "stars": 5, "date": "Apr 17, 2019"}, {"text": "its really good if u dont know try it out seriously.", "stars": 5, "date": "Apr 9, 2019"}, {"text": "The best for my purpose:\n\nA:visited {color: purple !important}\nA:hover {color: red !important; text-decoration: underline !important}\n\nAlso smaller and safer than Stylish!", "stars": 5, "date": "Mar 28, 2019"}, {"text": "It's Stylish without the shady spying practices. Works great.", "stars": 5, "date": "Mar 8, 2019"}, {"text": "Works perfectly. I like how you can mix and match themes, too.", "stars": 5, "date": "Feb 14, 2019"}, {"text": "It was perfect, but suddendly it started to unread all the styles once in a while for no apparent reason. Reloading the add-on works as temporal fix. I'm on Brave BTW, i hope it's not that the issue.", "stars": 3, "date": "Feb 13, 2019"}, {"text": "Its great makes my stuff look WAY BETTER", "stars": 5, "date": "Feb 5, 2019"}, {"text": "Unlike \"Stylish\", this extension is not owned by a web analytics company for the sole purpose of collecting browser histories.", "stars": 5, "date": "Jan 24, 2019"}, {"text": "This was a amazing chrome extension, now my friends are jealous of my chrome background's :D", "stars": 5, "date": "Jan 24, 2019"}, {"text": "Has NO effect at all on my version of Chrome in Windows 7.", "stars": 1, "date": "Dec 22, 2018"}, {"text": "Works great...\n\nit's called stylus but only supports css", "stars": 4, "date": "Dec 11, 2018"}, {"text": "Great extension! This and Taper Monkey together allowed me to create an awesome Workflowy theme and color code my tags and bullets. Now if only I could find a similar solution for ios mobile browsers!", "stars": 5, "date": "Dec 11, 2018"}, {"text": "Don't get me wrong. I love this extension. I use it all the time! But... recently, all of my saved styles just disappeared. I've never backed them up or published them. I'm unsure of if they have just disappeared, or were relocated for some reason, but I used a lot of styles on a lot of websites and I am not happy that they've all just disappeared.\n\nIf there is a fix for this, or they have indeed been moved somewhere, I will change this accordingly.", "stars": 2, "date": "Dec 9, 2018"}, {"text": "good", "stars": 5, "date": "Dec 6, 2018"}, {"text": "Just installed it and imported styles from stylish \nThere's annoying issue with Facebook style (for now) that causes the website to flash back to the original style and then flash back to the custom style\nWith a dark style it looks like lightnings :P", "stars": 4, "date": "Dec 6, 2018"}, {"text": "Most up to date version is having issues with the inline style sheet. It is giving me a 400 error even after uninstall and reinstall. If this was fixed, the review I am leaving would be 5 stars. Amazing extension other than this one issue.", "stars": 4, "date": "Nov 29, 2018"}, {"text": "FF Version 63.0\nWin 7\nVersion 1.5.0\nHi the latest version of stylus breaks my Telus Webmail in FF and won't let me see my e-mails.\nI don't use Stylus on that site but I use it for other sites.\nOnce I went back to the previous version M=my e-mail works again.\nThere must be something in your latest version that is effecting it.\nSo for now I will just stay with the previous version till it's fixed.\nThanks", "stars": 4, "date": "Nov 28, 2018"}, {"text": "good", "stars": 4, "date": "Nov 27, 2018"}, {"text": "This is a great extension! I love it! Is there any way to sync your themes?", "stars": 5, "date": "Nov 27, 2018"}, {"text": "It doesn't work on Chrome v72, old styles & rules has gone.", "stars": 4, "date": "Nov 21, 2018"}, {"text": "This extension worked great up until yesterday when suddenly all of my themes and add-ons were removed. I can't install any new ones either. I saw that some people were having issues running it on newer versions of Chrome, but I'm running an older version of Chrome. I hope this gets fixed soon, otherwise I'll be looking for another extension to use my themes.", "stars": 3, "date": "Nov 21, 2018"}, {"text": "latest version does not work at all.  None of my styles shows up, the editor is just a blank panel.  The right panel just seems to not be there at all.  I've checked the extensions database, and all of my styles are still in it.  But no editor pane, no manage pane, and the styles are not functioning on the web pages they were designed to.", "stars": 1, "date": "Nov 19, 2018"}, {"text": "Es Genial Stylus", "stars": 5, "date": "Nov 19, 2018"}, {"text": "Works very nice with Dark Reader, using Stylus for main web sites and Dark Reader for the rest seems to be the best combination I could make so far", "stars": 5, "date": "Nov 10, 2018"}, {"text": "like it but i wanna know if its safe.", "stars": 3, "date": "Nov 2, 2018"}, {"text": "Amazing! Been using since i found out about Stylish stealing UPD. great job guys!", "stars": 5, "date": "Nov 1, 2018"}, {"text": "Somehow all installed styles just disappeared from the extension.", "stars": 2, "date": "Oct 31, 2018"}, {"text": "Very good extension.\n2018-10-27: 223,453 users", "stars": 5, "date": "Oct 27, 2018"}, {"text": "better alternative to Stylish!", "stars": 5, "date": "Oct 18, 2018"}, {"text": "Neat and clean Management UI and still powerful features.\nBest that it's opensource and will not tracking your browsing history. :D", "stars": 5, "date": "Oct 9, 2018"}, {"text": "Thank you. Ever since Stylish was unmasked as yet another rear-end conspirator, there's been a void. This is great. Exactly what I needed. Usability sucks donkey but that's because the only people that know how to make such beautiful extensions are so geek minded it's impressive. Not gonna take a single point off the rating for the user experience being boxy, ambiguous, and less than delightful. Thank you for providing a solution. Cheers!", "stars": 5, "date": "Oct 5, 2018"}, {"text": "I loved it", "stars": 5, "date": "Oct 5, 2018"}, {"text": "its GREAT", "stars": 5, "date": "Oct 4, 2018"}, {"text": "Excellent extension. The fact that it's open sourced makes it that much better.", "stars": 5, "date": "Sep 26, 2018"}, {"text": "Awesome open-source alternative to Stylish that doesn't have extra garbage or tracking. Works perfectly.", "stars": 5, "date": "Sep 23, 2018"}, {"text": "Very good replacement of Stylish.\nThank you.", "stars": 5, "date": "Sep 22, 2018"}, {"text": "Really need to sync my installed styles between different computers. Consider adding a sync function with chrome sync.", "stars": 4, "date": "Sep 20, 2018"}, {"text": "good", "stars": 5, "date": "Sep 18, 2018"}, {"text": "Crashes roughly twice a day.\nUsing: Chrome 69 on MS W10\nUsage: That computer is mostly used to browse the web and watch Netflix.\nExtension usage: 2 styles installed, for Stack Overflow and Github.", "stars": 4, "date": "Sep 17, 2018"}, {"text": "All the userstyles I install get removed at random. idk why", "stars": 2, "date": "Sep 15, 2018"}, {"text": "I like it!! Thanks Stylus Developer.", "stars": 5, "date": "Sep 13, 2018"}, {"text": "I have a probrem when moving from Stylish to here. The extension changed the position of all tabs after I open chrome. Please fix it as soon as possible. I'm using Chrome 68 and Windows 10.", "stars": 4, "date": "Sep 12, 2018"}, {"text": "good~~~ like~~~", "stars": 5, "date": "Sep 11, 2018"}, {"text": "Love it. Should be integrated into the browser. Looking forward to an interface for adding exceptions to global styles (or auto-adding exceptions to global styles when site-specific styles are installed) and native browser syncing.", "stars": 5, "date": "Sep 11, 2018"}, {"text": "Great site. I like how certain sites look with this extension what I don't understand is why it is not working properly with the email gmail. when I want to change how my gmail looks it shows to me the following message: \"Could not communicat­e with the page. Try reloading the tab.\nStylus can access file:// URLs only if you enable the correspond­ing checkbox for Stylus extension on chrome://extensions page.\" Will someone please be kind enough to explain why this and fix this issue please?", "stars": 4, "date": "Sep 9, 2018"}, {"text": "simple and IT WORKS!", "stars": 5, "date": "Sep 8, 2018"}, {"text": "its ok..BUT the thing that is VERY BAD is :when editing a site the TAB'S NAME is the SAME as the site's name ..instead of calling the tab something like \"editing\"..please ..i hope u understand my english and fix this problem ..THANKS", "stars": 3, "date": "Sep 8, 2018"}, {"text": "Please add an exclude function along with the applies-to function", "stars": 4, "date": "Sep 5, 2018"}, {"text": "I just found out about the whole Stylish scandal and I'm livid. Stylish used to be one of my favorite extensions and they just betrayed my (and other people's) trust.", "stars": 5, "date": "Aug 31, 2018"}, {"text": "Does exactly as I'd expect. The \"Live preview\" feature makes it super convenient to see what you're doing. Great work!", "stars": 5, "date": "Aug 27, 2018"}, {"text": "No spying means everything to me", "stars": 5, "date": "Aug 26, 2018"}, {"text": "Works just like the original, except NO spying and it needs another click to see the extensions. Works great!", "stars": 5, "date": "Aug 25, 2018"}, {"text": "EXCELLENT!", "stars": 5, "date": "Aug 25, 2018"}, {"text": "nice.", "stars": 5, "date": "Aug 21, 2018"}, {"text": "Ahh, That's what I was looking for, 0 random blank white areas on facebook, nice.", "stars": 5, "date": "Aug 20, 2018"}, {"text": "Great replacement for Stylish that disappeared from the store and no longer works properly.", "stars": 5, "date": "Aug 20, 2018"}, {"text": "UI is extremely incomprehensible", "stars": 3, "date": "Aug 20, 2018"}, {"text": "Better than Stylish.", "stars": 5, "date": "Aug 19, 2018"}, {"text": "Really good It has more options for for so many more sites than i thought", "stars": 5, "date": "Aug 19, 2018"}, {"text": "Love it and have used it for a long time. Would love to see the ability to save all your currently used/installed/downloaded styles. I hate having to reinstall/find them all each and every time. Perhaps a sign-in/account feature for those who want to use it?", "stars": 5, "date": "Aug 13, 2018"}, {"text": "Stylsih was better, but meh, since Google didn't even bother to understand why the company that made Stylish had info on us, we gotta take the rest that's still here for now", "stars": 4, "date": "Aug 12, 2018"}, {"text": "Alright, I didn't really like it, there are better online versions, but I can't uninstall this app? How do I?", "stars": 1, "date": "Aug 12, 2018"}, {"text": "Cool!", "stars": 5, "date": "Aug 10, 2018"}, {"text": "Good replacement for Stylish, without the tracking issue.  Exporting and Importing styles between them worked fine.", "stars": 5, "date": "Aug 7, 2018"}, {"text": "Simply Excellent. The editor is much easier to use than Stylish.", "stars": 5, "date": "Aug 3, 2018"}, {"text": "cool", "stars": 5, "date": "Aug 1, 2018"}, {"text": "Ever since Stylish's downfall, I've already found this extension to be a much better alternative.", "stars": 5, "date": "Jul 31, 2018"}, {"text": "Very nice alt to Stylish. Able to use the styles that I uploaded to Stylish with this extension. The switch from Stylish to Stylus was quick and easy. Also, the inline search for styles feature is very helpful and much easier to work with.", "stars": 5, "date": "Jul 31, 2018"}, {"text": "I've been using this for 3 years. LOVE it. \nIt's a great way to customize the look and feel of any website.", "stars": 5, "date": "Jul 31, 2018"}, {"text": "Great Stylish alternative + more intuitive design. It would get 5 stars from me, however I've experienced some of the styles flashing into effect 1-2 seconds late in some instances. Something for the developers to look into.", "stars": 4, "date": "Jul 30, 2018"}, {"text": "A perfect alternative for Stylish", "stars": 5, "date": "Jul 30, 2018"}, {"text": "Good and wont track me", "stars": 5, "date": "Jul 30, 2018"}, {"text": "very good alternative to stylish as i found out stylish has tracking devices. this works exactly the same and is really good.", "stars": 5, "date": "Jul 29, 2018"}, {"text": "Good and wont track me", "stars": 5, "date": "Jul 29, 2018"}, {"text": "取代stylish了，time to hug stylus, I got everything I need here, thanks a lot developers.", "stars": 5, "date": "Jul 29, 2018"}, {"text": "good alternative to stylish since stylish got removed but where can i get styles for stylus? thanks. (I cant make my own things)", "stars": 5, "date": "Jul 28, 2018"}, {"text": "Works smoothly without much issues tho a few styles don't appear as they did in stylish (ex. Twitter Dark and Simple used to stretch the box with your name and tweets across the top while now in stylus, it just leaves it to the side all small and stuff). Hopefully stylus updates and makes them work~", "stars": 5, "date": "Jul 28, 2018"}, {"text": "I'm so thankful you guys forked Stylish as I used it all the time on websites without a dark mode.\n\nThankfully Stylus isn't a privacy risk. Keep up the good work guys.", "stars": 5, "date": "Jul 27, 2018"}, {"text": "It kept stuttering, couldn't work until refreshed", "stars": 2, "date": "Jul 27, 2018"}, {"text": "AMAZING!!! thank you so much this is way better and safer than Stylish I can still use my stylish themes 5 stars!!", "stars": 5, "date": "Jul 27, 2018"}, {"text": "It's the exact same as stylish. You can make custom styles or use your old styles minus the tracking of your data. \n\nI went and installed all the styles I had before on stylish, but on this app. \n\nThe only fault i would give it is that the user interface is a bit bland.", "stars": 5, "date": "Jul 27, 2018"}, {"text": "Had no idea Stylish turned into a privacy risk last year.. only was alerted to it when I went to visit google and found the page white, which lead me to discover the extension being disabled due to 'violations'. This apparently happened earlier in the month, yet it's remained enabled in my browser until today.\n\nIf only I knew this existed a year ago.\n\nWill take a bit of time to change to the usage pattern of this addon (hence the star knock).. but I guess it's for the best.\n\nYet another addon... Show more", "stars": 4, "date": "Jul 27, 2018"}, {"text": "Doesn't track the sites you visit illegally like Stylish so its good in my books", "stars": 5, "date": "Jul 27, 2018"}, {"text": "I'm using this in combination with \"Dark Reader\" to turn the web from eye hurting white to dark modes.\nIn general, styles in Stylus do a better job than Dark Reader, not always, but worth it for when Dark Reader doesn't do a good job (which I admit is rare).", "stars": 5, "date": "Jul 27, 2018"}, {"text": "Just switched from Stylish, and it works exactly as needed. It even accepts the Stylish styles back-up, as long as you change the files extension to .json first.", "stars": 5, "date": "Jul 26, 2018"}, {"text": "Thanks devs! Awesome extension!", "stars": 5, "date": "Jul 23, 2018"}, {"text": "Better Than Stylish, And It's Don't Spy On You.\n\nStylish Just Removed Because of Spying.", "stars": 5, "date": "Jul 20, 2018"}, {"text": "Thank you guys! It's awesome extension!", "stars": 5, "date": "Jul 17, 2018"}, {"text": "i wish me more userfriendly . example to exclude current site from a activated style", "stars": 3, "date": "Jul 17, 2018"}, {"text": "Way better than the old Stylish, and doesn't spy on you. 5 stars.", "stars": 5, "date": "Jul 17, 2018"}, {"text": "\"Stylus wants to read and edit all your data on the websites you visit\" - Has Stylus become the new Stylish in terms of data harvesting from its users?", "stars": 1, "date": "Jul 16, 2018"}, {"text": "All needed functionality and even the import works prefectly", "stars": 5, "date": "Jul 16, 2018"}, {"text": "ITS AWSOME", "stars": 5, "date": "Jul 15, 2018"}, {"text": "bad", "stars": 1, "date": "Jul 14, 2018"}, {"text": "Moving from Stylish to Stylus, Stylish is evil", "stars": 5, "date": "Jul 13, 2018"}, {"text": "awesome!", "stars": 5, "date": "Jul 11, 2018"}, {"text": "transitioning couldn't have been easier, just upload your style backup and your off to the races.", "stars": 5, "date": "Jul 10, 2018"}, {"text": "Stylish just got shut down for monitoring all your browsing history. This is a wonderful alternative and comes with no tracking, and is open source.\nGreat alternative.", "stars": 5, "date": "Jul 7, 2018"}, {"text": "A fork of the \"Stylish\" extension - better to use this one as it doesn't have any of the ad/tracking that Stylish has.", "stars": 5, "date": "Jul 7, 2018"}, {"text": "Thank you! You have saved me from the burden of having to use light themes on sites like Google. And it doesn't spy on me! :D", "stars": 5, "date": "Jul 6, 2018"}, {"text": "Big thanks!", "stars": 5, "date": "Jul 6, 2018"}, {"text": "Unlike Stylish, this extension will not steal all of your data!", "stars": 5, "date": "Jul 5, 2018"}, {"text": "Thank you", "stars": 5, "date": "Jul 5, 2018"}, {"text": "The good brother of Stylish. DON'T USE STYLISH.", "stars": 5, "date": "Jul 5, 2018"}, {"text": "Thank goodness for Stylus! Clean interface and none of Stylish' bull.", "stars": 5, "date": "Jul 5, 2018"}, {"text": "I was using stylish but heard it was stealing user data. Great Alternative!", "stars": 5, "date": "Jul 5, 2018"}, {"text": "Aside from not stealing your data, it's also just a far better user interface than Stylish. I always hated having to scroll through a huge menu with pointless screenshots just to enable/disable styles. Stylus is clean and simple, with no BS getting in the way, and it respects your privacy.", "stars": 5, "date": "Jul 4, 2018"}, {"text": "Stylish but better and with no tracking. Can't really ask for more.", "stars": 5, "date": "Jul 4, 2018"}, {"text": "I was using Stylish but I  read that it was stealing user data. Thanks for this extension!", "stars": 5, "date": "Jul 4, 2018"}, {"text": "Made by the community, is free and open, and DOESN'T TRACK AND RECORD YOUR BROWSING HISTORY.", "stars": 5, "date": "Jul 4, 2018"}, {"text": "Open source and doesn't steal my data!  Thanks for keeping my data between me and the lizard people who watch our every move.", "stars": 5, "date": "Jul 4, 2018"}, {"text": "Fxxk Stylish", "stars": 5, "date": "Jul 3, 2018"}, {"text": "Thanks for a great replacement to the data stealing Stylish. Open source forever!", "stars": 5, "date": "Jul 3, 2018"}, {"text": "Great Extension and tops marks for privacy unlike Stylish who collected everything. Well done!!", "stars": 5, "date": "Jul 2, 2018"}, {"text": "Much better than Stylish (which I used to love)!", "stars": 5, "date": "Jun 27, 2018"}, {"text": "Stylish but better and a much more clearer interface.", "stars": 5, "date": "Jun 21, 2018"}, {"text": "Thank you for the awesome extension and help! \n\nOh, and of course, if you are still on Stylish, what are you thinking..? Come over to the land of the free, say hi.", "stars": 5, "date": "Jun 10, 2018"}, {"text": "Moved over from Stylebot which has become abandonware. Excellent experience! \n\nWas pleased to see CodeMirror with Sublime keybindings.\n\nIf only it worked on the New Tab Page... but no extensions are allowed.", "stars": 5, "date": "May 30, 2018"}, {"text": "Switched from Stylish, and am completely satisfied. Quicker, private, and has many useful features for making your own styles. Overall, better in every regard; definitely recommend! \n\nAlso, I would suggest NeuDark if you are looking for a way to darken the interface. ^^", "stars": 5, "date": "May 19, 2018"}, {"text": "Privacy counts!", "stars": 5, "date": "May 18, 2018"}, {"text": "More responsive, cleaner, and simpler than the official \"Stylish\" extension. Definitely prefer this one.", "stars": 5, "date": "May 12, 2018"}, {"text": "The perfect web CSS tool", "stars": 5, "date": "May 7, 2018"}, {"text": "same as the old \"stylist\" extension but better", "stars": 5, "date": "Apr 11, 2018"}, {"text": "Better and faster than it's predecessor. Nice to know that some people don't want to sell out.", "stars": 5, "date": "Apr 3, 2018"}, {"text": "Stylish Stopped Working for me, so I search this extension is amazing no bugs work perfect!", "stars": 5, "date": "Mar 31, 2018"}, {"text": "Stylish stopped working all of a sudden, so I looked up if there were any alternatives.\n\nPerfect extension, has a ton of great features not in Stylish, and also has the old minimal UI which I really love :)", "stars": 5, "date": "Mar 12, 2018"}, {"text": "way better than stylish, that extension is trash now. thank goodness for stylus <3", "stars": 5, "date": "Mar 7, 2018"}, {"text": "Thank you, thank you!  To all the designers who make themes too!\n\nI've started using some sites more (like twitter), and am so happy with the sites I already had regularly used.  \n\nWay better than the first one I tried...", "stars": 5, "date": "Mar 2, 2018"}, {"text": "Works fantastic, used it for over a year for installing and writing themes with no issues. Has all the features I could want and more.", "stars": 5, "date": "Feb 9, 2018"}, {"text": "Absolutely amazing, especially for people who cannot stir white screens", "stars": 5, "date": "Jan 31, 2018"}, {"text": "Please add Google Account or Drive Sync :)\n\nwohoo autoupdate! Love.", "stars": 5, "date": "Jan 29, 2018"}, {"text": "i undownloaded a custom tab and its still there >:(", "stars": 1, "date": "Jan 6, 2018"}, {"text": "It's working well.Thanks", "stars": 5, "date": "Dec 23, 2017"}, {"text": "Thank you! Install after Stylish was broken, and Stylus support importing in same format!", "stars": 5, "date": "Dec 14, 2017"}, {"text": "Awesome", "stars": 5, "date": "Dec 6, 2017"}, {"text": "After getting very frustrated with Stylish not saving any changes I make to themes, or even a new theme I wanted to create, I switched over to this one.\n\nGuess what? It instantly works! For the rest it's exactly like Stylish, except that you can actually modify the themes /and/ save them! :P\n\nSomehow Stylus also feels snappier than Stylish, which is a very good thing! I just wish the GUI of Stylus could be themed as well, it's way too white to my poor eyes.\n\nAddendum: With the NeuDark plugin ... Show more", "stars": 5, "date": "Oct 29, 2017"}, {"text": "Great so far. Switched from  Stylish, because it stopped saving new styles.", "stars": 5, "date": "Oct 23, 2017"}, {"text": "Much faster and batter then Stylish.\n- It lacks to see the full name of the styles while opening the pop-up window,\nSuggestion: we can see the full name if the mouse is placed on the name.", "stars": 5, "date": "Oct 11, 2017"}, {"text": "Not a malware unlike the other one.", "stars": 5, "date": "Sep 30, 2017"}, {"text": "Bravo, people like yourselves are need in this world :)", "stars": 5, "date": "Sep 6, 2017"}, {"text": "Unlike that other app \"Stylish\" this one respects your privacy and doesn't sell your browsing info to 3rd parties.\n\nStylish is spyware, bloated, and has a somewhat cluttered interface while Stylus if faster and auto updates.\n\nStylus > Stylish", "stars": 5, "date": "Aug 11, 2017"}, {"text": "Hey I love this extension thank you, but unfortunately somehow I lost all my styles and never backed them up. Luckily I have the logs with all the names, and it had something to do with the checking updates. It's the same message for all styles\n\n\"skipped (server unreachable)\"\n\nI had over 100 styles, sadly it's going to take a while to find them I tried searching just one of them and for some reason the style don't even show up on userstyles.org where I got all of them from.\n\nPlease let me kno... Show more", "stars": 5, "date": "Aug 5, 2017"}, {"text": "Stylis was good, Stylus is better", "stars": 5, "date": "Aug 2, 2017"}, {"text": "Extension is broken now. You can lost all your styles in any time.Be careful.", "stars": 2, "date": "Aug 1, 2017"}, {"text": "Open Source and Better than Stylish.", "stars": 5, "date": "Jun 28, 2017"}, {"text": "Stylish got real ugly with all those changes to its UI. I can't stand it anymore. Hope this one will remain the way it is. Thanks!", "stars": 5, "date": "Jun 14, 2017"}, {"text": "i love it.\nbetter that Stylish", "stars": 5, "date": "Jun 9, 2017"}, {"text": "Faster and better than Stylish. Also looks better and has an auto-update feature, which is a must for styles for websites, which change often.", "stars": 5, "date": "Jun 8, 2017"}, {"text": "Much faster and batter then Stylish", "stars": 5, "date": "May 16, 2017"}, {"text": "Could you make a Firefox version?", "stars": 5, "date": "May 14, 2017"}, {"text": "Is it just me or \"Install\" button on the userstyles.org does nothing at all ?", "stars": 5, "date": "May 10, 2017"}, {"text": "Thank you for this wonderful extension.", "stars": 5, "date": "May 4, 2017"}, {"text": "Great. Thank you!", "stars": 5, "date": "Apr 5, 2017"}, {"text": "Very useful. It saved my eyes =)", "stars": 5, "date": "Mar 30, 2017"}, {"text": "Goodbye Jason (np) awesome while it lasted.\n\nHello yokris.dev good on you, that new Stylish for Chrome was getting too ugly.", "stars": 5, "date": "Mar 22, 2017"}, {"text": "Best fork available.", "stars": 5, "date": "Mar 20, 2017"}, {"text": "Better than Stylish", "stars": 5, "date": "Mar 19, 2017"}, {"text": "Hello! Also, I wish it was a little easier to make your own/custom styles. I wish there was a tutorial.", "stars": 5, "date": "Mar 14, 2017"}, {"text": "Excellent extension to make changes to all websites. Install \"Chrome Global Black\" and \"chrome font fix\" styles on userstyles.org and you will have the perfect dark web browsing experience at night that doesn't causes eyes strain by staring at bright white background on all websites. The chrome font fix helps improve text quality whether you have the style on or off, keep it run always. I love it. Stylus doesn't include any bloatware or spyware like Stylish. Clean user interface. Great job de... Show more", "stars": 5, "date": "Mar 9, 2017"}, {"text": "Looks good so far (as in, like \"it\" used to).\n\nI might prefer a different icon though. The old W3C two-color blue CSS3 \"shield\" (with or without curly braces, with or without the \"S\") comes to mind. (For some reason [uso] I just don't care for turquoise.)\n\nAnyway... Thanks!", "stars": 5, "date": "Feb 23, 2017"}, {"text": "Better than Stylish anyway. Thanks.", "stars": 5, "date": "Feb 22, 2017"}, {"text": "Glad to see the original Stylish layout back, definitely not a fan of the new look.", "stars": 5, "date": "Feb 11, 2017"}, {"text": "Simple and useful! Great for making pages more attractive, and, my favorite use, for darkening backgrounds to avoid excessive eyestrain when you'd otherwise be staring at a blaring white screen all day.", "stars": 5, "date": "Feb 9, 2017"}, {"text": "YES!!!", "stars": 5, "date": "Feb 5, 2017"}, {"text": "Thank you for this, all of you did good. No, not a grammatical .. you did \"good\".", "stars": 5, "date": "Feb 5, 2017"}, {"text": "Fantastic idea", "stars": 5, "date": "Feb 3, 2017"}, {"text": "The best user style manager. Userstlyes make the web so much nicer to use. It's also a great way to learn CSS. Stylus was built from the decrepit ruins of Stylish - which was acquired by a market research company who added spyware to it. Stylus was forked from before the tracking was added, providing the community with an honest and tracking free extension.", "stars": 5, "date": "Feb 2, 2017"}, {"text": "Works great nice to have the old Stylish layout back and to have the export/import feature", "stars": 5, "date": "Feb 2, 2017"}, {"text": "Perfect. Just what was needed.\nHas all the good things about the 'ish' without any of the spying and data collection.\n\nAnd the import system works great. I was able to import my last backup I made with the new version of 'ish'\n\nBig thanks to the creators of this fork.", "stars": 5, "date": "Feb 1, 2017"}, {"text": "Excellent!! A sincere \"Thank you!\" to everyone who was instrumental in bringing this extension to the web store. I am very pleased to have one of my favorite extensions restored to the functionality that I was accustomed to, with an added Import/Export feature. Kudos to all!", "stars": 5, "date": "Feb 1, 2017"}]