[{"text": "To any seeking to use this today (since it is currently not working anymore) this functionality is now built into the QUT student site.  Just do a google search for QUT Timetable Planner and the top result should be a link to the correct page.", "stars": 5, "date": "Aug 3, 2021"}, {"text": "It is a decent app, saves plenty of time in terms of planning for class registration. However, what I find frustrating is the fact that it fails to fetch unit data through the search bar in the extension itself. It comes up with an error when you use it to load unit timetable data. It also constantly says \"loading\" under the search bar and does not fully load no matter how many times you refresh the page. To resolve the fetching unit data issue, I had to manually go to QUT's website and load ... Show more", "stars": 4, "date": "Feb 2, 2019"}, {"text": "Used it all 2018, can it please be updated for Sem 1 2019. Love your work", "stars": 5, "date": "Jan 17, 2019"}, {"text": "This app is great except I am having trouble selecting the classes once I have imported units, seems to be a glitch?", "stars": 4, "date": "Jun 10, 2018"}, {"text": "Cheers ya legends! Great app, massive time saver.", "stars": 5, "date": "Jan 17, 2018"}, {"text": "Thank you for making every semester 1000 times easier to plan out. This works so well and is very easy to use.", "stars": 5, "date": "Jan 3, 2018"}, {"text": "legends", "stars": 5, "date": "Jun 6, 2017"}, {"text": "awesome", "stars": 3, "date": "Apr 12, 2017"}, {"text": "best eva", "stars": 5, "date": "Feb 2, 2017"}, {"text": "Great help\nlove it!!", "stars": 5, "date": "Feb 2, 2017"}, {"text": "omg omg omg this saved me  before registrations, as a high school graduate i had no idea what i was doing until i found this thank you <3", "stars": 5, "date": "Feb 1, 2017"}, {"text": "Works well", "stars": 5, "date": "Jan 30, 2017"}, {"text": "THANK YOU!", "stars": 5, "date": "Jan 28, 2017"}, {"text": "bless whoever created this", "stars": 5, "date": "Jan 20, 2017"}, {"text": "Whoeven made this deserves a nobel prize. Simple to use and efficient. Everything I need.  Beautiful. a e s t h e t i c 12/10 IGN", "stars": 5, "date": "Jun 6, 2016"}, {"text": "Fantastic tool.", "stars": 5, "date": "Jun 5, 2016"}, {"text": "Can the app be updated to accept Semester 2 class times so it can be used to plan in advance?", "stars": 3, "date": "May 25, 2016"}, {"text": "its really helpful for my work", "stars": 4, "date": "Apr 19, 2016"}, {"text": "Incredibly helpful extension! I think it must have halved my timetable planning time. Aside from a slight glitch here and the small text, I say this extension is great :)", "stars": 5, "date": "Jan 20, 2016"}, {"text": "Recommend to everyone I know", "stars": 5, "date": "Jan 14, 2016"}, {"text": "Awesome!", "stars": 5, "date": "Jun 2, 2015"}, {"text": "Timetable sorted out in 5 minutes, this is seriously great.", "stars": 5, "date": "May 16, 2015"}, {"text": "Its not to complex and makes planing so much easier then writing it all down. Must have app or planning timetable", "stars": 5, "date": "Jan 29, 2015"}, {"text": "thank you so much will recommend to everyone", "stars": 5, "date": "Jan 28, 2015"}, {"text": "thanks so much for making this :)", "stars": 5, "date": "Jan 27, 2015"}, {"text": "So much easier than fiddling with excel. Excellent.", "stars": 5, "date": "Jan 24, 2015"}, {"text": "hate it", "stars": 1, "date": "Sep 11, 2014"}, {"text": "Handy extension, helped me plan out my timetable in no time. Thanks :D", "stars": 5, "date": "Jun 3, 2014"}, {"text": "Awesome.", "stars": 5, "date": "Jun 3, 2014"}]