[{"text": "I wish there was an option to change the color of the ruler! The gray is too light for me. Also I wish there was an option to make the text bold, it's easier for me to read.", "stars": 3, "date": "Jan 19, 2024"}, {"text": "Love it so far. Clean implementation on the sites I regularly use it on, and the ruler feature is great.", "stars": 5, "date": "Sep 13, 2023"}, {"text": "good extention, like it.\nbut the thing what puts me off is i like dark mode on a lot of websites and the high contrast mode will mess up the whole website. mabey it is nice to have a way to toggel high contrast mode on and off.", "stars": 3, "date": "Sep 12, 2023"}, {"text": "Wow, this is great! And so easy to use! Thank you!", "stars": 5, "date": "Sep 22, 2022"}, {"text": "Works well, but I only want the ruler and there's no way to turn the font changer off without turning off the ruler as well.", "stars": 4, "date": "Sep 21, 2021"}, {"text": "works well, except for websites with darkmode. makes the text black on black. also is funky with google translate.", "stars": 5, "date": "Apr 13, 2021"}, {"text": "Instantly satisfied with this app. Things that could improve are more font options or the ability to upload your own fonts and an option to highlight the words your cursor is over (the bar is great but sometimes this extra help is needed). Load times could be better but they're not horrible.", "stars": 4, "date": "Mar 2, 2020"}, {"text": "Really great but would be better if you could toggle the background color changing.", "stars": 4, "date": "Jan 16, 2020"}, {"text": "Immediately did what I needed it to and has a fancy highlight bar. Love!", "stars": 5, "date": "Feb 16, 2019"}, {"text": "not really working on twitter, but other site fine", "stars": 5, "date": "Aug 11, 2018"}, {"text": "It would have been great, if I could actually toggle it on an off. I don't really need it on all websites.", "stars": 2, "date": "Feb 7, 2017"}, {"text": "Great app", "stars": 5, "date": "Apr 23, 2016"}, {"text": "I have enjoyed this extension. However, I find it causes a long delay when pages are uploading. It does not work well with Facebook. It would be nice if it had an easier on/off function. \n\nI find it VERY helpful when reading longer documents.", "stars": 4, "date": "Apr 15, 2016"}, {"text": "I kind of like it, but I hate the \"dyslexic font\", I like the comic sans, but not the other one,andit seems like even when I choose comic sans each page opens in 'dyslexic' and I have to change manually everytime and sometimes doesn't work. Can you change this?", "stars": 3, "date": "Nov 20, 2015"}]