[{"stars": 1, "text": "Auto-allows all notifications from all sites. Nope. Removed.", "date": "Mar 8, 2024"}, {"stars": 4, "text": "This extension was made for the 2010s, though it's still important.\nIf you want something different and powerful, try SuperDev Pro.", "date": "Feb 23, 2024"}, {"stars": 5, "text": "This plugin is very useful.", "date": "Feb 17, 2024"}, {"stars": 5, "text": "I've used it infrequently for years, but that doesn't mean it isn't useful.  It has been very handy for troubleshooting my own messes and that of others (mostly mine though),.  Thanks for this extension.  FREE extension, I mean.  Incredible value.", "date": "Dec 11, 2023"}, {"stars": 5, "text": "best extension for web dev's", "date": "Nov 29, 2023"}, {"stars": 5, "text": "very good", "date": "Nov 15, 2023"}, {"stars": 5, "text": "Useful, really useful, I like it.", "date": "Aug 31, 2023"}, {"stars": 1, "text": "this thing leaks page information out", "date": "Aug 26, 2023"}, {"stars": 5, "text": "this extension is so useful for web developers", "date": "Jul 25, 2023"}, {"stars": 5, "text": "i honestly dont get why theese ppl giving this a one star this is very good it helps much very much", "date": "Mar 7, 2023"}, {"stars": 1, "text": "My Facebook business manager and my entire facebook account got hacked directly after installing this extension, and without resetting or changing my password and that's another proof that it was this extension since it has an access to the cookies, He used the cookies to access my account and removed all the members with full access to employee access then added his fake accounts and posted something that violates Facebobok policies to lead my account to suspension and now he spent over $15,... Show more", "date": "Jun 20, 2022"}, {"stars": 1, "text": "The tool is actually wonderful. I've used it for years. BUT. And it's an enormous BUT.\n\nThis extension overrides and locks your notification settings (along with other settings) so that you can't change them. Because of that, any website can now constantly send you notifications and spam you all of the time.\n\nHow about the fact that any of those notifications of links that they send could be a virus. That enough evidence for you sir? \n\nI haven't even looked into the code or other permissions ... Show more", "date": "Mar 3, 2022"}, {"stars": 5, "text": "Good But Why http?", "date": "Feb 8, 2022"}, {"stars": 5, "text": "Excellent!", "date": "Dec 2, 2021"}, {"stars": 5, "text": "Has lots of very useful tools. It makes finding information much faster and less confusing.", "date": "Sep 29, 2021"}, {"stars": 4, "text": "Occasionally very useful. But very annoying: Opens a new tab with itself each time I open Chrome. Why?", "date": "Feb 8, 2021"}, {"stars": 1, "text": "dont download its an virus", "date": "Nov 2, 2020"}, {"stars": 5, "text": "I love this extension. I've been using this for years to help with accessibility testing and highly recommend it to all of my colleagues.", "date": "Oct 21, 2020"}, {"stars": 5, "text": "thx a lot!", "date": "Oct 2, 2020"}, {"stars": 5, "text": "Awesome.", "date": "Aug 21, 2020"}, {"stars": 5, "text": "Very nice tool!!", "date": "Jul 31, 2020"}, {"stars": 3, "text": "In new versions of Chrome, new extensions do not appear in your toolbar. That means that extensions you install are not readily visible. You have to fish around to \"pin\" them. I think some kind of post-install explainer would help this obvious UX issue with Chrome.", "date": "Jul 6, 2020"}, {"stars": 5, "text": "I'm using it for years. Thank you!", "date": "Jun 28, 2020"}, {"stars": 2, "text": "Edit CSS doesn't work. No other extensions. No ublock. url on localhost.", "date": "Apr 14, 2020"}, {"stars": 5, "text": "Best extension ever!!", "date": "Apr 11, 2020"}, {"stars": 5, "text": "ITS COOL WHILE THE ORANGE OTHER ONE THAT IS BARLLY LIKED ITS LITTTLE THIS IS THE BEST BUT DO KEEP DOING IT AND SHINGS I RATE THIS INFINITE STARS ITS COOL AND BIG WOW I LIKE THIS KEEP UP THE GOOD WORK PLEASE AND GOOD LUCK AND OTHER THINGS AND STUFF!.\n\n:)", "date": "Apr 9, 2020"}, {"stars": 3, "text": "I really like this extension but I have 1 complaint that moves me to almost trash it every time it happens. Please, please, make the resize options keep the sizes entered. Every time, this extension changes/Chrome updates, I am up for re-entering all the window sizes I need and I generally only realise that they are lost once again when I most need them....yes, it doesn't take hours to re-enter them but it is really annoying.", "date": "Mar 22, 2020"}, {"stars": 5, "text": "The best!! Thank you!", "date": "Mar 18, 2020"}, {"stars": 1, "text": "It forces notifications to be enabled on all websites in your browser without any option to turn notifications off", "date": "Mar 10, 2020"}, {"stars": 5, "text": "I've only used it for the responsive layouts and it's helped me out a lot.  is always up to date.", "date": "Feb 13, 2020"}, {"stars": 1, "text": "It's completely unnecessary to auto-open a new tab every time this extension is updated. \n\nRegardless of what this extension does or does not do, it's a step over the line for me.\n\nThere isn't even an option to disable it. I cannot think of a more intrusive way to notify me.", "date": "Jan 13, 2020"}, {"stars": 5, "text": "Thank you for the 0.54 update!  Fixed some my most used tools Color Picker, Guides, Ruler.  Cheers", "date": "Jan 13, 2020"}, {"stars": 2, "text": "Great up, but spams a changelog tab with every single update", "date": "Jan 13, 2020"}, {"stars": 2, "text": "Error!!! Cannot display \"show element tag names\" on Heading tags", "date": "Jan 9, 2020"}, {"stars": 1, "text": "Lost all my custom resize dimensions after update.", "date": "Dec 17, 2019"}, {"stars": 5, "text": "Been using this plugin on Firefox 3+ in 2007, until now on Chrome. Just brilliant and simple.", "date": "Dec 15, 2019"}, {"stars": 5, "text": "I used to love this but recently it has started to allow all notifications on all sites, without any option to turn notifications off. It makes me turn it off.\nEDIT: Apparently this has been fixed since version 0.4.8 but it seems I had to \"Reset Disable Features\" under the Disable tab https://chrispederick.com/work/web-developer/help/#allow-notifications. Thanks Chris! Now 5 stars.", "date": "Dec 3, 2019"}, {"stars": 5, "text": "I use this tool to aid in accessibility testing alongside WAVE and Axe, it does exactly what it says it does. It makes my job easier and it is open source! Thank you Chris and all the other open source contributors for making this tool and giving it away for free!", "date": "Nov 1, 2019"}, {"stars": 4, "text": "It's really useful, but it crashes pretty much every day.", "date": "Oct 1, 2019"}, {"stars": 5, "text": "Amazing tool, recommended highly, maximum usefulness with minimum adware.", "date": "Sep 9, 2019"}, {"stars": 5, "text": "I've been using this extension for years, and honestly can't live without it in terms of web design. Its most valuable feature is the Edit CSS function, which allows you to actually see what you're doing and edit CSS in realtime. The Responsive Layouts and Window Resize are crucial for any self-respecting web designer in this mobile-site-driven age in which we now live. It's a free extension packing premium content. Thank you so much, Chris, for building this tool and distributing it for free... Show more", "date": "Aug 10, 2019"}, {"stars": 1, "text": "Forces notifications to be enabled in your browser. I don't care what this can do, no longer helpful until that changes.", "date": "Jun 19, 2019"}, {"stars": 5, "text": "great add on", "date": "Jun 10, 2019"}, {"stars": 4, "text": "where is \"outline custom elements\"?", "date": "Jun 5, 2019"}, {"stars": 4, "text": "Can't give it 5 stars... it took me HOURS to narrow down why FLASH was not allowed AT ALL! I wasn't able to visit chrome settings and adjust flash settings. Everything having to do with flash settings was grayed out and unable to change ANYTHING. \n\nReally upset that it would not let me know that this plugin was controlling flash on EVER page / site!\nAnd I still cant figure out how to have Web Developer enabled while having it NOT affect my flash settings!", "date": "May 26, 2019"}, {"stars": 5, "text": "Brilliant Extension with a vast range of tools from someone who 'gets it'. Well done Chris.", "date": "Apr 21, 2019"}, {"stars": 5, "text": "Most Important extension for developers", "date": "Apr 5, 2019"}, {"stars": 5, "text": "thanks brother", "date": "Mar 26, 2019"}, {"stars": 1, "text": "I absolutely loved this extension on Firefox when I first installed it years ago. I never had a problem with it. Now, 2019, the features I use don't work at all with Chrome (currently v71) and it's a coin toss with Firefox Quantum.  By not working: I access a feature, get a blue progress bar that goes half way across the screen and then just stops and never comes back.", "date": "Feb 19, 2019"}, {"stars": 5, "text": "This is awesome!", "date": "Feb 13, 2019"}, {"stars": 5, "text": "Its been 8 year, I am using this extension for both Chrome and Firefox, it will be nonjudgmental If I dont write a bit unlike other review about this extension.\n1: This is the extension that leads you to take decision\n2. This is the extension that gives your bug report.\n3. This is the extension that you use to fix bug.\n\nA web developer without this extension is helpless, paralyzed and not a web developer.", "date": "Feb 6, 2019"}, {"stars": 2, "text": "Unfortunately, does not handle shadow DOM at all.", "date": "Jan 18, 2019"}, {"stars": 5, "text": "awesome debug tool", "date": "Jan 10, 2019"}, {"stars": 3, "text": "Does NOT stop the javascript overlay on this site...\nhttps://twinflamesuniverse.com/about-2/\n\nI only want to disable javascript on certain sites, not all across the board.", "date": "Jan 1, 2019"}, {"stars": 5, "text": "Essential tool", "date": "Dec 28, 2018"}, {"stars": 5, "text": "Cool application, thanks!", "date": "Dec 10, 2018"}, {"stars": 5, "text": "top", "date": "Dec 6, 2018"}, {"stars": 5, "text": "This does the work of 10+ extensions and does it well. Great work, thanks!", "date": "Oct 23, 2018"}, {"stars": 4, "text": "good", "date": "Oct 18, 2018"}, {"stars": 5, "text": "Image removing options helps out a lot with poor connection.", "date": "Sep 10, 2018"}, {"stars": 2, "text": "Color pIcker is not working", "date": "Aug 31, 2018"}, {"stars": 1, "text": "This plugin just sent me a notification from producthunt. Sad to see the author spamming. I would not trust it.", "date": "Aug 16, 2018"}, {"stars": 5, "text": "very good", "date": "Jul 25, 2018"}, {"stars": 3, "text": "good", "date": "May 23, 2018"}, {"stars": 5, "text": "so nice love it", "date": "May 22, 2018"}, {"stars": 5, "text": "exalent app", "date": "May 10, 2018"}, {"stars": 5, "text": "good", "date": "May 6, 2018"}, {"stars": 5, "text": "super", "date": "May 5, 2018"}, {"stars": 5, "text": "love it", "date": "Apr 14, 2018"}, {"stars": 4, "text": "I am using chrome so many year and it is fast and easy to work browser.", "date": "Apr 13, 2018"}, {"stars": 5, "text": "good", "date": "Apr 12, 2018"}, {"stars": 5, "text": "nice", "date": "Apr 12, 2018"}, {"stars": 4, "text": "nice one", "date": "Apr 10, 2018"}, {"stars": 1, "text": "on responsive view inspect element option not working. so now it's vague plugin now.", "date": "Mar 28, 2018"}, {"stars": 5, "text": "Perfect thing!", "date": "Mar 25, 2018"}, {"stars": 5, "text": "I've been using the Web Developer extension for YEARS.  As someone that works in the Digital Marketing industry, particularly focused on SEO, this tool time and time again has helped streamline many important tasks I have to do when evaluating websites.  It's flexible, customizable, and just really makes life easier. Thank you to the dev, for years of use.  I'm planning to make a small donation to the dev to express my gratitude, but I thought a review was due first.  The best thing about thi... Show more", "date": "Mar 24, 2018"}, {"stars": 5, "text": "absolutely beginner myself but I guess I'll be using this extension for a long time...", "date": "Mar 15, 2018"}, {"stars": 5, "text": "A very powerful and useful extension", "date": "Feb 8, 2018"}, {"stars": 5, "text": "It's working", "date": "Nov 24, 2017"}, {"stars": 5, "text": "Very useful!", "date": "Nov 17, 2017"}, {"stars": 1, "text": "Alt attributes are not working at all", "date": "Nov 3, 2017"}, {"stars": 5, "text": "thank you.", "date": "Oct 30, 2017"}, {"stars": 5, "text": "An important tool kit for any working web developer. Thank You!", "date": "Oct 9, 2017"}, {"stars": 5, "text": "norm", "date": "Sep 20, 2017"}, {"stars": 4, "text": "Good", "date": "Aug 28, 2017"}, {"stars": 5, "text": "Brilliant Extension with a vast range of tools from someone who 'gets it'. Well done Chris.\n\nAs for your open and honest transparency its hard not to continue to trust the application. At least I know that if something is wrong ill get the truth and instant support in resolving the problem.\n\n(Hats_Off)\n\nApologies for not agreeing with those of you slating the developer for the breach. Im in support of you all receiving a well deserved a full refund! \n\nChris, you can keep mine! :)", "date": "Aug 28, 2017"}, {"stars": 5, "text": "As a long-time web developer, I have used this tool in multiple browsers, on multiple platforms, for more years than I like to admit to anymore. \n\nI have exactly one complaint. I wish that the default sizes used in the responsive layouts were also used to pre-populate the resize window options.\n\nAside from that, I love it and plan to continue using this tool for as I continue to drive a keyboard for a living, and as long as this tool remains available!", "date": "Aug 22, 2017"}, {"stars": 5, "text": "thansk", "date": "Aug 20, 2017"}, {"stars": 5, "text": "thanks  for this Great work.", "date": "Aug 5, 2017"}, {"stars": 1, "text": "Malware?", "date": "Aug 4, 2017"}, {"stars": 5, "text": "Super helpful dev extension, especially love the responsive layouts view!", "date": "Aug 3, 2017"}, {"stars": 5, "text": "Thanks for the extension take down and your quick code fix after the exploit, Chris. Keep up the good work.", "date": "Aug 3, 2017"}, {"stars": 5, "text": "Solid addon to my daily work. The ads were an annoyance but everyone makes mistakes. Update to 0.5.x guys.", "date": "Aug 3, 2017"}, {"stars": 1, "text": "Adding spam and bad stuff, please do not install this!", "date": "Aug 3, 2017"}, {"stars": 1, "text": "Unacceptable lack of security, great that it was fixed fast but it never should have happened in the first place.  Could have cost me a client", "date": "Aug 3, 2017"}, {"stars": 5, "text": "Was briefly compromised, but the developer responded and fixed the issue quickly.", "date": "Aug 2, 2017"}, {"stars": 1, "text": "Poor security from the developer. The plugin was comprimised and injected malware and ads on every site that I visited.  Plugin is not worth the risk to keep using.  Change your passwords to be safe.", "date": "Aug 2, 2017"}, {"stars": 4, "text": "MALWARE NOTE: You must delete the extension then reinstall it, since Chrome won't automatically update it in a timely manner.\n\nIt seems like the latest version (0.5) is clean.", "date": "Aug 2, 2017"}, {"stars": 1, "text": "incredible, i dont care how that hack was even possible, but thats a complete disaster.", "date": "Aug 2, 2017"}, {"stars": 4, "text": "Really useful and extensible tool, -1 for the horrible new extension icon look from 90's... The other icons don't look better...", "date": "Aug 2, 2017"}, {"stars": 1, "text": "The plugin has triggered malware https://malwaretips.com/blogs/remove-b-partner-red-men/", "date": "Aug 2, 2017"}, {"stars": 5, "text": "Dev account was compromised and version 0.4.9 had ads injecting. \n\nVersion 0.5 has been updated and is working fine. Fast developer response and great extension!", "date": "Aug 2, 2017"}, {"stars": 5, "text": "The version 0.4.9 had Virus, but was resolved and cleaned at he 0.5.\nAmazing Tool Again!", "date": "Aug 2, 2017"}, {"stars": 5, "text": "This extension began serving me popup ads today, nearly gave me a heart attack thinking a client's site became infected!\n\nUPDATE: author fixed immediately. awesome extension", "date": "Aug 2, 2017"}, {"stars": 1, "text": "i used for years, but there is aggressive ads in last version! never more!", "date": "Aug 2, 2017"}, {"stars": 1, "text": "First, thanks to your work!\n\nI was a bit confused as I saw these loaded JS etc. and also noticed some (sex) adverstisement on i.e. Google.com\n\nThank you clarifying here, that you account was hacked.\n\nI had to update the extension by myself. Is there no emmergency option at the Chrome Web Store, which tells all browsers to update imediatelly?", "date": "Aug 2, 2017"}, {"stars": 1, "text": "Seems that in the last updated this extension contains a malware that shows an script alert and add their own add system", "date": "Aug 2, 2017"}, {"stars": 5, "text": "Quick response to compromised v0.4.9 release", "date": "Aug 2, 2017"}, {"stars": 5, "text": "Great tool to assist in web development!", "date": "Aug 2, 2017"}, {"stars": 4, "text": "Version 0.5 confirmed clean. Version 4.9 was hacked.", "date": "Aug 2, 2017"}, {"stars": 1, "text": "Started injecting scripts and causing redirects to adverts on link clicks", "date": "Aug 2, 2017"}, {"stars": 5, "text": "Great extension, and thanks for the super-fast response to the 0.4.9 hack.", "date": "Aug 2, 2017"}, {"stars": 1, "text": "The latest version adds ads (abrts.pro) to every page. \n\nI wonder if the tool has been highjacked, I don't believe the original author did this.", "date": "Aug 2, 2017"}, {"stars": 1, "text": "adding google analytics to the source of any visited website.", "date": "Aug 2, 2017"}, {"stars": 1, "text": "WARNING! Adds Google Analytics without user consent! Do not install!", "date": "Aug 2, 2017"}, {"stars": 1, "text": "production code of this app seams to be full of debugs that spam the console\ncontent.js:189 Installed:1501675755865\n14:53:01.802 content.js:192 Installed ms:2625937\n14:53:01.803 content.js:195 Now\n14:53:01.803 content.js:203 12\n14:53:01.805 content.js:207 2-8-2017\n14:53:01.806 content.js:211 wd7bdb20e4d622f6569f3e8503138c859d.win", "date": "Aug 2, 2017"}, {"stars": 5, "text": "OK, 0.5 is clean :-) you can use it safely once again.", "date": "Aug 2, 2017"}, {"stars": 4, "text": "Very useful in a lot of situations, even for regular users. GUI could be updated to a more modern, fresher look.", "date": "Aug 1, 2017"}, {"stars": 4, "text": "it is very usefull", "date": "Jul 30, 2017"}, {"stars": 5, "text": "All in one tool that Google should buy and implement by default in the dev tools.", "date": "Jul 19, 2017"}, {"stars": 5, "text": "Awesome work,enabling and disabling features make more handy for development", "date": "Jul 17, 2017"}, {"stars": 5, "text": "Love this.  Saved me a lot of time and headaches.", "date": "Jul 14, 2017"}, {"stars": 5, "text": "amazing)", "date": "Jul 9, 2017"}, {"stars": 5, "text": "good!!", "date": "Jun 29, 2017"}, {"stars": 4, "text": "I wish it didn't show that pop-up after installing it. That appears each time I create my profile on a machine and restore my extensions (which is pretty frequent for me). Also it provided no use even on first install.", "date": "Jun 28, 2017"}, {"stars": 5, "text": "Great tool, I use it all the time.", "date": "Jun 26, 2017"}, {"stars": 5, "text": "respect...but wish more professional.", "date": "Jun 17, 2017"}, {"stars": 5, "text": "Has been a godsend for web developers for years. Many thanks, Chris!", "date": "Jun 8, 2017"}, {"stars": 4, "text": "This debugger did a very good job on my computers.", "date": "Jun 8, 2017"}, {"stars": 5, "text": "must have", "date": "Jun 7, 2017"}, {"stars": 5, "text": "very useful Extension. Thanks Chris !", "date": "Jun 5, 2017"}, {"stars": 5, "text": "I like this,thanks", "date": "May 27, 2017"}, {"stars": 5, "text": "One of the Greatest Web Developer's Tools", "date": "May 18, 2017"}, {"stars": 5, "text": "Awesome to port to Chrome. Thanks Chris! ; )", "date": "Apr 12, 2017"}, {"stars": 5, "text": "Where's the donate beer button?", "date": "Apr 5, 2017"}, {"stars": 5, "text": "good", "date": "Mar 9, 2017"}, {"stars": 5, "text": "good", "date": "Mar 7, 2017"}, {"stars": 5, "text": "mikemmel", "date": "Mar 7, 2017"}, {"stars": 5, "text": "nice tool", "date": "Mar 3, 2017"}, {"stars": 1, "text": "It's spamming with openning a web page saying: \"WEB DEVELOPER INSTALLED OR UPGRADED\"", "date": "Feb 19, 2017"}, {"stars": 5, "text": "Great", "date": "Feb 17, 2017"}, {"stars": 4, "text": "Very helpful.", "date": "Feb 16, 2017"}, {"stars": 5, "text": "Fantastic work Chris, thanks so much.", "date": "Feb 16, 2017"}, {"stars": 4, "text": "This is a must have for web developers. I have no idea how I ever got along without it. My only gripe is that unlike the Firefox web developer extension, every time I refresh, I lose all of my tweaks such as outline block elements. Firefox version had a setting to make the changes stick and reapply after refreshing which I do a lot when developing. It's a downer but the plugin is still well worth using. (Ignore the one star ratings below).", "date": "Feb 12, 2017"}, {"stars": 2, "text": "Forces you to accept desktop notifications from all sites.", "date": "Jan 31, 2017"}, {"stars": 5, "text": "Very nice...liked a lot.", "date": "Jan 29, 2017"}, {"stars": 1, "text": "I don't like a rule which displays notifications on all sites by default. Even though the developer's intentions were good. I'll be making a fork and removing this.", "date": "Jan 28, 2017"}, {"stars": 1, "text": "Forces a rule that allows any site to create a notification.", "date": "Jan 14, 2017"}, {"stars": 1, "text": "This popup enforces a rule that lets any site create notifications !", "date": "Jan 13, 2017"}, {"stars": 5, "text": "great", "date": "Jan 10, 2017"}, {"stars": 1, "text": "As everyone else noted - the allow all notification thing bites - took me a while to figure out that is was because of this extension - uninstalled.", "date": "Jan 9, 2017"}, {"stars": 1, "text": "Used to be great for responsive designs but now it fills Chrome up with notifications. Once it's added it cannot be disabled. Don't use this extension until it's fixed!", "date": "Jan 8, 2017"}, {"stars": 4, "text": "Ok! like!!!", "date": "Dec 23, 2016"}, {"stars": 5, "text": "ok", "date": "Dec 10, 2016"}, {"stars": 1, "text": "This extension enables Notifications on All Sites, without exclusion!", "date": "Dec 9, 2016"}, {"stars": 1, "text": "As many have mentioned before me, this extention now forces allow notification for ALL websites. \n\nThe developer claims this it because of limitations in chrome-API,bu this solution is just not acceptable. \nhttp://chrispederick.com/work/web-developer/help/#allow-notifications", "date": "Dec 6, 2016"}, {"stars": 1, "text": "Used to love it (5 stars) but the allow all: \nhttp://* and https://*\nmeans it is now uninstalled.", "date": "Dec 1, 2016"}, {"stars": 4, "text": "Viewing \"responsive layouts\" function currently does not work. November 30, 2016", "date": "Dec 1, 2016"}, {"stars": 5, "text": "An essential toolbox for and web developer", "date": "Nov 29, 2016"}, {"stars": 2, "text": "I used this extension for a long time, but since it allows all notifications in Chrome I can't use it anymore. It's too anoying.", "date": "Nov 28, 2016"}, {"stars": 5, "text": "love it", "date": "Nov 23, 2016"}, {"stars": 1, "text": "This was such a useful plugin, until… this plugin adds http://* and https://* rules to Chromes notification center. Therefore, enabling this plugin allows all annoying notifications to pass through regardless if you tell Chrome to block all notifications.", "date": "Nov 18, 2016"}, {"stars": 1, "text": "Does not work. Does nothing.", "date": "Nov 17, 2016"}, {"stars": 1, "text": "This addon enable and locks notification settings chrome://settings/contentExceptions#notifications\nthat are impossible to remove on http:// and https:// these are used to serve daily ads from www.wittyfeed.com. This is unacceptable. Reported to google, i hope you get banned.", "date": "Nov 16, 2016"}, {"stars": 5, "text": "My most-used browser extension for FF and Chrome. Never had issues with it, has tons of features, easy to use. I don't often contribute to extension developers, but I did donate to Chris Pederick because his tools are excellent.", "date": "Nov 15, 2016"}, {"stars": 5, "text": "Excellent", "date": "Nov 15, 2016"}, {"stars": 4, "text": "That's good", "date": "Nov 10, 2016"}, {"stars": 1, "text": "Suddenly this extension enforces notifications on http://*, https://*\nSo any website is free to give you desktop notifications (no matter what you set in chrome - exceptions or off for all, this setting just overrides everything... basically, you can not turn off notifications as long as you have this extension installed)\n\nUninstalled :(\nToo bad for the usefulness of the extension. Was good while it lasted.", "date": "Nov 2, 2016"}, {"stars": 5, "text": "good", "date": "Nov 1, 2016"}, {"stars": 5, "text": "cool", "date": "Oct 23, 2016"}, {"stars": 4, "text": "I liked it :)", "date": "Oct 15, 2016"}, {"stars": 5, "text": "Awesome as always.", "date": "Sep 15, 2016"}, {"stars": 1, "text": "i installed it so that i could print the page EXACTLY as it is displayed.\n\ni disabled the print CSS. did not work, the page was still messed up", "date": "Sep 8, 2016"}, {"stars": 4, "text": "it is very helpful", "date": "Sep 7, 2016"}, {"stars": 5, "text": "Its fantastic", "date": "Sep 5, 2016"}, {"stars": 4, "text": "Good.\nUnfortunately, most functions do not work with local files.", "date": "Sep 4, 2016"}, {"stars": 5, "text": "good", "date": "Aug 26, 2016"}, {"stars": 1, "text": "Was very useful but for some reason, the developer made it enforce a rule in chrome that lets any site create popup notifications and the only way to stop it is to disable this.", "date": "Aug 24, 2016"}, {"stars": 4, "text": "Everything is awesome I would just like to be able to save the HTML as easily as I do the CSS", "date": "Aug 21, 2016"}, {"stars": 1, "text": "Sending spam, bad. Do not install -- Adware.", "date": "Aug 12, 2016"}, {"stars": 5, "text": "nice...", "date": "Jul 30, 2016"}, {"stars": 5, "text": "This tool has saved me so much time in developing responsive layouts.  I love that I can see how changes will look on the fly in all the devices sizes I need to check in very little time.  This is just one of the great features- there are too many to list.  Just install it and begin using it- you will wonder how you've worked without it.", "date": "Jul 26, 2016"}, {"stars": 5, "text": "For webdevs, a must have", "date": "Jul 23, 2016"}, {"stars": 5, "text": "There's no way I can do any webwork without this. In fact I can't remember ever working without it.", "date": "Jul 22, 2016"}, {"stars": 5, "text": "good", "date": "Jun 30, 2016"}, {"stars": 2, "text": "It is no longer maintained and it doesn't work in Chrome anymore.", "date": "Jun 27, 2016"}, {"stars": 1, "text": "It started forcing ads on me.", "date": "Jun 20, 2016"}, {"stars": 1, "text": "doesn't work anymore", "date": "Jun 20, 2016"}, {"stars": 1, "text": "WARNING - SPYWARE. This Extension enforces http://* and https://* notifications and then pushes ADS to your machine via notifications.\n\nThis was a recent change. DO NOT TRUST!", "date": "Jun 8, 2016"}, {"stars": 5, "text": "best", "date": "Jun 1, 2016"}, {"stars": 5, "text": "gread tools", "date": "May 13, 2016"}, {"stars": 2, "text": "The main reason I use this toolbar is the outline element functions, which do not work at all unfortunately. Amazing plugin if these issues can be fixed.", "date": "May 9, 2016"}, {"stars": 5, "text": "I don't know why some people are having problems with the extension, but it still works for me on the latest version of Chrome.\n\nFor an extension that hasn't been updated in two years, it works surprisingly well.", "date": "Apr 26, 2016"}, {"stars": 5, "text": "okay", "date": "Apr 21, 2016"}, {"stars": 5, "text": "good", "date": "Apr 20, 2016"}, {"stars": 5, "text": "This extension is a must have for any kind of web development! Thanks to the author :-)", "date": "Apr 18, 2016"}, {"stars": 5, "text": "This very help full to make responsive web site", "date": "Apr 11, 2016"}, {"stars": 5, "text": "best to code and debug", "date": "Apr 5, 2016"}, {"stars": 2, "text": "Has problem with rules", "date": "Mar 31, 2016"}, {"stars": 5, "text": "Chris, your tools have filled in some nice gaps that help with productivity.  Thanks for carrying forward what you started in FireFox to Chrome.", "date": "Mar 10, 2016"}, {"stars": 5, "text": "It's awesome.\nToday I found my first issue, and Chris showed me the solution so I'll share it here: \n\nThis extension seems to over-ride the default \"always ask\" way of dealing with notification permissions, as I got a notification today from a domain which I never approved, and it appears this extension is what allowed that to occur.\n\nTo fix this you can remove the over-ride settings by selecting ‘Disable’ -> ‘Reset Disable Features’ option in the extension.", "date": "Mar 9, 2016"}, {"stars": 1, "text": "Used to work great with the latest Chrome for many years and was my go-to tool for looking at element outlines, but now it is no longer functional. Selecting an outline option throws a JS error. Hoping that's resolved so can revert to 5 stars again, but I see that this is not being maintained.", "date": "Feb 26, 2016"}, {"stars": 1, "text": "The option to \"View Image Information\" does not work.", "date": "Feb 21, 2016"}, {"stars": 5, "text": "great tool for web developer", "date": "Feb 10, 2016"}, {"stars": 5, "text": "Been using this on firefox for a good few years, only went looking for it on Chrome this evening", "date": "Feb 7, 2016"}, {"stars": 4, "text": "dont work with local files :(", "date": "Feb 5, 2016"}, {"stars": 3, "text": "It's Okay !", "date": "Feb 5, 2016"}, {"stars": 4, "text": "good", "date": "Jan 15, 2016"}, {"stars": 5, "text": "good", "date": "Jan 12, 2016"}, {"stars": 5, "text": "Indispensable !", "date": "Jan 7, 2016"}, {"stars": 5, "text": "very good plugin", "date": "Dec 30, 2015"}, {"stars": 3, "text": "Useful but forces all notifications to be enabled or disabled, which can become an annoyance when sites you don't want notifications from start popping up in the corner of your screen.", "date": "Dec 30, 2015"}, {"stars": 5, "text": "This is awesome! Congrats :D\nBut if you put like short cuts to exit , you really rocks : D", "date": "Dec 23, 2015"}, {"stars": 5, "text": "excellent.", "date": "Dec 22, 2015"}, {"stars": 3, "text": "It appears: Web developer does not work on the Chrome Extension Gallery - on many things", "date": "Dec 22, 2015"}, {"stars": 5, "text": "Very pragmatic!", "date": "Dec 10, 2015"}, {"stars": 5, "text": "Quick, handy, and compact with reliable results. A must for all web designers and developers. It compliments the development tools already available in your browser (this extension is also available in Firefox).\n\nDon't dismiss this extension because of it's dated appearance (UI); it's not pretty, but it's packed with functionality.", "date": "Dec 7, 2015"}, {"stars": 5, "text": "Amazing.\nThanks a ton for the efforts.", "date": "Nov 21, 2015"}, {"stars": 1, "text": "Memory usage is too many. Please be able to use any spec low PC.", "date": "Nov 18, 2015"}, {"stars": 5, "text": "even with the built in chrome tools, there are lots of features (forms, validation, cookies) you can't do without this extension.\nI think i've been using it on different browsers for ten years now.  still the one and only.", "date": "Nov 17, 2015"}, {"stars": 2, "text": "Generally a good app but the handling of enable/disable javascript needs tweaking.  I have several sites that I have specifically disabled javascript for, and the settings for the Web Developer tool override these settings - not good.  So I have to remove this extension.", "date": "Nov 14, 2015"}, {"stars": 5, "text": "Very helpful", "date": "Nov 13, 2015"}, {"stars": 5, "text": "Wow this works perfect. It's awesome.\nThe only thing is sometimes the disable options don't work.", "date": "Nov 11, 2015"}, {"stars": 5, "text": "Useful in my dev project", "date": "Nov 5, 2015"}, {"stars": 5, "text": "Just wow", "date": "Nov 5, 2015"}, {"stars": 1, "text": "Its not working properly on chrome. Doesn't give element css info.", "date": "Nov 4, 2015"}, {"stars": 5, "text": "Excellent. It is a pity that calling a local application is complicated and needs some gymnastics.", "date": "Oct 29, 2015"}, {"stars": 2, "text": "fdd", "date": "Oct 27, 2015"}, {"stars": 5, "text": "Cool extension! Thanks", "date": "Oct 22, 2015"}, {"stars": 5, "text": "Good (y)", "date": "Oct 22, 2015"}, {"stars": 5, "text": "Impresindible", "date": "Oct 21, 2015"}, {"stars": 5, "text": "Good", "date": "Oct 10, 2015"}, {"stars": 5, "text": "Absolutely fantastic extension. Worried about the lack of updates, purely due to internal WC3 validating going through CSS 2.1, and things of that sort---much of it's handiness is still 100%.\n\nHope it get's a little love from the developers soon. It's still very useful, but would love to see a refresh! :)", "date": "Oct 3, 2015"}, {"stars": 5, "text": "It is the Best.", "date": "Sep 30, 2015"}, {"stars": 5, "text": "Simple, easy to use, and convenient!", "date": "Sep 27, 2015"}, {"stars": 1, "text": "was a fantastic tool but now it won´t work with chrome :-(", "date": "Sep 12, 2015"}, {"stars": 4, "text": "nice app must have!", "date": "Sep 9, 2015"}, {"stars": 5, "text": "A classic for good reasons.", "date": "Aug 24, 2015"}, {"stars": 5, "text": "Just got this and it looks spot on for tuning web pages.", "date": "Aug 17, 2015"}, {"stars": 3, "text": "Only thing missing is a View Generated Source tool", "date": "Aug 11, 2015"}, {"stars": 5, "text": "good tool... use it often", "date": "Aug 11, 2015"}, {"stars": 5, "text": "Awesome!!!!! Awesome!!!!! Awesome!!!!! very helpful when we developing responsive design. All features are awesome.", "date": "Aug 1, 2015"}, {"stars": 3, "text": "just so so，don't support chinese simple language.", "date": "Jul 30, 2015"}, {"stars": 1, "text": "was very useful but now it crashes crhome.", "date": "Jun 24, 2015"}, {"stars": 5, "text": "5 stars i can control my content easily", "date": "Jun 22, 2015"}, {"stars": 5, "text": "Very useful. I love it.", "date": "Jun 13, 2015"}, {"stars": 1, "text": "Doesnt work with Chrome version 43.0.2357.124 (64-bit). Always crash when i try to open.", "date": "Jun 12, 2015"}, {"stars": 5, "text": "great", "date": "Jun 7, 2015"}, {"stars": 5, "text": "Great", "date": "Jun 3, 2015"}, {"stars": 5, "text": "Help in develop web application..", "date": "Jun 2, 2015"}, {"stars": 5, "text": "Fantastic Tool.", "date": "May 16, 2015"}, {"stars": 5, "text": "Its awesome tool for web developers as well as internet marketers.\n\nProvides lots of information in a very convenient and handy way, have been using it on Firefox.", "date": "May 6, 2015"}, {"stars": 5, "text": "LOVED IT", "date": "Apr 30, 2015"}, {"stars": 1, "text": "No longer works.", "date": "Apr 27, 2015"}, {"stars": 5, "text": "Awesome!!", "date": "Apr 25, 2015"}, {"stars": 5, "text": "My best friend at work", "date": "Apr 23, 2015"}, {"stars": 5, "text": "essential tool", "date": "Apr 14, 2015"}, {"stars": 5, "text": "Use this extension all the time. It's invaluable for developing and troubleshooting HTML issues.", "date": "Apr 14, 2015"}, {"stars": 2, "text": "No matter what I choose, from Display Color to Display Outline, all that ever happens is a new window opens and the progress bar displays, but nothing else. Not sure what the issue is, but I will use this in Firefox, where it works. Doesn't work for me in Chrome.", "date": "Apr 3, 2015"}, {"stars": 5, "text": "good for fast loading of pages to save data by disabling javascript and image. also help collects url for downloading. help with zoom and many more!!!", "date": "Apr 1, 2015"}, {"stars": 5, "text": "nice....", "date": "Mar 26, 2015"}, {"stars": 3, "text": "Something seems to be broke with the latest version of Chrome. I can't edit CSS or view settings.", "date": "Mar 21, 2015"}, {"stars": 5, "text": "Got LOVE <3 for this toolbar...its very practical and efficient in every way possible, I give this toolbar the highest recommendation possible from me to any front end Dev or to be fair any coder out there creating work for the visual end type projects/work, A credit to the creators of this toolbar, there are numerous amounts of things it can do rather than the usual free tools cant do we all are use to, The past dictates anything free is usual trash or full of spam however this actually does... Show more", "date": "Mar 14, 2015"}, {"stars": 5, "text": "so much helpful", "date": "Mar 14, 2015"}, {"stars": 5, "text": "nice tool", "date": "Mar 14, 2015"}, {"stars": 5, "text": "Awesome :)", "date": "Mar 10, 2015"}, {"stars": 5, "text": "What a helpful tool :)", "date": "Mar 8, 2015"}, {"stars": 1, "text": "Useless", "date": "Mar 2, 2015"}, {"stars": 5, "text": "goog toolbar", "date": "Feb 19, 2015"}, {"stars": 5, "text": "Awesome!", "date": "Feb 9, 2015"}, {"stars": 4, "text": "interesting", "date": "Jan 28, 2015"}, {"stars": 5, "text": "Great tool with lots of functionality that eliminates the need for other extensions.", "date": "Jan 23, 2015"}, {"stars": 5, "text": "absolutely indispensable for web developers", "date": "Jan 21, 2015"}, {"stars": 5, "text": "Nice!", "date": "Jan 21, 2015"}, {"stars": 5, "text": "Just for the \"Mark All Links Visited\" option alone, I am sooo happy to have this extension!  \nAnd I'm sure it has many other great features. Thank You!", "date": "Jan 18, 2015"}, {"stars": 5, "text": "Nice", "date": "Jan 8, 2015"}, {"stars": 5, "text": "good", "date": "Jan 1, 2015"}, {"stars": 1, "text": "It doesn't disable css and javascript in iframes.", "date": "Dec 30, 2014"}, {"stars": 5, "text": "the best of it's kind if there are exist!! :)", "date": "Dec 20, 2014"}, {"stars": 5, "text": "very helpful for every developer", "date": "Dec 13, 2014"}, {"stars": 2, "text": "must have but wont work currently not correctly on chrome...", "date": "Dec 5, 2014"}, {"stars": 5, "text": "Been using this tool for years. Love it!", "date": "Dec 2, 2014"}, {"stars": 5, "text": "Thanks to Chris for this awesome tool.", "date": "Nov 21, 2014"}, {"stars": 5, "text": "Has lots of options. Although some seem useless to me, it makes this tool really powerful. Nice job !", "date": "Nov 19, 2014"}, {"stars": 5, "text": "Awesome.", "date": "Nov 9, 2014"}, {"stars": 5, "text": "much better to use in google chrome than other browser", "date": "Nov 6, 2014"}, {"stars": 5, "text": "nice", "date": "Nov 1, 2014"}, {"stars": 4, "text": "Highly Appreciate it.", "date": "Oct 29, 2014"}, {"stars": 5, "text": "it's to good for using web developers.", "date": "Oct 27, 2014"}, {"stars": 5, "text": "very useful", "date": "Oct 25, 2014"}, {"stars": 5, "text": "I use it daily!", "date": "Oct 23, 2014"}, {"stars": 5, "text": "Very helpful for web designers and developers.", "date": "Oct 16, 2014"}, {"stars": 5, "text": "Really helpful!!!", "date": "Oct 5, 2014"}, {"stars": 5, "text": "Excellent tool. Thank you Chris Pederick!!! However, there are subtle differences between Chrome and Firefox that I find annoying. For instance, on chrome, there's no 'web developer toolbar' just the icon and 'edit CSS' window location is at the bottom of the screen. Hope these differences are eliminated in future releases.", "date": "Sep 28, 2014"}, {"stars": 5, "text": "aweasome", "date": "Sep 23, 2014"}, {"stars": 4, "text": "Really good", "date": "Sep 20, 2014"}, {"stars": 4, "text": "Sometimes some tools bug out (though not badly and it's easily solved), but apart from that it's a great extension.", "date": "Sep 17, 2014"}, {"stars": 5, "text": "very useful in web design and development.", "date": "Sep 14, 2014"}, {"stars": 2, "text": "It just does't work in Chrome. Nothing happens no matter what option I click on. It still works in Firefox but does't deal with HTML5 well.", "date": "Sep 13, 2014"}, {"stars": 3, "text": "useful for  web Developer", "date": "Sep 10, 2014"}, {"stars": 4, "text": "Fantastic..!!", "date": "Sep 9, 2014"}, {"stars": 5, "text": "It's great!", "date": "Aug 31, 2014"}, {"stars": 5, "text": "Really awesome, I have seen ever....", "date": "Aug 30, 2014"}, {"stars": 5, "text": "nice tooll for evry one", "date": "Aug 30, 2014"}, {"stars": 5, "text": "Great addon.\nThanks for sharing! :)\n\nIt would be nice if I could save the \"Web Developer\" settings changes in the cloud.", "date": "Aug 26, 2014"}, {"stars": 5, "text": "One problem. The popup window on clicking the extension icon is not big enough to display the tab after \"tools\" tab.", "date": "Aug 23, 2014"}, {"stars": 5, "text": "I've used Chris Pederick's Web Developer tools for years. They're invaluable if you're debugging some JavaScript, or examining page structure.\n\nRecently I've been working on REST API development and the tools work excellently here.\n\nMany, many thanks.", "date": "Aug 22, 2014"}, {"stars": 5, "text": "Great!!", "date": "Aug 20, 2014"}, {"stars": 5, "text": "The Best", "date": "Aug 15, 2014"}, {"stars": 5, "text": "Essential for Web Development & QA", "date": "Aug 5, 2014"}, {"stars": 3, "text": "ok", "date": "Jul 30, 2014"}, {"stars": 5, "text": "Indispensable.", "date": "Jul 24, 2014"}, {"stars": 5, "text": "cool", "date": "Jul 18, 2014"}, {"stars": 5, "text": "This tool is a huge help. Thanks Chris", "date": "Jul 16, 2014"}, {"stars": 5, "text": "it's to good for using web designers and developers.", "date": "Jul 10, 2014"}, {"stars": 4, "text": "best", "date": "Jul 7, 2014"}, {"stars": 5, "text": "It is very good Tool for developers", "date": "Jun 30, 2014"}, {"stars": 5, "text": "Thanks buddy.", "date": "Jun 26, 2014"}, {"stars": 5, "text": "wow, this is crazy", "date": "Jun 25, 2014"}, {"stars": 5, "text": "I love it very mach !", "date": "Jun 21, 2014"}, {"stars": 5, "text": "just love it.", "date": "Jun 20, 2014"}, {"stars": 5, "text": "Nothing overlooked! A \"must have\". Chris's third eye, see all, visionary's wink to his fans!", "date": "Jun 14, 2014"}, {"stars": 4, "text": "more help to view form data and table and div hirarchy", "date": "Jun 12, 2014"}, {"stars": 5, "text": "Excellent", "date": "Jun 12, 2014"}, {"stars": 5, "text": "Great resource for web developers and SEO Professionals.", "date": "Jun 6, 2014"}, {"stars": 5, "text": "This is a really helpful tool. Recommended for anyone working with websites.", "date": "Jun 4, 2014"}, {"stars": 5, "text": "Best", "date": "May 27, 2014"}, {"stars": 2, "text": "I have used this app for years. It is being SUPER buggy with menu visibility and scroll bars inside the app which wont expand to show the the whole navigation area. I will be uninstalling it for now. I really hope to find these small and distracting issues amended one day.", "date": "May 22, 2014"}, {"stars": 5, "text": "Don't leave home without it !", "date": "May 22, 2014"}, {"stars": 5, "text": "Excellent Tool for a Web developer\nThanks Chris", "date": "May 12, 2014"}, {"stars": 3, "text": "Great!", "date": "May 9, 2014"}, {"stars": 5, "text": "Genial !", "date": "May 1, 2014"}, {"stars": 5, "text": "Very useful", "date": "Apr 25, 2014"}, {"stars": 5, "text": "Amazing!", "date": "Apr 24, 2014"}, {"stars": 5, "text": "thanks", "date": "Apr 18, 2014"}, {"stars": 5, "text": "Web developper is the best SEO Extension ever !", "date": "Apr 9, 2014"}, {"stars": 4, "text": "Heads-up: Sites for which you may have blocked JavaScript will be allowed again! (chrome://settings/contentExceptions#javascript)  Adding http://* and https://* Allowed is necessary for the commands to work.\n\nThe array of commands are wonderful but I'd like to suggest some interface improvements:\n\n- (Chrome) Add a search engine. Example: I go up to the omnibox and type `wd [Tab] respon|`... and it auto-suggests the \"View Response Headers\" commands.\n\n- (Any platform) An even better alternative... Show more", "date": "Apr 9, 2014"}, {"stars": 5, "text": "5 stars extension. Nothing else to say :)", "date": "Apr 7, 2014"}, {"stars": 5, "text": "Thnx. Really cool!", "date": "Apr 4, 2014"}, {"stars": 1, "text": "Edit CSS, View CSS does't work from ages and because of this plugin sucks", "date": "Apr 2, 2014"}, {"stars": 5, "text": "Lost without this tool.", "date": "Apr 1, 2014"}, {"stars": 5, "text": "This is a great tool, I loved it, but I find that Disable Javascript option is not working properly. It will be nice if you update it and correct it.", "date": "Mar 30, 2014"}, {"stars": 3, "text": "Sometime work and sometime doesn't work :'(", "date": "Mar 30, 2014"}, {"stars": 5, "text": "Excellent", "date": "Mar 27, 2014"}, {"stars": 3, "text": "Why do some things not work?", "date": "Mar 21, 2014"}, {"stars": 5, "text": "Very useful tool indeed!", "date": "Mar 12, 2014"}, {"stars": 5, "text": "good!", "date": "Mar 5, 2014"}, {"stars": 4, "text": "Works Fine but problems some time at times recursively checking and debugging the code.", "date": "Mar 5, 2014"}, {"stars": 4, "text": "Really love this plugin but I have one little feature request (unless its a feature that's there but buried)\n\nI would like to have Display Window Size as an option in the \"information\" tab. You have great tools for responsive design, but nothing that shows the current size of the window. \n\nThat is all. \n\nGREAT otherwise", "date": "Feb 26, 2014"}, {"stars": 5, "text": "very handy tool when you need to debug a website", "date": "Feb 23, 2014"}, {"stars": 2, "text": "It let open all ad pop-ups..", "date": "Feb 22, 2014"}, {"stars": 5, "text": "i know that i will love it...thanx...if i got to know it better...probably couldnt live without it...", "date": "Feb 22, 2014"}, {"stars": 3, "text": "I guess . . .", "date": "Feb 18, 2014"}, {"stars": 5, "text": "Many Useful tools for web developers specially nebies like me. Easy on the eyes strategy for displaying details about  web page. Web Developer tool from Chrome browser is amazing but all that information is presented in a cluttered manner. This App allows to select  a page element or attribute by toggling them individually or combined. Examples: Outline Absolutely positioned elements or floated elements or frames, blah blah, Can validate CSS, HTML..Detailed info on links... IT IS EASY on the ... Show more", "date": "Feb 18, 2014"}, {"stars": 5, "text": "it sgood so nice to use", "date": "Feb 18, 2014"}, {"stars": 5, "text": "Amazing! Increased my efficiency!", "date": "Feb 15, 2014"}, {"stars": 5, "text": "so many handy features. I use it all the time.", "date": "Feb 7, 2014"}, {"stars": 5, "text": "Without a doubt its a best companion for any web developer.", "date": "Feb 5, 2014"}, {"stars": 5, "text": "really usefull...", "date": "Feb 3, 2014"}, {"stars": 5, "text": "I've been using this for years and find it a very invaluable tool. Can't work without it!", "date": "Jan 26, 2014"}, {"stars": 5, "text": "Great!", "date": "Jan 22, 2014"}, {"stars": 5, "text": "This amazing tool is among the most versatile and useful I have encountered for development. I mainly use it to learn through example based observational analysis.", "date": "Jan 19, 2014"}, {"stars": 5, "text": "awesome", "date": "Jan 17, 2014"}, {"stars": 5, "text": "Very useful :) .", "date": "Jan 9, 2014"}, {"stars": 5, "text": "love it and easy to use .", "date": "Jan 7, 2014"}, {"stars": 2, "text": "Does not work properly. When i try to edit or view CSS in whatever webpage i want, the extension just freezes the Google Chrome Tab and after a few seconds it just doesn't do nothing.", "date": "Jan 5, 2014"}, {"stars": 1, "text": "Bugged on search", "date": "Jan 3, 2014"}, {"stars": 5, "text": "Excellent", "date": "Jan 2, 2014"}, {"stars": 3, "text": "There are some issues with the dropdown menu when you click the icon. I think this may be limited to Chrome on OS X or Macs with Retina display.", "date": "Jan 2, 2014"}, {"stars": 1, "text": "it was the worst thing ever!!!!!!!!", "date": "Dec 20, 2013"}, {"stars": 4, "text": "great tool. thanks.", "date": "Dec 19, 2013"}, {"stars": 4, "text": "Came here by way of the Window Resizer fiasco, happy with what I found.", "date": "Dec 13, 2013"}, {"stars": 5, "text": "enjoy", "date": "Dec 12, 2013"}, {"stars": 5, "text": "I love it :x", "date": "Dec 7, 2013"}, {"stars": 5, "text": "As a web developer, this is crucial to my work.", "date": "Dec 4, 2013"}, {"stars": 3, "text": "The Chrome version has been wacky lately. Not sure if it's because of Chrome or WD. However, this tool is amazing. I'd be lost without it as I'm sure many others would be too.\n\nThere are several things not working properly for me. Reload and Layouts. They just don't work at all. I see others are experiencing it too but no one has a fix from what I can tell.", "date": "Dec 2, 2013"}, {"stars": 5, "text": "Great tool. love it", "date": "Dec 2, 2013"}, {"stars": 5, "text": "I use this every day.  Would be lost without it.", "date": "Nov 24, 2013"}, {"stars": 5, "text": "great extention ! love it !", "date": "Nov 21, 2013"}, {"stars": 4, "text": "Has some neat features made simple for those that aren't experts", "date": "Nov 18, 2013"}, {"stars": 4, "text": "the tool is great! but couple of things i noticed to make it the best. \n1) the size of the popup when u click the tool is smaller than it should be.\n2) i would love to be able to add more custom fields for form population.\n\nThanks", "date": "Nov 13, 2013"}, {"stars": 5, "text": "i love it in FF i love it in GC !!!", "date": "Nov 10, 2013"}, {"stars": 5, "text": "Be part in my life", "date": "Nov 9, 2013"}, {"stars": 5, "text": "i'm love itz", "date": "Nov 1, 2013"}, {"stars": 5, "text": "Awesome!", "date": "Oct 30, 2013"}, {"stars": 5, "text": "best plug-in ever!", "date": "Oct 28, 2013"}, {"stars": 5, "text": "Great!\nFinally a good web app instrument. Congratulations ; )", "date": "Oct 27, 2013"}, {"stars": 5, "text": "It was a helpful tool for my class", "date": "Oct 27, 2013"}, {"stars": 3, "text": "This is a great tool in Firefox, but in Chrome whenever I click the extension icon to bring up the options popup, the popup has annoying scroll bars on the bottom and right. These bars aren't scrollable though. What's up with that!?", "date": "Oct 25, 2013"}, {"stars": 5, "text": "a great tool for any web developer.", "date": "Oct 25, 2013"}, {"stars": 5, "text": "A great tool, and a must have for any Chrome power user.", "date": "Oct 22, 2013"}, {"stars": 5, "text": "A very useful tool for both developers of web pages", "date": "Oct 18, 2013"}, {"stars": 5, "text": "It is very helpfull, the best development extension :) \nBut, it would be very nice if it had a inspect element tool :)", "date": "Oct 18, 2013"}, {"stars": 5, "text": "Very helpful extension!", "date": "Oct 18, 2013"}, {"stars": 5, "text": "Nice", "date": "Oct 18, 2013"}, {"stars": 5, "text": "Excellent.", "date": "Oct 14, 2013"}, {"stars": 5, "text": "very good. thank you", "date": "Oct 10, 2013"}, {"stars": 5, "text": "Must have! Thanks", "date": "Oct 4, 2013"}, {"stars": 5, "text": "One of the best extensions ever in the web development world. Great job, long time user, long time love and loyalty. I have tried to use other tools sense then, but they all end up being additions to using this one first.", "date": "Oct 2, 2013"}, {"stars": 5, "text": "love it it makes my life easier thnx dude", "date": "Sep 30, 2013"}, {"stars": 5, "text": "Indispensable whileusing frameworks like Twitter Bootstrap, Foundation and the like. I use it on all my browsers (Opera, Firefox and Chrome) for extensive checking.", "date": "Sep 17, 2013"}, {"stars": 4, "text": "ok bgt", "date": "Sep 12, 2013"}, {"stars": 5, "text": "One of the most brillant extension. A must for any web designer.", "date": "Sep 9, 2013"}, {"stars": 5, "text": "like", "date": "Sep 4, 2013"}, {"stars": 3, "text": "Quite nice, but recently the W3C services got broken. Any fixes for that?", "date": "Aug 29, 2013"}, {"stars": 5, "text": "Great tool ever i see", "date": "Aug 28, 2013"}, {"stars": 5, "text": "Great tool for web developers!", "date": "Aug 27, 2013"}, {"stars": 5, "text": "good.. and very useful plugin", "date": "Aug 27, 2013"}, {"stars": 5, "text": "Great Tool. I used this in Firefox for months, and just saw that it also exists for Chrome.", "date": "Aug 20, 2013"}, {"stars": 5, "text": "Best one tool", "date": "Aug 15, 2013"}, {"stars": 1, "text": "Used to love this plugin for live CSS editing. But now, I can't resize the window. Makes editing impossible...pretty much useless.", "date": "Aug 14, 2013"}, {"stars": 5, "text": "Why I can't find Chinese version of this?\nThere before I can find Chinese version easily!\nIt's strange now!\nI can't find many old used extensions through store search!", "date": "Aug 14, 2013"}, {"stars": 5, "text": "This tool is awesome...!!\n------web Designer-------", "date": "Aug 11, 2013"}, {"stars": 5, "text": "Streamlines workflow. Been a long-term fan. It's super useful.", "date": "Aug 8, 2013"}, {"stars": 5, "text": "Good", "date": "Aug 7, 2013"}, {"stars": 5, "text": "very nice", "date": "Jul 29, 2013"}, {"stars": 5, "text": "very good thank you", "date": "Jul 24, 2013"}, {"stars": 5, "text": "Best.extension.ever.\n\nMost of these things I do manually with CSS or code.  Then I have to go back and remember what I added and remove them.\n\nAWESOME Tools!!", "date": "Jul 21, 2013"}, {"stars": 5, "text": "Very usefull when analysing the design of a website and no only.", "date": "Jul 20, 2013"}, {"stars": 5, "text": "Very useful plugin if your into web design. Has many excellent tools, and  is a must have add on!", "date": "Jul 18, 2013"}, {"stars": 5, "text": "The absolute essentials for any web developer! So many features, so much time to save for me!", "date": "Jul 16, 2013"}, {"stars": 5, "text": "I am amazed by this tool ever since I first used it. Brilliant.", "date": "Jul 6, 2013"}, {"stars": 5, "text": "Woks great - has helped me out quite a few times in a short time period.", "date": "Jul 2, 2013"}, {"stars": 5, "text": "Best web dev plugin.", "date": "Jun 28, 2013"}, {"stars": 5, "text": "Exactly what I was looking for ! Great tool", "date": "Jun 28, 2013"}, {"stars": 5, "text": "good than Firefox", "date": "Jun 23, 2013"}, {"stars": 5, "text": "this is awesome", "date": "Jun 21, 2013"}, {"stars": 5, "text": "strongly recommended.", "date": "Jun 18, 2013"}, {"stars": 5, "text": "perfect", "date": "Jun 12, 2013"}, {"stars": 5, "text": "Best web developer tool for any browser!", "date": "Jun 3, 2013"}, {"stars": 5, "text": "This tool was particularly helpful in helping me decipher which  style were applied to elements. So awesome I will make a donation!", "date": "Jun 1, 2013"}, {"stars": 3, "text": "nice", "date": "May 30, 2013"}, {"stars": 5, "text": "Really useful!", "date": "May 29, 2013"}, {"stars": 4, "text": "This is a great extension for those that work with the web as a developer or supporter.  This Chrome version lacks some of the features of the original Firefox version, which is the only thing that keeps me from giving this extension five stars.", "date": "May 14, 2013"}, {"stars": 1, "text": "The abilities Chrome has built in are better than this extension.", "date": "May 13, 2013"}, {"stars": 5, "text": "Fantastic.\n\nI know it wasn't developed for this - but it's an awesome tool to help with investigating online fraud.", "date": "May 11, 2013"}, {"stars": 5, "text": "A Great tool for web developement, I use it everyday.", "date": "May 9, 2013"}, {"stars": 5, "text": "Outstanding!", "date": "May 7, 2013"}, {"stars": 3, "text": "So many bugs. Want to delete your domain cookies? NO DICE! Y'all are gonna have to restart your browser if you want that to go down.\n\nChrome is my browser of choice, but too bad the Firefox dev tools extension is waaaay superior to this junk.", "date": "Apr 25, 2013"}, {"stars": 5, "text": "Added to my must-have addons.", "date": "Apr 21, 2013"}, {"stars": 5, "text": "I like it very much \n\nmy must favorit tool in webprogramming\n\ngreetings from pforzheim, black forest, germany\n\nholger", "date": "Apr 20, 2013"}, {"stars": 5, "text": "Must have!", "date": "Apr 18, 2013"}, {"stars": 5, "text": "I love it. It makes my life easy.", "date": "Apr 14, 2013"}, {"stars": 5, "text": "powerful...", "date": "Apr 6, 2013"}, {"stars": 5, "text": "I've been using this extension for years now and I love it. It's particularly helpful and a must get for all web developers and designers.  \nWith this extension, you can easily make a real time changes to your website without having to touch the real code", "date": "Mar 22, 2013"}, {"stars": 5, "text": "love this!", "date": "Mar 20, 2013"}, {"stars": 5, "text": "Can't work without this extension, the best one for web developper", "date": "Mar 8, 2013"}, {"stars": 5, "text": "fantastic. gets better with every version.", "date": "Mar 6, 2013"}, {"stars": 5, "text": "its helper extension i  use it to develop my blog", "date": "Mar 1, 2013"}, {"stars": 5, "text": "I literally could not function without this extension. It increased my productivity by several factors and allows me to figure out issues much faster.\n\nI also had an issue with it and the developer was able to help me on his website's forums in a timely manner.", "date": "Feb 25, 2013"}, {"stars": 5, "text": "This item can read every page that you visit -- your bank, your web email, your Facebook page, and so on. Often, this kind of item needs to see all pages so that it can perform a limited task such as looking for RSS feeds that you might want to subscribe to.", "date": "Feb 25, 2013"}, {"stars": 5, "text": "I use this all the time, it's awesome.", "date": "Feb 3, 2013"}, {"stars": 5, "text": "Way back in the day it was literally this extension alone that convinced me to switch to Firefox.  Well it's just as good on Chrome.  I can honestly say that if this extension didn't exist my job would be a lot harder.  Thank you very much.", "date": "Feb 1, 2013"}, {"stars": 5, "text": "By Far the best plugin I have seen for web developers.", "date": "Jan 27, 2013"}, {"stars": 5, "text": "it sucks", "date": "Jan 25, 2013"}, {"stars": 5, "text": "This tool helps me earn money every day, (Every day I work), its features are really helpful and provide you the information you need with an unparalleled ease! \n\nThank you for developing this extension for us developers!", "date": "Jan 21, 2013"}, {"stars": 5, "text": "very useful for all web designer", "date": "Jan 13, 2013"}, {"stars": 5, "text": "Yeah ! .. great tool !.. tnkx for sharing !", "date": "Jan 9, 2013"}, {"stars": 5, "text": "I really love it. It helps me a lot while developing web pages.", "date": "Jan 3, 2013"}, {"stars": 5, "text": "Nice Tool for developers", "date": "Dec 24, 2012"}, {"stars": 5, "text": "Great Tool!!!", "date": "Dec 23, 2012"}, {"stars": 5, "text": "Excellent collection of tools. I can replace around 50 of my bookmarklets with this.", "date": "Dec 17, 2012"}, {"stars": 5, "text": "simple and awesome tool for key needs", "date": "Dec 7, 2012"}, {"stars": 4, "text": "Excellent Apps, helps me with all my development CSS issues. Great Job.", "date": "Nov 30, 2012"}, {"stars": 5, "text": "I have been developing for the last 13 years and this is one of the best Web Developer tools I've ever used. I've never written a review before either. I'm also Dyslexic, this has taken me 30 min... that's how much I love it. ;)", "date": "Nov 29, 2012"}, {"stars": 5, "text": "Just love this extension !!! big time saver ... a must extension for frontend developers", "date": "Nov 28, 2012"}, {"stars": 5, "text": "Awesome tool!", "date": "Nov 13, 2012"}, {"stars": 5, "text": "Beautiful!  Could get a javascript debugger integrated", "date": "Nov 10, 2012"}, {"stars": 5, "text": "Very usefull...", "date": "Nov 9, 2012"}, {"stars": 5, "text": "Indispensable tool. Everything is easily accessible and works as intended. Looking forward to the code-merged version with Firefox.", "date": "Oct 31, 2012"}, {"stars": 2, "text": "Really poor compared to the Firefox version.  \n1) I can't find a way to display it as it's own toolbar.\n2) Can't turn on highlight/split screen mode so that I can click on various images and see the CSS in a second pane.\n\nPretty useless.  Probably due to Chrome's limitations?", "date": "Oct 30, 2012"}, {"stars": 5, "text": "Best! Ever!", "date": "Oct 25, 2012"}, {"stars": 5, "text": "It's The first extension that I install in every computer i use that has  Chrome/Firefox installed. A must for web developers. Thank you Chris Pederick.", "date": "Oct 23, 2012"}, {"stars": 5, "text": "Get it for the instant visible checkmarks re validation & syntax (including css), use it for the block highlighting.", "date": "Oct 22, 2012"}, {"stars": 1, "text": "does not work \nclick on icons and does nothing", "date": "Oct 20, 2012"}, {"stars": 4, "text": "No hotkeys for ruler and another functions", "date": "Oct 18, 2012"}, {"stars": 4, "text": "Made the switch to Chrome (from FF) recently, and very happy to see this extension ported!  Not as feature-rich as the FF version as others have noted, but very good nonetheless.", "date": "Oct 13, 2012"}, {"stars": 5, "text": "ok", "date": "Oct 1, 2012"}, {"stars": 5, "text": "Awesome, doesn't need words. Just can't live without it. Hats off to chrispederick...!!", "date": "Sep 26, 2012"}, {"stars": 5, "text": "One of my most used extensions, perfect to identify hidden objects in a website. Also perfect to write selenium tests for web 2.0 applications.\n\nThe extension works fast & stable. Great look & feel, love to use it every day!", "date": "Sep 26, 2012"}, {"stars": 5, "text": "Really nice, i love the show css js function so nice", "date": "Sep 25, 2012"}, {"stars": 5, "text": "Awesome tool, definitely helping me out with programming", "date": "Sep 24, 2012"}, {"stars": 5, "text": "Great extension. This is the extension I missed the most after transitioning from firefox to chrome. So happy to find this chrome version by the same developer. I donated money for this ext when I used it on firefox, it's that good. Keep up the great work Chris!", "date": "Sep 22, 2012"}, {"stars": 5, "text": "love this tools make it easier for me to do my work", "date": "Sep 14, 2012"}, {"stars": 5, "text": "Fantastic suite of tools for your web development pleasure! :D", "date": "Sep 12, 2012"}, {"stars": 5, "text": "It has some great features including ruler for measuring elements, quick disable javascript and form populater which saves me loads of time!!", "date": "Sep 2, 2012"}, {"stars": 5, "text": "I love it! Thanks for your work", "date": "Aug 21, 2012"}, {"stars": 5, "text": "Works great for testing on my local web server. Thanks for bringing this to chrome.", "date": "Aug 14, 2012"}, {"stars": 3, "text": "The recent version has a issue where I cannot scroll down to see the whole site and highlight the footer items for information. This wasn't an issue on the previous versions. Hope it will be fixed soon.", "date": "Aug 7, 2012"}, {"stars": 5, "text": "Awesome plugin. This, paired with webkit's inspector, are priceless for web developers. No browser comes close to the utility that Google Chrome does equipped with these two tools.", "date": "Jul 26, 2012"}, {"stars": 3, "text": "The new version needs access to a to all my browsing history, private data and so on... is it dangerous? Why?!", "date": "Jul 25, 2012"}, {"stars": 5, "text": "Having used this in Firefox, I was delighted to find that the Chrome version provided all the functionality I personally needed. This is simply the best all-in-one tool around. I suppose that after using it a while, I may find something I don't like, but hat has not happened yet. Fine work. To those people who insist on whining about their browsing history being accessed, well, as a developer you should be capable enough to research that before you complain. You should also be clever enough t... Show more", "date": "Jul 8, 2012"}, {"stars": 3, "text": "Why does the extension need access to all my browsing history and private data?", "date": "Jun 28, 2012"}, {"stars": 5, "text": "Awesome addon, thanks for this, makes so many dev tasks 10x easier", "date": "Jun 27, 2012"}, {"stars": 4, "text": "Chris Pederick deserves a knighthood for services to the peoples of the web.\n\nSuper tools -- but why the need to see my history and sniff my data?", "date": "Jun 27, 2012"}, {"stars": 5, "text": "The issue with the extension allowing notifications on all sites has been fixed in version 0.4.8: http://chrispederick.com/work/web-developer/help/#allow-notifications", "date": "Jun 27, 2012"}, {"stars": 1, "text": "WIth the new permission requirements I am uninstalling the extension.", "date": "Jun 26, 2012"}, {"stars": 1, "text": "Can you explain why do you need access to browser history and other private information?", "date": "Jun 26, 2012"}, {"stars": 1, "text": "why you need access to the browser history, all visited websites, and other private infos?", "date": "Jun 26, 2012"}, {"stars": 5, "text": "Very usefull. Great tool.", "date": "Jun 26, 2012"}, {"stars": 1, "text": "Why do you need to know my browsing history? Why the need to access my web data?\n\nThis update is cause for uninstallation.", "date": "Jun 26, 2012"}, {"stars": 1, "text": "WHY ADDED PERMISSION? WHY NEED TO KNOW MY BROWSING HISTORY? WHY NEED TO ACCESS MY WEB DATA?\n\nwill uninstall tomorrow if this madness don't stop.", "date": "Jun 26, 2012"}, {"stars": 4, "text": "Thank you", "date": "Jun 21, 2012"}, {"stars": 4, "text": "I really do not know how to use it", "date": "Jun 2, 2012"}, {"stars": 5, "text": "one of the best tools in the world ( free )", "date": "Jun 1, 2012"}, {"stars": 5, "text": "Lovely extension. So many options!!!", "date": "May 29, 2012"}, {"stars": 5, "text": "I love this tool!", "date": "Apr 20, 2012"}, {"stars": 5, "text": "I can't design without it!", "date": "Apr 20, 2012"}, {"stars": 3, "text": "Couldn't view css", "date": "Apr 17, 2012"}, {"stars": 5, "text": "Simply amazing and useful tool for a Web Developer", "date": "Apr 10, 2012"}, {"stars": 5, "text": "The best CSS tool in my opinion!!  It has helped me tremendously in a few binds trying to figure out where the css problems were in my code.  \nLove it!!!", "date": "Apr 9, 2012"}, {"stars": 1, "text": "I can't find any way to add different dimensions to resize.", "date": "Apr 5, 2012"}, {"stars": 5, "text": "good tools for developer", "date": "Apr 1, 2012"}, {"stars": 5, "text": "Nice tool. Best I have used thus far.", "date": "Mar 23, 2012"}, {"stars": 4, "text": "Great extension! but I need the ability to resize my browser window to mobile browser sizes, there's only the options 800x600 (which nobody uses) and  1024x768. Please can you add 320x480, 480x800 and 640x960 - either that or the ability to define your own screen size?", "date": "Mar 15, 2012"}, {"stars": 5, "text": "Awesome！！", "date": "Mar 15, 2012"}, {"stars": 5, "text": "Love this tool! I am glad it is now both in Firefox and Chrome. This is great for development. Keep up the good work!", "date": "Feb 24, 2012"}, {"stars": 4, "text": "Not as feature packed or as useful as the Firefox version, but still a decent tool for any web developer. Recommended.", "date": "Feb 16, 2012"}, {"stars": 4, "text": "- Cannot close WebDev panel with clicking on WebDev extension icon again.\n- Cannot see which tool tab contains enabled tools\n- Switching between will more comfortable by hover, not click", "date": "Feb 14, 2012"}, {"stars": 5, "text": "Masterpiece I love this extension.", "date": "Feb 13, 2012"}, {"stars": 3, "text": "Not work on GC 17 Beta for Linux", "date": "Feb 10, 2012"}, {"stars": 5, "text": "really cool", "date": "Feb 2, 2012"}, {"stars": 5, "text": "Allways used on Firefox, now be glad to be possible use it on Chrome", "date": "Jan 30, 2012"}, {"stars": 5, "text": "thanks, great job !", "date": "Jan 28, 2012"}, {"stars": 4, "text": "I love this extension. I've been using it for years.\n\nMy only complaint is that not all features were moved over from the firefox version. Most important of them is the disable javascript feature. Wish this feature was added to the chrome version...\n\nOtherwise a definite must have.", "date": "Jan 9, 2012"}, {"stars": 3, "text": "It's a great tool, but the menu doesn't readjust itself after resizing the browser window.", "date": "Jan 9, 2012"}, {"stars": 5, "text": "Very convenient.", "date": "Jan 6, 2012"}, {"stars": 5, "text": "Very complete, the best", "date": "Jan 5, 2012"}, {"stars": 5, "text": "I love this app, so simple and easy to use.", "date": "Jan 4, 2012"}, {"stars": 3, "text": "chrome built in dev tool is way better, but nice addition though", "date": "Dec 31, 2011"}, {"stars": 5, "text": "Wonderful!\n\nI love it but I think that there are some things yuo could add.\n\n* Disable HTML5\n(to see if a site is compatible to older browsers)\n\n* Disable css3\n\n* Disable -webkit -moz and -o\n\n* Disable JavaScript\n\nNice", "date": "Nov 25, 2011"}, {"stars": 5, "text": "This extension really helps with my Developing! Thanks for porting it over to Chrome!", "date": "Nov 22, 2011"}, {"stars": 3, "text": "I don't see a lot of uses for this, but it's a rather  interesting demonstration of DOM manipulation.", "date": "Nov 19, 2011"}, {"stars": 5, "text": "Best.", "date": "Nov 15, 2011"}, {"stars": 5, "text": "The best!", "date": "Nov 14, 2011"}, {"stars": 5, "text": "Love it!!\n\nChrome is definitely my main browser! :)", "date": "Nov 11, 2011"}, {"stars": 5, "text": "awesome tool. thanks for your hard work chris.\n\nit _is_  missing some functionality compared to the ff version but there are other ways to skin those cats - use the built-in dom tools to edit css (you bug-reporters in the reviews section people) and write your js so that you can turn off any js based functional enhancements (cos you progressively enhance your pages, don't you?)!", "date": "Oct 27, 2011"}, {"stars": 5, "text": "This is a fantastic add-on for Chrome. There are so many little functions in here that make day-to-day page checking a breeze. I especially love the ability to quickly switch to the print stylesheet.", "date": "Oct 26, 2011"}, {"stars": 4, "text": "I love this extension and wish I could continue to use it, but have an issue with what I read in the details section:\n\nThis extension can access:\nYour data on all websites\n\nThis item can read every page that you visit -- your bank, your web email, your Facebook page, and so on. Often, this kind of item needs to see all pages so that it can perform a limited task such as looking for RSS feeds that you might want to subscribe to.\n\nCaution: Besides seeing all your pages, this item could use your... Show more", "date": "Oct 26, 2011"}, {"stars": 4, "text": "Doesn't allow me to add custom responsive layouts as far as I can tell. Otherwise, this extension is useful.", "date": "Mar 10, 2011"}]