[{"stars": 4, "text": "Doesn't work with Chromes \"Grouping of Tabs\" feature unfortunately. Otherwise great extension.", "date": "Mar 10, 2024"}, {"stars": 5, "text": "Best extenstion ever! But stopped working after the last Chrome update. I suppose it fails to work normally with active usage of new synced tab groups. Please can you check it?", "date": "Mar 5, 2024"}, {"stars": 5, "text": "I use this cycle feature so much, I try to mimic this feature in other software I use to keep the muscle memory. Would love to have this in ObsidianMD, VSCode, etc. Really helps me zip around. This extension has earned a dedicated button on my mouse on desktop pc and trackpad gesture on laptop.", "date": "Feb 29, 2024"}, {"stars": 4, "text": "Excellent extension. Unfortunately it doesn't work with the Chrome's new \"Tab Group\" feature. Will change to a 5 out of 5 once it does.", "date": "Feb 21, 2024"}, {"stars": 5, "text": "Please update the code to work for across the group, the extension does'nt work for group feature introduced recently in chrome. It will be a great help if u do so.", "date": "Feb 1, 2024"}, {"stars": 4, "text": "Seems to not working for some website anymore after recent Chrome update.", "date": "Nov 20, 2023"}, {"stars": 3, "text": "Three stars, as the extension itself works flawlessly.\n\nHowever ATTN: The author tracks installation and update and has Google Analytics included as well (see `background.js` in the repository for yourself).\n\"Bad smell\", as he doesn't point to this fact nowhere, \"VERY bad smell\".\n\nBetter use the fork called \"Open Last Tab\", where this tracking code is removed.", "date": "Nov 6, 2023"}, {"stars": 5, "text": "Next to ad-block, and a password manager, this is an essential extension for me.", "date": "Oct 10, 2023"}, {"stars": 5, "text": "exactly what I need. Many thanks to the developer!", "date": "Aug 8, 2023"}, {"stars": 5, "text": "Awesome", "date": "Jun 25, 2023"}, {"stars": 1, "text": "The tab order is often incorrect. I'm only using the \"slow switch\" function. Going backwards usually (but not always) works as expected. But going forwards almost never does. It usually switches to different windows and/or completely unrelated, long-unused tabs. Perhaps it would help to explain the exact logic used for deciding the tab order. Currently, it seems roughly random to me.", "date": "Jun 13, 2023"}, {"stars": 5, "text": "Stopped working. Uninstalled, reinstalled. Now it works again. (New version? Not sure.)\n\nAnyway, good extension. :-)", "date": "May 26, 2023"}, {"stars": 5, "text": "I could not change the shortcut keys to Ctrl+Tab in  Chrome portable Version 111.0.5563.111 nor find any options under Manage extension,  but I was able to change the shortcut key to Alt+1 to  go to last accessed  tab by going to chrome://extensions/shortcuts, (which is not part of the extensions menu). \n\nThus while not being able to change the (apparently) absolutely forbidden (by Chrome - though Chromium-based browsers as Vivaldi do, as well as the superior Firefox) Ctrl+Tab switch  yet CLU... Show more", "date": "Mar 27, 2023"}, {"stars": 4, "text": "Great extension, but when loading any chat forum that's based on the Discourse plugin, the page fails to load (it rejects a lot of inline scripts). This made it unusable for me, as many of the resources I visit are chat forums.", "date": "Mar 16, 2023"}, {"stars": 5, "text": "I've been using this for four years now and can't imagine life without it. I just started using a new machine and thought Chrome was broken until I realized I hadn't installed this extension yet!", "date": "Nov 14, 2022"}, {"stars": 5, "text": "This extension is super useful, it does something that Chrome should have being doing out of the box for years (like Firefox for example)", "date": "Oct 24, 2022"}, {"stars": 5, "text": "Does the job because Chrome doesn't by default. 10/10 always install in all my chrome-based browsers that don't have LRU tab cycling", "date": "Sep 11, 2022"}, {"stars": 5, "text": "Works perfectly and for me is indispensible for Chrome since I can't set the behavior with built in controls like Firefox. Well done.", "date": "Sep 10, 2022"}, {"stars": 5, "text": "Great work! Simple and just does what it should", "date": "Aug 2, 2022"}, {"stars": 2, "text": "ALT+W works but ALT+S doesn't work.", "date": "Jul 9, 2022"}, {"stars": 5, "text": "Do what is expected!", "date": "Jul 4, 2022"}, {"stars": 5, "text": "life saver , save you lots of time! Thx dev", "date": "Jun 30, 2022"}, {"stars": 5, "text": "I added it and it just works, great work!", "date": "Jun 10, 2022"}, {"stars": 5, "text": "a life saver! I can't believe i used chrome for so long without this. It's criminal to not use this.", "date": "May 26, 2022"}, {"stars": 5, "text": "Hi there.\n\nThat is my first review in \"chrome web store\", and that is not because I am rarely using a browser, but rather because I have not noticed such a decent boost in my productivity during the work, until I faced your extension, and this extension is the best productivity boost in the entire \"chrome web store\". I had used a similar one (but the older ext. required me to install an .exe file, and it worked only on Windows systems), however this ext. works flawlessly and it is crossplatfo... Show more", "date": "May 23, 2022"}, {"stars": 5, "text": "At last!!! thanks", "date": "Apr 26, 2022"}, {"stars": 5, "text": "Works very well, and has been for years now!\nSuggestion --> I'd like an option to switch between tabs of active window only.", "date": "Apr 7, 2022"}, {"stars": 5, "text": "Worked like a charm! Just a note that the combination on Mac is with the option button. I also linked the shortcut to my mouse scroll wheel button to quickly change tab while reading without keyboard.", "date": "Mar 14, 2022"}, {"stars": 5, "text": "This is Good!", "date": "Mar 3, 2022"}, {"stars": 5, "text": "It works!  Just what I was looking for...", "date": "Feb 21, 2022"}, {"stars": 5, "text": "This is the extension I've been looking for!!! Thank you Harshay!!", "date": "Feb 11, 2022"}, {"stars": 5, "text": "It works, and Chrome is much more useable with this extension.", "date": "Jan 30, 2022"}, {"stars": 4, "text": "Could be better, e.g. show preview of tabs you are cycling. But given current standards and there is absolutely nothing. This is work of genius... All these other extensions are not even usable in 99.9% cases... Imagine google is billion $ company and couldn't even include tab cycling, imbeciles, they are probably too busy making money to include even most basic functions one could think of...\n\nMy only problem: it doesn't cycle continuously, I got 2 times back and then when I press forward: i... Show more", "date": "Dec 30, 2021"}, {"stars": 5, "text": "Chrome menu More tools> Extensions: choose 3 dashes> Keyboard shortcut... Find this extension to assign shortcut to it.\nI choose Alt+Q; it works perfectly and help me to jump between 2 recent tabs quickly.", "date": "Oct 30, 2021"}, {"stars": 5, "text": "Cool stuff!", "date": "Oct 23, 2021"}, {"stars": 4, "text": "Can I change the extension icon? It doesn't look expressive on the taskbar.", "date": "Oct 2, 2021"}, {"stars": 5, "text": "I tried quite a few other solutions in the past, and found this one works the best!", "date": "Sep 16, 2021"}, {"stars": 5, "text": "Using it all the time", "date": "Sep 9, 2021"}, {"stars": 5, "text": "good job! made my life easier", "date": "Sep 1, 2021"}, {"stars": 5, "text": "one of the best extensions I have, and a great time saver", "date": "Aug 17, 2021"}, {"stars": 5, "text": "I've been using it for years. Super helpful and simple. My only question is why is this not standard Chrome behaviour?", "date": "Aug 12, 2021"}, {"stars": 5, "text": "That's what I want. Thank you!", "date": "Jul 23, 2021"}, {"stars": 5, "text": "No frills extension. Does exactly what it advertises.", "date": "Jun 30, 2021"}, {"stars": 5, "text": "Exactly what I need to simple dumb last tabs switch! No idea why this still not in Chrome default code!", "date": "Jun 25, 2021"}, {"stars": 5, "text": "It's the best one out there. I know it's for 'clut'ing but it would also be nice to have the ability to alt-q repeatedly to scroll through all the tabs much like in Windows. Well done. I've used this extension for at least a couple years on several gmail accounts.", "date": "Jun 19, 2021"}, {"stars": 5, "text": "I was using the other more popular extension (Jason's Recent Tabs) until that one updated in April and required a lot more permissions for no obvious reasons.\n\nSwitched to this one and got the same functionality with few permissions asked.", "date": "Jun 2, 2021"}, {"stars": 5, "text": "good extension", "date": "May 17, 2021"}, {"stars": 5, "text": "Excellent! It does exactly what it should do without asking for unnecessary permissions.", "date": "Apr 27, 2021"}, {"stars": 5, "text": "Wonderful extension, and with some Stackoverflow it's possible to make it run from Ctrl+Tab hotkey, but is there an option to make newly created tabs count as \"most recent\"? So when I open tabs in background, I can easily switch to it by pressing Ctrl+Tab?", "date": "Mar 27, 2021"}, {"stars": 5, "text": "Super helpful! I love that you can set different shortcuts for switching between last 2 tabs vs. going backwards through all the tabs you recently visited", "date": "Mar 10, 2021"}, {"stars": 4, "text": "Great extension, and better than all the alternatives I tried. I don't know if it's due to a recent update or just my imagination, but I seem to notice that the delay for toggling between more than two tags has gone up, so I often end up accidentally jumping to a third or fourth tab if I hit the shortcut twice in a row. Perhaps the developer should consider letting the user set this delay.", "date": "Jan 26, 2021"}, {"stars": 5, "text": "It's Working! Great!", "date": "Oct 26, 2020"}, {"stars": 5, "text": "Love it", "date": "Oct 17, 2020"}, {"stars": 5, "text": "Simple, YET helpful!", "date": "Sep 21, 2020"}, {"stars": 5, "text": "Cannot imagine browsing without this extension. Such a great time saver when you have too may tabs open (which is inevitably always).", "date": "Sep 4, 2020"}, {"stars": 5, "text": "Thank you! Mimics the handy Firefox feature to switch to the previous tab using the keyboard.", "date": "Aug 19, 2020"}, {"stars": 2, "text": "This extension hasn't been updated since 2016 and no longer works.", "date": "Aug 18, 2020"}, {"stars": 5, "text": "It does just what I needed, and it is really easy to get used to \"ALT+W\" shortcut. If you usually open a lot of tabs it will increase by far your agility to switch between them.", "date": "Aug 6, 2020"}, {"stars": 4, "text": "Works great, but don't understand the appeal of 'rapid' switching backward. I wish as long as ctrl is pressed, it would continue backwards every time tab is pressed instead of having to press it 'rapidly'. Like how the app-switcher for macOS works. You don't need to be 'rapid' about switching through the MRU list... That is just silly. But solid extension otherwise.", "date": "Jul 1, 2020"}, {"stars": 5, "text": "just i need this!! Thanks!", "date": "Apr 15, 2020"}, {"stars": 5, "text": "perfect complement to 'go to playing tab' if you have multiple chrome windows/tabs open", "date": "Apr 10, 2020"}, {"stars": 5, "text": "This is exactly what I was loking for. Thank you Harshay.", "date": "Apr 1, 2020"}, {"stars": 4, "text": "Is there any way to get it to work on Brave Browser?", "date": "Feb 27, 2020"}, {"stars": 5, "text": "Love those one purpose nicely integrated extensions. \nSimple and efficient functionality with big productivity improvements.\n+1", "date": "Jan 15, 2020"}, {"stars": 5, "text": "If there's only one extension I could install, this would be the one lol. Why not treat browsers the same as OS? I'd be cool with it if a dev could give a good explanation (like technical limitation, or UI study) but just \"we won't do it\" is nuts!", "date": "Dec 9, 2019"}, {"stars": 5, "text": "very  good", "date": "Nov 4, 2019"}, {"stars": 4, "text": "I wonder why it's not told that the command is ALT ( + Shift) + S", "date": "Sep 25, 2019"}, {"stars": 5, "text": "most useful extension in a long time. use it with auto hot key to activate last tab. its burned into my muscle memory, so i can't live without it!", "date": "Aug 26, 2019"}, {"stars": 5, "text": "This extension is mandatory for developers, who are used to this behavior in IDEs. There's no way back once you get used to this.", "date": "Aug 8, 2019"}, {"stars": 5, "text": "Thank you!  Works flawlessly and saves me from crying into my keyboard.", "date": "Aug 5, 2019"}, {"stars": 1, "text": "Not working as advertised.", "date": "Jul 21, 2019"}, {"stars": 5, "text": "It really works!", "date": "Jul 16, 2019"}, {"stars": 2, "text": "cannot remap recently switched tabs keyboard shortcut to Alt+Tab on macOS Chrome 75.0.3770.100 :-(", "date": "Jul 16, 2019"}, {"stars": 5, "text": "Now with Chrome version 75.0.3770.80, the shortcuts can be edited under chrome://extensions/shortcuts (or from the sandwich menu on the upper left, once on extensions)", "date": "Jun 6, 2019"}, {"stars": 5, "text": "It's working for me!", "date": "Mar 29, 2019"}, {"stars": 1, "text": "wondiw10 no wokr", "date": "Mar 25, 2019"}, {"stars": 5, "text": "Doesn't work anymore on Windows and latest Chrome. Can you please check? Thanks!", "date": "Dec 14, 2018"}, {"stars": 5, "text": "Exactly what you need if you write code! Love it!", "date": "Nov 14, 2018"}, {"stars": 5, "text": "Good! It's working!", "date": "Sep 19, 2018"}, {"stars": 3, "text": "New issue after the 2023 Nov Chrome update: It doesn't work for tabs that are in Group and have Save Group turned on. \n--\nIt works. The only issue is that the rendering of the browsing history is delayed by 1 or 2 sec, and it didn't keep track of Alt key. So if I press and release Alt+S twice within 2 second, it will not switch between current page and the last page. And, if I press Alt+S and releasing S but holding Alt, it will not continue cycling to the previous page when I press S again. ... Show more", "date": "Sep 13, 2018"}, {"stars": 4, "text": "this is the only working extension i found", "date": "Sep 6, 2018"}, {"stars": 5, "text": "Yay!! Finally an MRU tab extension that actually works.\n\nIf you're using Windows then you can map Ctrl+Tab to Alt+W using autohotkey.\n\nAdd these lines to your autohotkey script:\n\n#IfWinActive ahk_class Chrome_WidgetWin_1\n^Tab::Send !w  ; Map Ctrl+Tab to Alt+W\n#IfWinActive\n\nModifying the Chrome Preferences file didn't work for me. I sync my Chrome preferences, so every time Chrome restarted it overwrote my modifications to the Preferences file.", "date": "Aug 14, 2018"}, {"stars": 5, "text": "After testing some others this one installed and worked right away. Awesome", "date": "Aug 4, 2018"}, {"stars": 5, "text": "I don't get how native Chrome doesn't have this? I feel like maybe I'm missing it and its there? This extension is just too useful. I often have a lot of tabs open and then start doing work between two open google docs and this is perfect allowing me to switch quickly between the two. Great job!", "date": "Jul 28, 2018"}, {"stars": 5, "text": "you can use both the normal ctrl+tab hotkey for normal tab switching and alt+w for last used tabs", "date": "Apr 12, 2018"}, {"stars": 1, "text": "Simply does not work, sorry,  It is selected to work in More Tools>Extensions but ctrl+tab still only toggles thru all the tabs vs.   btwn the current tab and the  most recently  access tab, which is fitting if you have many tabs open.\n\n Of course, unlike Firefox ESR with the TabMixPlux extension, you also cannot enable multiple tab rows.\n\n I also have Ctrl+Tab MRU installed but which also does not enable this toggling,    unlike Firefox.", "date": "Apr 8, 2018"}, {"stars": 3, "text": "It would be nice to have a list of the last used pages when alt+w is pressed so the user can easily choose the tab", "date": "Apr 8, 2018"}, {"stars": 5, "text": "Ohmagerd this is amazing! Does just what it is supposed to. Especially good when I have multiple tabs open and it isn't obvious what some of them are just from the tab name, meaning I can't remember which was my previous tab. This shortcut sends me straight there.", "date": "Mar 21, 2018"}, {"stars": 5, "text": "Great addon !!! thanks", "date": "Mar 15, 2018"}, {"stars": 5, "text": "Very very useful if you get lost in the sea of tabs of your chrome window. So useful I was compelled to write a review on how useful it is and I don't write many reviews on the usefulness of chrome extensions that are actually useful. Useful.", "date": "Mar 3, 2018"}, {"stars": 5, "text": "Supports flipping back to tabs in different windows, which \"Toggle Switch Recent Last Tabs\" doesn't.", "date": "Feb 20, 2018"}, {"stars": 5, "text": "Awesome.", "date": "Dec 30, 2017"}, {"stars": 5, "text": "I needed to quickly switch between two tabs (occurs frequently when I have loads of tabs open but only need two tabs for the task at hand) and this add-on's Alt+W feature does just that: switches between last two tabs alternatively so I don't have to use the mouse to scroll through 20 open tabs to find the ones I need)", "date": "Nov 14, 2017"}, {"stars": 5, "text": "Great extension, thank you very much for this! Can you do one for Microsoft Edge? That'd be awesome!", "date": "Sep 16, 2017"}, {"stars": 4, "text": "Out of several similar extensions, this one is the only one that works. The only problem I had is that for the first time you install it, after I closed Chrome, it cleared all of my opened tabs. But later when I close and reopen Chrome, all off the tabs restoration functionality works as expected. At least a warning could be given. I use \"Continue where you left off\" option in Chrome.", "date": "Sep 1, 2017"}, {"stars": 5, "text": "Simply works! Cool!", "date": "Jul 27, 2017"}, {"stars": 2, "text": "(1) The \"ALT + S: Normal switch\" is available in Chrome already. No need to do it.\n\n(2) No list of recent tabs which is shown when I need to pick up a tab that is 3-4 tabs away.\n\nSo, useless.", "date": "Jul 2, 2017"}, {"stars": 5, "text": "In love with this extension, period. Thank you!!!\n\nthis + viumium = gold", "date": "Feb 16, 2017"}, {"stars": 5, "text": "The only extension that works for me", "date": "Feb 15, 2017"}, {"stars": 5, "text": "Loved it. Although I would've loved the ctrl + tab integration. Thank you.", "date": "Feb 7, 2017"}, {"stars": 5, "text": "Does exactly what its supposed too. You can change the options in the settings", "date": "Jan 15, 2017"}, {"stars": 3, "text": "I can't assign ctrl-tab to this extension, which isn't the extension's fault as far as I know but it's a universal key combination for switching tabs within an app so it should be used.\n\nAlso, this extension doesn't mimic alt-tab functionality. Performing successive alt-s key combinations just cycles through the tabs in order of history rather than flip back and forth between the two most recent tabs.", "date": "Jan 5, 2017"}, {"stars": 2, "text": "It was much better for me earlier. But the last release does not work with more than 2 tabs. Why so really? It become useless for me since.", "date": "Dec 2, 2016"}, {"stars": 5, "text": "perfect!", "date": "Oct 11, 2016"}, {"stars": 5, "text": "Just what I was looking for to restore the prior tab switching capability to toggle between two tabs, and also shift to a new tab easily using the keyboard only.\nOriginally it was as noted in another review by Sergei, where Ctrl+Tab+Tab vs Ctrl+Tab, Ctrl+Tab are distinguished by toggling, or stepping through the tab sequence to pick a new one.\nThis doesn't work quite that way, but it's just as good.  I set alt-Q for the toggle, and alt-W for forward, and alt-S for reverse.\nThis actually turns... Show more", "date": "Oct 8, 2016"}, {"stars": 5, "text": "Functions as expected.", "date": "Aug 27, 2016"}, {"stars": 5, "text": "This is probably the most reasonable extension available.\nIt's a shame Chrome doesn't implement this as is, and it seems developers are preventing to implement right behavior as extension.\nTo implement ideal extension few things are required:\n1) Ctrl+Tab should be allowed as shortcut (probably not allowing automatic assignment, and putting a disclaimer when assigning manually).\n2) Making possible to recognize Ctrl+Tab+Tab vs Ctrl+Tab, Ctrl+Tab. First should go pick 2nd MRU, second should pick... Show more", "date": "Jul 6, 2016"}, {"stars": 5, "text": "Please continue deving for this!! So much better than default ctrl tab.", "date": "Jun 27, 2016"}, {"stars": 5, "text": "Very useful", "date": "Jun 3, 2016"}, {"stars": 1, "text": "Completely broken; has two shortcuts for the same thing (normal and rapid), doesn't explain properly why, and the normal shortcut doesn't update the switching order for whatever reason.", "date": "Apr 29, 2016"}, {"stars": 2, "text": "Doesn't work at all like Windows. I'm not quite sure  what ordering this extension is supposed to be using, but it's certainly nothing like the MRU behavior used in Windows Alt+Tab.\n\nEven the most basic interaction, switching to one tab with Alt+S then switching back with Alt+S again, doesn't work correctly.", "date": "Apr 28, 2016"}, {"stars": 5, "text": "Binded Normal switch to Ctrl + Period, works perfectly.", "date": "Mar 17, 2016"}, {"stars": 4, "text": "very good.", "date": "Mar 11, 2016"}, {"stars": 5, "text": "Works!", "date": "Mar 10, 2016"}, {"stars": 5, "text": "Works great. I tried several and this is the best I've found. Saves lots of clicking with the mouse.", "date": "Jan 2, 2016"}, {"stars": 5, "text": "Just works....", "date": "Dec 28, 2015"}, {"stars": 2, "text": "\"*Keys can be changed in keyboard shortcut settings on the Chrome extensions page.\n\"\n\nThis is incorrect.  There are no options to change the keybindings.\n\nGiven that the chrome extension API either does or soon will support binding to Ctrl-TAB again, I'd much rather bind to that.  I have no muscle memory for ALT-W and ALT-S, particularly since I don't type on a qwerty keyboard.", "date": "Dec 21, 2015"}, {"stars": 5, "text": "Thanks a ton. I increased my productivity because of this!!", "date": "Nov 16, 2015"}, {"stars": 4, "text": "Good so far (installed 10 minutes ago). In combination with Tabs Outliner and TabTabSearch, two extensions which help quickly save, suspend and restore tabs and the other to quickly focus any given tab by simple omnibar search. Finally feels like I can manage decently having so many tabs (100+ typically) while not killing all resources.", "date": "Nov 2, 2015"}, {"stars": 5, "text": "saved lot of time", "date": "Oct 22, 2015"}, {"stars": 4, "text": "Simple and reasonably effective. Could use tweaks, like a Windows Alt+tab style list and a more logical way of cycling through tabs (once you're in the middle of cycling with Alt+S, then hitting Alt+W means you cycle back to the beginning of the stack, not the last tab - but maybe that's not such a bad thing). I like...", "date": "Oct 5, 2015"}, {"stars": 5, "text": "Works perfectly. Would have liked to be able to customize the hotkeys though", "date": "Sep 27, 2015"}, {"stars": 5, "text": "How did I live without this? and why doesn't google add this to chrome? unless you have 2 screens using tabs is lesser to having 2 windows. if you have a page with reference and an editor, switching back and forth is all you do. I was always looking for \"where was that tab\" no more... thank you!", "date": "Sep 10, 2015"}, {"stars": 5, "text": "Sweet! I use this with Quick Tabs, very nice solution to Chrome's missing tabs functionality.", "date": "Apr 30, 2015"}, {"stars": 5, "text": "Works perfectly ! Finally an extension that does this job right ! And I spent quite a bit of time looking for one.", "date": "Jan 6, 2015"}, {"stars": 1, "text": "Doesn't seem to work.", "date": "Dec 28, 2014"}, {"stars": 5, "text": "So far excellent. I miss this functionality in Chrome - Opera has it. Thank you very much!", "date": "Aug 25, 2014"}]