[{"text": "this Extension is good but if I can select default open root bookmark folder, would be great.", "stars": 3, "date": "Dec 12, 2023"}, {"text": "no search option available", "stars": 2, "date": "Aug 19, 2023"}, {"text": "Absolutely love it I use bookmarks all day at work and this allows to me to create easy folder that are easy to manipulate and put in order and to move the bookmarks by dragging and dropping instead of having to use the editor. Awesome Extension!", "stars": 5, "date": "Feb 20, 2023"}, {"text": "good to use！But the panel width is too narrow", "stars": 4, "date": "Nov 9, 2022"}, {"text": "Usually great, but won't open in Edge browser as of their latest build", "stars": 4, "date": "Jun 4, 2022"}, {"text": "Best Firefox like Bookmarks in the world!", "stars": 5, "date": "Apr 10, 2022"}, {"text": "I use Chrome across iOS, MacOS, Windows and Linux - The iOS environment is a pain in the proverbial when it comes to Chrome bookmarks, essentially I have to store all my bookmarks in the Mobile Bookmarks folder, which itself is a pain to access from the Chrome Bookmarks Bar. This extension makes quickly accessing Mobile Bookmarks SO MUCH easier, thank you. Combined with floccus to sync across to Edge when it needs to be used, this is a great extension!", "stars": 5, "date": "Mar 29, 2022"}, {"text": "the best bookmark button extension I've found so far!  The only small feature that would make it perfect is being able to drag bookmark links to resort the stacked order.  as it is you have to open bookmark manager to do that.  Big kudos to the dev for adding dark mode and icon options.", "stars": 5, "date": "Dec 16, 2021"}, {"text": "Great bookmarks menu extension!", "stars": 5, "date": "Mar 8, 2021"}, {"text": "No search field.", "stars": 2, "date": "Mar 3, 2021"}, {"text": "Currently the best bookmarks menu for the menu bar on Chrome at the moment! Thank you for creating this.", "stars": 5, "date": "Feb 21, 2021"}, {"text": "The best thing\n- you can open all the url under the subfolder too, even few deep subfolder. this feature is not easily found on other bookmark extension\n\nThing that need to improve to make it great\n- able to create folder \n- Stay on, after u select a bookmark to open. this is useful because sometime u want to open multiple url at different folder or subfolder.\n- make the popup look longer, there is limiation of 600px only. why so little\n- Copy URL and able to duplicate it at other folder or s... Show more", "stars": 4, "date": "Jan 22, 2021"}, {"text": "It is what I was looking for. Unfortunately it opens all the subfolder with this option disabled.", "stars": 4, "date": "Nov 5, 2020"}, {"text": "I love this bookmark menu, especially the optional dark theme.\n\nThe only thing I would like to add is an option to keep the menu open when clicking on bookmarks. It's very useful when I am simply glancing at multiple sites for driver updates and not having to reopen the bookmark menu each time to find my last spot.", "stars": 5, "date": "Oct 2, 2020"}, {"text": "Is it me stupid or the extension? Can't use any navigation keys?! (Chrome on Debian). Bummer!", "stars": 3, "date": "Sep 5, 2020"}, {"text": "Was hoping to use with Edge, but the interface doesn't always respond well to mouse scrolls and getting bookmarks to launch or folders to open. Might be a limitation of Edge not sure. Have not used this extension in Chrome so might be fine there. I do appreciate the effort though!", "stars": 4, "date": "Aug 29, 2020"}, {"text": "Simple and clean!\n\nI'd suggest making the open star icon and a nice sans serif font as the default so to match chrome's aesthetics and to show the idea of minimalistic (the book with the bookmark doesn't look \"minimal\").\n\nGood stuff anyway!", "stars": 5, "date": "Aug 4, 2020"}, {"text": "Nice extension, really like all the customization options. There's one irritating issue however: site icons keeps reloading each time I open the menu (which is quite often).", "stars": 4, "date": "Aug 4, 2020"}, {"text": "Great extension! Only function I personally need is to have a \"default unfolded directory\" selection. I have a \"bookmark bar\" folder which I want it to be unfolded by default. Do you think this is something that's relatively easy to implement?", "stars": 5, "date": "Jul 16, 2020"}, {"text": "great!", "stars": 5, "date": "Jul 8, 2020"}, {"text": "fantastic extension!! i like it so much!\njust have one advice. i have clicked start with folders closed, and it's convenient. however, there are some folders i usually need to use, so i want to keep these folders open. can you help me solve this problem? thank you very much.", "stars": 5, "date": "Apr 11, 2020"}, {"text": "Perfect", "stars": 5, "date": "Apr 10, 2020"}, {"text": "Been using this extension for a while now, pretty happy with it. There are a number of extensions like it and I think this one is a fork of an older extension no longer maintained. I like this one the best because it has a good handful of features (how many features does this really need?) without bloat, fast, clean, simple to use. Many thanks to the developer for continuing to maintain this extension!", "stars": 5, "date": "Mar 23, 2020"}, {"text": "I'm using with NEW Edge, as test.", "stars": 4, "date": "Mar 2, 2020"}, {"text": "It lags (freezes for a second) on expand animation. Maybe you want to fix that.", "stars": 4, "date": "Feb 2, 2020"}, {"text": "Doesn't require excessive permissions 👍👍👍👍\nI can open a whole folder with middle mouse button 👍👍\nFolders stay open 👍 (Optional)", "stars": 5, "date": "Feb 1, 2020"}, {"text": "I like it. 5 stars. But if is possible would you add option to change height to 600+?", "stars": 5, "date": "Jan 12, 2020"}, {"text": "Please support dark mode", "stars": 4, "date": "Nov 17, 2019"}, {"text": "It remembers where I closed it", "stars": 5, "date": "Nov 11, 2019"}, {"text": "The options for this extension are non-functional.  Well, they LOOK that way.  No one can see black text on a black background.  A drop-down list is shown for the options.  The drop-down list presents an empty  black panel; i.e., black background with no other-color text (no contrast hence unreadable).  I discovered you can click on the down-arrow, and then use the up/down arrow keys to move between the available choices that are otherwise be invisible.  My guess is the author has not yet bot... Show more", "stars": 3, "date": "Nov 9, 2019"}, {"text": "Great extension! \"When clicking \"Open all\", open all bookmarks in all subfolders as well\" works for me!", "stars": 5, "date": "Oct 19, 2019"}, {"text": "Good one! exactly what I was looking for :)", "stars": 4, "date": "Aug 18, 2019"}, {"text": "Hello! Plz get back Zoom Level. Thx.", "stars": 4, "date": "Jul 17, 2019"}, {"text": "Very nice but when you have a few hundred Bookmarks, even well organized, the lack of a search engine is really painful. Every time I need to search for a bookmark, which happens quiet often, I need to use Chrome's default Bookmarks. After a few days I just got rid of this extension, only because of that. Please consider adding a search bar. It's a mandatory option in my opinion.", "stars": 3, "date": "May 15, 2019"}, {"text": "All good. But add a search field.", "stars": 5, "date": "Mar 22, 2019"}, {"text": "A great extension after Neater Bookmarks stopped being developed. I still think that adding search would be beneficial, as you could see the bookmark icons, which Chrome does not show when using 'bm', and helps a lot sorting through the search results (the way Popup my Bookmarks does it).", "stars": 4, "date": "Mar 13, 2019"}, {"text": "Since last update the option \"preferred height\" does not work. It sticks to 500 even if you type 600.", "stars": 4, "date": "Feb 2, 2019"}, {"text": "Works wonderfully, has a clean look and the right amount of options: there's also the option to compress other folders when you open one, very useful if you have a very organized folder structure in your bookmarks.\nIt only lacks a way to always start with all folders compressed: right now it always opens up showing the last folder you visited. \nThat would be the cherry on top :)", "stars": 4, "date": "Sep 9, 2018"}, {"text": "Best bookmark app I have used.\n\nUpdate: Been using for over 2 years and still the best bookmark tree extension I could find! The only thing I saw from another bookmark tree that was nice, is a small bar at the bottom to show the web address of the bookmark you highlighted (mouseover). Whether this is ever added or not, this is still the best bookmark extension. Thanks again for your hard work!", "stars": 5, "date": "Sep 7, 2018"}, {"text": "Does the job of accessing bookmarks, looks nicer than Neater Bookmarks.", "stars": 5, "date": "Jul 15, 2018"}, {"text": "Very Good, I like it !", "stars": 5, "date": "Jun 12, 2018"}, {"text": "on MacOS, the popup would close suddenly often when clicking browserAction button.", "stars": 4, "date": "May 11, 2018"}, {"text": "Excellent bookmarks extension.  I don't like needing to show the bookmarks bar to use bookmarks.  This allows you to hide the bar, but access bookmarks via a button within all the other extension buttons.  Clean interface, and very quick.", "stars": 5, "date": "Apr 26, 2018"}, {"text": "The setting screen can not be scrolled, so it can not go down.", "stars": 3, "date": "Apr 13, 2018"}, {"text": "I tried several bookmarks tree extensions (quite a lot) ...\n\nAnd so far, I would say this is the best i found\n\nOne con though, i'd like to be able to get rid of the \"Preferred height\" limitation and make it full screen", "stars": 5, "date": "Apr 5, 2018"}, {"text": "The recent change to the options makes it impossible for me to access them.  Scrolling down doesn't work.  I'm guessing it was implemented to work on higher resolution screens only.  \n\nStill, it's probably one of the best bookmarks extensions available.", "stars": 4, "date": "Apr 4, 2018"}, {"text": "Great feel to this bookmark extension. The only thing I would REALLY like to see changed is when you delete a bookmark, I would like to not have to confirm the deletion.", "stars": 4, "date": "Mar 8, 2018"}, {"text": "Good extension that focuses on what it does best. The maximum preferred height is too small though (600). The box is tiny on a large screen.", "stars": 4, "date": "Dec 31, 2017"}, {"text": "It's clean and minimal, which are the only things I want in a bookmark extension. It fulfills its purpose of allowing you to access your bookmarks without the need for a whole toolbar taking up space. It also has a few nice little customization options.\n\nBut I do have two gripes and I figured I'd include them here since the dev is asking for suggestions.\n\nFirst is that when your folder is long enough to add a scroll bar to the box, whenever you try to drag and drop a bookmark above/below the ... Show more", "stars": 4, "date": "Nov 28, 2017"}, {"text": "best of its kind! fast and accurate!", "stars": 5, "date": "Aug 21, 2017"}, {"text": "Almost perfect. Very fast.\nTwo things, though:\n- make a search editbox on top of the panel ... but do NOT use Chrome's built in bookmark search, it is VERY slow (Firefox' is many times faster, maybe they cache bookmarks somehow?)\n- dragging a bookmark over a bookmark folder is not moving the bookmark into the folder, but \"between\" folders. This should be fixed in a future update.\n\nOtherwise, excellent.", "stars": 4, "date": "Jul 30, 2017"}, {"text": "Unobtrusive, and does what it says. So simple, it should be part of standard Chrome. Recommended to anyone, thanks Rémon!", "stars": 5, "date": "Jul 29, 2017"}, {"text": "This is useful, but I find myself using Bookmark OS instead", "stars": 4, "date": "Jul 19, 2017"}, {"text": "This is the best bookmark button I've seen. Wish I could get rid of the superfluous \"Bookmark bar\" root item though.", "stars": 4, "date": "Jun 12, 2017"}, {"text": "Black frame appears around main dropdown window when some folders are expanded. Otherwise almost what I'd like to use.\n\nUpdate: The black frame effect disappeared after disabling the animation. I am upgrading the score to 4 stars now.", "stars": 4, "date": "Apr 22, 2017"}, {"text": "Great!!!", "stars": 5, "date": "Mar 3, 2017"}, {"text": "JavaScript code doesn’t work.", "stars": 1, "date": "Feb 15, 2017"}, {"text": "Great extension! There are just two things I'd like to see implemented:\n\n1) Middle-click to open a bookmark in a new tab while keeping the bookmarks tree open. I understand I can ctrl-left-click to do this, but I'm conditioned to middle-click links.\n\n2) This is purely visual, but I'm on a retina display, so I'd love to see retina versions of the folder icons, along with the favicons that are displayed. As is, the folder icons and favicons are blurry on my screen.", "stars": 4, "date": "Jan 4, 2017"}, {"text": "Is there an option to keep the bookmark open so i can click two or three links, or do I need to reopen every time?", "stars": 3, "date": "Dec 15, 2016"}, {"text": "I could not delete or edit any of the preset bookmarks. Tried to delete NBA, no joy. Tried to edit NBA, again not able to.  This is worthless if you can't delete or edit bookmarks. I wanted to give it a 2.5 but there is no star for that. Just Okay.", "stars": 2, "date": "Dec 14, 2016"}, {"text": "Please, add possible to open links in new tab, and not in current opened. Thanks.", "stars": 5, "date": "Mar 18, 2016"}, {"text": "Lovely! Would be more amazing if there is a search option. But this is good enough as it is state \"Minimal\".", "stars": 5, "date": "Mar 7, 2016"}, {"text": "Nice Bookmark Add-On", "stars": 5, "date": "Mar 4, 2016"}, {"text": "Really nice extension and should be built-into Chrome like Firefox. I like how you can change the width & height and zoom level.\n\nOne bug I found is the \"bm\" in omnibar doesn't always work. It searches for the bookmarks wonderfully, but when I press Enter or left-click to open the link, it wouldn't open 90% of the time.", "stars": 4, "date": "Dec 29, 2015"}, {"text": "works well", "stars": 5, "date": "Dec 9, 2015"}, {"text": "Simple, functional, un-intrusive, works.", "stars": 5, "date": "Nov 29, 2015"}, {"text": "It's awesome but lack one crucial option for me - opening a bookmark without closing the extension. In other words - the bookmarks list could stay open so a number of links can be opened.\n\n10x!", "stars": 4, "date": "Jul 21, 2015"}, {"text": "it testing many bookmarks add ons because this is the best one *ist fast and *its very good to read!", "stars": 5, "date": "May 5, 2015"}, {"text": "great indeed.......because it lets me see the bookmarks without having an account like others.....also it lets me do everything on a mouse click like firefox....\n\nbut the window should work on mouseover event also I think....it would be more user friendly :)\n\nthanks", "stars": 5, "date": "Apr 28, 2015"}, {"text": "Excellent! Thank you.", "stars": 5, "date": "Apr 10, 2015"}, {"text": "Exactly what I was looking for. Saves valuable space. Nicely executed. Thanks!", "stars": 5, "date": "Apr 4, 2015"}, {"text": "best bookmark tree,simple yet so powerfullllll", "stars": 5, "date": "Nov 14, 2014"}, {"text": "sorry cuts off the words and makes it hard to read", "stars": 1, "date": "Jul 4, 2014"}, {"text": "Simple, works, awesome. Best bookmark app out there.", "stars": 5, "date": "May 26, 2014"}, {"text": "Fonts option would be great.\n\nThanks!", "stars": 5, "date": "May 12, 2014"}, {"text": "I thought this was an extension I can live with; but my live rss feeds will update fine on the bookmark bar but will take about 10 minutes to update on this one... whats up with that?", "stars": 3, "date": "Mar 16, 2014"}, {"text": "The Search feature is not working properly. Only shows one result.\n\nIt's a good idea, only if it worked...", "stars": 2, "date": "Mar 14, 2014"}, {"text": "Very useful.\n\nRequest: An option to swap the behaviour of middle-click and ctrl-click.", "stars": 5, "date": "Jan 27, 2014"}, {"text": "The \"Remember scroll position when Minimal Bookmarks Tree window closes\" not work well. When desactived remember again", "stars": 5, "date": "Jan 20, 2014"}, {"text": "Doesn't search my bookmarks using the code bm in the omnibar. It gives me one result from my bookmarks and isn't able to find bookmarks that I know exist.", "stars": 1, "date": "Dec 1, 2013"}, {"text": "Few Gliches. Favcons look to squashed sometimes...", "stars": 3, "date": "Oct 27, 2013"}, {"text": "Very good bookmarks extension. Easy to use, fast, and well designed. Allows to edit and delete bookmarks through the context menu.", "stars": 5, "date": "Aug 8, 2013"}, {"text": "The only reason I'm not giving this a fifth star is because there doesn't appear to be a right-click menu for individual links, or an option to open links in a new tab.", "stars": 4, "date": "Jul 5, 2013"}, {"text": "Thank You! :) Fast and doesn't have glitches when it displays the menu! \n\nReq: To display \"Other Bookmarks\" as a folder, instead of the individual bookmarks on the dropdown.", "stars": 5, "date": "Jul 4, 2013"}, {"text": "yess appl", "stars": 5, "date": "May 7, 2013"}, {"text": "Exactly what I was looking for :* love it", "stars": 5, "date": "Mar 29, 2013"}, {"text": "Just what I wanted! Thanks.", "stars": 5, "date": "Feb 22, 2013"}, {"text": "Functions good, I can hide the bookmark bar and save space now. Icons are a bit away from Chrome overall appearance.", "stars": 4, "date": "Feb 19, 2013"}, {"text": "Perfect and simple.  This is the way Chrome should have made the bookmarks.", "stars": 5, "date": "Jan 16, 2013"}, {"text": "nice and clean and fast! it would be better if I can have a \"open in the new tab\" option", "stars": 4, "date": "Nov 30, 2012"}, {"text": "Simple to use and light weight!", "stars": 5, "date": "Nov 5, 2012"}, {"text": "Love it really helps me out alot and again thanks 5 STARS*", "stars": 5, "date": "Oct 20, 2012"}, {"text": "Perfect extension. Maybe just a suggestion. It would be nice to have an option that let you choose if you want to open the selected bookmark in a new tab instead of opening it directly in the current tab.\n\nGreat work.", "stars": 5, "date": "Oct 17, 2012"}, {"text": "After searching for a simple yet effective bookmark menu, I finally found Minimal Bookmarks Tree.\nI don't need anything else but a simple button to open a fully functional, fast and yet stylish menu. I can reach my favourite bookmarks quickly with less fewer clicks, folders will close once I open another folder. It just works.", "stars": 5, "date": "Oct 3, 2012"}, {"text": "Great extension. \n\nMy only gripe about it would be that it opens with bookmark bar and mobile bookmarks as the root folder. I think it would be better if it launched in the bookmark bar to begin with, or even better be able to choose which folder in the settings.", "stars": 4, "date": "Sep 16, 2012"}, {"text": "Really good extension, I've been searching for a clean and simple bookmarks tree for chrome since neat bookmarks failed.\n\nTo improve the extension I would like the option to turn off the scrolling out of new trees so that it's instant.", "stars": 4, "date": "Aug 29, 2012"}, {"text": "Just what i was looking for!", "stars": 5, "date": "Aug 13, 2012"}, {"text": "Great extension. I wonder why this simple functionality is missing in Chrome", "stars": 5, "date": "Jul 25, 2012"}, {"text": "Simple enough for me.\nThanks.", "stars": 5, "date": "Jul 19, 2012"}, {"text": "Simple and brilliant.", "stars": 5, "date": "Jul 7, 2012"}, {"text": "FINALLY! a bookmarks menu extension that doesn't plain suck.\n\nLight on resources, with a snappy, responsive interface that uses chrome's own favicons. \n\nNo search/filter/tag bars/custom-favicons or other superfluous, memory devouring, cpu consuming, useless non-features that plague every other alternative I tried so far. \n\nEnabling bookmark search via the address bar is a good example of non-intrusive feature addition.\n\nThank you, please never change it (well, maybe use chrome's folder icon?)", "stars": 5, "date": "Jul 5, 2012"}, {"text": "As others have said, the closest replacement to the discontinued Neat Bookmarks. I'm really not sure why chrome doesn't offer a feature such as this built in!", "stars": 5, "date": "Jun 25, 2012"}, {"text": "App has worked great, however now, on Mac, to open a tab in the background requires you to hold control instead of command? Why change that? Was there a need?", "stars": 4, "date": "Jun 20, 2012"}, {"text": "Love this extension. Best replacement to the now defunct Neat Bookmarks. Keep up the good work mate ^_^b\n\nOnly two suggestions. First, would be to have an option that when you open a folder, the previous folder you opened closes.\nSecond would be to have a basic search bar function. \n\nAnyways, good stuff. I'll refer this extension to all my friends.", "stars": 5, "date": "Jun 16, 2012"}, {"text": "I need a \"open all\" work for each folder only, not open sub folder also! it will be awesome :)\n\nThanks", "stars": 5, "date": "Jun 16, 2012"}, {"text": "Please, change the folder icons, are awful!\n\nThe extension is great!\nThanks for your work.", "stars": 4, "date": "May 25, 2012"}, {"text": "Great bookmarks button. I thank you for it.\n\nI do have one request, though. When you hover over a bookmark in the tree, in the popup box, please show the full bookmark name instead of (or in addition to) the full bookmark address.\n\nHere's why. Personally, the bookmark address is not \"useful information\" to me. But, the full bookmark name is useful information to me. As I am bookmarking a page, I often add extra information to the bookmark name. For example, if I am price shopping, I may add t... Show more", "stars": 5, "date": "May 24, 2012"}, {"text": "Please add two function.\n1.When opening one document the another one can close automatically\n2.Search Bar that can use  keyword to search bookmarks.", "stars": 4, "date": "May 18, 2012"}]