[{"date": "Feb 26, 2024", "text": "worked perfectly on Linux", "stars": 5}, {"date": "Feb 25, 2024", "text": "works for me 5/5", "stars": 5}, {"date": "Feb 10, 2024", "text": "This extension adds 5.1 audio. 1080p doesn't seem to be available still.", "stars": 4}, {"date": "Feb 10, 2024", "text": "Thank you!!!!!!!!!!!!!!!!!!!!!!!!!!!", "stars": 5}, {"date": "Feb 9, 2024", "text": "does not work\n\nError\n\"Pardon the interruption\" etc..", "stars": 1}, {"date": "Feb 7, 2024", "text": "IT WORKED !! 720p to 1080 is day and night difference on Netflix. Video is so much detailed and crisp now.\n**Check video resolution/bit rate using Ctrl+Alt+Shift+D\n**Make sure Playback setting in settings of Netflix website is set to HIGH. \n\nUsing Chrome v121 / Windows 10 (v1607).", "stars": 5}, {"date": "Jan 23, 2024", "text": "Absolutey prefect - Allows 5.1 with Netflix on Kubuntu 23.10 with wayland and output through a 7.1 Onkyo reciever.", "stars": 5}, {"date": "Jan 15, 2024", "text": "Doubles size of subtitles", "stars": 4}, {"date": "Jan 7, 2024", "text": "why not add the option to select the quality, it appears near the end of every episode so why not just add it as an option permanently", "stars": 5}, {"date": "Jan 3, 2024", "text": "Não funcionando no Microsoft Edge Linux.\nNot working on Edge Linux.", "stars": 1}, {"date": "Dec 29, 2023", "text": "Only solution I found for getting 5.1 AC3 sound over SPDIF on Ubuntu. Works out of the box, excellent!", "stars": 5}, {"date": "Dec 26, 2023", "text": "Before, I can only watch 480p due to netflix DRM (which I read in a forum post that limits video quality if not using their proprietary application, and is also explain by Louis Rossmann in his video). Now, I can watch 1080p quality in netflix. So, ty for the extension. simple yet working correctly. like buying a plug n play switch.\n\nBefore installing. Try watching a netflix videos and check the quality by pressing (CTRL + SHIFT + ALT + D) and look for \"Playing bitrate\". \n\nAfter that, install... Show more", "stars": 5}, {"date": "Dec 23, 2023", "text": "Doesn't work", "stars": 1}, {"date": "Dec 21, 2023", "text": "When I install this extension, Netflix gives an error. I cant play any video. After removing this extension, Netflix plays at 720 maximum. How to solve this problem?", "stars": 3}, {"date": "Dec 3, 2023", "text": "This app is amazing but unfortunately, surround channels stopped working so only Left, Right, Center and Sub is working. It would be amazing to get an update for full 5.1 surround.", "stars": 4}, {"date": "Nov 23, 2023", "text": "I didn't even know Netflix was cheating its customers out of a half decent resolution and always thought my monitor was just bad or uncalibrated. What an eye opener.", "stars": 5}, {"date": "Nov 17, 2023", "text": "No change on vivaldi and chrome, and yes user settings on netflix is already set to 1080p/highest but it keeps dropping me to 320p with no internet issues.", "stars": 1}, {"date": "Nov 11, 2023", "text": "Perfect! Works on Vivaldi Windows 10", "stars": 5}, {"date": "Oct 22, 2023", "text": "This works perfectly on Chrome, Vivaldi, Opera and Brave... I just don't know why it won't work and has no effect at all on Edge?!!!", "stars": 4}, {"date": "Oct 13, 2023", "text": "Noticed no difference on Windows PC with Chrome...", "stars": 1}, {"date": "Oct 7, 2023", "text": "Installed. Restarted browser. Watched various things on Netflix and saw no change in resolution. Extension isn't working.", "stars": 1}, {"date": "Sep 22, 2023", "text": "IT WORKS! I was going nuts trying to figure out why netflix looks so bad on ubuntu while being shart on windows and android. And this fixes it. THANK YOU!", "stars": 5}, {"date": "Sep 13, 2023", "text": "Great extension", "stars": 5}, {"date": "Aug 31, 2023", "text": "This used to work perfectly. Still does for the picture quality part, but a few months ago Netflix made some change which now means that when you select 5.1 surround, it actually plays a LCRS mix derived from the stereo rather than the 5.1 stream, which is a great pity. Hope this is something that can be fixed.", "stars": 5}, {"date": "Aug 28, 2023", "text": "It worked a few months ago but I tried it again recently and I'm not hearing the surround speakers.  I hear the center, sub, and main Left/Right, but not the rear surrounds in 5.1.  I'm certain my speakers are connected correctly.\n\nChrome Version 116.0.5845.110\nMacOS 12.3.1", "stars": 4}, {"date": "Aug 27, 2023", "text": "It worked great before but know it makes the subtitles be extremly small, and there is no way to make them bigger, hopefully they fix it", "stars": 3}, {"date": "Aug 24, 2023", "text": "great extension. does what it says on the box. but since a week or so ago it results in the screen being black with audio only coming through. disabling the extension fixes that (but obviously leaves me with 720p again).", "stars": 5}, {"date": "Jun 1, 2023", "text": "No effect at all, just wasted my time.", "stars": 1}, {"date": "May 28, 2023", "text": "As of now, the extension works flawlessly. It lets me use Netflix on Opera and play at a clearly better resolution than before. Can't be sure if it's higher than 1080p, but definitely at least 1080p.", "stars": 5}, {"date": "May 8, 2023", "text": "Has absolutely no effect whatsoever. Netflix continues to revert to 720p after playing at 1080 for a short while. 600Mbps/16 core/64GB RAM and no other streaming service has any issues.", "stars": 1}, {"date": "Apr 29, 2023", "text": "Immediately enabled crystal clear video on Netflix once I refreshed the page after installing the extension. Before Netflix kep tchanging the quality to be miserable but this fixed it right up.", "stars": 5}, {"date": "Apr 24, 2023", "text": "Works good on chrome. Doesn't work on edge though for some reason.", "stars": 5}, {"date": "Apr 9, 2023", "text": "Works great on Linux Mint 20.3!!! Thanks a lot!!", "stars": 5}, {"date": "Mar 31, 2023", "text": "Never expected it to work, but it did an amazing little tweak. Just remember to enable the check boxes in the extension settings, and refresh Netflix tab, for it to work it's wonder.", "stars": 5}, {"date": "Feb 28, 2023", "text": "Thanks for this extension, however it doesn't bypass the framerate limit that Netflix imposes on Chrome. It seems it can't go over 25fps, even for content that has a higher framerate (for e.g. Drive To Survive on Safari plays at 50fps). If you could fix this it could be awesome !", "stars": 5}, {"date": "Feb 9, 2023", "text": "Lifesaver!\nCTRL+ALT+SHIFT+S to set settings.", "stars": 5}, {"date": "Jan 2, 2023", "text": "Works perfectly, took my watching experience from literal 240p to 1080p!", "stars": 5}, {"date": "Dec 31, 2022", "text": "Meh it kind of works, 1080p shows are around 2-3k bitrate until the last 10 minutes, when the menu pops up out of nowhere and offers 6k, but the ctrl shift alt d menu shows two overlapping menus and neither select.", "stars": 3}, {"date": "Dec 17, 2022", "text": "Worked!", "stars": 5}, {"date": "Nov 28, 2022", "text": "Can you do the same for disney+?", "stars": 5}, {"date": "Nov 27, 2022", "text": "Hi, can you make for disney+ as well?", "stars": 5}, {"date": "Nov 11, 2022", "text": "great it works", "stars": 5}, {"date": "Nov 6, 2022", "text": "Can't believe it totally work, tks", "stars": 5}, {"date": "Nov 5, 2022", "text": "nice!", "stars": 5}, {"date": "Oct 20, 2022", "text": "Works very well (no lag) with intel core i5 12400 and 5.1 surround sound works like charm 👌\nNote: (In order to play 5.1 surround sound, make sure check the 5.1 surround sound in extension option, and you must know which film support 5.1 surround sound because the label 5.1 surround sound won't appear in preview movie menu, but you can check through audio setting during movie playback)", "stars": 5}, {"date": "Oct 17, 2022", "text": "Netflix watchers on Linux are literally crying :)))))\nI use Arch btw.", "stars": 5}, {"date": "Oct 10, 2022", "text": "Truly works... Thanks", "stars": 5}, {"date": "Sep 29, 2022", "text": "It just works you don't have to do anything.", "stars": 5}, {"date": "Sep 16, 2022", "text": "Works like a charm, haven't used Netflix in years and realized the quality was worse nowadays, this extension restores the old quality, the quality it was supposed to be. You should get this if you have the Standard plan or higher.", "stars": 5}, {"date": "Sep 13, 2022", "text": "Completely pointless, it only works if you've upgaded from the basic netflix plan, whitch lets you fource 1080p any way. If you have the standard plan or higher you can lock video quality in account settings. If you're on the basic plan just pirate the show instead, because 1080p has been bare minimum standard since the invention of the lightbulb.", "stars": 1}, {"date": "Sep 12, 2022", "text": "Works as intended! Would love to see a disney plus or hulu version!", "stars": 5}, {"date": "Aug 25, 2022", "text": "I cannot believe it ACTUALLY WORKS..!!!!\nUse CTRL+ALT+SHIFT+D & check the playing bitrate..", "stars": 5}, {"date": "Aug 20, 2022", "text": "Garbage. don't know how or where to use it.", "stars": 2}, {"date": "Aug 14, 2022", "text": "It works! I feel like my eyes are 20/20 lol. Thanks.", "stars": 5}, {"date": "Aug 1, 2022", "text": "great", "stars": 5}, {"date": "Jul 27, 2022", "text": "Works perfectly! I have no plans to use Microsoft Edge to watch Netflix. This extension does the job perfectly. Full HD is streamed now through the Chrome Browser. Recommend to anyone who wants 1080p resolution on Chrome. Safe and compaitable with all devices", "stars": 5}, {"date": "Jul 19, 2022", "text": "Works like charm, thank you. <3 It took effect immediately.", "stars": 5}, {"date": "Jul 15, 2022", "text": "It just works!", "stars": 5}, {"date": "Jul 8, 2022", "text": "Working as advertised!", "stars": 5}, {"date": "Jul 6, 2022", "text": "it just works! thanks!", "stars": 5}, {"date": "Jun 13, 2022", "text": "Wow, actually works. In 2022 this shouldn't need to exist but thank god it does, fixed the problem instantly. I really don't understand why Netflix is stuck on 720p when I have no issues with anything else, its quite embarrassing.", "stars": 5}, {"date": "Jun 11, 2022", "text": "Worked fine but Kindely Improve its UI and Update it to manifest v3. v2 Support will end this year.", "stars": 4}, {"date": "Jun 3, 2022", "text": "SO much better. thanks for this!", "stars": 5}, {"date": "May 30, 2022", "text": "Great It works in Linux. \n\nIt works great in Ubuntu 22. got full 1080p", "stars": 5}, {"date": "May 28, 2022", "text": "Works perfect", "stars": 5}, {"date": "May 26, 2022", "text": "thank you bro... works great\nso nice...hmwa", "stars": 5}, {"date": "May 21, 2022", "text": "It works!!!! No more reloading! Hooray!", "stars": 5}, {"date": "May 13, 2022", "text": "INCREDIBLY it works. I have a Chromebook and it's the only way that I've found to have 1080 on netflix.\nCHEERS GUYS, KEEP UP THE GOOD WORK", "stars": 5}, {"date": "May 11, 2022", "text": "It works! Thanks!", "stars": 5}, {"date": "May 6, 2022", "text": "Works well thanks", "stars": 5}, {"date": "May 3, 2022", "text": "perfect", "stars": 5}, {"date": "Apr 7, 2022", "text": "its a keylogger that steals your information, after not using netflix for 3 months i come back to my account with 3 new profiles, a different language and a more expensive subscription. my account was used on multiple devices in puerto rico and i am going to report every single one of those connections to the local police.", "stars": 1}, {"date": "Mar 29, 2022", "text": "Just Works!! Seamlessly", "stars": 5}, {"date": "Feb 26, 2022", "text": "I'm on fiber and it worked immediately. I double checked and uninstalled it and when I reloaded the video it came back with artifacts and garbage quality, and then reinstalled and it worked again. I found out about it on reddit here: https://www.reddit.com/r/netflix/comments/a3hcq2/shortcuts_to_force_higher_bitrates_not_working/ can't say much about why it works (I think people were saying it doesn't force h264 or something, but I can stream 4K over 100 fps via H.264 encoding/decoding via par... Show more", "stars": 5}, {"date": "Feb 26, 2022", "text": "dosent work, scam", "stars": 1}, {"date": "Feb 24, 2022", "text": "Worked for 1080p but audio quality is degraded. Any solutions?", "stars": 3}, {"date": "Feb 20, 2022", "text": "Why ask if override when auto select best is chosen?", "stars": 1}, {"date": "Feb 17, 2022", "text": "Seems to work. Restores \"old way\" to chose and force bitrate on Netflix. More documentation on how to use would be nice.", "stars": 4}, {"date": "Feb 17, 2022", "text": "Wow works! Thanks.", "stars": 5}, {"date": "Feb 17, 2022", "text": "finally, 1080p! works and looks great!", "stars": 5}, {"date": "Feb 14, 2022", "text": "perfect", "stars": 5}, {"date": "Feb 13, 2022", "text": "Working perfectly!", "stars": 5}, {"date": "Feb 11, 2022", "text": "still working", "stars": 5}, {"date": "Feb 10, 2022", "text": "Works! I was getting grainy video but now it's full HD. Windows 11.", "stars": 5}, {"date": "Feb 2, 2022", "text": "Works great! I was using Edge to watch netflix for the longest time because I thought all the chrome extensions for this purpose were no longer working. I'm glad I found this in 2022!", "stars": 5}, {"date": "Jan 28, 2022", "text": "Does the work, simply!!", "stars": 5}, {"date": "Jan 23, 2022", "text": "It works for me as of January 2022, the bitrate is a bit lower that what I get on Edge, but it's still 1080p", "stars": 4}, {"date": "Jan 22, 2022", "text": "Works perfectly fine but I have an issue where a white box where you can choose quality is showing near the end of any netflix's content. The right quality was already selected and there is no point that this box is showing at the end, it ruins my immersion :(((", "stars": 3}, {"date": "Jan 16, 2022", "text": "Works Fine on Chrome(Mac), Doesn’t work on Edge(Mac).\nStill HDR support is not available in Chrome(Mac).\n\nAlternative Solution for people who are facing this issue - Use Safari on Mac it nativity support Full HD with HDR. On Windows use Edge, it supports upto 4k (Your display should be 4k too)", "stars": 5}, {"date": "Jan 5, 2022", "text": "Works in windows 10.", "stars": 5}, {"date": "Jan 1, 2022", "text": "Fantastic plugin .. lets me use the ctrl+alt+s menu on linux and lets me force vp9 encoding from the plugin options (so much better than the h264 you tend to get by default). Turns netflix from the encoding equivalent of teletext to an up to date quality encoder. And did I say it works on linux .. no more having to run netflix in a bloody windows 11 vm to get the high quality encodes.\n\nI had a dream that netflix didn't have ***** policies around it's quality and codecs .. and this plugin made... Show more", "stars": 5}, {"date": "Dec 25, 2021", "text": "Somehow came across an article which highlighted that normally Netflix only streams at 720p on Chrome, this extension works perfectly for me, so now streaming at 1080p. To check your streaming quality press ctrl + alt + shift + D on Windows which watching something on Netflix.", "stars": 5}, {"date": "Dec 23, 2021", "text": "I don't know if its convert 5.1 audio are not but it pushing quality to 1080p Like Hell There is a huge difference by watching in 1080p by using this extension Loved It.", "stars": 5}, {"date": "Dec 20, 2021", "text": "1080p works", "stars": 5}, {"date": "Dec 20, 2021", "text": "Does just what it claims!\n\nSaves me from having one browser per usecase.", "stars": 5}, {"date": "Dec 20, 2021", "text": "works perfectly", "stars": 5}, {"date": "Dec 19, 2021", "text": "Why the bitrate and buffring bitrate is showing 128kbps out of 6000kbps??", "stars": 4}, {"date": "Dec 12, 2021", "text": "Top", "stars": 5}, {"date": "Dec 6, 2021", "text": "Does not work", "stars": 1}, {"date": "Dec 2, 2021", "text": "great app thanks", "stars": 5}, {"date": "Nov 30, 2021", "text": "It is not working anymore. \n\nPlease update this soon. Thanks!", "stars": 2}, {"date": "Nov 26, 2021", "text": "Dear Developer,\n\nIt worked fine just one time. Few days after, not anymore. Needs regular updating.\nThank you for your hard work on this extension.", "stars": 2}, {"date": "Nov 24, 2021", "text": "finally so glad i got my pixels back 10/10 would recomend", "stars": 5}, {"date": "Nov 23, 2021", "text": "Works like a charm.", "stars": 5}, {"date": "Nov 22, 2021", "text": "Stop working now , win 10 Chrome", "stars": 2}, {"date": "Nov 22, 2021", "text": "5* app when it's working, but the last few weeks it's suddenly not giving me the option for 1080p or 5.1 in Netflix. 5.1 audio playback is ticked in the Chrome settings for the extension. On a Mac running Chrome v96.0.4664.55", "stars": 3}, {"date": "Nov 22, 2021", "text": "Working as of writing this.", "stars": 5}, {"date": "Nov 20, 2021", "text": "It didn't work before in 2019 but now it seems to be working great! thanks.", "stars": 5}, {"date": "Nov 19, 2021", "text": "Does working", "stars": 5}, {"date": "Nov 14, 2021", "text": "Works as intended! Amazing.", "stars": 5}, {"date": "Nov 13, 2021", "text": "works fine for me, forces netflex to play 1080p instead of 720p on chrome, ty devs.", "stars": 5}, {"date": "Nov 7, 2021", "text": "Extension stopped working for me.\nTried it on Chrome and Firefox [WIndows 7]", "stars": 1}, {"date": "Nov 4, 2021", "text": "Working fine for me.", "stars": 5}, {"date": "Oct 31, 2021", "text": "Not working anymore 31/10 chrome", "stars": 3}, {"date": "Oct 24, 2021", "text": "It works for me, Thank you.", "stars": 5}, {"date": "Oct 21, 2021", "text": "Works for me (OCT 2021), just had to reload my Netflix tab and right click the extension icon and go to options to enable 5.1 audio as well and a few other options. Fantastic! Was able to check the settings using Shift+Ctrl+Alt+D when not in fullscreen.", "stars": 5}, {"date": "Oct 11, 2021", "text": "It's back hell yeah", "stars": 5}, {"date": "Oct 11, 2021", "text": "It works for me, however this makes me reconsider the Netflix platform, maybe I will move to some other platforms\n\nEdit: I noticed one thing that bothered me a little, it works on my intel mac book on bigsur, however it didn't work out well on my family's windows laptop very well, Some shows like squid game are forced to play in 720p", "stars": 4}, {"date": "Oct 11, 2021", "text": "It is working! Netflix is finally in 1080p.", "stars": 5}, {"date": "Oct 2, 2021", "text": "I dunno why netflix doesn't enable 1080p with standard plan by default, was hella confused when saw freakin HD on my 34'' monitor.\nExtension works though, thanks for your job of fixing Netflix bugs (or features lol)", "stars": 5}, {"date": "Oct 1, 2021", "text": "This is working for me as of reviewing! Thank you author!\nPress ctrl+alt+shift+d to check the bitrate/resolution while playing a video in netflix. Now I don't have to use another browser solely just to watch Netflix in higher resolutions.", "stars": 5}, {"date": "Sep 11, 2021", "text": "works, great work guys", "stars": 5}, {"date": "Aug 19, 2021", "text": "it is showing 1080p but I am not sure it is true or not", "stars": 3}, {"date": "Aug 4, 2021", "text": "Works great!\nNow I can watch in glorious 1080p on my Linux machine!", "stars": 5}, {"date": "Aug 3, 2021", "text": "it works, using Chrome on Ubuntu 21.04\n\nit will not work out of the box, you need to activate it in the options of the extension", "stars": 5}, {"date": "Jul 30, 2021", "text": "lol \nworks", "stars": 5}, {"date": "Jul 28, 2021", "text": "waste of my time trying to get it to \"work\" cleared cache and still doesn't work.", "stars": 1}, {"date": "Jul 25, 2021", "text": "Thank y", "stars": 4}, {"date": "Jul 23, 2021", "text": "As of July 2021, this extension works as advertised. I am running Fedora linux and I am getting 1080p.", "stars": 5}, {"date": "Jul 12, 2021", "text": "You have to manually go to Extension settings and turn on all the options (5.1 etc.) from there. It won't work directly after installing from chrome webstore & just clearing the cache. \n\nThis is a good extension but needs the basic instructions and documentation for general public who won't just instinctively bother to tinker around in extension settings.", "stars": 4}, {"date": "Jul 6, 2021", "text": "Works as described \nDoes an amazing job\nWell done", "stars": 5}, {"date": "Jul 5, 2021", "text": "OMG!! This works!! and it enables 5.1 too! please do one for HBO Max and Prime Video!", "stars": 5}, {"date": "Jul 2, 2021", "text": "July 2, 2021: Works perfectly!", "stars": 5}, {"date": "Jun 29, 2021", "text": "I cannot believe an extension is necessary to stream the 1080p netflix service I pay for, in 1080p. But this extension does exactly what it says it does. Thank you OP.", "stars": 5}, {"date": "Jun 28, 2021", "text": "Welcome back!!! We really REALLY miss this extension!! I've managed to use some other when the old version of this wasn't working anymore but wasn't as good as this by any chance. PLUS this is in the webstore Gratz!!\nHopefully it remains here official for good this time. Also thanks for coming back to this project. THIS RIGHT HERE is the BEST extension EVER.", "stars": 5}, {"date": "Jun 27, 2021", "text": "Didn't work for a long time, but has been updated to work yet again! Thank you to the developer!", "stars": 5}, {"date": "Jul 29, 2019", "text": "An excellent extension while it was working. It seems recently that Chrome and or Netflix have changed something and the extension can no longer work on Netflix, but that is not the fault of the owner of this extension... Hopefully fixed soon, thanks so much for this effort, even if not.", "stars": 5}, {"date": "Jul 28, 2019", "text": "Extensions has worked for me for several months, until today. Assuming Netflix (or maybe Chrome) has changed something on there end that has broken the functionality of the extension, hopefully fixed soon. Still blows my mind that Netflix would not be streaming 1080 in the first place.", "stars": 4}, {"date": "Jul 28, 2019", "text": "please fix it", "stars": 1}, {"date": "Jul 28, 2019", "text": "It used to work perfectly but now not working anymore for past week. Please do your magic and make it work again.", "stars": 3}, {"date": "Jul 27, 2019", "text": "It worked fine until recently, I can't play any videos at all with this turned on.", "stars": 2}, {"date": "Jul 27, 2019", "text": "It was an awesome extension. But I'm getting this error since this morning : M7111-1331", "stars": 4}, {"date": "Jul 27, 2019", "text": "A fantastic extension when it was working. Unfortunately within the last week Netflix appears to have changed something that broke it. Now attempting to view most (or possibly any) titles with this extension enabled will cause the video to fail to load with an error message. If this can be fixed then this extension will once again be amazing.", "stars": 5}, {"date": "Jul 26, 2019", "text": "can not work today\nit'll show the error code : M7111-1331", "stars": 5}, {"date": "Jul 26, 2019", "text": "Use to work back in the days. Now it just gives streaming error M711. Think it needs an update.", "stars": 3}, {"date": "Jul 26, 2019", "text": "Worked great until a few days ago.\n\nFoutcode: M7111-1331", "stars": 5}, {"date": "Jul 26, 2019", "text": "It stop working couple of days ago...", "stars": 4}, {"date": "Jul 26, 2019", "text": "Not working anymore after 25th July, 2019. It was working fine before. Getting an error once i turn on this extension.", "stars": 2}, {"date": "Jul 26, 2019", "text": "Does not work.\nStreaming error whenever the addon is activated, looks like it is blocked or something.\nIt works 1 time if you remove cache, then it goes back to not working again.", "stars": 2}, {"date": "Jul 26, 2019", "text": "its down,sad", "stars": 3}, {"date": "Jul 25, 2019", "text": "Worked for ages, good program but as of 25/07/19 its not working anymore. netflix throws a M7111-1331 error code", "stars": 3}, {"date": "Jul 25, 2019", "text": "It was very good but in July 24, 2019 it stop working and makes netflix to refuse to start any videos unless you disable it... please fix it, its a very good extension!", "stars": 5}, {"date": "Jul 25, 2019", "text": "M7111-1331 bug", "stars": 5}, {"date": "Jul 25, 2019", "text": "Error Code：M7111-1331", "stars": 5}, {"date": "Jul 25, 2019", "text": "can not work today\nit'll show the error code M7111-1331", "stars": 5}, {"date": "Jul 25, 2019", "text": "it blocked by netflix again", "stars": 1}, {"date": "Jul 24, 2019", "text": "Error Code: M7111\n\nError Code: M7399-1260-00000024\n\nNetflix support wasn't able to figure out the issue. Your app is BROKEN dude. (Maybe read some chrome dev docs/blog postings/youtube videos before releasing this unstable pos app)", "stars": 1}, {"date": "Jul 24, 2019", "text": "Worked great until today.", "stars": 3}, {"date": "Jul 24, 2019", "text": "Was working this morning, but when I came back, whichever thing I tried watching, Netflix told me it wasn't available for streaming. Cleared cache multiple times on and off, only works when turned off.", "stars": 3}, {"date": "Jul 24, 2019", "text": "It worked fine until recently. Now it breaks Netflix and can no longer stream videos on Chrome while running this extension. Have to disable it to play videos.", "stars": 3}, {"date": "Jul 24, 2019", "text": "Useless Does not even work i rather kill my self then use it again", "stars": 1}, {"date": "Jul 24, 2019", "text": "Works fine on Chrome, but since yesterday doesn't work on Opera and Opera GX. Error O7111-1331, streaming video error.I can't watch any video. When I turn this extention off, Netflix works again. Even Netflix support doesn't know how to fix this problem.", "stars": 4}, {"date": "Jul 24, 2019", "text": "please update it to opera, it's not working since two days ago", "stars": 4}, {"date": "Jul 21, 2019", "text": "Works again 07/21/2019", "stars": 4}, {"date": "Jul 21, 2019", "text": "It worked, but now it stopped and Netflix shows error.", "stars": 3}, {"date": "Jul 21, 2019", "text": "as of today , its not working again  -,-", "stars": 3}, {"date": "Jul 21, 2019", "text": "its stop working for me on chrome with macos.\nhope it will be fixed againg\n(already clear cache and history)", "stars": 2}, {"date": "Jul 20, 2019", "text": "Good while it worked, but as of today Netflix has blocked it.", "stars": 5}, {"date": "Jul 20, 2019", "text": "this extension working perfect until today. when ı open netflix at this extension I get this error.\n\nhttps://imgur.com/lLEq6tE\n\nso doesn't work now. pls fix asap.\n\nEDIT: TY for quick fix. Working perfect again.", "stars": 5}, {"date": "Jul 20, 2019", "text": "Loved this extension, but heads up - looks like Netflix is blocking playback as of 7/20/19 if you're chrome browse has this extension installed. Had to uninstall for now to keep watching my shows.", "stars": 5}, {"date": "Jul 20, 2019", "text": "The update today broke it for me. Shows Error Code m7121-1003.", "stars": 3}, {"date": "Jul 20, 2019", "text": "Version 1.17 doesn't work I am getting O7111-1331 error code (Opera) and M7111-1331 (Chrome)", "stars": 1}, {"date": "Jul 20, 2019", "text": "It was working but as at this moment it shows error M7121-1003 in netflix. when I disable it, netflix plays normal", "stars": 4}, {"date": "Jul 15, 2019", "text": "2019-07-15\nIt works, ctrl+alt+shift+D shows 1080p\nidk why so many ppl are saying it wont work\nbut hey at least now i dont have to use Edge lol\nThanks a lot!", "stars": 5}, {"date": "Jul 13, 2019", "text": "It's not full HD", "stars": 1}, {"date": "Jul 11, 2019", "text": "It works.\nEdit 24/7/19: Stopped working. Netflix goes into a \"streaming error\" when the extension is enabled. It doesn't let you continue watching.", "stars": 4}, {"date": "Jul 10, 2019", "text": "One of those hidden gems you didn't realize you needed.", "stars": 5}, {"date": "Jul 8, 2019", "text": "It actually works!  I shouldn't need this,  because Netflix should just work with 1080 in Chrome by default,  but because Netflix made some bad business decisions,  we have to use this extension to get 1080 working.  And it does work!  If anyone knows something similar to this for Amazon Prime Video,  please let me know!  Using Debian GNU Linux with Google Chrome.", "stars": 5}, {"date": "Jul 7, 2019", "text": "is lit", "stars": 5}, {"date": "Jun 18, 2019", "text": "it works for me and it's amazing thanks for developer", "stars": 5}, {"date": "Jun 5, 2019", "text": "it works, thanks!", "stars": 5}, {"date": "Jun 2, 2019", "text": "This extension does work. Remember to clean your cache and cookies in case it doesn't.", "stars": 5}, {"date": "May 22, 2019", "text": "Works great...BUT...what people need to realize is that not all of Netflix content is available with a max res of 1080p. Some of it is only 480p or 720p. If the content is available in 1080p, this plugin will let chrome play it (assuming your connection is fast enough).  What this extension won't do, is to magically make a 480p max video into a 1080p one.  If you want to verify a movie resolution, try it with MS Edge browser.  It doesn't hurt to read the instructions, either... :)", "stars": 5}, {"date": "May 8, 2019", "text": "My only gripe is that it seems to select \"5.1 Audio Description\" as the default instead of the standard 5.1", "stars": 4}, {"date": "May 6, 2019", "text": "2018.05.06\nit worked. check the bitrate and resolution by pressing ctrl+alt+shift+d\nfind this line below\n\"\nPlaying bitrate (a/v): 96 / 3045 (1920x1080)\n\"", "stars": 5}, {"date": "May 5, 2019", "text": "It used to work until a few days ago when I tried to watch Netflix it reduces to the worst possible resolution, way worse than the default 720p. I ended up just using Internet Explorer.", "stars": 2}, {"date": "Apr 29, 2019", "text": "It just works.", "stars": 5}, {"date": "Apr 28, 2019", "text": "Does not work", "stars": 1}, {"date": "Apr 27, 2019", "text": "It works.\nThe resolution goes to 1920x1080 in auto.\nUsing Linux Mint 19.1 Cinnamon.", "stars": 5}, {"date": "Apr 27, 2019", "text": "Works great on Kubuntu", "stars": 5}, {"date": "Apr 23, 2019", "text": "for some reason super netflix settings for bitrate wont show up unless this extension is on", "stars": 5}, {"date": "Apr 21, 2019", "text": "it is awesome", "stars": 5}, {"date": "Apr 20, 2019", "text": "Seems to be working on Chrome on Mac", "stars": 5}, {"date": "Apr 17, 2019", "text": "Works as it should but unfortunately for me, often switches back to 1280x720 or lower because of my connection.", "stars": 5}, {"date": "Apr 16, 2019", "text": "More of a question than a review (for now). How is this working on the new Microsoft Edge Chromium versions? Is it even required? or does Edge retain its ability to play content at high quality without this extension.", "stars": 4}, {"date": "Apr 16, 2019", "text": "Works fine most of the time.\nPress Ctrl-Alt-Shift-D in Netflix browser tab to display stats.", "stars": 4}, {"date": "Apr 16, 2019", "text": "don't work", "stars": 1}, {"date": "Apr 12, 2019", "text": "It worked perfectly in my chrome. I installed, closed chrome and opened again, open netflix and it starts at 1080p instantly. Thank you :)", "stars": 5}, {"date": "Apr 11, 2019", "text": "Sorry, 1 star because it's simply not working. It just runs at 720p. I cleared cache and everything, but it doesn't work. Browser is freshly installed. I don't know what else to do.", "stars": 1}, {"date": "Apr 10, 2019", "text": "Doesn't work on Ubuntu 18.10 (both Chrome and Opera)", "stars": 1}, {"date": "Apr 8, 2019", "text": "Works perfectly, simply does what it promises: 1080p Netflix in Chrome (which, fyi, is limited to 720p by default). Now I longer need to use Edge just because I want to watch Netflix!", "stars": 5}, {"date": "Apr 7, 2019", "text": "no longer works", "stars": 1}, {"date": "Mar 27, 2019", "text": "It didn’t work even i already clean the cache,", "stars": 5}, {"date": "Mar 25, 2019", "text": "doesn t work, still 540p", "stars": 1}, {"date": "Mar 22, 2019", "text": "works for me", "stars": 5}, {"date": "Mar 19, 2019", "text": "Strange, but really works. At least for some my shows. Before I installed this extension, ctrl+shift+alt+s didnt work for me at all (only alt+d works), but after - works both (+d and +s).", "stars": 5}, {"date": "Mar 16, 2019", "text": "Worked. You can check by typing CTRL+Shift+Alt+D.\n\nI was watching The Office (US)\nPlaying bitrate (a/v): 96 / 4870 (1920x1080)", "stars": 4}, {"date": "Mar 15, 2019", "text": "It would be better if clicking on the extension icon takes you to the Netflix site.", "stars": 4}, {"date": "Mar 14, 2019", "text": "this addon not working for me...still shity 720p F U Netflix and this garbage QA", "stars": 1}, {"date": "Mar 5, 2019", "text": "Finally 1080p Netflix in Chrome!", "stars": 5}, {"date": "Mar 4, 2019", "text": "useless", "stars": 1}, {"date": "Mar 3, 2019", "text": "it works on some content but not all, like 'silence of the lamb' could be up to 1080p but not 'kill bill volume 1', anyone have any thoughts?", "stars": 4}, {"date": "Feb 27, 2019", "text": "doesnt work", "stars": 1}, {"date": "Feb 23, 2019", "text": "amazing extension but after the new netflix update the extension now skips then pause instead of auto playing.", "stars": 5}, {"date": "Feb 22, 2019", "text": "it worked after clear cache, watch and wait a little bit for it too load. it's good.", "stars": 5}, {"date": "Feb 22, 2019", "text": "Made the video smaller and quality looked bad", "stars": 1}, {"date": "Feb 21, 2019", "text": "How do I tell if it's working? Do I need to click the extension in the menu bar to activate it or does it work automatically?", "stars": 4}, {"date": "Feb 21, 2019", "text": "Works great 1080p and 5.1", "stars": 5}, {"date": "Feb 20, 2019", "text": "it works just fine for me on chrome 72 / win10", "stars": 5}, {"date": "Feb 19, 2019", "text": "doesn't work", "stars": 1}, {"date": "Feb 18, 2019", "text": "Utterly useless. It has ONE JOB which it doesn't even do. Don't waste your time.", "stars": 1}, {"date": "Feb 18, 2019", "text": "its good", "stars": 5}, {"date": "Feb 14, 2019", "text": "Noticed blurry artifacting, checked the stream, and it was sending 540p.  Ouch, went searching for a solution.  Found this app, cleared my cache, and it's working thus far perfectly, crystal clear 1080p video in chrome.  Thanks!", "stars": 5}, {"date": "Jan 31, 2019", "text": "Works but has huge CPU spikes every once in a while. No expert but could be a bitcoin miner.", "stars": 2}, {"date": "Jan 26, 2019", "text": "I cleared cache, still does not work at all.", "stars": 1}, {"date": "Jan 25, 2019", "text": "It doesn't work anymore!", "stars": 1}, {"date": "Jan 24, 2019", "text": "Finally 1080p Netflix on Linux. Works like a charm.", "stars": 5}, {"date": "Jan 22, 2019", "text": "Doesnt work at the moment...", "stars": 1}, {"date": "Jan 21, 2019", "text": "It doesn't work for me  ...", "stars": 1}, {"date": "Jan 16, 2019", "text": "It stopped work as of 1/15/2029.", "stars": 2}, {"date": "Jan 15, 2019", "text": "Flawless 1080p video playback, but 5.1 surround sound playback isn't working anymore.", "stars": 4}, {"date": "Jan 14, 2019", "text": "Do what supposed to do.", "stars": 5}, {"date": "Jan 9, 2019", "text": "Doesn't work for me right now, I get 480p or 720p in browser.", "stars": 4}, {"date": "Jan 8, 2019", "text": "Does what it's supposed to do.\n1080p playback using Chrome in Manjaro Linux.\nAny way to enable 4K as well?", "stars": 5}, {"date": "Jan 5, 2019", "text": "It works!", "stars": 5}, {"date": "Jan 5, 2019", "text": "This usually works, some movies or tv series just do not load if this extension is enabled. Make no mistake, this is because Netflix doesn't want you to have the option for higher quality since it saves them bandwith.\n\nAs of 1/2/19 I know for sure that about 20% of the things I try to watch don't load if this extension is enabled.", "stars": 3}, {"date": "Jan 2, 2019", "text": "It doesn't work anymore. Netflix Error Code: M7353-5101.", "stars": 2}, {"date": "Jan 1, 2019", "text": "Used to work great, but as of 30 Dec 2018 it has stopped working. Netflix throws up Error Code: M7353-5101(means extension is preventing Netflix from playing). Tried disabling all other extensions, and narrowed it down to this one.", "stars": 3}, {"date": "Dec 30, 2018", "text": "Ignore any review below 4 or 5 stars. This does what it's supposed to do. Occasionally it will break, but this is not the creators fault as Netflix will make changes often that will break this extension. If this happens, disable it and wait for it to be updated. Not rocket science.", "stars": 5}, {"date": "Dec 26, 2018", "text": "Loved it when it worked but it stopped working again.", "stars": 5}, {"date": "Dec 21, 2018", "text": "Very nice extension. But it doesnt work. Since yesterday i got the error M7111-1309. An Update would be great!", "stars": 5}, {"date": "Dec 19, 2018", "text": "Stopped working :(", "stars": 3}, {"date": "Dec 14, 2018", "text": "I don't know how this works. But WOW! Keeps netflix HD which is just what I needed as for some reason even though my internet speed is over 250mbps netflix still went low quality after a few mins of watching! This extension is a savior!", "stars": 5}, {"date": "Dec 12, 2018", "text": "It's a great extension for some of the content. But when it comes to some films, for example it just happened with The Untouchables, the bitrate won't go further than 950. But in the Windows app, it is 4220. That also happened with Watchman the other day. Weird.", "stars": 4}, {"date": "Dec 12, 2018", "text": "Doesnt work. When you click it says it will reload the page to use the extension, it reloads and plays a couple seconds in 1080 but then immediately returns to SD. Useless.", "stars": 1}, {"date": "Dec 11, 2018", "text": "make video quality like Crystal", "stars": 5}, {"date": "Dec 8, 2018", "text": "Great extension. however for certain movies it doesnt work.Instead an M7353-5101 error would be detected. Would you look into it please", "stars": 5}, {"date": "Dec 8, 2018", "text": "Some movies just won`t load with this extension (e.g. try \"Constantine\" movie), throwing an error after 30s of load....", "stars": 2}, {"date": "Dec 5, 2018", "text": "If content is not available in 720p or 1080p (Older shows like Frasier) it will not play. I get error M7353-5101.", "stars": 3}, {"date": "Dec 3, 2018", "text": "Right after installing the image became much clearer and less choppy.", "stars": 5}, {"date": "Nov 29, 2018", "text": "It works, and this is very valuable.", "stars": 5}, {"date": "Nov 28, 2018", "text": "I think if a 1080p was not available,instead of playing 720p,it just doesn't play anything resulting in an unexpected error.I think just the if statements need to be changed.Please look into it please.", "stars": 3}, {"date": "Nov 28, 2018", "text": "Doesn't work, Chrome max video is 540 audio is improved however.", "stars": 2}, {"date": "Nov 26, 2018", "text": "Work it.", "stars": 5}, {"date": "Nov 23, 2018", "text": "LOVE This EXTENSION!!!\nAs a long time user just want to say, thanks \"truedread\" for all the work you have put into this chrome extension, so very much appreciated!\nAlso appreciate the the fast fixes when netflix makes changes like the recent video player change.\nAn excellent extension I would recommend to all chrome users watching netflix!", "stars": 5}, {"date": "Nov 22, 2018", "text": "An indispensable extension. Thanks!", "stars": 5}, {"date": "Nov 22, 2018", "text": "Works 100%, Ctrl+Alt+Shift+D shows that resolution reach 1920x1080. Great job doing this.", "stars": 5}, {"date": "Nov 21, 2018", "text": "Does its job. After Netflix changes I was thinking that it's over, but plugin was quickly updated. Good job! It is ridiculous that I pay for 4k and I can watch it on my TV, but on my PC (linux) I'm stuck with terrible 720p due to DRM. With this I can at least get that 1080p, which still isn't great for 4k monitor... It's sad that everyone are treat like thief's, even after buying something legally. What's the point of this   if pirates are still successfully releasing 4K versions anyway? No p... Show more", "stars": 5}, {"date": "Nov 21, 2018", "text": "Thx you for the update, it works again as great as before! Best Netflix Extension ever ...", "stars": 5}, {"date": "Nov 21, 2018", "text": "Everything is ok now。Thanks。\nNow I hope that it support 2k/4k", "stars": 5}, {"date": "Nov 21, 2018", "text": "When it works, it's perfect!", "stars": 5}, {"date": "Nov 20, 2018", "text": "Breaks Netflix and prevents videos from playing as of Nov2018.\nThis addon is like a Mafia Don's wife.\nDO NOT TOUCH", "stars": 1}, {"date": "Nov 20, 2018", "text": "Not Working!!!", "stars": 1}, {"date": "Nov 20, 2018", "text": "On some titles it gives error code. Could you fix this ?  Did you have paypal for donation ?", "stars": 5}, {"date": "Nov 20, 2018", "text": "Worked fine until a week ago when the extension is preventing me to access NF videos, Please fix it for 5*", "stars": 2}, {"date": "Nov 20, 2018", "text": "It works only for a moment, then the video is in poor quality 682x384.", "stars": 1}, {"date": "Nov 20, 2018", "text": "Fixed, work now, thanks", "stars": 5}, {"date": "Nov 20, 2018", "text": "the version 1.10 works again..i guess this is issue with netflix changing player and extension needing update to support that.\n\npeople can use release on github (1.10 ) and it works or can wait for extension to update here.", "stars": 5}, {"date": "Nov 19, 2018", "text": "Works fine on 30/11 after the update. Thank you for updating it, good plugin.", "stars": 5}, {"date": "Nov 19, 2018", "text": "The issue is fixed in : https://github.com/jeyk/netflix-1080p/tree/update-cadmium-player\ndownload the update-cadmium-player branch and manually install.", "stars": 5}, {"date": "Nov 18, 2018", "text": "was really good and was working like a charm,now if you have it enable on chrome ,netflix gives an unfortunate error,it would be great if developers can fix it and start working again!", "stars": 3}, {"date": "Nov 18, 2018", "text": "Doesnt work anymore", "stars": 2}, {"date": "Nov 18, 2018", "text": "Worked well until November 2018. Now Netflix won't load videos and says, \"whoops something went wrong - Unexpected error\"", "stars": 3}, {"date": "Nov 17, 2018", "text": "I confirm. It stopped working on Chrome and when it's on, Netflix doesn't play any movies. Needs to be shut down in order to watch anything. It requires a fix.", "stars": 3}, {"date": "Nov 17, 2018", "text": "Worked pretty well, up until recently where it caused netflix to produce an error code and not play a video at all. Error Code: M7111-1331-2206.  After clearing cached images and files, the error remained, but it dropped the error code.", "stars": 4}, {"date": "Nov 17, 2018", "text": "Doesn't work. Netflix will not play at all with it enabled.", "stars": 1}, {"date": "Nov 17, 2018", "text": "Back to working again", "stars": 5}, {"date": "Nov 16, 2018", "text": "Used to work great, but since yesterday (15. Nov 2018) it causes the error code M7111-1331-2206, so I had to disable the extension. A fix would be wonderful :)", "stars": 3}, {"date": "Nov 16, 2018", "text": "Used to work just fine until 15.11.2018. Now i get the error code  M7111-1331-2206. please fix this!", "stars": 1}, {"date": "Nov 16, 2018", "text": "Stopped working for today. Netflix returning M7111-1331-2206 error with this extension. After uninstalling Netflix starts wotking.", "stars": 1}, {"date": "Nov 16, 2018", "text": "Great Extension!! But can't use today. (07/25/2019)\nSeems Netflix updated their web player again.\n\nPLEASE FIX IT.", "stars": 5}, {"date": "Nov 16, 2018", "text": "It no longer works, but when it did it was great. This extension needs an update, there must have been some changes from Netflix side.", "stars": 4}, {"date": "Nov 16, 2018", "text": "Stopped working today.", "stars": 2}, {"date": "Nov 15, 2018", "text": "Used to work fine... but now it seems broken", "stars": 2}, {"date": "Nov 15, 2018", "text": "It is not working. Error Code: M7111-1331-2206.", "stars": 1}, {"date": "Nov 15, 2018", "text": "Error was patched ! Good follow up", "stars": 5}, {"date": "Nov 15, 2018", "text": "work like a charm last couple of months.\n\nbut Error Code: M7111-1331-2206.\n\nhope to see next update.", "stars": 4}, {"date": "Nov 15, 2018", "text": "Unable to watch Netflix. Error Code: M7111-1331-2206", "stars": 4}, {"date": "Nov 15, 2018", "text": "Mom It's broken.", "stars": 3}, {"date": "Nov 15, 2018", "text": "Unable to watch Netflix. Error Code: M7111-1331-2206. Issue started today. Disabling extension allows Netflix to play content. \n\nPlease Fix, Thank you! :)", "stars": 5}, {"date": "Nov 15, 2018", "text": "I had ZERO problems with this extension like less than an hour ago, now all the sudden I'm getting an error message. What's up with this?! I really hope this gets fixed.", "stars": 2}, {"date": "Nov 15, 2018", "text": "Great addon", "stars": 5}, {"date": "Nov 15, 2018", "text": "dont know what happen but when this extension is enabled netflix gives me an error. was working fine for month then today this happend. i thought something was wrong with chrome. so i uninstalled chrome clear cache browser history etc. found out that the extension was behind it all", "stars": 2}, {"date": "Nov 14, 2018", "text": "As in right now, the extension is not working on Chrome for Mac.", "stars": 1}, {"date": "Nov 10, 2018", "text": "Funktioniert perfekt! Works great! But sometimes you have to wait.", "stars": 5}, {"date": "Oct 31, 2018", "text": "Works as expected, i'd recommend it", "stars": 5}, {"date": "Oct 22, 2018", "text": "I didn't even know I was limited. Netflix is looking worlds better!", "stars": 5}, {"date": "Oct 21, 2018", "text": "wow this actually works it gives me 1080p playback in linux\nty", "stars": 5}, {"date": "Oct 20, 2018", "text": "This is simply amazing.", "stars": 5}, {"date": "Oct 18, 2018", "text": "Doesn't work, while its installed the quality goes DOWN not up. Tried deleting cookies and cache already, still.\n\nUsing Windows 7.", "stars": 1}, {"date": "Oct 15, 2018", "text": "Didn't make a difference what so ever. Yes I have the UHD 4k package, and a wired, 340Mbps download 22 Mbps upload connection. Wouldn't bother with this extension as it seems to be a Netflix issue. As much as you don't want to hear this, you get a steady, and believable 1080p with Microsoft Edge.... However, load times between shows can be painfully long compared to chrome being instant.", "stars": 1}, {"date": "Sep 23, 2018", "text": "Beautiful, thought I'd have to resort to edge for netflix. This took care of it perfectly.", "stars": 5}, {"date": "Sep 21, 2018", "text": "It used to work perfectly well but now my netflix doesn't stream above 480p ever since the big chrome update.\nPS. My internet speed's 20mbps and i have the uhd netflix subscription so there's nothing lacking on my end", "stars": 3}, {"date": "Sep 19, 2018", "text": "Working as of September 19th, 2018. I suspect someone higher up the chain in Netflix supporting this extension, this is FREAKING AWESOME!", "stars": 5}, {"date": "Sep 1, 2018", "text": "Fantastic.", "stars": 5}, {"date": "Aug 31, 2018", "text": "wow - it just works...  Shame on you Netflix for not supporting one of the most popular browsers out here naitivly...", "stars": 5}, {"date": "Aug 30, 2018", "text": "dont work", "stars": 1}, {"date": "Aug 24, 2018", "text": "works fine for me", "stars": 5}, {"date": "Aug 23, 2018", "text": "The only one that really works to get 1080p.", "stars": 5}, {"date": "Aug 20, 2018", "text": "It Works :D", "stars": 5}, {"date": "Aug 19, 2018", "text": "well done, thank you.", "stars": 5}, {"date": "Aug 13, 2018", "text": "Works great. Thank you very much!", "stars": 5}, {"date": "Aug 12, 2018", "text": "dont work", "stars": 1}, {"date": "Aug 11, 2018", "text": "It simply works", "stars": 5}, {"date": "Aug 5, 2018", "text": "Exceptionnal", "stars": 5}, {"date": "Aug 2, 2018", "text": "Is what it says. Very reliable and easy to use.", "stars": 5}, {"date": "Jul 31, 2018", "text": "Works great", "stars": 5}, {"date": "Jul 28, 2018", "text": "dont work", "stars": 1}, {"date": "Jul 26, 2018", "text": "A miracle for win7, thanks so much.", "stars": 5}, {"date": "Jul 24, 2018", "text": "Works as described", "stars": 5}, {"date": "Jul 19, 2018", "text": "Works at first, but switches to 480p after 10 minutes or so (default before installing was 720p). Will keep using to see if this happens on all shows, and update accordingly.", "stars": 2}, {"date": "Jul 19, 2018", "text": "Works as advertised", "stars": 5}, {"date": "Jul 17, 2018", "text": "It caused my Netflix to become very poor quality.", "stars": 1}, {"date": "Jul 13, 2018", "text": "Does what it is suppose to do ;-)", "stars": 5}, {"date": "Jul 12, 2018", "text": "It works. Some people say it doesn't work, probably because of using other extensions like \"Super Netflix\" at the same time. You have to set the bitrates over 4000 to get 1080p. (Sometimes you get 1080p if your bitrates is over around 2800, but it's not guaranteed.)", "stars": 5}, {"date": "Jul 2, 2018", "text": "I have the cheapest version of netflix (9.99/month) and thought it would give me full 1080p but gave me 720p instead, im happy but i woudve liked that extra HD  quality (1080p or higher). Also when I do ctrl+shift+alt+s it actually shows me a lot more options (Netflix was suggesting b/w 200 - 300 bitrate), now im getting more.\n\nKeep up the good work!", "stars": 5}, {"date": "Jun 29, 2018", "text": "Works as advertised", "stars": 5}, {"date": "Jun 22, 2018", "text": "good", "stars": 5}, {"date": "Jun 18, 2018", "text": "Thank you!", "stars": 5}, {"date": "Jun 17, 2018", "text": "Love it!", "stars": 5}, {"date": "Jun 14, 2018", "text": "Doesn't work at all. I used  SHIFT + CTRL + ALT + S and SHIFT + CTRL + ALT + D to check as well. \n\nI have HD (playback is set correctly) and at best, Netflix shows 480p on my computer. \n\nSo don't bother with this extension. Maybe it worked at one point or maybe Netflix did something to break it again, but whatever the case, as of June 14, 2018, it DOES NOT WORK.", "stars": 1}, {"date": "Jun 9, 2018", "text": "Does not seem to work on Chrome Version 67.0.3396.62 (Official Build) (64-bit)", "stars": 1}, {"date": "Jun 7, 2018", "text": "The only one that works, and that's because the developer has continued maintaining it, and fixes any issues that Netflix throws at them.", "stars": 5}, {"date": "May 29, 2018", "text": "EDIT WARNING: THIS DOES NOT WORK FOR DISNEY MOVIES. Originally gave this a bad rating because I assumed it didn't work at all when I saw crappy quality/bitrate while watching Guardians of the Galaxy. But, it works! Hopefully the Disney incompatibility gets sorted out soon. I hate using the Windows 10 app so this extension is going to be a life saver for me.", "stars": 5}, {"date": "May 24, 2018", "text": "Doesn't work, used the ctrl+alt+shift+s but nothing changes still streaming in 720p", "stars": 2}, {"date": "May 24, 2018", "text": "Does what it says and is still supported. Great extension for anyone looking to watch netflix on chrome.", "stars": 5}, {"date": "May 23, 2018", "text": "Brilliant.\n*** netflix won't play any title as of 25/7/19 when enabled. Please update/fix for 5 stars.", "stars": 1}, {"date": "May 23, 2018", "text": "Heads up people, it SEEMS like Netflix has intentionally broken resolution/bitrate forcing plugins by making them break playback entirely.\n\nI don't think this is the developer's fault.\n\nSo please, don't come here to write an angry review against the dev, instead go write an angry letter to Netflix for being awful - and strongly consider switching to another service.  I know I'll be looking around for a new service.  In the mean time, I hope another workaround for netflix's BS can be found soon.", "stars": 5}, {"date": "May 23, 2018", "text": "Fantastic extension, used it since it came out.\n\nIt's a shame Netflix restricts us to 720p in this day and age.\n\nReview update. The extension has been fixed! Cheers @developers.", "stars": 5}, {"date": "May 22, 2018", "text": "Just came on here because I noticed it was Removed on Firefox?  is it going to be coming back?", "stars": 1}, {"date": "May 17, 2018", "text": "Doesn't work. Tried clearing cache, tried ctrl+alt+shift+s like everyone says, doesn't work.", "stars": 1}, {"date": "May 12, 2018", "text": "Does what it says. Video quality is noticeably improved.", "stars": 5}, {"date": "May 12, 2018", "text": "Works Well. Was shuffling between Edge and Chrome for Netflix and Prime video. Happy days! great work developer!", "stars": 5}, {"date": "May 8, 2018", "text": "It works really good, it would be great to update to 4K because even in my 1080 screen 4k videos look better cause netflix compress the videos", "stars": 5}, {"date": "May 3, 2018", "text": "dosent work", "stars": 1}, {"date": "Apr 21, 2018", "text": "Works. thanks for the addon and the explanation on github truedread!", "stars": 5}, {"date": "Apr 15, 2018", "text": "Doesn't work anymore.", "stars": 1}, {"date": "Apr 10, 2018", "text": "Finally!", "stars": 5}, {"date": "Mar 28, 2018", "text": "thank god", "stars": 5}, {"date": "Mar 27, 2018", "text": "Works like magic, this is seriously fantastic. Trust me when I say this, but I've tried watching Netflix in 1080p in multiple different ways (using Edge, or IE Tab for chrome(that didn't even work)) and this is the only and this is pretty much the only way to do it without using Edge or the Netflix windows 10 app, which both cause terrible cursor lag spikes in my computer every second for some reason, so that wasn't good. I don't even know how this dude did this but its amazing, I'm seriously... Show more", "stars": 5}, {"date": "Mar 23, 2018", "text": "Wow, actually surprised that this worked.  Just remember to do ctrl+alt+shift+s to change settings, and then ctrl+alt+shift+d to make sure it worked", "stars": 5}, {"date": "Mar 20, 2018", "text": "Ok, it's fine until you don't rewind and video need to buffer. Now you have lowest quality, and will stay like that until page refresh. So, there is bug. It's blocking high quality after buffering. (no it's not isp fault, it's not netflix fault - everything works properly after disabling plugin - reinstall also isn't changing anything so don't bother)", "stars": 2}, {"date": "Mar 20, 2018", "text": "I like this but i'm skeptical, i took screenshots of a show with and without this extension at the exact same frame, they look exactly the same, however this extension does show that i am using 1080p when i ctrl+alt+shift+d but i'm curious if this is just an inspect element kind of thing.\n\nEDIT: After looking further into it i am pretty sure this actually does change the resolution, it's definitely not inspect element, great extension.", "stars": 5}, {"date": "Mar 19, 2018", "text": "Works only rarely, aka not all the time. Better use Edge Browser if you can help it.\nYou can check with strg+alt+shift+d if it's in 1080p and only 1 of 5 series/movies work with that plugin in 1080p.", "stars": 1}, {"date": "Mar 18, 2018", "text": "Works @ v65.0.3325.162\n\nMaybe doesn't work because you have to wait a few seconds / minutes after click \"Play\"?\n\nAnd bandwith have to be at last 5-10 Mbps?", "stars": 5}, {"date": "Mar 18, 2018", "text": "Does not work at all.  Have cleared browsing data and dont understand I'm in the UK if that makes a difference.", "stars": 1}, {"date": "Mar 18, 2018", "text": "it works thank you!", "stars": 5}, {"date": "Mar 16, 2018", "text": "Dude you are great this is best extension ever. I love you :) Btw is there a way to make a movies non-originals in HD as well for example Avengers and Jurrasic World on edge is 5000+bitrate but on chrome 1700+", "stars": 5}, {"date": "Mar 11, 2018", "text": "Awesome, works perfectly. Finally I can enjoy Netflix in 1080p on Chrome. Thanks!", "stars": 5}, {"date": "Mar 10, 2018", "text": "Does what is says on the tin.", "stars": 5}, {"date": "Mar 8, 2018", "text": "Works as designed and just want I wanted.  Netflix looks so much better now.", "stars": 5}, {"date": "Feb 28, 2018", "text": "loved it!", "stars": 5}, {"date": "Feb 24, 2018", "text": "Good extension, just remember to ctrl+alt+shift+s to change the bitrate and ctrl+alt+shift+d to verify it.", "stars": 4}, {"date": "Feb 22, 2018", "text": "no go", "stars": 1}, {"date": "Feb 20, 2018", "text": "Doesn't work Chrome V. 64.0.3282.167  (64-bita)", "stars": 2}, {"date": "Feb 20, 2018", "text": "Doesn't work. Videos are still capped at 480p when a 1080p version plays in Edge.", "stars": 1}, {"date": "Feb 19, 2018", "text": "Great extension, works exactly as described. Don't know if Netflix will ever stop this work-around but until then I can enjoy 1080p playback in Chrome, thanks to the dev!", "stars": 5}, {"date": "Feb 14, 2018", "text": "Doesn't work on my Chrome (Version 63.0.3239.132 (Official Build) (64-bit)) + Win 10. I cleared the cache in browser. The bit rate is the same. Checked on Edge and there is 1080p. \n\nNot sure how it should be but the extension has grayed out the \"Options\" button.", "stars": 3}, {"date": "Feb 13, 2018", "text": "Hello. Thank you for extension, it really works. Can you make it support 4k also?", "stars": 5}, {"date": "Feb 13, 2018", "text": "Love this extension.As others noted, works like a charm. There is an issue with certain videos though. Disney titles like Pirates of the Caribbean or The Jungle Book are capped at 480p and the extension doesn’t seem to work with those. Is there a workaround?", "stars": 5}, {"date": "Feb 13, 2018", "text": "Netflix only played at 720p video and 64bit rate audio before. Now with this Netflix 1080p extention, Not only can I watch 1080p video but audio is 96 bit rate as well! (Press Control-Alt-Shift-S to see while watching netflix video).", "stars": 5}, {"date": "Feb 13, 2018", "text": "Working as expected!\nThank you!", "stars": 5}, {"date": "Feb 12, 2018", "text": "Didn't work, i don't know if it because i'm outside the US, but didn't work.\nUbuntu 16.04\ngoogle-chrome-stable (64.0.3282.140-1)\nLocation: Mexico", "stars": 2}, {"date": "Feb 12, 2018", "text": "Stopped working for today. Netflix returning M7111-1331-2206 error with this extension. After uninstalling Netflix starts wotking.\n\nPlease comment if started working again!", "stars": 1}, {"date": "Feb 12, 2018", "text": "its worked", "stars": 5}, {"date": "Feb 11, 2018", "text": "It works! Using along super netflix extension and in the video information it says 1080p instead 720p :). GOOD JOB!!", "stars": 5}, {"date": "Feb 11, 2018", "text": "I must confess that I was doubting that it would work but hey, it works. And it works pretty well. To test that it is indeed running at 1080p, search for \"Test Patterns\" in Netflix search bar and run a test video before and after installing the extension. Will you notice it running at 1080p. Thanks, developer.", "stars": 5}, {"date": "Feb 11, 2018", "text": "Works :) Thanks", "stars": 5}]