[{"text": "BRILLIANT. I really like this extension. Also the owl 😆.", "stars": 5, "date": "Mar 2, 2024"}, {"text": "Edit: Changed to 1 star because of how invasive this extension is. I was loading data on a new site which I hadn't saved and the chrome extension was trying to force it to close no matter what. I ended up losing my data and unable to recover it. Very invasive and annoying when trying to incorporate in everyday life too.\n\nPros:\n* Blocks unlimited sites\n* Sets time limits\n* Uses psychology to help you be more productive when you're distracted\n\nCons:\n* Sets time limit for all sites, making you m... Show more", "stars": 1, "date": "Jan 7, 2024"}, {"text": "I LOVE THIS !!!!!!", "stars": 5, "date": "May 8, 2023"}, {"text": "Everything is good, although there should be an option to only block blacklisted websites. It is very annoying adding every single website to the allowed list.", "stars": 4, "date": "Apr 4, 2023"}, {"text": "Very helpful app that's a step above a pomodoro clock! It was a pleasure chatting it up with you at the library btw", "stars": 5, "date": "Aug 5, 2022"}, {"text": "I like the extension but it could be improved. I don't use the task or breaks option, I just want to reduce my useless screen time overall, even during my free time. However, sometimes I'll need to access social media for work-related purposes, and because it's blacklisted I have to unable the extension just to check it for a minute. I wish the \"make an exception\" option would actually work instead of just telling you \"I make no exceptions\".", "stars": 4, "date": "Jul 21, 2022"}, {"text": "This app saved my college. 10/10", "stars": 5, "date": "May 23, 2022"}, {"text": "I give it 4 star because I'm thankful it was made, but unfortunately I won't be using it. It's too harsh for me. Please just add more options! Like the option to allow for more than 3 minutes of surfing on a non-white listed website. The option to use different time limits for different websites (say you want to be allowed 20 minutes of Facebook and 15 minutes of Youtube a day). And the option to have all websites be white-listed by default, except for those you specifically want to see be re... Show more", "stars": 4, "date": "Apr 10, 2022"}, {"text": "I agree with other reviews criticizing the 3 minute timer for websites that aren't blocked but also aren't whitelisted. I have ADHD and really struggle with staying focused when it comes to reading so things will take me longer to find when doing research and constantly having to look at the countdown to see if the page needs a refresh does not let me focus fully on what I'm trying to read. Just a blacklist would've been preferred, sometimes I need to leave a page open for a long time but wil... Show more", "stars": 2, "date": "Apr 6, 2022"}, {"text": "Overall the extension works and I like it expect for the fact that it closes tabs when I am not looking or am not on them. This can get pretty annoying when I am doing research or anything. I still use the timer and I can find the information I need within the time I have set on the timer. But for example I go back to my document and I still want to keep the research study around for referencing and copy paste, but the tab's timer keeps ticking and then in the background it closes. Could a op... Show more", "stars": 3, "date": "Jan 25, 2022"}, {"text": "I can't imagine how many hours this extension saved me over the years. To the dev: Thanks for giving me some peace of mind and the tool to fight this intrusive technology in my life. You rock", "stars": 5, "date": "Jan 18, 2022"}, {"text": "I really like gamification and I wanted to like this extension, but the fact that the owl considers every unlisted website in the settings as something bad that must be closed makes it unusable for everyday web browsing.\n\nYes, I agree with closing social networks and e-shopping websites, but there are millions of other websites that do not need to be closed, and users do not have the time to add the whole internet to the settings of the app.", "stars": 2, "date": "Dec 11, 2021"}, {"text": "This is very helpful. I appreciate that I can earn time to use on my blocked sites by doing the things I need to do. The only thing I wish it could do that it doesn't right now is give me the option of rewards for time spent on certain sites. If I could build up reputation or earn break time for interacting with my homework web pages, that would be a hoot!", "stars": 5, "date": "Nov 11, 2021"}, {"text": "I just like the way you can drag the owl everywhere on the screen when he block a website.🤣", "stars": 5, "date": "Aug 26, 2021"}, {"text": "The owl being skeptical and annoying is what made me love this application. It is one of the best blocking software's out there", "stars": 5, "date": "Jul 5, 2021"}, {"text": "Mostly good, but it conveniently \"forgets\" I've timeboxed weekends free. Putting in extensions such as .org and .edu does seem to let all such common research websites work consistently. It's just really annoying to be sitting around on a Sunday not being able to screw around on random websites because I apparently have to time box every Sunday ahead of time, even though I don't have to reenter the free time I plugged in for weekdays.", "stars": 4, "date": "May 23, 2021"}, {"text": "Perfect", "stars": 5, "date": "Apr 24, 2021"}, {"text": "Great app, totally recommended.", "stars": 5, "date": "Apr 14, 2021"}, {"text": "I mostly liked. It's very nice to block some websites, but as the app says, it will close every tab that is not on your \"allowed\" list. That said, studying can get really complicated when you search google for something, because that new tab will not be on your allowed list, so IT WILL BE CLOSED. Even if you're not on the tab the countdown will start, sometimes you open it up just to see it being closed.", "stars": 4, "date": "Feb 27, 2021"}, {"text": "I love this.  It would be even more fantastic if you could automatically sync your settings between browsers.", "stars": 5, "date": "Feb 19, 2021"}, {"text": "I started to use this extension before the big update and already found it very useful, but after the addition of all these new features I'm finding this extension more useful than ever!", "stars": 5, "date": "Jan 29, 2021"}, {"text": "Very useful for people like me who both have ADHD and are very good with computers! if i were to try and use an application that forces me off of the distraction, i can always just remove it. even ones made specifically to be extremely hard to remove while on block! but this one just gently reminds me in a way where i find it useful. the respect function is also motivating! best productivity app ive used.", "stars": 5, "date": "Dec 17, 2020"}, {"text": "It's great! Honestly I love everything about it, it was exactly what i needed. The only problem is that no matter what I do, sometimes it doesn't block certain websites (i don't know why it doesn't block twitter but it's fine, it isn't like i use it as much). Also, I don't know to increase my respect level!! It's a bit disappointing, but anyway. Apart from that, it's amazing!", "stars": 4, "date": "Dec 7, 2020"}, {"text": "Very useful thing. I recommend this plugin", "stars": 5, "date": "Oct 21, 2020"}, {"text": "Greate extension, fits exactly what I was looking for. Great options to customize schedule. Helps me keep focused rather than surfing garbage during work hours.", "stars": 5, "date": "Aug 21, 2020"}, {"text": "Great work on the 2.0! Very useful and helpful, thank you very much!", "stars": 5, "date": "Aug 13, 2020"}, {"text": "Have I really never reviewed this extension before? I've used it on and off for years now. I *love* it!! I mainly use it to keep myself from getting distracted while working on my novels, which means that I haven't actually used it much the past year while going through a huge writer's block. I also don't use it constantly or really use the 'free time' feature, when I'm done working for awhile I just turn the extension off. Which I guess could be an easy way to 'cheat' as well, but I've never... Show more", "stars": 5, "date": "Mar 16, 2020"}, {"text": "I am so happy to finally find an extension that suits my needs after spending so much time looking for one. Thanks for Productivity Owl team!", "stars": 5, "date": "Mar 15, 2020"}, {"text": "Afer using it for a while I have a few suggestions. If you whitelist a certain website that you need for work it doesn't automatically whitelist all the subdomains and you have to manually whitelist them which is not practical at all. Also, the maximum time allowed is to big I can just set it to 2000000 seconds and the owl will just sit there. Also there should be a settings lock option for the biggest procrastinators :)", "stars": 3, "date": "Feb 27, 2020"}, {"text": "I like it! it's simple but i like when i type the blocked site. the owl comes up with image and says go back work. i wish it also has some sound that can be added or customized. so it can be some alarming and also bigger reminder that i am wasting time one web surfing. ^^ just a small suggestion.", "stars": 4, "date": "Nov 18, 2019"}, {"text": "I really liked all the idea and concept, and it's working very fine. The only thing that bothers me is I don't find an option to hide the owl that appears on right down corner showing me that \"FREETIME\" everytime, or the seconds that are left on given site. I'm then forced to block the owl when I need to reach certain site because that bothers me very much, thus reducing its usefulness since I don't remember to turn it on everytime.\n\ntl;dr: is there any way to hide the owl that appears in the... Show more", "stars": 4, "date": "Sep 27, 2019"}, {"text": "Kind of works. Blocks most websites but wont block 4chan. I tried putting every combination of url that 4chan uses but still refuses to block it.", "stars": 2, "date": "Sep 12, 2019"}, {"text": "Lacks an option to have the owl timer working only on certain websites.", "stars": 4, "date": "Aug 28, 2019"}, {"text": "I'm giving it a four, so as not to gush. Initial impressions I like it. The owl gives me a bit of warning, it is ominous, and it reminds me that I don't need to be spending this time on most if not any of these sites. I don't feel that it is stopping more than making me aware. I guess to this owl I look like a mouse in a field who has spent too much time sitting still in the open. It may be a primal instinct that makes this effective. On another note I have also noticed it seems to be in an a... Show more", "stars": 3, "date": "Aug 15, 2019"}, {"text": "Love it!, super cute! realy helps me stay focused", "stars": 5, "date": "Aug 8, 2019"}, {"text": "Error handling response: ReferenceError: respsonse is not defined\n    at chrome-extension://eoagmdboiealblmpaahjlhajggndaahi/contentscript.js:128:7\nEdit: still not fixed", "stars": 1, "date": "Aug 6, 2019"}, {"text": "I looked through the code, and I'm pretty sure you will never gain respect ever.  Other than that, this is the best productivity app I've found.  I used a much more popular and polished one for a few minutes until I realized it couldn't be customized the way the Owl can.", "stars": 5, "date": "Jun 11, 2019"}, {"text": "it sucks!!!! \nno wikipedia and a student can hack it supereasy", "stars": 1, "date": "Dec 20, 2018"}, {"text": "Love in first sight", "stars": 5, "date": "Nov 27, 2018"}, {"text": "I love this thing! Make me productive ane is extremely time saving :)", "stars": 5, "date": "Nov 4, 2018"}, {"text": "Good concept, not working. It started closing pages by itself. Not pages that I set as denied but random pages. Deleting it now.", "stars": 1, "date": "Oct 30, 2018"}, {"text": "I've never written a review for an app here, but i really love this! Really does what i need it to do", "stars": 5, "date": "Oct 8, 2018"}, {"text": "I hated the fact that one have to set up a white list of websites. I may spent time of various websites due to work/study. And these sites may differ according to the project that I'm working on. It was annoying to add every work/study site to a owl's white list. I'd atleast do it if that was something easy to do. Everytime you want to add a site to a white list, you have to oepn the app and add it.\n\nThat is the only reason I'm giving it a star. Although it is just one reason, that one reason... Show more", "stars": 1, "date": "Mar 16, 2018"}, {"text": "Love the sarcasm. To be honest, that's what really motivates me! :)", "stars": 5, "date": "Mar 7, 2018"}, {"text": "Very good extension , do what i needed to be more productive !", "stars": 5, "date": "Feb 12, 2018"}, {"text": "the OWL on the lower corner do not let me zoom out on the google map site very annoying need option to shift it to any location i want. for the time being disabling it.", "stars": 2, "date": "Jan 17, 2018"}, {"text": "This is the worst thing ever!!!!  remove it from my computer", "stars": 1, "date": "Dec 25, 2017"}, {"text": "The theory behind it is great. And I think for people that only *need* a handful of websites, it is ideal. But having to add in every single individual website that you'll ever need to access for legitimate reasons (school, side projects, etc) is obnoxious. It's a massive time sink trying to do this, and I think that kills the whole point of it. \nAgain, for the right person, it could be helpful. But for most students that need a large variety of sites to access, from several news sites to cou... Show more", "stars": 2, "date": "Dec 1, 2017"}, {"text": "I love this! It is perfect for me. Other productivity timers could be reset by closing and re-opening the browser window. Scheduling free time with productivity owl solved that problem for me. I love the owl. He is very \"skeptical of my commitment to productivity,\" which made me laugh out loud. I hope you will further increase his sarcasm another 200%!", "stars": 5, "date": "Oct 4, 2017"}, {"text": "This extension is a really useful tool for people. It blocks specific websites and only lets you use certain ones for a certain amount of time before it closes it, which helps. However, it's two major flaws are the owl blocking virtually everything in the bottom right corner and it's consistently closing tabs when I'm working on a project. I understand it's the point, but I can't keep this installed, because I need to be able to access different sites without worrying about them being suddenl... Show more", "stars": 4, "date": "Sep 27, 2017"}, {"text": "first CAN SOMEONE HELP ME TURN OFF ANTI DESPERATION MODE? I DID NOT TURN IT ON, YET HERE IT IS.\nlike, i know, i know! its an extension to make you not stay on sites too long, so i should be thankful its kicking me off certain sites, but it actually makes me spend more, more frustrated time on a site when i need to like refresh it 5 times because the timer keeps running out before i can do the one (1) simple task i went there to do. (which is how i use the app, to keep me on a site long enough... Show more", "stars": 4, "date": "Sep 25, 2017"}, {"text": "This app is soo pretty good that him help me all day to avoid a procrastination.", "stars": 5, "date": "Sep 8, 2017"}, {"text": "The owl is very cute and helpful!", "stars": 5, "date": "Jun 23, 2017"}, {"text": "It is the best thing wich can help to concentrate on work. (It will be good if it will be possible in safari on mac os)\nP.s. I think that you should add russian language because there are a lot of users from Russia. (Like me)", "stars": 5, "date": "May 7, 2017"}, {"text": "I think that it wold be better to set the blocked time instead of free time, make more sense to me. Also, and option to add a work related site to the list that you can just click on extensions menu, I have dozen of sites and is annoying to add them one by one.", "stars": 3, "date": "Apr 21, 2017"}, {"text": "I use this along with a habitica extension. \n\nUsing the habitica extension it would not close the site after the timer ended. (Though it would not reopen the site without paying... I could just leave youtube up and keep watching.) \n\nNow with productivity Owl it automaticly shuts down, and I have to pay my habitica coins in order to watch more. \n\nThanks - I'll be sharing this extension. :)", "stars": 5, "date": "Mar 1, 2017"}, {"text": "take it off", "stars": 1, "date": "Feb 19, 2017"}, {"text": "The owl has a very dry sense of humour, overall it's a funny app and I like using it. \n\nI have Coldturkey, I paid over 30 euro for it and I actually prefer this. This helps you build good habits and is effective in blocking distractions. \n\nOne thing I will say - my research means I need to read loads of text, articles and essays from different websites. It is kinda annoying to have to add each one to the accepted sites for fear of grumpy owl closing it. \n\nOverall very good, I would definitely... Show more", "stars": 5, "date": "Feb 3, 2017"}, {"text": "awesome app. very helpful", "stars": 5, "date": "Feb 2, 2017"}, {"text": "Very cute and useful, easy to set unlike other productivity apps. \nIt's still developing though and it's missing some things, but it's on the right track :)", "stars": 4, "date": "Jan 12, 2017"}, {"text": "I love it very much", "stars": 5, "date": "Dec 7, 2016"}, {"text": "I absolutely hate this sooo much. This has completely shut down my computer it wont let me undownload it or change my settings to stop deleting my tabs. They delete everything not just the stuff i told it to. VERY disappointed :( if this doesn't stop soon i might need to go and pay for some one to debug this :( :( :(", "stars": 1, "date": "Nov 14, 2016"}, {"text": "i cant uninstall it", "stars": 1, "date": "Nov 8, 2016"}, {"text": "Helps keep me focused on tasks at work, makes work time more productive and satisfying. I like the free time feature and the configurable #/secs before it closes a webpage that is not white-listed. Without this feature it would be too black and white creating a bad effect.", "stars": 4, "date": "Oct 7, 2016"}, {"text": "If locking me out of control is an option that would be even better! I really have a problem with procrastination, this extension looks great.", "stars": 4, "date": "Jul 11, 2016"}, {"text": "I really don't like the fact that it automatically closes websites that are not on your approved list (unless you are on free time). You either need to adjust the timer for an incredibly long time or schedule more free time.", "stars": 3, "date": "Jul 8, 2016"}, {"text": "Thank you mate!", "stars": 5, "date": "Jun 19, 2016"}, {"text": "A very clever and fun way of helping with productivity.\n\nI still don't get no respect from that owl, but I still live in hope.", "stars": 5, "date": "Jun 17, 2016"}, {"text": "Please help!!!\nI am unable to do my project work. Project work includes opening a new site from google a lot lot of times.Every time I open a site, the OWL unnecessarily blocks it. Please reply me the solution.", "stars": 3, "date": "May 31, 2016"}, {"text": "go github/opensource and i'm sure many of us will help you add features and improve. great work", "stars": 4, "date": "May 28, 2016"}, {"text": "it would not let me use free time", "stars": 1, "date": "May 27, 2016"}, {"text": "Instead of scheduled free time, it would be easier to schedule work time and then a total amount of free time per day. Also there is no guide that explains the options. And I'm pretty sure the dev has abandoned the app since it doesn't seem to have been updated since 2012. Also the website is nonfunctional.", "stars": 2, "date": "May 12, 2016"}, {"text": "I like using this to sleep since I'm a night owl.... and this is about an owl, I'm not using it for it's purpose but it's gud.", "stars": 4, "date": "Apr 20, 2016"}, {"text": "Very useful. The only feature I find missing is mode that allows  me to enter all pages without a timer. I would like to browse any pages that isn't on the blocking list without a timer.", "stars": 5, "date": "Apr 13, 2016"}, {"text": "Works well for me except the position of the owl blocks the G+ post button - even in freetime!!", "stars": 3, "date": "Mar 27, 2016"}, {"text": "There should be pause button. Sometimes I am writing in communities, forums and this would close them. \n\nIts very irritating that it closes my forums and I need to re-write all the stuff. \n\nAlso going to extensions again and again to disable this is very time consuming job. \n\nPlease add pause/freeze button", "stars": 3, "date": "Mar 23, 2016"}, {"text": "Very good and original way to force users to study by literally closing the tab. I would just suggest allowing an exception for all .edu sites and a way to simply turn on/off the extension (though I realize the possible problems with that) because I only need to be forced to study occasionally. Also wow, I am such a hardcore procrastinator that I went as far as to write this Google review as opposed to doing homework.", "stars": 4, "date": "Feb 28, 2016"}, {"text": "I would like an intermediate option to just have the owl close tabs for certain sites instead of the default option of having the owl close any site that is not on the allowed list (without completely blocking). I find my allowed list to be fairly long.", "stars": 4, "date": "Dec 27, 2015"}, {"text": "I like that this is different from most, which require manual turning on and off. I wish there was an option where you can turn on the owl and then have it give you free time for \"x amount of minutes\" after every \"x amount of time you are productive\". \n\nI would also be happy if there was a better explanation guide for this. What is anti-desperation mode?", "stars": 4, "date": "Dec 9, 2015"}, {"text": "Concept is good but implementing isn't so great. I have to do a lot of research so maybe this isn't the tool for me.", "stars": 2, "date": "Dec 3, 2015"}, {"text": "I NEEDED THIS. Thank you!", "stars": 5, "date": "Nov 17, 2015"}, {"text": "This idea is great but i can't add tumblr to it :(", "stars": 3, "date": "Nov 3, 2015"}, {"text": "Good thing, realy usefull with very clear & easy-using interface", "stars": 5, "date": "Oct 22, 2015"}, {"text": "Awesome app, improves my productivity..", "stars": 5, "date": "Oct 17, 2015"}, {"text": "My productivity has skyrocketed since installing Productivity Owl, as has my self respect since I no longer waste so much of my time.\n\nLove it.", "stars": 5, "date": "Oct 16, 2015"}, {"text": "I really like the extension, the idea seems solid. One thing i don't like is the owl in the bottom right. Sometimes it interferes with websites I visit, even when I'm in freetime. The only work-around is to add the site to my allowed websites but that's counter-productive.", "stars": 4, "date": "Oct 10, 2015"}, {"text": "it  only lets me get on a website for 30 sec.", "stars": 1, "date": "Oct 6, 2015"}, {"text": "[Recommended]\nWant to be productive?\nLet the Owl do the thing.", "stars": 5, "date": "Sep 29, 2015"}, {"text": "It stopped me from getting in facebook, and has a owl, i like owls!", "stars": 4, "date": "Sep 28, 2015"}, {"text": "Really helpfull!. Love the way it shut the tab. I have to work now", "stars": 5, "date": "Aug 20, 2015"}, {"text": "I work at home as a fantasy author and I am addicted to Facebook and other social media, which makes my work time less productive than it should be. This extension keeps me focused on my goals. Great.", "stars": 5, "date": "Jul 2, 2015"}, {"text": "I hate u, I hate u, I hate u owl!", "stars": 5, "date": "Jun 16, 2015"}, {"text": "good add-on everyone should have", "stars": 5, "date": "Jun 1, 2015"}, {"text": "Thank you so much for creating this and providing it for free. You rock", "stars": 5, "date": "Apr 28, 2015"}, {"text": "Very useful productivity tool.", "stars": 5, "date": "Apr 10, 2015"}, {"text": "Up until now i think it runs smoothly and really helps me focus", "stars": 4, "date": "Mar 25, 2015"}, {"text": "Absolutely fantastic for self control. Loving all the features. One thing I would like to see however, is scheduling free time for each day individually.", "stars": 5, "date": "Mar 22, 2015"}, {"text": "Why do I have to manually list the sites I don't want to be closed within 30 seconds? I just want to block a few sites, like 9gag etc. I want all other sites enabled! There is no such option, there's only a white list and a black list, all other sites gets closed after 30 seconds. Sorry but I uninstalled the owl for this reason.\n\nBesides, the \"export/import configuration\" button doesn't even work.", "stars": 2, "date": "Feb 23, 2015"}, {"text": "Could be better. I like StayFocusd better than this. I'd prefer that the owl doesn't automatically close my page. Another thing that bugged me is that I had to constantly add urls to the list of Allowed Sites.", "stars": 3, "date": "Jan 26, 2015"}, {"text": "I liked this add-on, it really keeps me productive. However, it'd be great if we could actually earn/lose some respect. That would really keep us eager on productivity.", "stars": 4, "date": "Dec 7, 2014"}, {"text": "DO NOT DOWNLOAD IT", "stars": 1, "date": "Nov 8, 2014"}, {"text": "I will remove it because I need something that allows everything except the sites I've blocked for ( blacklist only ).\n\nSince I'm a web developer I'm constantly in many different blogs and websites searching for info and Owl becomes a productivity enemy for me.\n\nOther than that it works fine", "stars": 3, "date": "Oct 1, 2014"}, {"text": "i never downloaded this program. it just showed up on my google chrome account. i makes doing college work a real problem. someone better help me uninstall this program. this program makes me not want to use google chrome anymore.", "stars": 1, "date": "Aug 18, 2014"}, {"text": "Just few minutes into it, already feeling super proudtive. must have for trigger happy addictive like me.", "stars": 5, "date": "Aug 16, 2014"}, {"text": "Disrupts my attempts to watch movies or go to my favorite websites. Owl's screeching hurts the ears if you grab him. Ticking timer until a given web page closes is irritating in the extreme. Owl is a bit of a douche.\n\n5/5. Would download again.", "stars": 5, "date": "Aug 5, 2014"}, {"text": "There is no option to choose between am/pm and 24h time format, also input buttons are time consuming to click.\n\nInstead of free time it would be easier to set up work time.\n\nThere is no difference between having a tab opened and having it focused, which makes my multitab habits a problem now.", "stars": 3, "date": "Aug 1, 2014"}, {"text": "kinda want to uninstall", "stars": 1, "date": "Jul 23, 2014"}, {"text": "I LOVE this extension, but I can't find my way back to the website that let me change my schedule and stuff, so now it's useless!", "stars": 1, "date": "Jun 1, 2014"}, {"text": "Very useful extension, I use it along with strict workflow, owl keeps general sites at check and block all the no-no sites, while strict workflow goes a step ahead and block somewhat neutral sites that are still distractive enough during the pomodoro.", "stars": 5, "date": "May 29, 2014"}, {"text": "This app is just awesome. I love it and I'm so glad I found it! The owl is cute {and fun, with his \"get back to work\" haha} and it helps you stay focused on your work. Besides, there are a lot of helpful settings and features you can use to improve your productivity.", "stars": 5, "date": "May 25, 2014"}, {"text": "Great App. I highly recommend. IMO it's better than similar apps like StayFocused and the tomato one because it allows you to schedule your time and you have a certain amount of time for non-blocked websites as well. Very good at stopping me from obsessively checking facebook.\n\nMy only complaint so for this app is the \"earn respect\" portion doesn't seem to be doing anything. I've become much more efficient and virtually stopped using the time-wasting sites, but nothing seems to happen?\n\nOther... Show more", "stars": 4, "date": "May 19, 2014"}, {"text": "I absentmindedly look up random crap, and scroll through news feeds. I need this, even though I don't want it.", "stars": 5, "date": "May 18, 2014"}, {"text": "There are a few JavaScript errors that show up in the Developer Console when using this extension. I wish it were open source so I could fix them!", "stars": 3, "date": "Apr 17, 2014"}, {"text": "Working great so far- but when the count is getting low, the owl flies to fast for me to hit \"save\" if I want to save for later. My eyes are getting old and slow- slow the owl down!", "stars": 5, "date": "Apr 8, 2014"}, {"text": "Great concept but I've knocked a star off because the owl's overlay div prevents me from using web pages which have elements in the bottom-right of the screen, such as Google Maps.\n\nMessage to mrieck - could you please add a collapse/expand button so I can minimise it out of the way please :)", "stars": 3, "date": "Mar 28, 2014"}, {"text": "no way to fast accept site, need to go to config and TYPE full url of website...\n\ngood idea, but unusable", "stars": 1, "date": "Mar 14, 2014"}, {"text": "As a person with ADHD it is helpful to block me from spending a lot of time in one site. I've set my timer for 120 seconds. I would still like to be able to do that while still be able to block facebook. A suggestion would be to allow us to reward ourselves by using a short amount of free time instead of scheduling the time slots. The \"Strict workflow\" extension has that sort of concept. I don't want to schedule every minute of the day on here on this app because that would be unproductive an... Show more", "stars": 4, "date": "Mar 5, 2014"}, {"text": "I like this. It works well for me while I'm working. However, I really wish it would just turn the page blank until \"freetime\" instead of closing it. I'd like to be able to pin the tab instead of add it to a \"save for later\" list that I have to go into the extension settings to see. Never gonna remember to do that. Another benefit of just turning it blank would be that it would save your place in the page if you were part way through and article or filling out a form or something.", "stars": 4, "date": "Jan 29, 2014"}, {"text": "Genial!", "stars": 5, "date": "Jan 28, 2014"}, {"text": "God I REALLY needed something like this! I get so lost in the quagmire!", "stars": 4, "date": "Jan 1, 2014"}, {"text": "Love love love this applet, stops me from procrastinating and gets my work done", "stars": 5, "date": "Dec 5, 2013"}, {"text": "I love this extention, i would give it 5 stars if it had little explanations telling me what some of the options were.  For example, what is How do you earn the Owl's respect and what kind of \"freedoms\" does he give you?    But otherwise, it is the best productivity app out there!  It would be great if it could do it for the Chrome Web store though, I tent to spend a surprising amount of time here!", "stars": 4, "date": "Oct 18, 2013"}, {"text": "Nice extension. I never though I could be this productive. Though it can be annoying sometimes since the owl just closes the pages that I'm currently on, it still helps. I've been better at managing my time online and my time working/studying. Who would've thought that an owl would be a solution for my cramming habits. Adding an option of allowing other sites other than the blocked ones would be of great help.", "stars": 5, "date": "Sep 28, 2013"}, {"text": "Fantastic add-on. It has virtually stopped me from obsessively clicking on facebook every 10 seconds. It's also stopped me from wasting time on youtube.\n\nThe 'free time' is a great idea and works well.\n\nOnly gripe is the respect system doesn't work. Perhaps something to think about for the next update.", "stars": 4, "date": "Sep 4, 2013"}, {"text": "It keeps shutting my windows every time, even if I use the ones I added as the exception, which makes research impossible", "stars": 1, "date": "Aug 14, 2013"}, {"text": "Great  especially for ADHD and to discourage \"borrowers\" who think that  your computer is shared property. I work in a teaching lab environment and every time I needed to leave my computer without logging out, I'd find that someone just had to \"take a quick look at something\".  Now it's not so convenient.", "stars": 5, "date": "Jul 24, 2013"}, {"text": "It would be nice to Allow All Sites except for blocked sites. I have no intention of listing all the sites I need to visit - often they're work-related and span many different domains depending on where Google takes me.", "stars": 4, "date": "Jun 18, 2013"}, {"text": "Better than Cold Turkey, Self-Restraint etc. Good job on developing the extension! It's helping with my studies.", "stars": 5, "date": "May 26, 2013"}, {"text": "★★★★Author Please Read! ★★★★\nI agree with the other user(s)! Please add the option to use a certain amount of free time instead of scheduling time slots. PLEASE PLEASE PLEASE\n\nAlso, there is a flaw in the design because all you have to do is refresh the page to restart the countdown", "stars": 4, "date": "Apr 25, 2013"}, {"text": "I really like this extension, I had it before winter break this year (2012-2013) and it's amazing, you can block by key words, it's really nice because I can block \"game\" so those won't open. Also something that really helpful is the ability to keep domain names, so I can prevent .edu and .gov sites from being blocked or closed by the owl. This is a really great extension and I plan to keep using it.\n\nThe bad thing about it though, is that it SOMETIMES (not always) blocks buttons, which can b... Show more", "stars": 4, "date": "Mar 21, 2013"}, {"text": "Doesn't seem to know how to schedule free time that goes past midnight. It doesn't realize that 12:15 am is AFTER 11:00 pm! \n\nOtherwise this is a pretty great app.", "stars": 4, "date": "Mar 4, 2013"}, {"text": "It's just amazing how his annoying things keep me more organized during the day.\n\nWould be great to have more explanation on how to use different options, but still works great out-of-the box anyway.\n\nOwl rocks!", "stars": 5, "date": "Feb 19, 2013"}, {"text": "♥ its helpful,cute, and easier than other extensions I've used", "stars": 5, "date": "Jan 26, 2013"}, {"text": "This is a great plugin--it really trains you to get the information you need quickly and get out. I no longer suffer from surfing the web and wasting hours of time! Great job developer; well worth a donation in the productivity savings ;)", "stars": 5, "date": "Jan 16, 2013"}, {"text": "Great addon! My only problem was that I got a little distracted trying to find this to stop me from getting distracted..", "stars": 5, "date": "Jan 12, 2013"}, {"text": "Recent version 1.2 version released on 11/30 seems to have fixed the inactive tabs bug.\n\nThis extension was recently featured on LifeHacker, thus all the recent activity.", "stars": 5, "date": "Dec 12, 2012"}, {"text": "Works very well, better than any of the other extensions like this I've used in terms of changing my behavior.  Makes it very easy to whitelist, a problem I've had with others, since I have quite a bit of web work that requires lots of time on a page.  One issue - it bugs me a ton that I can't earn any respect from the owl. I want the owl to respect me!", "stars": 4, "date": "Dec 10, 2012"}, {"text": "Seems like the bugs that existed before are no longer present.  Hasn't closed any of my 'white-list' tabs all morning, making for a much less frustrating experience, and a much higher rate of productivity!", "stars": 4, "date": "Dec 3, 2012"}, {"text": "It's very helpful, but I'd like it to sync my settings with an account.", "stars": 5, "date": "Dec 3, 2012"}, {"text": "A really awesome app. Good ideas thought through... You may want to add some kind of \"notification\" to tell the user when has the \"free time\" started...", "stars": 5, "date": "Nov 29, 2012"}, {"text": "There's potential here, but as mentioned above, there are bugs and places that could really be improved. The extension closes pages after a certain period of time even if you turn that option off. Also, there needs to be an option to move the owl from the corner it sits in  - it blocks my ability to hit buttons I need to when working with PDFs. Also, as noted above, there's no explanation of what \"anti-desperation mode\" even is. Would be nice to know.\n\nThis really is a clever extension and it... Show more", "stars": 3, "date": "Nov 28, 2012"}, {"text": "I absolutely love this extension. I have a hard time staying on task, and this is a great tool for keeping me in check.\n\nHowever, for some reason tabs that are in the whitelist are being closed after they are inactive for a few minutes, despite having the \"Close Unused Tabs After __ minutes\" box unchecked. I also can't wait for the \"export settings\" function to work.", "stars": 4, "date": "Nov 26, 2012"}, {"text": "Could be awesome, but the developer decided to release it before fix critical bugs (app closes tab in whitelist). \n\nAlso, I would rather see a page like the one shown to sites in blacklist when trying to access a site neither in white or blacklist (i.e. app is harsher to sites that doesn't know how to behave than to sites that should be blocked)", "stars": 3, "date": "Nov 25, 2012"}, {"text": "Would be a good app if it didn't close tabs that I actually need for work. I have turned off the exit idle tab option, and added the websites to the allowed list. Still it closes them after like 20 mins. That doesn't increase productivity. It just makes me really annoyed and have to stop what im doing to reopen the tabs.\n\nI think this could be a good app otherwise.", "stars": 2, "date": "Nov 23, 2012"}, {"text": "What is anti-desperation mode supposed to mean anyways?", "stars": 3, "date": "Nov 23, 2012"}, {"text": "It's good, and it helped me be productive even after a day of use. I got my homework done. The only thing that I want added is an option to use  a certain amount of free time instead of time slots.", "stars": 4, "date": "Nov 22, 2012"}, {"text": "Great addon. It seems to be better than addons likes StayFocus, because it doesn't break you flow nad promotes being true to your freetime schedule.", "stars": 5, "date": "Nov 21, 2012"}, {"text": "Nice extension to enforce focus.\n\nBlocks websites based on a black list, allows sites in a white list and everything else is \"grey\" and is kept open for a few (configurable) seconds.\n\nOne thing that annoys me and that I think is a bug, is that it still wants to close tabs in the whitelist as if they were \" unused\", even though that option is disabled. Onde that is fixed, I can give it 5 stars!", "stars": 3, "date": "Nov 21, 2012"}]