[{"date": "Feb 22, 2024", "text": "\"Remember until I sign out\" option doesn't work. Users have to login everytime they restart the browser. Tested in edge and chrome. I am giving one star to bring attention to this issue I'm facing. Please fix as soon as possile.", "stars": 1}, {"date": "Feb 22, 2024", "text": "By far, the most adapted credentials manager for team needs!", "stars": 5}, {"date": "Feb 21, 2024", "text": "The best open source password manager out there. I'm using it for almost 5 years now and it works great, it has everything from securely storing passwords/notes to folders.", "stars": 5}, {"date": "Feb 20, 2024", "text": "I've been using passbolt for a year now. Great product and an amazing security model. Would highly recommend it.", "stars": 5}, {"date": "Feb 19, 2024", "text": "Great password manager, easy to self-host, being open source is a plus.", "stars": 5}, {"date": "Feb 19, 2024", "text": "Easy to install and top-notch security approach", "stars": 5}, {"date": "Feb 19, 2024", "text": "I've been using it since two years, it's an amazing product", "stars": 5}, {"date": "Feb 18, 2024", "text": "Free for only seven days. Should be advertised as paid, so I don't have to waste my time installing and immediately uninstalling it.", "stars": 1}, {"date": "Feb 16, 2024", "text": "can't copy password is a big big fatal misatake. i know its being secure but its kind of useless extension right now, so please consider another extension.", "stars": 1}, {"date": "Feb 14, 2024", "text": "You gotta hand it to Cedric: He cares about Passbolt. He takes issues people have and fixes them in updates. You just have to bring it up to his attention.  The extension itself is very straightforward.  The only change I wish that could happen is to prevent the Chrome's password auto-fill button/icon inside a password field would not share the same space as the Passbolt's extension icon.  The two icons will overlap and one will hide behind the other and cannot be clicked on.  This is probabl... Show more", "stars": 5}, {"date": "Feb 11, 2024", "text": "Recent update broke my chrome browser ability to use Passbolt on internal services.  The logon and password credentials get seemingly passed correctly, but i get a contextual error that \"Either 'username' or 'uid' must be specified\".  The correct username is clearly autofilled.  And when the password is viewed, the correct password is there.  Why does the service not recognize them.  When I manually enter the SAME credentials as Passbolt enters, the credentials work.  The extension for Edge d... Show more", "stars": 4}, {"date": "Feb 9, 2024", "text": "Since yesterday in the last update  4.5 of this extension it has stopped working correctly. The extension does not work, you have to copy and paste the credentials manually from the passbolt account to be able to work.", "stars": 1}, {"date": "Nov 19, 2023", "text": "It gives an error \"Failed to fetch\" when I close Chrome and open it again. Passbolt itself is great but the extension is broken.", "stars": 1}, {"date": "Jun 21, 2023", "text": "Every time I close Chrome and reopen it, the extension cannot connect my account. Unfortunately, it is useless right now.", "stars": 2}, {"date": "May 20, 2023", "text": "easy to setup, adapt, privacy focussed with self-hosting option. The engineering that went behind it is brilliant and makes me feel secure", "stars": 5}, {"date": "Mar 17, 2023", "text": "Passbolt's definitely worth checking out. It's open source, very customizable, and easy to use. Super convenient for teams.", "stars": 5}, {"date": "Mar 15, 2023", "text": "The most secure password manager.", "stars": 5}, {"date": "Mar 15, 2023", "text": "Open source and secure, really great password manager !", "stars": 5}, {"date": "Mar 15, 2023", "text": "Support is very fast and awesome ! \nFor sure, it is the best choice to use Passbolt!", "stars": 5}, {"date": "Mar 15, 2023", "text": "A great open source password manager for teams!", "stars": 5}, {"date": "Feb 23, 2023", "text": "Great until you realized it lacks of TOTP...", "stars": 3}, {"date": "Dec 13, 2021", "text": "The session in the chrome extension is way too short. I don't want to input the master password 4 times a day, that's the main reason I got a password manager in the first place.", "stars": 3}, {"date": "Nov 17, 2021", "text": "The best password manager ever !!!", "stars": 5}, {"date": "Feb 10, 2021", "text": "The only password manager I trust as it uses a tried-and-tested encryption (GPG keyrings) solution that doesn't store any passwords in a way that could be decrypted if the server was compromised.", "stars": 5}, {"date": "Feb 3, 2021", "text": "Passbolt server is great and worked extremely well for a while as one of the best ON PREMISE, fully auditable local password database team web applications.  Unfortunately the newly released (FORCED) browser extension moves all web application files into the compiled extension which is PLAGUED with problems, issues and drawbacks.  Not least of which means your are now 100% at the mercy of the extension developers and the Google Chrome webstore.   Goodbye PASSBOLT.  It was great while it lasted.", "stars": 2}, {"date": "Jan 28, 2021", "text": "Doesn't work after the update. When you try to share your password, the browser freezes. The error appears in the Developer Tools in Chrome: stack: \"Entityvalidationerrors: Could not validate entity G...mhafipceonhjepacocaffmoppf/index. min. js:23939:17)\", message: \"Could not validate entity GroupUser.\", name: \"EntityValidationError\",", "stars": 4}, {"date": "Jan 27, 2021", "text": "Doesn't work after update when trying to get decrypted password", "stars": 4}, {"date": "Jan 7, 2021", "text": "Passbolt has been excellent for our team. Service and responsiveness is also excellent. We've been using it for two years now and are glad we made the migration to it.", "stars": 5}, {"date": "Dec 23, 2019", "text": "For cloud host: \nVery pleased with the ease of use and the security with a nice dark Theme.\n\nOur team is very satisfied of the product once all accounts have been created.Account creation might be a bit tough if you're not tech-oriented or a bit helped.\n\nPro: secure\nShared passwords between persons\nDark Mode\nteam is very helpful and quick to reply\n\nCons: account creation is a bit confusing\npassword recovery is on your responsibility \n\nWaiting for: Secure notes\nmobile app\npossibility to manage... Show more", "stars": 5}, {"date": "Nov 29, 2019", "text": "very good password manager. We use it to store passwords and share them in a group of people.\nSupport is quick and very helpful if you have a problem.", "stars": 5}, {"date": "May 17, 2019", "text": "Totally useless, it does not work at all. Great waste of time. It always pops this error: 'There was an error during authentication. Enable debug mode for more information'", "stars": 1}, {"date": "Sep 25, 2018", "text": "An amazing open source password manager for startups and enterprises. Very secure and user friendly.", "stars": 5}, {"date": "Sep 25, 2018", "text": "This a great password manager! Total lifesaver\nAllows me to have strong passwords without having to remember them all. Love it!", "stars": 5}, {"date": "Mar 29, 2018", "text": "I like what passbolt stands for but I've run into issues using on multiple devices. My Chrome extension was auto disabled because it now requires permission to manage downloads -- why?", "stars": 4}, {"date": "Feb 20, 2018", "text": "The Chrome/Chromium version does not work with our passbolt instance. It logs in (as I get a different message when I use the wrong password) thinks about it then returns to the login screen meaning I am unable to use it at all. The Firefox version works fine which leads me to believe the issue is with the chrome extension and not the server.", "stars": 2}, {"date": "Oct 24, 2017", "text": "One of the best self-hosted password manager.", "stars": 5}, {"date": "Aug 15, 2017", "text": "A very nice and useful password manager for my team!", "stars": 5}, {"date": "Aug 2, 2017", "text": "Horrible app. Signing up for \"demo\" never actually completes.", "stars": 1}, {"date": "Jul 29, 2017", "text": "Very nice and useful password manager", "stars": 5}, {"date": "Jul 20, 2017", "text": "Excellent plugin which actually works with the Passbolt web application, a nice password and security system intended not only for personal but for business in a great Open Source package.", "stars": 5}, {"date": "Jun 14, 2017", "text": "Although a little tricky to install, the support for this product is exceptional. This product shows a lot of promise and I can't wait to see what features they bring out soon.", "stars": 5}, {"date": "Jan 5, 2017", "text": "A very promising password manager. Uses open source tools and makes them easy to use. More functionality expected this year.", "stars": 5}, {"date": "Dec 1, 2016", "text": "best!!!", "stars": 5}]