[{"stars": 5, "text": "It works perfectly. I love the feature to instantly disable all active extensions and re-enable them whenever you need them with just a click.\nI also enjoy the profiles feature.\n\nWhat is missing, it ´ s a feature to organize or group the extension. For example, to put together extensions of the same type.", "date": "Mar 9, 2024"}, {"stars": 5, "text": "perfect extension! thanks.", "date": "Mar 7, 2024"}, {"stars": 5, "text": "cool", "date": "Mar 6, 2024"}, {"stars": 5, "text": "I've been using this for a few years. Best app. And must install this addon to save memory and cluttered menu bar icons even in the latest version of chrome.", "date": "Feb 17, 2024"}, {"stars": 5, "text": "Yeah.. this one makes it all worth it..", "date": "Jan 30, 2024"}, {"stars": 5, "text": "Been using this for YEARS! It's absolutely the best. Only hit one snag recently when my extension profiles disappeared, but the developer responded quickly and said to reload the extension. Worked like a charm! This is a MUST HAVE.", "date": "Jan 25, 2024"}, {"stars": 5, "text": "Without it, Chrome becomes a mess.", "date": "Jan 19, 2024"}, {"stars": 5, "text": "Probably my favourite extension.", "date": "Jan 16, 2024"}, {"stars": 5, "text": "Really helpful and time saving", "date": "Dec 24, 2023"}, {"stars": 5, "text": "I've been using this extension since early 2022 and now use it on all my Chrome profiles, and on multiple computers. I love this extension and believe it offers what should be a standard (developer) feature in any browser. If it ever goes away, I will be very, very sad.", "date": "Dec 15, 2023"}, {"stars": 5, "text": "The great simplicity and utility is the best that it has. Completely in love with this extension.", "date": "Dec 15, 2023"}, {"stars": 5, "text": "This extension is my most useful yet. I'm literally using it the whole time to toggle between extensions. Very great and I can definitely recommend!", "date": "Dec 9, 2023"}, {"stars": 5, "text": "AMAZING EXTENSION . THANK YOU", "date": "Dec 7, 2023"}, {"stars": 5, "text": "I was looking for something like that for a long time it only took me a quick search finally I don't have to go to the extension manager and disable what i don't want to use and go again and enable it's really frustration but with this extension it's amazing they have to make it available for the browser natively, but they don't.", "date": "Dec 2, 2023"}, {"stars": 5, "text": "Best Extension Manager Ever with 1 Click Enable Disable Feature", "date": "Nov 29, 2023"}, {"stars": 1, "text": "One star because Profile function doesn't work, but 4 stars otherwise.", "date": "Nov 19, 2023"}, {"stars": 5, "text": "Love it! Makes handling extensions a breeze. Super simple to use and keeps my extensions organized.", "date": "Nov 17, 2023"}, {"stars": 5, "text": "This is is the first extension i install after a clean and the one that never leaves my Browser", "date": "Nov 14, 2023"}, {"stars": 5, "text": "Perfect!", "date": "Oct 29, 2023"}, {"stars": 5, "text": "BEST extension manager PERIOD, nothing else to say!", "date": "Oct 27, 2023"}, {"stars": 5, "text": "great way to manage extensions", "date": "Oct 17, 2023"}, {"stars": 4, "text": "Nice!", "date": "Oct 14, 2023"}, {"stars": 5, "text": "superb useful & must have extension manager !", "date": "Oct 10, 2023"}, {"stars": 5, "text": "Great for stopping extensions from running in the background.", "date": "Sep 16, 2023"}, {"stars": 5, "text": "Super", "date": "Sep 15, 2023"}, {"stars": 5, "text": "Makes life easier. Works flawlessly . Its FREE. What more could you ask for?", "date": "Aug 31, 2023"}, {"stars": 5, "text": "This is a genius idea for an extension. Props to the developer(s).", "date": "Aug 18, 2023"}, {"stars": 4, "text": "I give it a 4 star because id like to be able to back up all the extensions placed in this to be able to use this across all browsers and accounts that I have.", "date": "Jul 26, 2023"}, {"stars": 5, "text": "Extensity is an exceptional Google Chrome extension that offers a wide range of features to enhance your browsing experience. With its ability to quickly enable and disable Chrome extensions, it provides unparalleled convenience and flexibility. Here's a detailed and comprehensive review of Extensity, highlighting its key features and benefits.\n\nOne of the most impressive aspects of Extensity is its ability to help you keep your browser lean and fast. With the vast array of extensions availab... Show more", "date": "Jul 13, 2023"}, {"stars": 5, "text": "It should be native in Chrome !!  It is one of the Top 5 Chrome Extensions, along with One Tab, uBlock Origin,  Linkclump and  'Copy All Urls '", "date": "Jun 30, 2023"}, {"stars": 5, "text": "help a lot. thanks founder", "date": "Jun 24, 2023"}, {"stars": 5, "text": "extremely simple. extremely useful", "date": "Jun 21, 2023"}, {"stars": 5, "text": "What it does is so simple, yet so useful. I've been using it for a while and felt like coming here just to rate it 5 stars, it deserves it! Keep the great work.", "date": "Jun 20, 2023"}, {"stars": 5, "text": "very usefull :)", "date": "Jun 19, 2023"}, {"stars": 5, "text": "Extremely useful! :) Thank you, developer!", "date": "Jun 5, 2023"}, {"stars": 5, "text": "Just op and too handy for chromium based browsers", "date": "Jun 4, 2023"}, {"stars": 4, "text": "Please add ability to sort the extensions by categories!", "date": "May 19, 2023"}, {"stars": 5, "text": "best best best. and super handy", "date": "May 18, 2023"}, {"stars": 5, "text": "undoubtedly necessary", "date": "May 11, 2023"}, {"stars": 5, "text": "All in One", "date": "May 7, 2023"}, {"stars": 5, "text": "literally the best", "date": "May 7, 2023"}, {"stars": 5, "text": "super helpful", "date": "Apr 29, 2023"}, {"stars": 5, "text": "Given that it's free and does all it boasts, you can't go wrong with this extension. It has saved me tons of time and battery life.", "date": "Apr 22, 2023"}, {"stars": 5, "text": "I am using this at school and it is actually really good! I recommend you to download it (If you know how to use it). Also, I wish it works with apps too.", "date": "Apr 15, 2023"}, {"stars": 5, "text": "awesome", "date": "Apr 4, 2023"}, {"stars": 5, "text": "It needs a Export or back up option.  like give us List generation so we can export the list and their icons and ideally a link with them to their pages. This way if i change browsers i can remember what i had.", "date": "Mar 29, 2023"}, {"stars": 4, "text": "I aint gon' even lie:\nWhenever I have to re-install chrome for some reason (issues, new pc, etc.) extensity is my go to (as in: FIRST) plugin I'm looking for because I find that chrome gets \"bogged down\" when I have too many plugins installed, tabs open, etc. It eases the struggle that session/tab/memory managers face, typically because of the bloat.\n\nI dig extensity so much that I've looked for it for other browsers when I feel I can't take chrome any more (to my dismay: Nothing).\n\nAll that ... Show more", "date": "Mar 26, 2023"}, {"stars": 5, "text": "ily dev", "date": "Mar 23, 2023"}, {"stars": 5, "text": "shopping, working, writing, creating, editing, etc. There's an extension for it, and with extensity I can easily adjust which of them are helpful actively running and which can just go to sleep. Is this available on safari, if not, can it be? GREAT WORK", "date": "Mar 15, 2023"}, {"stars": 5, "text": "This is something Chrome should make as a web page called(this is the web address they should make for the page): chrome://extention-manager", "date": "Mar 14, 2023"}, {"stars": 5, "text": "One of the most useful extensions that I can't live without. No idea why Chrome devs forgot to work on extension management page. Keep it up!", "date": "Mar 11, 2023"}, {"stars": 5, "text": "Super helpful and easy to use!", "date": "Feb 27, 2023"}, {"stars": 5, "text": "Light weight and does what you want", "date": "Feb 25, 2023"}, {"stars": 5, "text": "showw", "date": "Feb 21, 2023"}, {"stars": 5, "text": "fantastic extension management app", "date": "Feb 18, 2023"}, {"stars": 5, "text": "A must have extension in 2023", "date": "Feb 17, 2023"}, {"stars": 2, "text": "Something is messed up, I'm not sure what but it appears switching profiles doesn't actually work. I have two, one is secure browsing with most of the extensions installed are disabled and unsecure browsing with most of them enabled. Problem is switching profiles and the extensions remain in the state they were in no matter what. I'm forced to manually click them on/off. Pretty annoying. Another bug \"Show Always On profile in the list\" is unchecked and yet it appears in my profile anyway.", "date": "Feb 16, 2023"}, {"stars": 5, "text": "the best of its kind", "date": "Feb 10, 2023"}, {"stars": 5, "text": "Fantastic extension, really really helpful.", "date": "Jan 24, 2023"}, {"stars": 5, "text": "Legendary", "date": "Jan 15, 2023"}, {"stars": 5, "text": "The savior of all saviors", "date": "Jan 7, 2023"}, {"stars": 5, "text": "How do I rename profiles?", "date": "Jan 5, 2023"}, {"stars": 5, "text": "the best", "date": "Jan 3, 2023"}, {"stars": 4, "text": "Can remember running extensions\nCant delete other extensions", "date": "Dec 18, 2022"}, {"stars": 4, "text": "This is the absolute best 'extension management'- extension I've tried. However, the 'profiles' section could be improved a lot. Firslty, it should give you a warning \"hey are you sure you want to switch profile and the current choice of extensions will be changed and lost (unless you have it saved) and can't be undone without having to do the manual work. Furthermore, I'd like to see profiles more as \"groups\" that could be added/removed by clicking them. Contrary to how it is now, where clic... Show more", "date": "Dec 17, 2022"}, {"stars": 5, "text": "Best. #1.", "date": "Dec 16, 2022"}, {"stars": 5, "text": "Absolutely brilliant!", "date": "Dec 12, 2022"}, {"stars": 1, "text": "5 stars If multiple Profiles can be active at once", "date": "Dec 3, 2022"}, {"stars": 5, "text": "Makes browser faster. Very useful extension..i just disabled many extensions with click of button.", "date": "Dec 2, 2022"}, {"stars": 5, "text": "so many things could be added. like pining and unpinning. show source code. show extension id", "date": "Nov 30, 2022"}, {"stars": 5, "text": "Very, very convenient, easy to use and perfect UI.", "date": "Nov 26, 2022"}, {"stars": 5, "text": "very useful and easy to use", "date": "Nov 22, 2022"}, {"stars": 5, "text": "Awesome. A Must Have. Thank you for this.", "date": "Nov 10, 2022"}, {"stars": 5, "text": "This extension is must have extension in browsers.", "date": "Nov 8, 2022"}, {"stars": 5, "text": "simply amazing,  simple to use and free.", "date": "Nov 5, 2022"}, {"stars": 5, "text": "Awesome extension.\nThere should be an \"All\" default profile, that enables all of your installed extensions. I can just make one that uses all of my extensions, but when I install a new extension, it isn't added to the profile automatically.", "date": "Nov 5, 2022"}, {"stars": 5, "text": "Wow, that's awesome", "date": "Nov 3, 2022"}, {"stars": 5, "text": "Thanks for this . This Really helps me", "date": "Nov 2, 2022"}, {"stars": 3, "text": "Thanks for your extension.\nIf you open chrome://extensions/shortcuts, from there it is possible to assign any new key shortcuts in order to automate how each extension should respond to them. \nI would really appreciate if you implement the option allowing users to switch between their different profiles by pressing shortcut keys. It seems way more convenient to do than extra mouse clicks in the address bar. \nHope this helps.", "date": "Nov 1, 2022"}, {"stars": 5, "text": "Super useful if you have lots of extnesions, some of which you only use occasionally", "date": "Nov 1, 2022"}, {"stars": 3, "text": "When I install this add-on and visit the Ali Express website, the link is converted to an affiliate link", "date": "Nov 1, 2022"}, {"stars": 5, "text": "love this extension. very simple, very nice", "date": "Oct 21, 2022"}, {"stars": 5, "text": "• Installation was effortless \n• The UI is logical and uncluttered And most importantly? It does exactly what it says it does. It has brought some much needed zen to the chaos that was formerly my extension panel. Great work, dev! \n\n🍻 Dilly, dilly! (https://cutt.ly/3BaNr5y) 🍻", "date": "Oct 8, 2022"}, {"stars": 5, "text": "Does what its supposed to do, great extension!", "date": "Oct 5, 2022"}, {"stars": 5, "text": "this is so transparent that one can use all messy things at one place, this is a really helpful tool.", "date": "Sep 30, 2022"}, {"stars": 5, "text": "Very nice tool that does its job well.", "date": "Sep 28, 2022"}, {"stars": 5, "text": "Excellent extension - quick, practical, awesome!", "date": "Sep 22, 2022"}, {"stars": 5, "text": "Very nice extension.", "date": "Sep 14, 2022"}, {"stars": 5, "text": "best tool for all", "date": "Sep 10, 2022"}, {"stars": 5, "text": "Awesome! Even you can create profiles whatever you want. You can choose \"always on\" extensions(security, ad & tracker blocker extension etc.).", "date": "Sep 5, 2022"}, {"stars": 4, "text": "The only feature it is missing it URL-related rules like NooBoss or others. I still use this one the most though. 4.4 stars.", "date": "Sep 2, 2022"}, {"stars": 5, "text": "The perfect solution for managing extensions, thanks!", "date": "Sep 1, 2022"}, {"stars": 5, "text": "Super convenient and easy to use. Recommend it for everyone who uses extensions on chrome.", "date": "Aug 20, 2022"}, {"stars": 5, "text": "It's a quality of life improvement...\nBut its a shame it doesn't work on firefox due to extensions not being able to manage other extensions.", "date": "Aug 11, 2022"}, {"stars": 5, "text": "Amazing, fast, user friendly and does exactly what you need", "date": "Aug 9, 2022"}, {"stars": 5, "text": "Perfect. I can have as many extensions as I want without the need/worry to disable them when I dont need to", "date": "Aug 4, 2022"}, {"stars": 4, "text": "Excellent extensión, only missing:\n- Backup (export/import)\n- Ability to activate more than one profile", "date": "Jul 19, 2022"}, {"stars": 5, "text": "amazingly helpful. i use it all the time. thanks so much.", "date": "Jul 14, 2022"}, {"stars": 5, "text": "Gtreat Extension", "date": "Jul 9, 2022"}, {"stars": 5, "text": "recommended", "date": "Jul 8, 2022"}, {"stars": 5, "text": "Awesome extension.  Been using it for quite a few years now.   \n\nMy only wish is for the develepor to enable the editing of the names of the profiles we create, apart from being able to delete them.", "date": "Jul 7, 2022"}, {"stars": 5, "text": "Great Extension, my life depends on it, please never shut it down.", "date": "Jul 6, 2022"}, {"stars": 5, "text": "That was perfect extension!", "date": "Jul 1, 2022"}, {"stars": 5, "text": "Best extension to manage other extension, works cool and simple", "date": "Jun 26, 2022"}, {"stars": 4, "text": "basically perfect except for one flaw. \nwhen display config updates, the window shrinks and only the first 12 extensions are able to be disabled \nit comes back if you turn off the header and search bar, but only sometimes.", "date": "Jun 25, 2022"}, {"stars": 5, "text": "great extension for manage all extension and save ram", "date": "Jun 25, 2022"}, {"stars": 5, "text": "This is exactly what I was looking for.", "date": "Jun 24, 2022"}, {"stars": 5, "text": "Best extension on the store", "date": "Jun 22, 2022"}, {"stars": 5, "text": "One of the most helpful extensions for Chrome.", "date": "Jun 19, 2022"}, {"stars": 5, "text": "This is PERFECT! Tysm!!!", "date": "Jun 16, 2022"}, {"stars": 5, "text": "good", "date": "Jun 13, 2022"}, {"stars": 1, "text": "Useless. Doesn't work.", "date": "Jun 6, 2022"}, {"stars": 5, "text": "Simplistically beautiful, kudos! Could not live without it!", "date": "Jun 1, 2022"}, {"stars": 5, "text": "I love this extension!", "date": "May 12, 2022"}, {"stars": 5, "text": "Brilliant idea. The best extension I've discovered in a long time. Would be good if you could duplicate and rename profiles.", "date": "May 4, 2022"}, {"stars": 5, "text": "Must have extension", "date": "Apr 29, 2022"}, {"stars": 3, "text": "Great extencion, but profiles function doesn't work", "date": "Apr 26, 2022"}, {"stars": 5, "text": "Awesome Extention!! could u change the icon tho.", "date": "Apr 26, 2022"}, {"stars": 5, "text": "Awesome!", "date": "Apr 23, 2022"}, {"stars": 2, "text": "If you want to make your menu more confusing than ever, this app is for you---and not for me.", "date": "Apr 18, 2022"}, {"stars": 5, "text": "This is best extention , everyone should use this", "date": "Apr 6, 2022"}, {"stars": 5, "text": "Awesome", "date": "Mar 20, 2022"}, {"stars": 5, "text": "Excellent add-on.\nI particularly like, that it is very compact - most similar extensions waste a lot of screen estate or show only short lists.\nOptions/settings are directly available from the drop down (no extra right click required).  \nI would prefer even a longer list (currently about 60% of my screens height) to see as much stuff at once as possible.\nDonated 5 USD / recommend to support this developer", "date": "Mar 19, 2022"}, {"stars": 5, "text": "Extensity really makes it so much easier than having to go into Chrome's Settings and search through for what you want on or off.", "date": "Mar 14, 2022"}, {"stars": 5, "text": "I stumbled upon this extension via active computer magazine. I would kindly thank the developer/s for creating a truly useful and easy to use extension tool.\n⭐⭐⭐⭐⭐", "date": "Mar 13, 2022"}, {"stars": 5, "text": "A simple extension to turn your extensions off and on.\nI tried it with Microsoft Edge works good but sometimes my Audio stuttering but maybe it's because of my 1 Million Tabs i'm currently reading.", "date": "Mar 11, 2022"}, {"stars": 5, "text": "Fantastic 9/10", "date": "Mar 2, 2022"}, {"stars": 5, "text": "thank you", "date": "Mar 1, 2022"}, {"stars": 5, "text": "incredibly useful", "date": "Feb 24, 2022"}, {"stars": 5, "text": "This is the best extensions manager ever.", "date": "Feb 7, 2022"}, {"stars": 5, "text": "Love it !!!", "date": "Feb 6, 2022"}, {"stars": 5, "text": "Perfect!", "date": "Jan 27, 2022"}, {"stars": 5, "text": "This is one of my top 3 extensions for Chrome. I can't recommend this utility enough, as anyone who knows me can attest. Especially useful when troubleshooting page load issues with content blockers and generally managing the intense memory hog that is Chrome.", "date": "Jan 14, 2022"}, {"stars": 5, "text": "This extension is really handy and very easy to use, it keeps my browser fast.", "date": "Jan 11, 2022"}, {"stars": 5, "text": "Convenient", "date": "Jan 1, 2022"}, {"stars": 5, "text": "awesome tool in your kit :) works perfectly", "date": "Dec 14, 2021"}, {"stars": 5, "text": "all I can say is thank you", "date": "Dec 12, 2021"}, {"stars": 5, "text": "Love this tool. Indispensable to me.", "date": "Dec 8, 2021"}, {"stars": 5, "text": "very nice", "date": "Dec 6, 2021"}, {"stars": 5, "text": "Amazing Extension Loved it", "date": "Dec 2, 2021"}, {"stars": 5, "text": "best extension manager", "date": "Nov 30, 2021"}, {"stars": 4, "text": "This the one extension to rule them all! I use a million different extensions, so Extensity is perfect for quickly toggling on/off the extensions I need. \n\nFeature Request: I would like to see is the ability to group extensions within the dropdown tab. I see that I can switch between specific groups of extensions using profiles, but it would be much better to be able to group them by my use case. I don't always need to turn off a specific group of extensions, but I do always want to quickly s... Show more", "date": "Nov 25, 2021"}, {"stars": 5, "text": "Awesome", "date": "Nov 22, 2021"}, {"stars": 5, "text": "Very Good!", "date": "Nov 22, 2021"}, {"stars": 5, "text": "it has a 5-star rating for a reason :)", "date": "Nov 13, 2021"}, {"stars": 5, "text": "Works and does what it promises.", "date": "Oct 26, 2021"}, {"stars": 5, "text": "Love the extension...simple and does the job well...Just a suggestion .. Is there any way to re-order extensions!", "date": "Oct 25, 2021"}, {"stars": 5, "text": "I had been looking for an extension manager that features addon set profiles for ages! \n\nAwesome! Will definitely donate.", "date": "Oct 10, 2021"}, {"stars": 5, "text": "My performances increased 90% thanks to it, multiplies profiles and auto sync across devices sounds worthy of 5 star to me.", "date": "Oct 4, 2021"}, {"stars": 5, "text": "there is a bug, not in the extension but in the webstore!!!!!\nthe number of reviews isn't going up!! it's stuck at *12* reviews only", "date": "Sep 30, 2021"}, {"stars": 5, "text": "why aren't you using it yet", "date": "Sep 30, 2021"}, {"stars": 5, "text": "Awesome!!", "date": "Sep 28, 2021"}, {"stars": 5, "text": "Very easy to use and absolutely a must-have extension. Thank you so much Sergiokas.", "date": "Sep 13, 2021"}, {"stars": 5, "text": "Amazing - exactly what I needed (the ability to disable all extensions with one click, and reenable only those extensions again with one click)", "date": "Sep 3, 2021"}, {"stars": 5, "text": "Very helpful. Well done!", "date": "Aug 22, 2021"}, {"stars": 5, "text": "Thanks for making this", "date": "Aug 8, 2021"}, {"stars": 4, "text": "Fantastic extension, a must-have for every chrome/brave user! I only wish under each profile, the pin 'status' and pin position of each extension can be remembered so when you switch profiles you can view those activated extensions displayed seamlessly.", "date": "Jul 27, 2021"}, {"stars": 5, "text": "Simple, easy and effective extension for managing extensions.❤😀", "date": "Jul 16, 2021"}, {"stars": 5, "text": "neat and so much organised", "date": "Jul 16, 2021"}, {"stars": 5, "text": "Very useful 🥰", "date": "Jul 14, 2021"}, {"stars": 5, "text": "it is best extension ever. Thanks to developer.", "date": "Jul 11, 2021"}, {"stars": 1, "text": "It's great overall, and thanks a ton for this work, BUT it will be super sweet if you allow more then one profile to be enabled at the same time. \n\n0 Star just to take your attention. I will eddied it as soon as I see a reaction :)", "date": "Jul 6, 2021"}, {"stars": 4, "text": "as a totally new user, I love the easy visual interface, and use it basically just to switch on/off extensions, which it accomplishes flawlessly and gives user great ease!", "date": "Jun 28, 2021"}, {"stars": 5, "text": "Does an excellent job of tidying up my extensions, more than I could ever imagine.", "date": "Jun 19, 2021"}, {"stars": 5, "text": "Great extension! This allows you to make your pc faster! Just disable extensions that are not being currently used and bam, your pc becomes faster! There is just one suggestion and that is to have a dark mode for the extension or maybe even to make the UI a little bit more simple, but still this is a great extension for anyone!", "date": "Jun 8, 2021"}, {"stars": 5, "text": "Super Simple and most efficient. To the point.\nVery easy to use.. Liked it, loved it and now stick to it", "date": "May 21, 2021"}, {"stars": 5, "text": "Fantastic. I hated how most browsers require you to jump through hoops just to quickly disable/enable browser extensions, so Extensity is exactly what I was looking for.\n\n(I haven't ventured to profiles and whatnot as I don't see myself ever needing them at all; I've merely used this extension for the purpose of quickly enabling/disabling my browser extensions, so I guess you could say that my experience with Extensity is basic).", "date": "Apr 30, 2021"}, {"stars": 5, "text": "FANTASTIC, all features you can ask for. Great extension ! ...if only (in general) people were more aware of how to use browsers extensions... This one is A KEEPER for sure.", "date": "Apr 25, 2021"}, {"stars": 5, "text": "This was a really good extension and helps my browser lag because I have a lot of extensions!!!!", "date": "Apr 15, 2021"}, {"stars": 5, "text": "Best thing since fried okra.  Not only is it good for building sets of extensions (e.g. turn on all that GitHub stuff only when you're at GitHub), it's also a great boon for debugging. Make your \"Always On\" set of key privacy extensions, and then a \"My Usual\" set for everything you normally run with, and if there's some issue (e.g. an extension is doing search engine hijacking, or something is interfering with important elements of a site, like ability to submit a form), you can selectively d... Show more", "date": "Apr 11, 2021"}, {"stars": 5, "text": "Exactly what I needed. Thank you.", "date": "Apr 3, 2021"}, {"stars": 5, "text": "DAMN!!! 😲 How have I lived all this time without this? Everyday, I need to turn extensions on and off so I don't slow my browser depending on what I'm doing. I hate the process of having to open the \"manage extensions\" page, trying to find the one I'm looking for [I have a lot] just so I can turn it on/off. This saves  me a lot of time and headaches. It's on my list of best extensions.", "date": "Mar 15, 2021"}, {"stars": 5, "text": "Amazing Extension! It is a must to control memory issues. I use a ton of  extensions so every new tab suffers with performance. However if you don't need them you can disable them using the quick button on top or using different profiles based on your need.", "date": "Mar 6, 2021"}, {"stars": 5, "text": "great app", "date": "Feb 28, 2021"}, {"stars": 5, "text": "I have been using since a colleague recommended it. It has made browser life so much easier. I even have used it with chrome 49.0.2623.112 + extensity v1.10 still works as far back as win XP sp3, so thanks for backward compatibility helps when I want to play with an old \"vintage\" PC setup.", "date": "Feb 28, 2021"}, {"stars": 5, "text": "Perfect in every way", "date": "Feb 22, 2021"}, {"stars": 5, "text": "Great Extension\nI have a lot of extensions and if you're like me than this is a must have", "date": "Feb 11, 2021"}, {"stars": 5, "text": "nice.", "date": "Feb 10, 2021"}, {"stars": 5, "text": "This extension is brilliant good job", "date": "Feb 9, 2021"}, {"stars": 5, "text": "Much better than others I've tried. 5 stars.\n\nReally should be a built in feature in Chrome but thanks for taking the time to develope this.", "date": "Feb 8, 2021"}, {"stars": 3, "text": "Unfortunately, there's no keyboard toggle hotkey to control the on/off mode. It's a pain to have to click each time. Running js: vm.switch.flip() works, but it only works in the VM context of the extension.", "date": "Jan 24, 2021"}, {"stars": 5, "text": "One of the most useful extensions ever.  It makes management of extensions (and their pull on RAM) a total breeze.", "date": "Jan 18, 2021"}, {"stars": 5, "text": "wow works better than other extension disablers", "date": "Jan 17, 2021"}, {"stars": 5, "text": "Great extension...!!!", "date": "Jan 13, 2021"}, {"stars": 5, "text": "Just essential ! So much better now !", "date": "Jan 11, 2021"}, {"stars": 5, "text": "love it ❤❤❤", "date": "Jan 3, 2021"}, {"stars": 5, "text": "Been searching for this extension for hours!!! \nSuch a helpful extension!!!", "date": "Dec 27, 2020"}, {"stars": 5, "text": "The extension is awesome. But is it possible to make it that the profiles get auto enabled when visiting a particular website, like shopping related extensions gets enabled only when opening amazon website.", "date": "Dec 16, 2020"}, {"stars": 5, "text": "Using a few years in Chrome . pretty basic in a minimalist way. \nEasy to navigate. Best of those tried . Currently installed with Vivaldi .", "date": "Dec 11, 2020"}, {"stars": 5, "text": "This is a must have! just perfect", "date": "Nov 26, 2020"}, {"stars": 5, "text": "Thank you. Best Chrome extension. Even Google could not provide a simpler way to enable, disable or hide chrome extensions in a better way :-)", "date": "Nov 19, 2020"}, {"stars": 5, "text": "It is very useful. But: Why can I just add a profile, not delete it?", "date": "Nov 17, 2020"}, {"stars": 5, "text": "Works GREAT!", "date": "Oct 31, 2020"}, {"stars": 5, "text": "go app", "date": "Oct 29, 2020"}, {"stars": 5, "text": "nice!", "date": "Oct 27, 2020"}, {"stars": 5, "text": "Provides easy access to extension, bypassing Chrome's redirection to the Manage Extensions page.  Simple, effective on/off control of extensions,", "date": "Oct 27, 2020"}, {"stars": 5, "text": "Simply the best!", "date": "Oct 25, 2020"}, {"stars": 5, "text": "Let's me keep a clean bar, and have an easy way to add the extensions I need fast.", "date": "Oct 25, 2020"}, {"stars": 4, "text": "Very good, useful extension!  I started using it for a \"sandbox\" profile I created to try out and test extensions, there's so many and I don't want to bloat my usual profile, plus this way I can compare alternatives more easily. This extension fits right in and enables testing out groups of extensions quite easily. I also added it to my other profiles since it's useful to turn on/off those used less often or only sometimes.\n\nFeedback / issues:\n1)  It seems the pinned state of extensions (pinn... Show more", "date": "Oct 25, 2020"}, {"stars": 5, "text": "this is a must", "date": "Oct 20, 2020"}, {"stars": 5, "text": "Soooo useful!!", "date": "Oct 14, 2020"}, {"stars": 5, "text": "very useful for managing extension.", "date": "Sep 24, 2020"}, {"stars": 3, "text": "Good extension! But it's not working anymore the way it should. Profiles don't work... the save on the profiles list... sometimes the get deleted without a reason... and when selecting each of them, nothing happen...it used to work...", "date": "Sep 14, 2020"}, {"stars": 5, "text": "I couldn't do without this extension - THANKS!", "date": "Sep 10, 2020"}, {"stars": 5, "text": "Great extension", "date": "Sep 5, 2020"}, {"stars": 2, "text": "Well I kind of hate this extension because the school can't let me undownload this. It really sucks to be honest.", "date": "Sep 2, 2020"}, {"stars": 5, "text": "Since I love this extension, I want to Add a Review.\nI'm glad I found this Extension. As we all know that google chrome has a lot of extensions and they keep running in the background and Eat our PC RAM like crazy. With Extensity you can easily ON and OFF any extension you want in just 1 Click :)\nThank you Than you!!", "date": "Aug 29, 2020"}, {"stars": 4, "text": "It needs an option to remove extensions! There needs to be an X Button near the extension settings!", "date": "Aug 28, 2020"}, {"stars": 5, "text": "VERY FU**ING GOOD KEEP THE GOOD WORK", "date": "Aug 25, 2020"}, {"stars": 5, "text": "Great app, saves a lot of time", "date": "Aug 18, 2020"}, {"stars": 5, "text": "Great extension", "date": "Aug 16, 2020"}, {"stars": 5, "text": "I love this Saves my Chrome", "date": "Aug 10, 2020"}, {"stars": 1, "text": "UPDATE (2020-09-10): sorry that I need to update my review! I guess I was enjoying the extension too much! today I opened Chrome, my profiles are gone, and when I select (my newly created) profiles, nothing happens 😥\n\nAmazing extension. Simple and super useful. I LOVE the idea of the profiles! 🧡🧡🧡", "date": "Aug 5, 2020"}, {"stars": 5, "text": "I love it   !!!!", "date": "Aug 2, 2020"}, {"stars": 5, "text": "This is a hIghly impressive organizer. I have a lot (I mean A LOT) of Chrome extensions that I don't need to use all the time. This allows me to easily enable/disable depending on what I need, which helps keep my CPU and memory low on my Mac. Also, creating a 'Profile' makes it even more easy to manage.", "date": "Jul 21, 2020"}, {"stars": 4, "text": "ompfuna", "date": "Jul 8, 2020"}, {"stars": 5, "text": "very good", "date": "Jul 7, 2020"}, {"stars": 5, "text": "This is something that even latest google update feature can't hold a candle against it\nThis extention is a must for everyone, there is at least 20 extention worth installing, but having them run at the same time its like having 20 pages open, +2 gb ram but with this ... enable and disable when not needed and your Ram thanks you for it", "date": "Jul 4, 2020"}, {"stars": 5, "text": "Perfect!", "date": "Jun 27, 2020"}, {"stars": 4, "text": "There is an issue with the new update to Chromes extension picker and pinned extensions. When switching between profiles in Extensity, chrome resets the pins, so any extensions I need visible, I have to repin them each time I switch profiles.\n\nAny way this can be avoided?", "date": "Jun 27, 2020"}, {"stars": 1, "text": "Since google chrome last update, the extension stopped to work and now google chrome has one extension shortcut to manage the extension in the bar, I dont want to use it, the extensity is better.", "date": "Jun 26, 2020"}, {"stars": 5, "text": "Love this extension. Simple, elegant, and does what it says.", "date": "Jun 25, 2020"}, {"stars": 5, "text": "I am so lucky for knowing this extension and it helps a lot for browsing all extensions at once i didn't find anything fault in this Extension!", "date": "Apr 15, 2020"}, {"stars": 5, "text": "I can't think about browsing internet without this. I use it every single day.", "date": "Apr 14, 2020"}, {"stars": 5, "text": "good", "date": "Apr 14, 2020"}, {"stars": 5, "text": "Simple to use, and delivers as promised.", "date": "Apr 10, 2020"}, {"stars": 5, "text": "I love this extension", "date": "Apr 10, 2020"}, {"stars": 5, "text": "Very Useful Indeed.", "date": "Apr 8, 2020"}, {"stars": 5, "text": "Very useful", "date": "Apr 4, 2020"}, {"stars": 5, "text": "Brilliant! Thank You!", "date": "Mar 30, 2020"}, {"stars": 5, "text": "Awesome Extension, it makes easy to manage my extensions seeing it working on and off in a much fast way", "date": "Mar 28, 2020"}, {"stars": 5, "text": "easy and quick on off for extensions and apps including some settings of extensions", "date": "Mar 28, 2020"}, {"stars": 5, "text": "ive just downloaded it, a few hours ago, but so far , its been extremely Productive!!!", "date": "Mar 24, 2020"}, {"stars": 5, "text": "Loved it", "date": "Mar 21, 2020"}, {"stars": 5, "text": "One of the most useful and consistent extensions ... it just works.", "date": "Mar 15, 2020"}, {"stars": 5, "text": "very useful for me.", "date": "Mar 12, 2020"}, {"stars": 5, "text": "A must have extension for me.", "date": "Feb 23, 2020"}, {"stars": 5, "text": "Works as expected. Very useful to have if you have lots of extensions installed.", "date": "Feb 16, 2020"}, {"stars": 1, "text": "I used Extensity to temporarily turn-off AdBlock Plus in Microsoft Edge Beta. When I turned Adblock Plus back on, the extension doesn't work properly anymore. I uninstalled and reinstalled Adblock Plus, but it appears that Adblock Plus is somehow *permanently* broken after using Extensity. This is probably a browser-specific issue, but it's pretty obvious that it was caused by Extensity.", "date": "Feb 7, 2020"}, {"stars": 5, "text": "nice extension so far", "date": "Jan 29, 2020"}, {"stars": 5, "text": "Excellent", "date": "Jan 29, 2020"}, {"stars": 5, "text": "omg a must if you use chrome just a little bit with extensions", "date": "Jan 29, 2020"}, {"stars": 5, "text": "Great extension, been using it for years. Thanks for making this extension!", "date": "Jan 27, 2020"}, {"stars": 5, "text": "Excellent solution to manage all active extensions as well as my RAM and CPU usage.\nThanks! Extensity", "date": "Jan 26, 2020"}, {"stars": 5, "text": "Very useful app !", "date": "Jan 26, 2020"}, {"stars": 5, "text": "Awesome extension. Very convenient to quickly turn them off/on to improve productivity.", "date": "Jan 25, 2020"}, {"stars": 5, "text": "Finally something useful for me. I love it", "date": "Jan 15, 2020"}, {"stars": 5, "text": "amazing", "date": "Jan 14, 2020"}, {"stars": 1, "text": "Not able to view entire list of apps in first/preview screen for Extensity. Apps are cut off from view. Imaged error: https://photos.app.goo.gl/Ef6XNSU1DkZEoecv9. Not user-friendly! Using another extension because of this flaw.", "date": "Jan 7, 2020"}, {"stars": 5, "text": "plz in the long run consider a switch or toggle profile shortcut within Chrome.\nawesome work. thanks very much.", "date": "Jan 6, 2020"}, {"stars": 5, "text": "great", "date": "Dec 31, 2019"}, {"stars": 5, "text": "(SO NICE)", "date": "Dec 24, 2019"}, {"stars": 5, "text": "I love this extension.  I use it everyday.", "date": "Dec 22, 2019"}, {"stars": 5, "text": "its a good app yo have", "date": "Dec 7, 2019"}, {"stars": 5, "text": "One of the most essential extensions for any type of user.", "date": "Nov 26, 2019"}, {"stars": 5, "text": "Wonderful in its simplicity. I tried most of the others. Many were bloated, some did too little, and others were ugly. Extensity has been on my Chromebooks for a long time and there's been no reason to look for an alternative. It just works.", "date": "Nov 23, 2019"}, {"stars": 5, "text": "Super!!!", "date": "Nov 20, 2019"}, {"stars": 5, "text": "The Best!Must have.", "date": "Nov 12, 2019"}, {"stars": 5, "text": "Extensity is the best extension to easily toggle extensions and create different groups on profiles that you can immediately turn on or off.  Turn off extensions when you don't need them.  When you do want them, click the Extensity extension icon and you can immediately turn other extensions back on.\n\nIf you use more than 6 extensions, after you add Extensity, it will become an extension that you never want to remove from chrome.  By the end of the day, it's not uncommon that I have 10+ brows... Show more", "date": "Nov 12, 2019"}, {"stars": 5, "text": "Super, try the profiles option too", "date": "Nov 6, 2019"}, {"stars": 5, "text": "I highly recommend Extensity to anyone who has extensions that run constantly but aren't needed constantly. This extension needs to come included with Chrome browser in my opinion!", "date": "Nov 2, 2019"}, {"stars": 5, "text": "good", "date": "Nov 1, 2019"}, {"stars": 5, "text": "Loved it", "date": "Oct 22, 2019"}, {"stars": 5, "text": "I am a developer and this extensions definitely helps keep things clean, neat and improves performance.  \n\nThank you for you contribution to the community by providing this extension to us.", "date": "Oct 12, 2019"}, {"stars": 5, "text": "Most useful extension that I have installed so on. \nSuggestion: I want to group extensions so i can enable/disable extension groups Can you add this feature to extensify?", "date": "Oct 11, 2019"}, {"stars": 5, "text": "Love it.", "date": "Oct 8, 2019"}, {"stars": 5, "text": "I love it thank you!", "date": "Oct 4, 2019"}, {"stars": 5, "text": "Excellent tool, but scrolling issue means I can't access have my extensions, I opened an issue https://github.com/sergiokas/Extensity/issues/51", "date": "Sep 27, 2019"}, {"stars": 5, "text": "Originally I heard about this extension through a tech webcast that I watch periodically. I installed it immediately and loved it. Then I never gave it another thought...until recently. I have been in the same computer environment for over a year and recently had to do a fresh OS install on a comp and of course that meant adding Chrome naked. I suddenly realized just how much I make use of this extension. It's an incredible tool to be able to use super convenient extensions that are also a nu... Show more", "date": "Sep 4, 2019"}, {"stars": 5, "text": "Epic - great job! - works like a treat 10/10", "date": "Sep 3, 2019"}, {"stars": 5, "text": "Please add this important feature :\nhttps://i.ibb.co/dLJhGH6/feature.png", "date": "Aug 21, 2019"}, {"stars": 5, "text": "I rely on this DAILY, Nonstop for all my work.\nProfiles: Work, Media, Shopping, Research, Writing\nThe profiles sync across devices via chrome-cloud-sync, so it's really smooth!\nCombined with Workona workspace manager (tab/session tool), my workflow is so much more efficient!", "date": "Aug 12, 2019"}, {"stars": 5, "text": "love it, but i don't like the extension logo showing in my extensions, wish i could make it invisble or change the logo", "date": "Aug 10, 2019"}, {"stars": 5, "text": "Exactly what I was looking for.", "date": "Aug 7, 2019"}, {"stars": 5, "text": "One Word \"AWESOME...!!!!\"  - perfect tool exactly what I was looking for, keep up the great work.", "date": "Aug 4, 2019"}, {"stars": 5, "text": "When I get a new computer or set up a new account, Extensity is the first extension I download. It is the hub I use to manage everything else.", "date": "Aug 2, 2019"}, {"stars": 5, "text": "Absolutely Fantastic Thanks All Team", "date": "Jul 19, 2019"}, {"stars": 5, "text": "Exactly what I needed. Thanks!", "date": "Jul 17, 2019"}, {"stars": 5, "text": "The extension is great, but what I'm missing in it is the direct link to Chrome webstore. Then it would be a 6 star extension.", "date": "Jul 10, 2019"}, {"stars": 5, "text": "Works great. Good design. They have optimized common tasks so that you can accomplish your task with very minimal input / clicks. Clearly, this was made by a real pro.", "date": "Jul 6, 2019"}, {"stars": 5, "text": "The profile option is simply wonderful: in 1 click I can  switch on/off the app I use for work or leisure. And even better: it's open source!", "date": "Jul 5, 2019"}, {"stars": 5, "text": "I use it daily, I could not use chrome without it, but the best part of it is that its open source (being able to switch profile is great ―save the CPU for other task). Thanks for sharing your work Sergiokas!", "date": "Jul 5, 2019"}, {"stars": 5, "text": "easy to use", "date": "Jul 5, 2019"}, {"stars": 5, "text": "just perfect !!!", "date": "Jul 4, 2019"}, {"stars": 5, "text": "Most valuable and a must have app when using the resource hogging Chrome.", "date": "Jun 23, 2019"}, {"stars": 5, "text": "@@@ ABSOLUTELY PHENOMENAL @@@\n\nWhen I discovered Extensity, it was like a dream come true. I have 9 privacy extensions alone that often need to be toggled and it used to take me forever to go through Chrome's native menu to handle this. It was inefficient, slow, and a nuisance.\n\nExtensity completely eliminated that problem for me and also solved my second problem to boot. Certain websites I visit only need certain extensions enabled. The answer is the Extensity \"Profiles\" feature! I can creat... Show more", "date": "Jun 14, 2019"}, {"stars": 5, "text": "I'm using this extension for developing an extension. The great thing about it is that I can easily switch between a development profile and my personal profile. So, as you might guess, the profiles are the most useful feature for me. I would love it even more if it would have remembered the positions of icons for extensions.", "date": "Jun 12, 2019"}, {"stars": 5, "text": "This is an immensely helpful tool. I love it.", "date": "Jun 12, 2019"}, {"stars": 5, "text": "Great stuff. I'm very happy this extension has the profile functionality. I have a ton of extensions that I use conditionally, and until now I was using different Chrome profiles to use certain extensions when I needed them. It was a pain because then I would need to copy-paste URLs into a new browser and start over. Thank you!", "date": "Jun 10, 2019"}, {"stars": 5, "text": "I am VERY pleased with this extension.  I use it many times a day!\nThank you very much!", "date": "May 31, 2019"}, {"stars": 5, "text": "Best extension ever!", "date": "May 30, 2019"}, {"stars": 5, "text": "the faster you install this, the more time you can save\nsimple and great confirmed!", "date": "May 23, 2019"}, {"stars": 5, "text": "Switching between profiles (Work, Learn, more) with only needed extensions improved my productivity and boosted Chrome performances. Excellent stuff.", "date": "May 17, 2019"}, {"stars": 5, "text": "very useful", "date": "Apr 23, 2019"}, {"stars": 5, "text": "Clean as a whistle! Best one with minimal and hazzle free interface!", "date": "Apr 23, 2019"}, {"stars": 2, "text": "can't install through it,\nvery far distant icons.\ni thought it would similar to \"simple ext manager\". do copy style of then i will give 5 star", "date": "Apr 22, 2019"}, {"stars": 5, "text": "Must have extension!!", "date": "Apr 10, 2019"}, {"stars": 5, "text": "I really enjoyed it because it's very useful and helps me organize my extensions that I don't need.", "date": "Apr 8, 2019"}, {"stars": 5, "text": "Pretty straightforward and easy to use, and it is open-source. 5-star for sure", "date": "Apr 7, 2019"}, {"stars": 5, "text": "Very simple and good.", "date": "Mar 26, 2019"}, {"stars": 5, "text": "The fastest way to switch on and off extensions. Great for who has a lot of them, but don't use them all the time", "date": "Mar 24, 2019"}, {"stars": 5, "text": "Absolutely necessary if you are a power user. Also helps when working on machines with relatively less memory. Extremely grateful to the developer.", "date": "Mar 20, 2019"}, {"stars": 5, "text": "Awesome extension, I love it.", "date": "Mar 20, 2019"}, {"stars": 4, "text": "Love it. Thanks you.\n\nCan you remove syncing last used profile across multiple computers please.\n\nFor example, I have a profile called Work that I want to use at Work, and another called Home. \n\nUnfortunately If I enable Work profile at work, when I get home and open Chrome, this extension sync my last used profile to Chrome on my home computer. \n\nI want to use my Home profile at home and my Work profile at work, I dont want this extension autoswitching to my last used profile when I open Chr... Show more", "date": "Mar 15, 2019"}, {"stars": 5, "text": "Never thought I would review an extension on Google Chrome but here I am! This is an amazing tool. I'm a bit of a heavy extension user and this is extremely useful for cutting back on ram usage. The saved profiles feature is killer for implementing extension workflows too! I can finally have peace of mind that my computer will not freak out when I have a bunch of tabs open, programs running and Lightroom all at the same time. Best tool out there!", "date": "Mar 14, 2019"}, {"stars": 5, "text": "I run Chrome on several operating systems for different purposes.  This extension is amazing because, ex, some Chromebook-necessary extensions are meaningless on Mac. I've used this for years and it especially works wonders for development environments.  I can toggle framework-specific tools, or quickly remove all extensions to see if they are causing errors and not the app I'm building.\n\nMake more things, person!", "date": "Mar 13, 2019"}, {"stars": 5, "text": "Works great! I have added more extension and able to access them with ease! Very helpful! Thanks!", "date": "Mar 13, 2019"}, {"stars": 5, "text": "Rated it 5-Star within 2 minutes after installation & just after 1st use\nWorked Beautifully", "date": "Mar 7, 2019"}, {"stars": 5, "text": "This extension is very very good and useful! A more modern Menu/Gui for the extension would be Great! Thanks!", "date": "Mar 6, 2019"}, {"stars": 5, "text": "Very helpful.  Extensity has made it so that I can benefit from many more extensions than I otherwise would.  With extensity a whole universe of functionality is at hand when you need it, but out of the way when it's not needed.  Works as advertised and have never had any problems with.", "date": "Mar 3, 2019"}, {"stars": 4, "text": "Great idea, needs some refinement but overall job well done.", "date": "Mar 2, 2019"}, {"stars": 5, "text": "nice job!", "date": "Mar 1, 2019"}, {"stars": 5, "text": "This extension is awesome now i can manage my all extensions in one", "date": "Feb 27, 2019"}, {"stars": 5, "text": "and it's open source! Thanks for sharing your awesome work!", "date": "Feb 24, 2019"}, {"stars": 5, "text": "I find it is surprising one of my best extensions.  I love having a plethora of extensions at my disposal, but I don't always need them active at the same time, nor at times want them active at the same time.  This extensions solves that problem for me with ease.  In my opinion.", "date": "Feb 19, 2019"}, {"stars": 5, "text": "Useful!", "date": "Feb 15, 2019"}, {"stars": 5, "text": "Awsome", "date": "Feb 11, 2019"}, {"stars": 5, "text": "Extensity is a great extension that you should have on your browser.", "date": "Feb 11, 2019"}, {"stars": 5, "text": "friendly UI! easy to use! All is perfect, but! lack the function of REMOVING extensions!! 非常可惜！！", "date": "Feb 10, 2019"}, {"stars": 5, "text": "According to me, the best extension in chrome webstore.", "date": "Feb 2, 2019"}, {"stars": 5, "text": "best thing", "date": "Jan 28, 2019"}, {"stars": 5, "text": "Just perfect!, actually this is what I was looking for. Thank you.", "date": "Jan 27, 2019"}, {"stars": 5, "text": "Very useful as some chrome extensions such as Grammarly are incredibly useful but are security risks for username and password text.  So having a handy mechanism to disable and enable Grammarly on the fly is great.", "date": "Jan 20, 2019"}, {"stars": 2, "text": "After the not yet fixed major bug of not being able to saving profiles the extension is currently limping in its usability and stumbles around its former glory.", "date": "Jan 11, 2019"}, {"stars": 5, "text": "Works well for what I needed. If I have problems with a web page working properly this lets me quickly turn all of them off to see if an extension is the problem, then quickly go threw them to find the problem one. I know this can be done threw the extensions page, but this makes it much faster.", "date": "Jan 10, 2019"}, {"stars": 5, "text": "I LOVE this extension!  Allows me to turn on and off what I need easily!", "date": "Dec 27, 2018"}, {"stars": 5, "text": "I like it. I prefer how Custom Chrome and SimpleExtManager handle groups/profiles, but the extension does what it's designed to do, and does it well. \n\nIn those other two, instead of creating profiles where ALL extensions not in the profile get disabled, you're creating groups of extension to toggle on/off, while items not in the groups are ignored. I find that easier to manage personally, because when you add/remove extensions, you don't have to constantly remember to edit/update every group... Show more", "date": "Dec 25, 2018"}, {"stars": 5, "text": "using a lot of extensions dosn't have drag you CPU into the dust with this great extensiion", "date": "Dec 20, 2018"}, {"stars": 5, "text": "thanks a lot for sharing your talent & time!", "date": "Dec 20, 2018"}, {"stars": 5, "text": "Wonderful productivity tool! Devs did a fantastic job!", "date": "Dec 10, 2018"}, {"stars": 5, "text": "Must have app if you are using too many chrome apps.", "date": "Dec 3, 2018"}, {"stars": 4, "text": "Thanks a lot for this great Extension!,\nit allows to work Task-Based, e.g. enable just the Extensions used for shopping and later enable just the used to study.\n\nThis would be useful:\n1) A click to an Extension-Icon should be forwarded to the extension itself so that the Extension can be used as usual. If one would like to enable an Extension, we could click to a checkbox or e.g. the Text of the Extension-Title.\n\n2) Extension-Groups. It would be useful if we could Group Extensions (additional... Show more", "date": "Dec 2, 2018"}, {"stars": 5, "text": "Great product. Simple. Does what it's supposed to do...well.", "date": "Dec 1, 2018"}, {"stars": 5, "text": "Wow, I have been able to quickly toggle on/off my extensions. I Recommend! (I am learning how to use profiles to switch even quicker between configurations). This extension is now a must for my workflow. I don't know how I was living without it before! Thank you", "date": "Nov 29, 2018"}, {"stars": 5, "text": "One of the most useful chrome extensions!", "date": "Nov 27, 2018"}, {"stars": 5, "text": "this is hell yeah outstanding and very f...... useful. thanks", "date": "Nov 26, 2018"}, {"stars": 4, "text": "Its funny how you need an EXTENSION to manage EXTENSIONS on chrome. God what a horribly designed browser Chrome is.", "date": "Nov 11, 2018"}, {"stars": 5, "text": "If you want to save some RAM usage this is it! The best ideas are the simplest ones. This extension is must have for people running lots of extensions but not need all of them all the time.", "date": "Nov 5, 2018"}, {"stars": 5, "text": "Must have extension.  Extension to rule all extensions :)", "date": "Nov 4, 2018"}, {"stars": 5, "text": "A must have extension for your browser! One of the best extensions ever.", "date": "Nov 1, 2018"}, {"stars": 5, "text": "Simple and useful, really a great idea and a must-have extension!", "date": "Nov 1, 2018"}, {"stars": 5, "text": "great app thanks!", "date": "Oct 26, 2018"}, {"stars": 5, "text": "Very useful", "date": "Oct 24, 2018"}, {"stars": 4, "text": "Good Stuff,  I've noticed a reduction of usage in my CPU, memory and maybe even the internet.  As-well-as my need to use every extension I see.   It works.\n\nThanks.\n\nUpdate, this app rocks and keeps getting better. With a flick of a switch I can decrease google's sucking of all my computer's resources.  This app puts the extension to sleep or hibernates them, it does something, I don't know but I do know it rocks.", "date": "Oct 16, 2018"}, {"stars": 5, "text": "Excellent Extension! Super easy to use :)", "date": "Oct 12, 2018"}, {"stars": 5, "text": "It's grrrreat - Frosted Flakes Tiger", "date": "Oct 11, 2018"}, {"stars": 5, "text": "show", "date": "Oct 9, 2018"}, {"stars": 5, "text": "Very helpful for finding extensions and installed apps. Thanks!", "date": "Oct 8, 2018"}, {"stars": 3, "text": "It would be nice if it could launch extensions so that I could have it be the only thing showing on my bar, and use it as an extension menu.", "date": "Oct 1, 2018"}, {"stars": 5, "text": "My extensions were over running my browser, I could no longer tell what extensions I had. With 'Extensity' I have only the apps and extensions I need running, and any app extension I need takes just a second to turn on or to see if I have an extension for the project I am working on. I think this app was well thought out. I also like the 'Profile' button which is great so only my necessary extensions are on. I also enjoy the fact that it is my choice whether applications or extensions are at ... Show more", "date": "Sep 27, 2018"}, {"stars": 5, "text": "Great organizing tool for Chrome extensions.  Nice and tidy; all in one place and easy to access.", "date": "Sep 26, 2018"}, {"stars": 5, "text": "Great productivity tool for Chrome as it greatly speeds up your experience on several websites, along with being able to go virtually Extension free. I find it a great help on some financial websites that have trouble with certain extensions or those that dont quite look right, i.e. missing menus or loading screens that just loop forever. I previously had to use guest mode, or a blank Chrome profile but this is a time saver. Thanks Sergiokas for this helpful extension.", "date": "Sep 25, 2018"}, {"stars": 5, "text": "its very useful and helpful....thanks google.", "date": "Sep 23, 2018"}, {"stars": 5, "text": "I don't know how I lived without this.  I utilize this a lot because I play a few games that crash if too many extensions are available.  This allows me to move between groups of extensions as needed without any wasted time.  I currently use 3 profiles, which works for my needs.", "date": "Sep 21, 2018"}, {"stars": 2, "text": "When switching active extensions off, all extensions also get banned out of the toolbar. For someone having a few extensions in the toolbar for quick access, all of them are gone after switching them back on and have to be pulled to the toolbar via the 3dot menue. Then it's easier to quickly switch to an incognito window  via the 'Open In Incognito 0.0.3' extension with one click.", "date": "Sep 11, 2018"}, {"stars": 5, "text": "ALL the extensions and apps can be shown in it and easily to use!", "date": "Sep 8, 2018"}, {"stars": 5, "text": "Very very useful and improved regularly  👍👍👍\n\nThe dev is very responsive on Github 😊", "date": "Sep 5, 2018"}, {"stars": 5, "text": "It is just perfect! :p", "date": "Sep 2, 2018"}, {"stars": 5, "text": "this is really a great extension", "date": "Aug 23, 2018"}, {"stars": 5, "text": "very good", "date": "Aug 23, 2018"}, {"stars": 5, "text": "This is FANTASTIC. UI could be updated up a bit but functionally, it does 95% of what I want it to. If you have more than 10 extensions or don't need all of yours active at once, this is for you. Game-changer.", "date": "Aug 22, 2018"}, {"stars": 5, "text": "Loved this!!!", "date": "Aug 21, 2018"}, {"stars": 5, "text": "great", "date": "Aug 20, 2018"}, {"stars": 5, "text": "One extension to rule 'em all!", "date": "Aug 17, 2018"}, {"stars": 5, "text": "Super easy to use.  Turn on/off some or all extensions.  Works flawlessly.", "date": "Aug 16, 2018"}, {"stars": 5, "text": "it is awsome", "date": "Aug 16, 2018"}, {"stars": 5, "text": "it's super nice to keep the clutter of extinctions.", "date": "Aug 11, 2018"}, {"stars": 5, "text": "A Handy tool!!!", "date": "Aug 10, 2018"}, {"stars": 5, "text": "I'm using a Chromebook and find it useful to prevent from using too much memory on it.", "date": "Aug 10, 2018"}, {"stars": 5, "text": "One-click to enable/disable is just perfect.", "date": "Aug 3, 2018"}, {"stars": 5, "text": "By far one of the best addons for Chrome and one of the most unrated ones too.", "date": "Aug 1, 2018"}, {"stars": 5, "text": "This thing rocks! Very nicely done... plus it's opensource, so you can see how it works!\n\nhttps://github.com/sergiokas/Extensity", "date": "Aug 1, 2018"}, {"stars": 5, "text": "Really useful!!", "date": "Jul 26, 2018"}, {"stars": 5, "text": "I love that you can pick which apps to turn off and on quickly from toolbar", "date": "Jul 25, 2018"}, {"stars": 5, "text": "It frees up a lot of CPU and memory!!!", "date": "Jul 23, 2018"}, {"stars": 5, "text": "cool", "date": "Jul 19, 2018"}, {"stars": 5, "text": "I have been using this for years and love it. Just getting around to rating it.", "date": "Jul 18, 2018"}, {"stars": 5, "text": "It's pretty useful for managing extensions", "date": "Jul 17, 2018"}, {"stars": 5, "text": "Love it.  Much faster than going into settings.", "date": "Jul 16, 2018"}, {"stars": 4, "text": "I think it just show the button with logo of extension. It will make the interface smaller.", "date": "Jul 12, 2018"}, {"stars": 5, "text": "I'm Glad that i found this extension thanks to @ThioJoe", "date": "Jul 3, 2018"}, {"stars": 4, "text": "nice way to organize all your needs in one place like a bucket.", "date": "Jul 2, 2018"}, {"stars": 5, "text": "loved it .. must have extension for nerds like me", "date": "Jun 29, 2018"}, {"stars": 4, "text": "So far so good..actually i love it!", "date": "Jun 28, 2018"}, {"stars": 5, "text": "SO MUCH MORE EASY STOP WASTING TIME DOWNLOAD THIS NOW! GO!..... YES I AM TELL YOU TO DOWNLOAD IT!", "date": "Jun 23, 2018"}, {"stars": 5, "text": "Absolutely essential to have and this works beautifully!\nSimple and brilliant! No more 100+ extensions covering the whole northern hemisphere of my screen while in chrome!!", "date": "Jun 18, 2018"}, {"stars": 5, "text": "Best Bookmark manager I found so far.", "date": "Jun 18, 2018"}, {"stars": 5, "text": "simple chrome extensions pile up and slow down computer speed. \n\nExtensity allows me to go 1 place for any extension I need and it's free. \n\nThe King Of Extensions.", "date": "Jun 16, 2018"}, {"stars": 4, "text": "Pretty good, just missing the functionality to retain extensions positioning. I understand this to be a limitation of Chrome, but perhaps you could put a toggle button on each extension in the app's list, and make the default title click option open the  pop out window of each extension? This we we can just use Extensity as the 'extension drawer'", "date": "Jun 15, 2018"}, {"stars": 5, "text": "Really useful !!!", "date": "Jun 15, 2018"}, {"stars": 5, "text": "Quick access to turn on/off extensions...don't need more when you've installed so many.", "date": "Jun 10, 2018"}, {"stars": 5, "text": "This is amazing! I love it!\nIt's incredibly useful and I find new possibilities every time I try. In example I created a profile called facebook in which I activate all my facebook extensions exclusively, and another called Youtube which toggles all of my many youtube extensions exclusively, and another named Webclippers where, well... you got the idea. It saves a lot of resources, by not having all my many many addons active at the same time. Thanks a lot! I can't believe it's not butter! PS... Show more", "date": "Jun 8, 2018"}, {"stars": 3, "text": "It does the job of easily turning stuff on/off as needed, but it doesn't put them back where I'd like them to be. Half are on the page and the other half are  on the hidden extension portion. \n\nI have specific items shown all the time and when they are active they always revert back to where I want them to be. This extension screws that up and sometimes opens them to the hidden portion instead of the onscreen portion.", "date": "Jun 7, 2018"}, {"stars": 5, "text": "This is a must have extension. Does the job beautifully.", "date": "Jun 6, 2018"}, {"stars": 5, "text": "Thank you for this", "date": "Jun 2, 2018"}, {"stars": 5, "text": "New user, very pleased.", "date": "May 31, 2018"}, {"stars": 5, "text": "Works perfectly, amazing extension really. Good job!", "date": "May 28, 2018"}, {"stars": 5, "text": "love it. i have too many extensions and my mem usage for chrome alone goes up to 2GB, which is insane. (Edge has the tendency to copy this behavior.)", "date": "May 28, 2018"}, {"stars": 5, "text": "It's fantastic", "date": "May 26, 2018"}, {"stars": 5, "text": "very useful extension for Chrome browser, thanks a lot!@", "date": "May 25, 2018"}, {"stars": 5, "text": "This is essential for anyone who uses extensions... \nGreat tool for managing your other extensions and keeping chrome under control.\n\nThere are so many awesome chrome extensions out there, many you rarely use - save memory and quickly turn them on/off only when you need them. Sometimes you want to try a few addons and work out which suits you best - this makes it easy.\n\nYou can also create multiple profiles (extension sets) like one for testing, a lean low memory mode or a high functionality ... Show more", "date": "May 22, 2018"}, {"stars": 5, "text": "So far, the best extension manager I've come across. What distinguishes this from  other extensions is its ability to create as many custom groups/profiles as you like, as easily you like, and as smoothly as you like. \n\n5/5 stars. Great job by the developers.", "date": "May 21, 2018"}, {"stars": 5, "text": "All was ok with the extension before the latest chrome update. Now its window keeps opening/closing with lightning speed when the extension icon is clicked. There's no chance to activate/deactivate any extension. Your extension is the best way to control others. I give you 5 stars so please fix it.\n\nThe problem is on windows 10 x64. On ubuntu mate 16.04 all is ok.", "date": "May 17, 2018"}, {"stars": 5, "text": "Great Application simple works perfectly, made me even realize what apps I had installed on chrome that I just completely forgot about", "date": "May 16, 2018"}, {"stars": 5, "text": "Very convenient", "date": "May 10, 2018"}, {"stars": 5, "text": "It does what it says. It is so simple, a no brainer. This is the best solution for holding onto those obscure extensions that are useful once in a while, but slow down Chrome all the rest of the time. I even deactivate the extensions I do use on a regular basis to speed things up.  It is so quick and easy to turn your extensions on and off. Also, check out it's options. Why didn't Chrome build this functionality into their extensions in the first place.", "date": "May 9, 2018"}, {"stars": 4, "text": "Installed today. I like it so far. Very helpful keeping only needed extensions active so chrome uses less memory. Also cleaner look of browser header.\n\nOne issue: I have setup two profiles so far. I noticed there is no way to tell which profile is active in the profile list. I have to look at the active extensions to tell. Please add this feature.\n\nThanks", "date": "May 6, 2018"}, {"stars": 5, "text": "I can't imagine using my browser without this extension. 10/10", "date": "May 5, 2018"}, {"stars": 5, "text": "This is exactly what I was looking for. Simple, works, perfect. Thanks!", "date": "May 3, 2018"}, {"stars": 5, "text": "I love it.. but i want one more option to make change in position up and down accordingly.", "date": "Apr 30, 2018"}, {"stars": 5, "text": "Works great :)", "date": "Apr 29, 2018"}, {"stars": 5, "text": "Easily my favorite extension, especially with the ability to set profiles! Thank you for creating this!", "date": "Apr 29, 2018"}, {"stars": 5, "text": "Super simple to use, just click what you want to activate/deactivate. I have also just realized you can group related extensions together which is extremely useful. This is a must have extension", "date": "Apr 27, 2018"}, {"stars": 5, "text": "I like it because you can disable quickly extension. For me, google sync across devices is nice but i have the problem of prefering different groups of extension in each device. THis extension helps me to quickly toggle them", "date": "Apr 21, 2018"}, {"stars": 5, "text": "perfect used so many extension manager this one is best!!!", "date": "Apr 20, 2018"}, {"stars": 5, "text": "Great extension, thank you for your hard-work. I only have a small suggestion. in the menu drop-down, it should highlight the profile in use. That's it. Again, thank you!\n\nEdit: Thank you, Sergio, looking forward to that!", "date": "Apr 17, 2018"}, {"stars": 5, "text": "Amazing..I love it there's so much joy now that I have this extension. When I first got this extension it was different than the others, it has touched me in more ways then I could ever explain. Whenever I have it enabled it brings out emotions that are so very deep..I laugh and then cry.  Extensity has brought out the best and worst of me, but we know that we're perfect as a team..I highly recommend Extensity. Let the emotions begin.", "date": "Apr 7, 2018"}, {"stars": 5, "text": "I tried the new firefox but couldnt live without Extensity!", "date": "Apr 6, 2018"}, {"stars": 5, "text": "10/10\nbest best best", "date": "Mar 27, 2018"}, {"stars": 5, "text": "i love this extension, everything look clean now", "date": "Mar 25, 2018"}, {"stars": 4, "text": "Very good, but I can't see why instead of profiles, you can add/remove extensions in groups, which would make a lot more sense to me.  Keeping profiles updated is a lot of hassle, while there are groups of extensions that I want to turn on while I am doing something in particular, in addition to my core extensions, which I want enabled all the time.", "date": "Mar 10, 2018"}, {"stars": 5, "text": "great tool; cant believe its a free app. very generous of the developer. thank you!", "date": "Mar 1, 2018"}, {"stars": 5, "text": "Excellent, one of the few things I've paid to support. FAST switching on and off of extensions.", "date": "Feb 28, 2018"}, {"stars": 2, "text": "It too much slow.", "date": "Feb 27, 2018"}, {"stars": 5, "text": "Excellent, lightweight and so far no problems nice neat design", "date": "Feb 21, 2018"}, {"stars": 5, "text": "Great,I was looking For it", "date": "Feb 19, 2018"}, {"stars": 5, "text": "brings amazing functionality to using extensions - just put the Exensity Icon at the far right of the extension list and activate and deactivate  as needed... the apps launcher is bonus\nBig Thank You to developer(s)!", "date": "Feb 8, 2018"}, {"stars": 5, "text": "Awesome extension that really does what no other ext does. Its essential!", "date": "Feb 5, 2018"}, {"stars": 5, "text": "Leaving numerous extension enabled all the time tends to slow things down.  Now I can enable what I need when I need it.", "date": "Feb 4, 2018"}, {"stars": 5, "text": "I'm using it since two years now.", "date": "Jan 30, 2018"}, {"stars": 4, "text": "Great extension and just what I was looking for to help manage large number of extensions I installed! \n\nHowever, a neutral icon would have been better. It takes a while to find the Extensity icon among similar looking icons.", "date": "Jan 29, 2018"}, {"stars": 5, "text": "Looks real good so far, tho I cannot see to find where to perform these functions: (1)* Turn all extensions off (and back on) with a single click.\n(2) * Quick switch between several extensions groups using the Profiles feature.\n\nOK Guys, was a journey but think I got those two above features OK. \n\nIf I could get to a Help and \"How To\" page, please let me know. Thanks, Jim\n\nUpdate: AHhh Top panel @ the slider does all ext's with well placed click..a start I'd say.\n\nDoes really really great job... Show more", "date": "Jan 25, 2018"}, {"stars": 4, "text": "Could give 5 Stars but, there is one issue. Profile is not functioning as it should. It activates all the addons added into any profile but, then it does not deactivate all when you click back on the same profile.", "date": "Jan 15, 2018"}, {"stars": 5, "text": "Loved It.", "date": "Jan 11, 2018"}, {"stars": 4, "text": "I really like it. Some suggestions: 1) I'd like the feature to rename or copy existing profiles. 2) It would also be good to have the description of the extensions when deciding to enable / disable it in the profile. 3) Maybe you should include an \"enabled in all profiles\" button for the most important extensions.", "date": "Jan 7, 2018"}, {"stars": 5, "text": "Thanks a lot for this extremely useful extension! Love this!", "date": "Jan 4, 2018"}, {"stars": 4, "text": "Awesome profile feature. Very useful. Thanks! 👌", "date": "Jan 3, 2018"}, {"stars": 5, "text": "Exactly what I was looking for.  Easy to use and easy to enable and disable extensions with one click.    Perfect for someone like me who wants to try a bunch of different extensions without them hogging all of the system resources.  Thank you.", "date": "Jan 1, 2018"}, {"stars": 5, "text": "just one feature I REALLY want added, can you add a feature where if I go to a website a profile automatically goes on? Would greatly appreciate since I have a slow PC. Thanks! Still a great extension though. Keep up the good work!", "date": "Jan 1, 2018"}, {"stars": 3, "text": "The extension is great except for 1 big whole. There is no way to sync your settings between computers. In today's world with many people having many computers and having to manually setup your groups on each computer its a real pain. Also if you to need the rebuild your computer the same thing will happen. If this omission is fixed it will be a 5 star extension until then i think 3 stars is a fitting rating. I ended up uninstalling it and going to a similar extension that has syncing capabil... Show more", "date": "Dec 31, 2017"}, {"stars": 1, "text": "With no buttons to access extensions' settings or to delete them, this extension is very limited. To the point of being useless.", "date": "Dec 31, 2017"}, {"stars": 5, "text": "Love this.  I have way too many extensions but need them mostly for wiork and forget which ones I have most of the time.  This just saved me a ton of time and hassles.", "date": "Dec 29, 2017"}, {"stars": 5, "text": "I've been looking for something like this.So easy to use and takes the clutter out! Thank you!", "date": "Dec 23, 2017"}, {"stars": 4, "text": "You know those couple of extensions that are very useful for some special purpose but not generally, and that may or may not be a real pain when not needed? Extensity wrangles them for me with her quick wits and brawny arms. I have also used this in (chrome-based) Opera and would recommend it in either browser.", "date": "Dec 19, 2017"}, {"stars": 5, "text": "REALLY useful! thank you very much", "date": "Dec 17, 2017"}, {"stars": 5, "text": "Love the concept and functionality! \n\nBrad", "date": "Dec 13, 2017"}, {"stars": 5, "text": "It works very well, a simple clic and you can enable/disable any extension.\nThe only missing feature is the possibility to create groups of extensions. I'm waiting for the implementation ;)", "date": "Dec 8, 2017"}, {"stars": 5, "text": "clean and simple", "date": "Dec 7, 2017"}, {"stars": 2, "text": "If you add key shortcut to enable profiles, this extension will be the best.", "date": "Dec 4, 2017"}, {"stars": 5, "text": "Special Thanks!!!", "date": "Dec 1, 2017"}, {"stars": 5, "text": "Useful. Well designed. Does what it claims it will. Thanks", "date": "Nov 30, 2017"}, {"stars": 3, "text": "When I disabled and then enabled extensions, extensions weren't in toolbar (as before disabling) but in menu. Disabling/enabling works properly.", "date": "Nov 29, 2017"}, {"stars": 5, "text": "Great idea, I needed this so bad.", "date": "Nov 29, 2017"}, {"stars": 5, "text": "Thanks", "date": "Nov 22, 2017"}, {"stars": 5, "text": "Extremely useful, saves you a lot of time and runs absolutely reliably.", "date": "Nov 15, 2017"}, {"stars": 5, "text": "Excellent!", "date": "Nov 14, 2017"}, {"stars": 5, "text": "Great extension!!!", "date": "Nov 14, 2017"}, {"stars": 5, "text": "Exactly what I was looking for! I expected the ability to manage different extension profiles to be one of the primary features of an \"extension manager\". Surprisingly, I had to try and reject several products before discovering Extensity, and it works perfectly!", "date": "Nov 8, 2017"}, {"stars": 4, "text": "4 stars, the app is one of the best for what it does. The only lack it has to get 5 stars is that it needs a custom group function where the user can make its own groups to group his extensions and addons on. It would also be interesting if you could make it so that the groups could close and open as if folder in a tree in a computer, that way you could have all groups clean and nicely put.\n\nPS: If it had that function I would stop using \"SimpleExtManager\" at the same time too. Right now I us... Show more", "date": "Nov 4, 2017"}, {"stars": 5, "text": "When I was hit by too many extensions, this is one extension to rule the rest.", "date": "Oct 27, 2017"}, {"stars": 5, "text": "This is a great tool to assist in keeping my browser as clean as possible - allowing me to easily turn on the features I need and turn off the ones that I don't.", "date": "Oct 25, 2017"}, {"stars": 5, "text": "Thanks for this great extension. It's so quick and informative.", "date": "Oct 19, 2017"}, {"stars": 5, "text": "This makes it WAAAY easier for me to manage my extensions without having going to my extension options which takes ages to go to, this extension makes it easy as pie! :D\n\nThank you very much for making such program i love it!!!!", "date": "Oct 12, 2017"}, {"stars": 5, "text": "REALLY useful!!!", "date": "Oct 9, 2017"}, {"stars": 5, "text": "This is an indispensable extension for committed Chrome users. It's an ingenious way of accessing and managing your extensions and apps.\nOne of the most useful active extensions I've got.", "date": "Oct 9, 2017"}, {"stars": 5, "text": "Awesome extension. Works really well.  Use it daily.  Love I can pick individual extensions to load or just block them all.", "date": "Oct 3, 2017"}, {"stars": 5, "text": "Indeed it does its job very well.Well Done Guys.", "date": "Sep 27, 2017"}, {"stars": 5, "text": "Nice one. Quickly I can turn off or on Chrome extensions.", "date": "Sep 20, 2017"}, {"stars": 5, "text": "Turns extensions on and off.  A real memory saver and brilliant way to manage extensions.  A must if you use a multiple of extensions.", "date": "Sep 18, 2017"}, {"stars": 4, "text": "Love the functionality. One question though: why does it need permission to read my browsing history?", "date": "Sep 15, 2017"}, {"stars": 4, "text": "Before I say anything else -\n\nThis is a fanTAStic little tool. If you have more than even just 5 extensions, I really recommend you get this; you won't regret it :)\n\nMoving on - \n\nThe one and only thing missing from this is a cloud-sync feature. \nI'm about to reinstall my OS and it took me a while to find the necessary Extensity files to backup my profiles and settings.\n\nFor anyone interested, copy the following files from the Local Storage folder inside your Chrome's Default folder:\nchrome-e... Show more", "date": "Sep 15, 2017"}, {"stars": 5, "text": "It can organize all your extensions it is just amazing", "date": "Sep 11, 2017"}, {"stars": 5, "text": "Best plugin ever!", "date": "Sep 4, 2017"}, {"stars": 5, "text": "great app, works like it says!", "date": "Sep 4, 2017"}, {"stars": 5, "text": "Fantastic just what I needed so now I can remove some extensions and see them in Extensity", "date": "Aug 27, 2017"}, {"stars": 5, "text": "Super", "date": "Aug 11, 2017"}, {"stars": 1, "text": "it sucks", "date": "Aug 10, 2017"}, {"stars": 5, "text": "Great for getting lasting battery on my ChromeOS device. I use a lot of extensions and didn't really want to uninstall them even if they were hard on my battery. Disabling except for when I need them solved the problem thanks to Extensity.", "date": "Aug 9, 2017"}, {"stars": 5, "text": "Absolutely fantastic - thank you! Having Profiles was a nice surprise.", "date": "Aug 8, 2017"}, {"stars": 5, "text": "Works like no other!", "date": "Aug 5, 2017"}, {"stars": 5, "text": "This is an essential extension for dedicated Chrome users. It's a  swift way of managing your extensions and accessing your apps. \n\nI love trying new extensions and use them for many things; to optimize my browsing experience, to improve productivity, to integrate services and apps and to utilize developer tools when working. But the extensions stack up and can start to eat up memory. \n\nExtensity's neat list of just the extension names solves a lot of problems already. You can choose to group... Show more", "date": "Jul 23, 2017"}, {"stars": 5, "text": "This is soo easy and AWESOME", "date": "Jul 16, 2017"}, {"stars": 5, "text": "Great! I turn on/off lesser used extensions and have my connected apps right at hand. Very handy.", "date": "Jul 13, 2017"}, {"stars": 5, "text": "Great extension, even signed up as a donator! \n\nLoving the convenience of it since I run a lot of entensions but dont use most of them regularly enough so this reeaally helps keep it clean. \n\nGonna go ahead and give it 5 stars, two thumbs up and a high five for the devs!", "date": "Jul 4, 2017"}, {"stars": 5, "text": "Just what I needed.", "date": "Jul 1, 2017"}, {"stars": 5, "text": "Smooth as Silk!", "date": "Jun 8, 2017"}, {"stars": 5, "text": "a grate one...", "date": "May 19, 2017"}, {"stars": 5, "text": "can active multiple profiles ?", "date": "May 18, 2017"}, {"stars": 5, "text": "It's perfect.  \nContinuous development with improvements.\nNot a security risk.\nDonate people!  It doesn't get better than this.", "date": "May 11, 2017"}, {"stars": 5, "text": "This app is exactly what I needed. An extension to disable extensions. The part I was looking for is the profiles feature. No other extension has this option. This has easily became my top fav extensions for every day use!", "date": "May 8, 2017"}, {"stars": 5, "text": "Does what it says...\nShort answers and honesty is underrated!", "date": "May 2, 2017"}, {"stars": 5, "text": "super", "date": "May 2, 2017"}, {"stars": 5, "text": "Browsing history scared me off but open source and mentioned linked to manifest checks out.  Thanks for this!", "date": "Apr 29, 2017"}, {"stars": 5, "text": "i have been searching for this extension all my life!!! i wonder why google won't put you in the editor's choice list. Keep up with the great job.", "date": "Apr 24, 2017"}, {"stars": 5, "text": "great easy to use does what it says", "date": "Apr 1, 2017"}, {"stars": 5, "text": "i just love it.\nGreat app. Just one request, Add to uninstall extension.", "date": "Mar 26, 2017"}, {"stars": 5, "text": "Far and above the most used extension I have. Thank you so much!", "date": "Mar 26, 2017"}, {"stars": 5, "text": "great, it`s very functional", "date": "Mar 25, 2017"}, {"stars": 5, "text": "Awesome app guys. Behaves as intended, and the ''profiles'' option is brilliant. Sending support. CHEERS !!", "date": "Mar 13, 2017"}, {"stars": 4, "text": "It's handy but needs more. I like that left clicking on an ext in the drop down menu disables or enables it, but why is there no right click options? When I right click on an ext in the toolbar I can go to the options for that ext. Why isn't that implemented in Extensity?", "date": "Mar 13, 2017"}, {"stars": 5, "text": "very good~", "date": "Mar 11, 2017"}, {"stars": 5, "text": "Easy and functional. Love it!", "date": "Mar 9, 2017"}, {"stars": 5, "text": "Excellent", "date": "Mar 8, 2017"}, {"stars": 5, "text": "Handy little extension:)", "date": "Mar 6, 2017"}, {"stars": 5, "text": "Best extension to manage extensions in Chrome.", "date": "Mar 3, 2017"}, {"stars": 5, "text": "Fantastic! I love the idea of having the different Profiles for extensions. My browsing is so much more customizable than ever before. \n\nWhen i want to be private, i can be private. When i work on SEO, i can have all my tools ready and available. WHen i shop, nothing but coupons and savings slow me down.\n\nGreat Job guys!", "date": "Feb 25, 2017"}, {"stars": 5, "text": "amazing - i use it constantly...", "date": "Feb 23, 2017"}, {"stars": 5, "text": "I use it to switch between normal & safe browsing, profiles are very useful & on top is Open Source which is always great", "date": "Feb 17, 2017"}, {"stars": 4, "text": "good tool", "date": "Feb 16, 2017"}, {"stars": 5, "text": "Loveit", "date": "Feb 9, 2017"}, {"stars": 5, "text": "Simple and helpful.  Love being able to easily enable and disable apps and to see all of them in a list.", "date": "Feb 8, 2017"}, {"stars": 5, "text": "excellent!!! so easy!", "date": "Jan 23, 2017"}, {"stars": 5, "text": "At last an easy way to organize my extensions! Thank you!", "date": "Jan 17, 2017"}, {"stars": 4, "text": "THERE'S ONLY ONE THING MISSING: a Search Box.\n\nI have used a variety of Chrome extension managers which have a search box to easily locate a specific extension or App with ease by simply typing the name into a search box (like SimpleExtManager).\n\nAnd NO. This is NOT an Ad for SimpleExtManager. In fact, I prefer the look of Extensity.\n\nWITHOUT a search box, I find myself scrolling up and down to seek out a specific extension when I need to enable or disable it.\n\nThis is EXTREMELY helpful when ... Show more", "date": "Jan 14, 2017"}, {"stars": 5, "text": "Fantastic product for free, makes life very easy and a lot quicker. Great product", "date": "Jan 14, 2017"}, {"stars": 5, "text": "Great way to turn your apps on and off to save some of that RAM action! Thanks!", "date": "Jan 6, 2017"}, {"stars": 5, "text": "If like me you use multiple extensions this is the must have tool to manage them easily and effectively", "date": "Dec 22, 2016"}, {"stars": 5, "text": "Great tool for organizing and turning on and off extensions you are not using at any given time.", "date": "Dec 14, 2016"}, {"stars": 3, "text": "accurate, but too simplistic. hasn't even a search/filter feature! cannot compete with some other such extensions", "date": "Dec 11, 2016"}, {"stars": 5, "text": "great！", "date": "Dec 3, 2016"}, {"stars": 5, "text": "You know that there are a LOT of Apps & Extensions that are necessary as well as useful.  The only trouble is you can overload your resources.\n\nExtensity is a NECESSARY app as it allows you turn off your Apps & Extensions, giving you a way to lighten your resource load.\n\nThe ability to create \"Profiles\" of required Apps & Extensions is a bonus & a most helpful function.\n\nThank you for one of the best Extensions for Chrome.", "date": "Nov 22, 2016"}, {"stars": 5, "text": "Great app!", "date": "Nov 17, 2016"}, {"stars": 5, "text": "This is a MUST HAVE extension.  I set up 4 profiles: \n\n1. Super Fast Browsing: uTorrent only.\n \n2. General Browsing:  uTorrent, LastPass, Tampermonkey, Google RSS, Evernote.  \n\n3. All of #2 plus additional Google stuff.\n\n4. uTorrent, OneTab.  OneTab is great but I don't trust it enough to have access to everything all the time.\n\nI have a BUNCH of other extensions, but I rarely use them. Having them all on all the time is not only TOTALLY UNNECESSARY, but it's a RESOURCE HOG and a SECURITY RIS... Show more", "date": "Nov 8, 2016"}, {"stars": 5, "text": "Perfect for when you have 100 troll image replacers (shrek, cage, schnitzel, nigel, etc.) and want to quick disable them.\n\nwas minorly glitchy when I first got it, but its perfectly fine after 5 minutes.", "date": "Nov 1, 2016"}, {"stars": 5, "text": "Glad someone showed me this extension.  It is by far the best extension I have found for keeping my extensions and apps easily accessible.", "date": "Nov 1, 2016"}, {"stars": 5, "text": "excellent, exactly what i was looking for, AAA+++", "date": "Nov 1, 2016"}, {"stars": 5, "text": "Really useful and easy to use.", "date": "Oct 18, 2016"}, {"stars": 5, "text": "Simply the best extension for managing other extensions\nIts the best, dont waste your time with others", "date": "Oct 9, 2016"}, {"stars": 5, "text": "Beautiful! Gives me access to my extensions and apps without having to go through cumbersome menus.", "date": "Oct 3, 2016"}, {"stars": 5, "text": "yup X2", "date": "Oct 3, 2016"}, {"stars": 5, "text": "Works great!", "date": "Sep 9, 2016"}, {"stars": 5, "text": "One of the most useful extensions. Must have!", "date": "Sep 4, 2016"}, {"stars": 5, "text": "it really helps to manage plugins!", "date": "Aug 30, 2016"}, {"stars": 5, "text": "Awesome!  Would like the ability to Rename profiles, and also Import/Export profiles - although cloud sync for the profiles (synced to the Google account) would be better and more Ideal!!  Thanks!", "date": "Aug 25, 2016"}, {"stars": 5, "text": "Extensity is amazing.", "date": "Aug 22, 2016"}, {"stars": 5, "text": "The Lord of the  Extensions \n\n... this one extension Rules Them ALL\n\na PRECIOUS   Must-have   for every extension  Junkie !", "date": "Aug 20, 2016"}, {"stars": 5, "text": "brillo, does what it says on the tin, and even gives you a shortcut to app without bothering with the app search", "date": "Aug 15, 2016"}, {"stars": 5, "text": "Superb extension management that allows you to load even more Chrome extensions and deactivate/activate them with one click so your browser does not get bogged down.", "date": "Aug 1, 2016"}, {"stars": 5, "text": "A must for a power user. I can easily activate or deactivate extensions with one click!", "date": "Jul 3, 2016"}, {"stars": 5, "text": "AWESOME!", "date": "Jun 23, 2016"}, {"stars": 5, "text": "If you are like me with tons of extensions, this one is a must have.", "date": "Jun 19, 2016"}, {"stars": 5, "text": "Massive fan.", "date": "May 31, 2016"}, {"stars": 5, "text": "All-in-all, very practical and pleasant widget.\n\nAlthough, the lack of app folders makes me sad.", "date": "May 25, 2016"}, {"stars": 5, "text": "good idea", "date": "May 23, 2016"}, {"stars": 5, "text": "make it easy to play Terraria through Crouton on my chromebook with less lag", "date": "May 22, 2016"}, {"stars": 5, "text": "One of my first extension downloads for Chrome; has been invaluable since.\nLots of useful Chrome ext., this keeps all accessible and could not be easier to manage my add-on's. LUV.", "date": "May 22, 2016"}, {"stars": 5, "text": "Great extension!  I recommend it to all of my teachers!", "date": "May 20, 2016"}, {"stars": 5, "text": "Great tool! I can find all my extensions and apps without them cluttering up my screen.", "date": "May 19, 2016"}, {"stars": 5, "text": "My absolute favorite and most-used extension! It makes Chrome even better!", "date": "Apr 27, 2016"}, {"stars": 5, "text": "Super useful, compact, and practical. Taking off the traditional AdBlock has seriously sped up my device also.", "date": "Apr 23, 2016"}, {"stars": 5, "text": "Great tool!", "date": "Apr 5, 2016"}, {"stars": 4, "text": "I love it but I'm not seeing the profiles I set up ... is this a bug?", "date": "Mar 27, 2016"}, {"stars": 5, "text": "Really, really useful to be able to turn off extensions I only need very occasionally (WebEx, GotoMeeting, SoundCloud Downloader) etc. I can switch them off knowing I can switch them back on in 2 clicks. Love it.", "date": "Mar 18, 2016"}, {"stars": 5, "text": "Really amazing!", "date": "Mar 16, 2016"}, {"stars": 5, "text": "Two extensions I could never go a day without using.. OneTab, and EXTENSITY!! Seriously though, extensity is the must have tool for everyone. Anyone, from those multi-screen power users, or anyone that's just starting to explore extensions and chrome apps. Or maybe happy medium of the two..\n Especially now with the addition of profiles! It used to be one of those things that you don't realize just how easy and amazing it is until a single clip switches off 7 extensions while turning on 2. It ... Show more", "date": "Mar 14, 2016"}, {"stars": 5, "text": "A fabulous extension that really helps reduce the overheads of having many Extensions. \n\nParticularly useful when you have intrusive extensions that are only needed occasionally such as the CISCO WebEx extension.\n\nAlso good for debugging/development extensions that you don't always want cluttering up your environment & for extensions where you find them useful but aren't so certain about their reliability or security.", "date": "Mar 10, 2016"}, {"stars": 4, "text": "Partial replacement for functionality lost when Google destroyed the formerly useful extensions overflow menu and killed PageAction (Extension icons in the \"Omnibox\").\n\nI like the fact that I can turn all the extensions off with a click, but there was a brief panic when I didn't realize that my former settings were saved. Maybe an \"Are you sure: we'll save your activated extensions for later.\" for weak-kneed people like me.", "date": "Mar 5, 2016"}, {"stars": 3, "text": "Appreciate that apps are included.\n\nWould prefer ability to group extensions, sort by enabled, and uninstall.\n\nI prefer to use Manage Extensions in the meantime.", "date": "Feb 25, 2016"}, {"stars": 5, "text": "A must if you use a lot of extensions!", "date": "Feb 23, 2016"}, {"stars": 5, "text": "very useful! I love the ability to switch off/on all my extension with an only click. \nI also suggest, if possible, to have the chance to select some extensions to be immediately reactivated when switched on again. a sort of default basic extension group", "date": "Feb 23, 2016"}, {"stars": 5, "text": "Awesome!", "date": "Feb 21, 2016"}, {"stars": 5, "text": "Awesome", "date": "Feb 20, 2016"}, {"stars": 5, "text": "So helpful!!!  Thank you!", "date": "Feb 10, 2016"}, {"stars": 5, "text": "Great extension to manage....extensions!  Excellent for troubleshooting issues in Chrome to see which extensions may be causing issues.", "date": "Jan 26, 2016"}, {"stars": 5, "text": "Does its job well, no complaints.", "date": "Jan 13, 2016"}, {"stars": 5, "text": "awesome!", "date": "Jan 7, 2016"}, {"stars": 5, "text": "easy to install easy to use, solid coding - 5 stars with ease...", "date": "Dec 29, 2015"}, {"stars": 5, "text": "After a couple of weeks of use I'm updating this to a 5 because it just works w/o causing any problems\n\nIt's probably not possible but I'd love to see one that changes extensions by website visited.", "date": "Dec 16, 2015"}, {"stars": 5, "text": "A worthy tool, indeed.", "date": "Dec 12, 2015"}, {"stars": 5, "text": "thanks HelpFull", "date": "Nov 28, 2015"}, {"stars": 5, "text": "Simply awesome. A real life saver if you like me have lots of extensions you don't use often but yet don't want to uninstall.", "date": "Nov 6, 2015"}, {"stars": 5, "text": "This extension here has saved me a lot of time. I cannot imagine using Chrome without it now. My heartfelt gratitude to the creators. \nIf you are someone who makes use of many extensions, then get this one. YOU NEED IT !!", "date": "Nov 2, 2015"}, {"stars": 5, "text": "Very handy!", "date": "Oct 18, 2015"}, {"stars": 3, "text": "Was a five star extension, but applied changes do not seem to be working for me. Hopefully the dev can help me resolve the issue and I can move the rating back to 5 stars.", "date": "Oct 16, 2015"}, {"stars": 5, "text": "Very useful", "date": "Oct 13, 2015"}, {"stars": 5, "text": "Awesome!", "date": "Oct 8, 2015"}, {"stars": 5, "text": "Great way to turn extensions on and off.", "date": "Oct 6, 2015"}, {"stars": 5, "text": "i fall again .... in love with this extension.\n\ni have one beautiful suggestion. if u can set option to default extensions to run all time instead of getting switched by a temporary profile. one profile for extensions like ubock etc permamnet all time and rest profiles are temporary .", "date": "Oct 3, 2015"}, {"stars": 5, "text": "very light, no memory even used if you not click it. it auto unload after you done using it. great apps, must have", "date": "Sep 28, 2015"}, {"stars": 5, "text": "Gives quick access to adjusting extensions and has enabled me to speed up my ChromeOS/Chromebook. This is a superb app.", "date": "Sep 27, 2015"}, {"stars": 5, "text": "Must have resource to quickly and easily manage extensions", "date": "Sep 21, 2015"}, {"stars": 5, "text": "Indispensable if you have a lot of extensions. Having this extension is like having a light switch: You don't need to unscrew the bulb every time you turn the light off.", "date": "Sep 14, 2015"}, {"stars": 5, "text": "Excellent add-on. Very useful, stable and fast. Using it for years now and never had any problems.", "date": "Sep 5, 2015"}, {"stars": 5, "text": "Does what it promises, isn't ugly, and easy to use!", "date": "Aug 30, 2015"}, {"stars": 5, "text": "just starting out but looks like a BIG time saver", "date": "Aug 26, 2015"}, {"stars": 5, "text": "One of my two absolutely essential Chrome taming extensions. (The other is The Great Suspender).", "date": "Aug 15, 2015"}, {"stars": 5, "text": "Nice!  So glad I don't have to go to settings to turn Extensions On and Off!", "date": "Aug 8, 2015"}, {"stars": 5, "text": "goog stuff", "date": "Aug 5, 2015"}, {"stars": 5, "text": "Great meta-extension, thank you!!", "date": "Jul 29, 2015"}, {"stars": 5, "text": "Excellent way to manage your add ons", "date": "Jul 21, 2015"}, {"stars": 5, "text": "Great. Nice little tool that I've been looking for for a bit. It's a pain to always have to go to settings>>more tools>>extensions to see and manage my extensions. Now it's all there right at my fingertips.", "date": "Jul 17, 2015"}, {"stars": 5, "text": "This saves me a ton of time. It's an easy way to manage extensions that you don't always need to have open and taking up memory.", "date": "Jul 16, 2015"}, {"stars": 5, "text": "A convenient application which saves me a few minutes turning on and off Google Chrome extensions.", "date": "Jul 15, 2015"}, {"stars": 5, "text": "10/10-ign", "date": "Jul 15, 2015"}, {"stars": 5, "text": "Sweet! Genius!", "date": "Jul 15, 2015"}, {"stars": 5, "text": "great way to organize extensions", "date": "Jul 10, 2015"}, {"stars": 5, "text": "Positively a \"must have\"! Especially for power users of extensions. thanks.", "date": "Jul 10, 2015"}, {"stars": 5, "text": "I use Extensity every day - great \"meta-extension\"", "date": "Jun 30, 2015"}, {"stars": 5, "text": "It helps me personally, a lot in managing all the extensions. Thank you for this well planned software.", "date": "Jun 22, 2015"}, {"stars": 5, "text": "This is one of the most indispensable extensions I've used. I use it everyday. I use a lot of different extensions for different things, and I can't have them all running at once because it would slow down my browser too much. With this, I just turn them on and off as I need them. If I had to go to the extensions page and do that every time, it would really suck. This is a lifesaver, and I've never had any problems with it working properly.", "date": "Jun 22, 2015"}, {"stars": 5, "text": "Really well designed and excellent app.", "date": "Jun 14, 2015"}, {"stars": 5, "text": "WoW! A \"Must Have\" for Chrome users, as Chrome is a powerful but memory hungry browser. \nExtensity allows you to load a plethora of nifty extensions without occupying RAM space. Keep many of them off and use only the extensions you require in a particular situation with One-click enable-disable. Nifty!\nThanks Sergio. xxx", "date": "Jun 9, 2015"}, {"stars": 5, "text": "very good", "date": "Jun 8, 2015"}, {"stars": 5, "text": "Two thumbs up!", "date": "Jun 4, 2015"}, {"stars": 5, "text": "It lacks the option to turn all extensions at once and then turn them back on again. Aside from that, good work!\nEdit: You did it! Five stars!", "date": "Jun 4, 2015"}, {"stars": 5, "text": "Life change", "date": "Jun 2, 2015"}, {"stars": 5, "text": "Fantastic!", "date": "May 23, 2015"}, {"stars": 5, "text": "A must have extension to manage your extensions!", "date": "May 21, 2015"}, {"stars": 5, "text": "Excellent extension, very useful for freeing up space if you want to hide adblocker buttons from your extensions toolbar and then simply turn them on or off from Extensity. Highly recommended.", "date": "May 18, 2015"}, {"stars": 5, "text": "Its great. I luv extensions that work esp without viruses!!", "date": "May 17, 2015"}, {"stars": 5, "text": "Such a useful extension. Thank you!", "date": "May 12, 2015"}, {"stars": 5, "text": "exactly what I needed, thanks!", "date": "May 10, 2015"}, {"stars": 5, "text": "Extremely useful just to be able to activate and disable extensions on the fly.", "date": "May 7, 2015"}, {"stars": 5, "text": "Great! I don't need all extensions always up, I simply enable most of them when I need it!", "date": "May 7, 2015"}, {"stars": 5, "text": "Everyone needs this extension !!!!", "date": "Apr 6, 2015"}, {"stars": 5, "text": "Do the job in simple way, 100% works!", "date": "Mar 24, 2015"}, {"stars": 5, "text": "great extension!!  the ability to urn off other extensions is awesome!!!!!!", "date": "Mar 21, 2015"}, {"stars": 5, "text": "This is a MUST HAVE extension.", "date": "Mar 16, 2015"}, {"stars": 5, "text": "This is one of the most used extensions in my list, apart from my mouse gestures and ad-block extensions. \nChrome is a memory hungry browser, this enables me to use only the required extension in a particular situation and disable the others, whilst keeping everything. \nFurther, this enables you to experiment with the extensions. Very user-friendly way of activating and deactivating extensions with just a click, is a key advantage of this over the other extension managers.", "date": "Mar 2, 2015"}, {"stars": 5, "text": "Amazing tool!", "date": "Feb 28, 2015"}, {"stars": 5, "text": "good!", "date": "Feb 21, 2015"}, {"stars": 5, "text": "This is my favourite extension.  It has made managing my many extensions a breeze.  I love that my chrome apps are in a neat alphabetized list as well.  Thank you", "date": "Jan 13, 2015"}, {"stars": 5, "text": "practıcal,effıcıent and fast enough.all-ın-one.hıghly recommended..Congrats and Grazie.........", "date": "Jan 11, 2015"}, {"stars": 5, "text": "works fine", "date": "Dec 30, 2014"}, {"stars": 5, "text": "useful", "date": "Dec 24, 2014"}, {"stars": 5, "text": "Excellent!\n\nI keep bouncing between Extensity and One-Click Extensions Manager. \n\nIf Extensity had two features, it would be a hands-down unequivocal winner.\n\n1. 1-click 'Disable All Extensions'\n2. 1-click Groups or Profile manager\n\nI like the idea of profiles better. I need one set of extensions for everything, one for business development, and one for watching YouTube, etc.", "date": "Nov 7, 2014"}, {"stars": 5, "text": "Love it!", "date": "Oct 20, 2014"}, {"stars": 4, "text": "Useful to quickly stop and start extensions you may not want to use all the time, as well as allowing use of similar extensions that you do not wish to run at the same time, but which have separate features you find useful. i.e. SperSorter & Bookmark Sentry", "date": "Oct 7, 2014"}, {"stars": 5, "text": "Great extension allows me to access and disable other extension without having to open my extensions list and without having to have the extensions I use take over my Chrome URL bar. Thank you very much and I love the extension.", "date": "Sep 2, 2014"}, {"stars": 5, "text": "Great. Just what I need", "date": "Aug 29, 2014"}, {"stars": 5, "text": "Great extension! to make it better I would only move all switched on extensions to the top of the list.", "date": "Aug 28, 2014"}, {"stars": 5, "text": "Amazing! The only thing it needs is a \"turn off all extensions\" shortcut", "date": "Aug 23, 2014"}, {"stars": 5, "text": "OMG! THANK YOU! FINE JOB!\nIT CAN BE DONE there is an extension that i actual LOVE!!!!!!", "date": "Aug 16, 2014"}, {"stars": 4, "text": "Like this extension. It's what I needed and it does what I want to do perfectly. \nThough I wish it could disable all/selected extensions with a keyboard hotkey/trigger", "date": "Jul 31, 2014"}, {"stars": 5, "text": "I like it", "date": "Jul 10, 2014"}, {"stars": 5, "text": "easy use", "date": "Jun 24, 2014"}, {"stars": 5, "text": "Extension for extensions.Loved it.", "date": "Jun 7, 2014"}, {"stars": 5, "text": "5 stars. Really great. enables me to keep my chrome running light and enable extensions for various websites only when they are needed", "date": "May 24, 2014"}, {"stars": 5, "text": "This is the greatest thing to manager my extensions. If only there was something like this for Firefox. It really gives Chrome the winning edge in my heart.", "date": "May 17, 2014"}, {"stars": 5, "text": "I want to marry this extension.  Seriously.  This my HOLY GRAIL ADD ON.  Why am I such a weirdo about it?  It's simple ...  (que dramatic background music).   \n\n·´·★  E X T E N S I T Y ★·.·\n ＼（＾○＾）人（＾○＾）／\n\nI HOARD apps and Extensity enables my addiction.  How?  Well, before Extensity I was forced to pick a struggle: Do I want a browser that works, or do I want to click ... that... pretty blue \n[-F R E E-] button ...  pretty...\n\nAfter killing Chrome a few times and crashing my computer I stumb... Show more", "date": "May 14, 2014"}, {"stars": 3, "text": "This is not bad. But One-Click Extension Manager does it better. There should be a button to disable all extensions at once or to disable the chosen extensions. Also with one click you should be able to enable them again.", "date": "May 1, 2014"}, {"stars": 5, "text": "Only used it a short time but first impressions are \"where have you been?\" Combining app execution and extension manipulation in a one click button not only saves click time but response time as well. Is there something else out there that is better?  I only see 150 folks who rated this? Hard to believe.  thank you!", "date": "Apr 23, 2014"}, {"stars": 5, "text": "Just what I never knew I needed! Thank you so much for this!", "date": "Apr 10, 2014"}, {"stars": 5, "text": "T. Hill    March 29 2014                        All Your Extensions : All Your Apps . All In One Drop Down Side Bar. Quick , Easy       GET IT  USE IT !!!", "date": "Mar 29, 2014"}, {"stars": 5, "text": "Excellent extension app.\n\nFind all your extensions and apps in one place.  You can even see the one you have removed.", "date": "Mar 16, 2014"}, {"stars": 5, "text": "perfect extension for heavy usage of Apps n Extensions....", "date": "Feb 26, 2014"}, {"stars": 5, "text": "incredible, not sure how I ever go along without it - if you're app/extension happy like me when using Google Chrome~ then I am sure you will find this Extension a huge benefit to your browsing.", "date": "Feb 26, 2014"}, {"stars": 5, "text": "It is so helpful to me.", "date": "Feb 13, 2014"}, {"stars": 5, "text": "It would have been great if it came with little trash icon next to each item in the drop down for deleting extensions.\nAlso a online narrative sentence for each item if we place the cursor over each extension in the drop-down. the above options could be turned on or off by saving.", "date": "Feb 3, 2014"}, {"stars": 5, "text": "Extensity is the only extension that I keep on all the time, so I can activate all the other \"can't-live-without\" extensions only when I need them, and in an instant!", "date": "Jan 30, 2014"}, {"stars": 5, "text": "I downloaded a malicious extension by mistake from haukcie.tk and it disabled my google chrome extensions manager. I downloaded this awesome app and with it - i was able to disable the malicious extension, then access my google chrome extenions manager and delete it. Thanks!", "date": "Jan 28, 2014"}, {"stars": 5, "text": "Click off\nClick on\nSimple but effective, thank you!", "date": "Jan 25, 2014"}, {"stars": 3, "text": "I like this extension a lot BUT recently it is having a problem. It only shows the very end of the list. \n\nPlease fix this and it will be my favourite again.", "date": "Jan 24, 2014"}, {"stars": 5, "text": "Simple and effective. Lists all extensions. Clicking on one toggles it off. Clicking it again toggles active again. Can't beat ~that~ !\n\nThe DataRat", "date": "Jan 23, 2014"}, {"stars": 5, "text": "it doesn't show under the chrome's task manager how much memory it adds to it but i'd imagine not much just switching things on and off but it's PERFECT. i wanted so many extensions and i still add to it all the time and this is the ONLY one that's on 24/7/365 so when i browse for whatever particular extension i either need or am in the mood for is simply a click away to turn it on and change my searching and browsing experience. that being said for me is a fantastic reason to own this: it wo... Show more", "date": "Jan 22, 2014"}, {"stars": 5, "text": "This is very helpful, simply overlooked extension.", "date": "Jan 15, 2014"}, {"stars": 5, "text": "Works great!  I love turning off extensions to keep chrome fast, and this makes that easy.", "date": "Dec 20, 2013"}, {"stars": 5, "text": "incredibly useful - can keep chrome memory footprint down by turning off rarely needed extensions, knowing that I can turn them on whenever I need them", "date": "Dec 10, 2013"}, {"stars": 5, "text": "=)  Excellent!", "date": "Dec 8, 2013"}, {"stars": 5, "text": "excellent for efficiency and effective", "date": "Dec 8, 2013"}, {"stars": 5, "text": "Best extension of its type that I have found. \n\nA feature like this would make Extensity even more useful: include a search function, or make it possible to type a letter or string and automatically go to that section of extensions. \n\nAlternatively, an option to group by Extensions/Apps or Active/Inactive would be helpful.", "date": "Dec 7, 2013"}, {"stars": 5, "text": "Well done. Super simple.", "date": "Dec 7, 2013"}, {"stars": 5, "text": "Simple, Effective, Works. That's what you want from an extension. Thanks for this!", "date": "Dec 4, 2013"}, {"stars": 5, "text": "Very simple but useful extension. Anyone using a couple of extensions for chrome should get it.\n\nI would, however, like to be able to create groups for my extensions and to be able to uninstall in the extensity menu.", "date": "Nov 28, 2013"}, {"stars": 5, "text": "Great doo-hickey.", "date": "Oct 19, 2013"}, {"stars": 5, "text": "Great extension; I didn't think I needed it but now I don't know how I would get by without it!", "date": "Sep 26, 2013"}, {"stars": 5, "text": "Fantastic & simple.", "date": "Aug 8, 2013"}, {"stars": 5, "text": "This extension is very useful. You can turn other extensions on and off very quickly.", "date": "Aug 7, 2013"}, {"stars": 5, "text": "great", "date": "Aug 6, 2013"}, {"stars": 5, "text": "Unbelievably helpful! Great to manage the growing collection of extensions. Awesome!", "date": "Jul 27, 2013"}, {"stars": 4, "text": "Would be awesome if you could add some kind of \"uninstall\" gesture like right click or something like that.", "date": "Jul 25, 2013"}, {"stars": 5, "text": "Finally! A way to manage all my extensions and Chrome apps. Google left a big utility hole in the browser, and Extensity filled it.", "date": "Jul 23, 2013"}, {"stars": 1, "text": "Messed my installed theme after clicking on it's name! Now the theme won't show up and adding other themes installs those but i wasn't able to get that previously installed theme back since in Web Store says it's already installed (but won't show up) The extension should be able to undo it's own changes! And by the way why does it need to access the theme? Should do what it says nothing else!", "date": "Jul 19, 2013"}, {"stars": 5, "text": "It works...easy enough to disable and to open the extensions I want in new tab. A sure Download", "date": "Jul 18, 2013"}, {"stars": 5, "text": "great for those who have lots of occasional-use extensions and don't want it bogging chrome down", "date": "Jul 13, 2013"}, {"stars": 5, "text": "Awesome. Would be more cool if you could have favorite extensions.", "date": "Jun 13, 2013"}, {"stars": 5, "text": "wonderful!!!!!!", "date": "May 31, 2013"}, {"stars": 5, "text": "Definitely should've came with chrome. A great extension if you want to keep your other extensions in check.", "date": "May 16, 2013"}, {"stars": 4, "text": "Make the links launch-able based on customizable user preferences.", "date": "Apr 8, 2013"}, {"stars": 5, "text": "simple, faster, quick, the best", "date": "Oct 12, 2012"}, {"stars": 5, "text": "does the job simply, perfectly. Love it. Been using it for a year. The best.", "date": "Sep 29, 2012"}, {"stars": 5, "text": "Great extension will always use", "date": "Aug 9, 2012"}, {"stars": 5, "text": "Even better if it can group extensions by on and off.", "date": "Aug 7, 2012"}, {"stars": 5, "text": "EXACTLY WHAT I WAS LOOKING FOR!", "date": "May 24, 2012"}, {"stars": 5, "text": "Does what is needed. No other way I've seen to see all  my extensions. Thank you!", "date": "Dec 18, 2011"}, {"stars": 5, "text": "just what the doctor ordered! Thank you so much! <3", "date": "Nov 11, 2011"}]