[{"stars": 5, "text": "This extension is the first thing I add after installing a browser. My CPU should be running my programs and if a company wants my data they can get out their wallet and pay \"ME\" for it\n\nThank you EFF and Privacy Badger devs for helping me give the middle finger to data thieves\n\nBTW I wonder how much energy is saved by Privacy Badger that isn't being used by transferring useless ads and running javascripts???", "date": "Mar 4, 2024"}, {"stars": 4, "text": "The extension takes too much time to load after opening the browser. Aside from this problem its a good extension", "date": "Mar 1, 2024"}, {"stars": 3, "text": "Does a good job, but lacks one very basic function. Every site I go to I have to allow the Twitter frame or the Disqus frame, etc. What is needed is a way to globally allow trusted elements. Do it once globally and be done with it. \n\nWhat I do especially like is that it cleans Facebook links of all their filthy tracking information.\n\nBut the aforementioned lack is an annoyance.", "date": "Feb 12, 2024"}, {"stars": 2, "text": "This extention broke ChatGPT with error like : TypeError: Failed to execute 'getReader' on 'ReadableStream': ReadableStreamDefaultReader constructor can only accept readable streams that are not yet locked to a reader.", "date": "Feb 2, 2024"}, {"stars": 5, "text": "Been using it for years. All of my stuff, my kids and work computers. I use two other extensions in conjunction with this and the whole web gets cleaned up, and all sorts of things stop happening. I am only writing this review because of the review below from Bobby Jones. I hope Bobby gets some tech help but it ain't this extension. I am not affiliated with nor do I make any money from any of the extensions I use. I feel better when the knuckleheads at work use a station and I have all my par... Show more", "date": "Jan 26, 2024"}, {"stars": 1, "text": "Extension will not load.  Does nothing.  Tried uninstalling and reinstalling.  The extension does not respond.  It does not allow access to configurations.  It does not show it's properties.  All configuration screens are blank.  \n\nIt's dead Jim.", "date": "Nov 19, 2023"}, {"stars": 5, "text": "I loved", "date": "Nov 12, 2023"}, {"stars": 5, "text": "You barely notice it on memory but it blocks a bunch of trackers. Use this with uBlock, they're best companions.", "date": "Oct 5, 2023"}, {"stars": 5, "text": "Go EFF!", "date": "Sep 24, 2023"}, {"stars": 5, "text": "Yeah very very good!!!", "date": "Sep 16, 2023"}, {"stars": 3, "text": "Pretty please devs, STOP this insane 2-3 times popup when installing this extension!\nInstall, freaking new tab with privacy badger.\nClose browser.\nStart browser, freaking new tab with privacy badger.\nClose browser.\nStart browser, freaking new tab with privacy badger.\nAnd this has been going on for quite a while on plenty machines.", "date": "Aug 11, 2023"}, {"stars": 5, "text": "This is a better realistic privacy solution than anything else I've seen. 10/10", "date": "Aug 2, 2023"}, {"stars": 3, "text": "I can't check out with EBT at Walmart bc it says Blocked By Extension. I disabled it for WM, but it still does it. I have to turn the whole thing off. I'll try disabling on EBT site. I'll know the next time I order. If it still does it, I will find st else", "date": "Jul 28, 2023"}, {"stars": 5, "text": "This extension is approved by EFF.org one of the best non-profits fighting for online privacy and anonymity. Privacy Badger has easy to use settings to meet many needs and is easy to turn off when/if required. I appreciated the work this team has done to allow everyone to use the internet without receiving unwanted malicious codes, malware, cookies, tracking, data mining, etc.", "date": "Jun 2, 2023"}, {"stars": 5, "text": "It's pretty flippin fantastic. I mean, pages are popping in faster. All of these money hungry websites can barely see me, It's great. can't wait to tell the boss.", "date": "Apr 26, 2023"}, {"stars": 5, "text": "Brilliant! I've been looking for a way to remove the ?fbclid garbage from the end of facebook external links. Works like a charm. \n\n(Haven't investigated further yet, but this is a great start, thank you.)", "date": "Nov 9, 2022"}, {"stars": 2, "text": "Used to love it... But as of 10/31/2022 it's causing my entire browser to crash constantly! According to Windows Event Viewer:\n\n[678576:679600:1031/190114.504:WARNING:chrome_content_verifier_delegate.cc(216)] Corruption detected in extension pkehgijcmpdhfbdbbnkijodmdjhbjlgp installed at: Data\\Default\\Extensions\\pkehgijcmpdhfbdbbnkijodmdjhbjlgp\\2022.9.27_1, from webstore: 1, corruption reason: 1, should be repaired: 0, extension location: kInternal\n\nPlease fix this crucial extension!", "date": "Nov 1, 2022"}, {"stars": 5, "text": "excellent companion to uBlock origin. don't listen to the haters, they all seem to be clueless plebs. thanks eff!", "date": "Oct 14, 2022"}, {"stars": 5, "text": "A great extension to enchance your privacy a bit more", "date": "Sep 28, 2022"}, {"stars": 2, "text": "Reviews don't know what they are talking about, it breaks many website logins such as google login on Indeed.com and many other websites.  Privacy Badger blocks stuff automatically but it is coded in such a way that it breaks many things not just Google stuff but other stuff as well that is needed to make certain functions on a website to run.  It needs to be configured to know to not block font.gstatic and many other google trackers as it claims aswell.  Unfortunately privacy badger has had ... Show more", "date": "Sep 3, 2022"}, {"stars": 5, "text": "Wow, it actually works. And it works good. It will keep tap of tracking cookies and block them if it finds the same cookie on 3 sites you visit. You still need uBlock Origin to block ads, and you still need audio, canvas and font fingerprinting extensions installed if you hope to stay a little private on the web. A nice vpn like Mullvad is probably not too shabby either.", "date": "Aug 30, 2022"}, {"stars": 5, "text": "I just installed on chrome but have been using on Microsoft Edge for a year. I like it because it is seamless and does not popup or bother me while I am browsing. It is effective and learns from what you do so the more you browse the more privacy you get!", "date": "Jun 26, 2022"}, {"stars": 3, "text": "This would be great if it worked. Unfortunately, it's been breaking a LOT of sites for me in the past few months. I'm talking like work websites or donation pools. That kind of thing. I'm leaving this review before deleting the extension.", "date": "May 2, 2022"}, {"stars": 3, "text": "Some websites clearly bug because of this extension. But very good to protect our privacy.", "date": "Mar 6, 2022"}, {"stars": 5, "text": "Very useful and intuitive.", "date": "Dec 9, 2021"}, {"stars": 5, "text": "all power to the devs behind this extension", "date": "Oct 31, 2021"}, {"stars": 5, "text": "Amazing extension, a perfect addition to an ad blocker. A lot of websites these days will block access to their website if they detect an adblocker. With Privacy Badger you'll fly under the radar:-) In general I'm not against ads and understand that websites that provide valuable info need to make money but the tracking of a user across the web has gotten out of control. I'm glad that EFF came up with a solution to stop the madness. Thank you.", "date": "Oct 28, 2021"}, {"stars": 2, "text": "EFF should be able do better than this. \nThis extension offers no device spoofing, no protection from fingerprinting and dont block ads very well either. Cant see the need for this extension.", "date": "Oct 3, 2021"}, {"stars": 2, "text": "Not good enough. Not on same level as Bromite. Privacy badger still lets anyone see all info about your device, cameras, ram and canvas fingerprinting. With all fingerprinting allowed by privacy badger you are still being tracked so it is unclear what is privacy in privacy badger.", "date": "Sep 7, 2021"}, {"stars": 1, "text": "It doesn't work at all", "date": "Aug 4, 2021"}, {"stars": 5, "text": "One of the best... addon, this is the first addon which i install when I download any browser, along with https everywhere\ngreat eff team for creating this addon....\n \nEFF team if you read this review, please say hi to me....  because I will be blessed getting hi, from such great developers", "date": "Aug 1, 2021"}, {"stars": 5, "text": "Hi, Please fix google account login on websites. I can login via google account after disabling Privacy Badger, but I cannot login with PB active.", "date": "Jul 14, 2021"}, {"stars": 5, "text": "Super 👍👍", "date": "May 23, 2021"}, {"stars": 5, "text": "This extention can't detect facebook ads trackers", "date": "May 17, 2021"}, {"stars": 5, "text": "Every one should use it", "date": "May 6, 2021"}, {"stars": 5, "text": "Just love it, removes the intrusive and excessive ads. Recommended for good web experience to every user.", "date": "May 4, 2021"}, {"stars": 3, "text": "I got this extension quite recently, and while it may be doing what it says it is doing I have also had increasing difficulties with a number of basic utilities suddenly not working - particularly sound related. I can no longer listen to previews of audio books in Chirp, and Soundcloud has stopped playing entirely. Seriously, if these basic functions cannot run with PB in place I will have to delete it and take my chances.", "date": "Apr 23, 2021"}, {"stars": 5, "text": "works great. but if google is allowing this extension to be on webstore then they must have found a way out to evade the badger and is tracking us.??", "date": "Apr 6, 2021"}, {"stars": 3, "text": "Works OK but needs a snooze feature so you can completely disable the extension for a few minutes to use affiliate links. It is a pain to have to turn it off in Chrome and remember to turn it back on.", "date": "Mar 29, 2021"}, {"stars": 3, "text": "Many sites content do not load when this extension is activated. please make it less aggressive.", "date": "Mar 19, 2021"}, {"stars": 5, "text": "good app...will introduce to all of my friends", "date": "Mar 9, 2021"}, {"stars": 5, "text": "Great extension makes the browser load and render pages so much faster. i think you should make your own adblocker to work along side it that way we can be sure it will be something that won't slow down the page load and render speed.", "date": "Mar 5, 2021"}, {"stars": 5, "text": "Any alternatives for Tor Browser. Thanks!", "date": "Feb 28, 2021"}, {"stars": 5, "text": "Works great and is easy to set up.", "date": "Feb 25, 2021"}, {"stars": 5, "text": "This. Is. AMAZING!!!!!!!!!! \neff.org why don't you make more good extensions\nbut it doesn't matter! This is really good! And don't forget to install the HTTPS Everywhere!", "date": "Feb 23, 2021"}, {"stars": 5, "text": "This is AWESOME. THANK YOU FOR MAKING THIS!!!\n\nalso everybody go to https://www.eff.org/pages/tools and get the other things created by Eff.org\nthey are really good", "date": "Feb 17, 2021"}, {"stars": 4, "text": "I don't know witch extension has problems but it's crashing because of (local cdn) again and again in kiwi browser", "date": "Feb 7, 2021"}, {"stars": 5, "text": "Great add-on! If it's created by the Electronic Frontier Foundation and recommended by PrivacyTools.io, it's good on my book. If you haven't checked them out, they have other solid privacy recommendations.", "date": "Feb 7, 2021"}, {"stars": 1, "text": "blocks captcha", "date": "Jan 16, 2021"}, {"stars": 5, "text": "This extension best with Advanced Mode :>", "date": "Jan 4, 2021"}, {"stars": 5, "text": "Amazing extension", "date": "Dec 29, 2020"}, {"stars": 5, "text": "Very good!", "date": "Nov 27, 2020"}, {"stars": 5, "text": "it's so good for my laptop, because i'm a hacker and i don't know other hacker tracking me or not", "date": "Nov 14, 2020"}, {"stars": 3, "text": "Starting today, this extension is causing a background 10-15 percent CPU utilization on an i7-8700 CPU system running Windows 10 Professional (latest patches), Chrome 86.0.4240.111, and Privacy Badger 2020.10.7. The only thing that was updated yesterday was my nVidia driver.\n\nI've always been a fan of this extension, but for now I have to disable it. It runs so much that the current Google Halloween page hangs and becomes unresponsive.", "date": "Oct 30, 2020"}, {"stars": 5, "text": "Never had a problem. But now, www.cbs.com sees it a an ad blocker. Since I won't turn Privacy Blocker off, I guess I won't watch CBS until I can work out how to use my Raspberry Pi to get around CBS's algorithms.", "date": "Oct 28, 2020"}, {"stars": 4, "text": "I am glad I found this app! Really good extension. The best part is - it's free.", "date": "Oct 26, 2020"}, {"stars": 1, "text": "Installed this app and my mac started using a ton of battery. After checking the activity monitor, it showed google chrome draining all its battery. Basically tried to pinpoint the error for days and ended up reseting my whole mac because I was afraid it had virus. After restarting this is the first extension I installed and guess what? After installing Privacy Badger, the draining starts all over again. DONT INSTALL SAVE YOURSELF THE PAIN", "date": "Oct 21, 2020"}, {"stars": 5, "text": "A complete must have!😍", "date": "Oct 12, 2020"}, {"stars": 1, "text": "It breaks almost all ecommerce sites I visit — images won't load, shipping calculator won't show, sometimes it breaks the entire page, as if the CSS info hadn't been loaded at all. I just got tired of reporting this problem on nearly every single shopping site I go to.", "date": "Oct 1, 2020"}, {"stars": 4, "text": "Broke more websites than the DuckDuckGo extension or my ad blocker (uBlock) but provides easy and advanced options to personalize how it works. They also take direct feedback to report that the extension broke a website. In general, I'd totally reccommend.\nUpdate Nov. 2020: Had to disable it for now as the extension is interfering with Google Login on other sites, I hope they get to fix it soon.", "date": "Sep 29, 2020"}, {"stars": 5, "text": "EXLLENT!!!!!!!!!!!!!!", "date": "Sep 13, 2020"}, {"stars": 4, "text": "great system.keep it up", "date": "Sep 9, 2020"}, {"stars": 5, "text": "Does what it says it will do well beyond my expectations. I appreciate the ability to tailor my experience across all sites I visit.  The instant feedback option on sites that do not work well with the app is a great feature that tells me the developers are truly interested in improving their product at all times.", "date": "Sep 6, 2020"}, {"stars": 5, "text": "Straight forward to use and efficiently blocks trackers as expected.", "date": "Sep 3, 2020"}, {"stars": 5, "text": "I like this extension", "date": "Aug 30, 2020"}, {"stars": 5, "text": "Good", "date": "Aug 20, 2020"}, {"stars": 5, "text": "It is so powerful", "date": "Aug 10, 2020"}, {"stars": 4, "text": "Facing troubles with websites which uses Tawk.to", "date": "Aug 7, 2020"}, {"stars": 5, "text": "good for privacy", "date": "Jul 21, 2020"}, {"stars": 5, "text": "It seems to work pretty well.", "date": "Jul 11, 2020"}, {"stars": 5, "text": "EFF EFF EFF!  What more do you want, does what it says - dah", "date": "Jul 1, 2020"}, {"stars": 5, "text": "Privacy badger is a must have tool! Everybody concerned about their security should get this one.", "date": "Jun 29, 2020"}, {"stars": 5, "text": "NICE!!!!", "date": "Apr 9, 2020"}, {"stars": 1, "text": "If you want the web to not work right, then this is the tool to achieve that goal.\n\nYou'll spend hours scratching your head as to why a spinning icon is appearing over something as simple as Amazon Pay boxes on a website implementing Amazon's payment system before you realise that this extension is causing it - sometimes you forget to check this extension and waste a lot of time and refreshing trying to make a website work.\n\nFor example: I seen the Amazon \"sign in\" pop up window after checkin... Show more", "date": "Mar 26, 2020"}, {"stars": 5, "text": "FANTASTIC app for killing tracking sites and cookies.  I use it WITH AdBlock Plus and Disconnect.  All 3 in combination is a PERFECT way to have full control of security.  I personally also recommend blocking cookies and javascript BY DEFAULT and only allow it on sites you want/intend to visit.", "date": "Mar 23, 2020"}, {"stars": 2, "text": "Breaks the ability to add youtube videos to your watch later playlist from embedded sources.\n\nFor this alone, I'm removing it.", "date": "Dec 3, 2019"}, {"stars": 5, "text": "Easy to use and allows customization to what trackers you wish to unblock for whatever reason you would need that.", "date": "Nov 27, 2019"}, {"stars": 5, "text": "super", "date": "Nov 27, 2019"}, {"stars": 5, "text": "The thing works as expected, protects your privacy, and speeds up your browsing.  Best extension on the web, in my opinion.", "date": "Nov 23, 2019"}, {"stars": 4, "text": "does the job", "date": "Nov 10, 2019"}, {"stars": 3, "text": "I just installed so I'll give it ⭐⭐⭐ for now. Is there a way to enable a tracker on one site, but block it elsewhere? Umatrix is able to do that. For example allowing reddit resources on reddit, but blocking them on all other sites.", "date": "Nov 2, 2019"}, {"stars": 5, "text": "super awesome", "date": "Oct 18, 2019"}, {"stars": 4, "text": "I liked it, but now I can't access chrome remote desktop, even when it is disabled.  The only way to access chrome remote desktop is either disabling the extension completely or opening up in incognito mode.", "date": "Oct 12, 2019"}, {"stars": 5, "text": "The single best extension for Chrome.", "date": "Oct 3, 2019"}, {"stars": 5, "text": "Very useful extension.", "date": "Sep 23, 2019"}, {"stars": 5, "text": "This is a great extension!", "date": "Sep 10, 2019"}, {"stars": 5, "text": "You may not realise that it's a 5 star extension, until you try other tracker-blocker extensions.\n\nOnce you see how much they demand from the user, how slowly they adapt to new trackers and how little they allow you to see which trackers are permitted or not, you will cherish privacy badger dearly in comparison. It helps you tweak it with ease and after a few manual tweaks, it begins automaticlaly adapting to your style of hating tracking vs not minding tracking.", "date": "Sep 9, 2019"}, {"stars": 5, "text": "Seems that it causes crash in Chrome Canary version 78.0.3901.0", "date": "Sep 3, 2019"}, {"stars": 5, "text": "Very good! This extension also very affective at blocking ads.", "date": "Sep 3, 2019"}, {"stars": 5, "text": "I love it a lot. It does a great job behind the scenes and has the big plus of being governed by the EFF. There are rare occasions where I have to intervene (once a month?). The intervention is most of the time simple (move a slider in the popup). \n\nIt drastically improves my Internet experience on a daily basis. What could you want more?", "date": "Aug 30, 2019"}, {"stars": 1, "text": "With this extension enabled in ChrEdge (Microsoft's new Edge browser), any request triggered with `fetch` to a properly configured CORS resource would stuck in `pending` state. This rendered the extension useless for my daily work.", "date": "Aug 16, 2019"}, {"stars": 5, "text": "yes it amaszing", "date": "Aug 9, 2019"}, {"stars": 5, "text": "My internet experience in general seems to have improved since installing Privacy Badger. It is not high maintenance at all as some have claimed.  It just sits there quietly, doing its thing for the most part.\n\nI've been receiving a lot of spam lately from overseas.  I know it is because they are somehow reading my browser history because they always contain my recent key search words.  I don't have a lot of extensions and the ones I have are pretty benign I think.  The two I have some questi... Show more", "date": "Jul 24, 2019"}, {"stars": 5, "text": "Honestly, it is super handy. Makes you more aware of what is being recorded/etc.", "date": "Jul 19, 2019"}, {"stars": 1, "text": "Made the charts in tradingview all wonky/misaligned scales. Had to remove. No idea why it would have an effect.", "date": "Jul 1, 2019"}, {"stars": 5, "text": "Amazing extension!", "date": "Jun 24, 2019"}, {"stars": 3, "text": "Was working fine, but the last 2 weeks, I've been having trouble opening and saving pictures on Facebook with this enabled.", "date": "Jun 13, 2019"}, {"stars": 5, "text": "yes yes yes", "date": "Jun 12, 2019"}, {"stars": 2, "text": "It used to work fine, but now, I can't use the Spotify web player! It opens just fine, but then, it doesn't play anything!", "date": "May 27, 2019"}, {"stars": 1, "text": "Initially, it seems pretty cool.  I used it for about six months, If you read about this on some other professional reviews, you'll find something to the effect of \"It's cool, but breaks the internet experience\"  And that's kinda true.  After you install this, depending if you are a power user or facebook only internet user, be prepared to spend 5-10 minutes a day playing the \"ReCaptcha\" clicking on the picture games for literally every site you go to.  Does that sound too bad\" Well that's 30... Show more", "date": "Apr 4, 2019"}, {"stars": 5, "text": "I have used this plugin for a few years now. I use it for its primary purpose: to block trackers. It's probably not the best at ad blocking. I recommend it if you wish to protect your privacy as much as you can.\n\nThe only issue I've had is that it will break forms on some sites, but it's easy enough to disable for the site you need to use.\n\nI donate to the EFF and I hope you do too!", "date": "Mar 30, 2019"}, {"stars": 1, "text": "this prevents me from clicking on 'submit' buttons and any type of buttons like that.  can't login to paypal, etc.  worthless to me.", "date": "Mar 29, 2019"}, {"stars": 5, "text": "great product. it really does protect your privacy without getting the way.", "date": "Mar 22, 2019"}, {"stars": 5, "text": "<## Love you EFF ;-*", "date": "Mar 22, 2019"}, {"stars": 4, "text": "Well, this extension works well, but sometimes \"too well\", you have to disable it in some websites, which is annoying...anyway, thanks to the author, hope it could be better. Privacy is important for everyone.", "date": "Mar 22, 2019"}, {"stars": 2, "text": "Gmail always stalled on the loading page and couldn't figure out why. Started turning off extensions one by one and this extension was the culprit.", "date": "Mar 22, 2019"}, {"stars": 3, "text": "This extension blocks many websites' important cookies, such as qr-code when I was trying to log into my Weibo or somewhere else, which is annoying. Besides I didn't find any differences between other blocker extensions. Perhaps it's okay for its nonprofit slogan.", "date": "Mar 10, 2019"}, {"stars": 5, "text": "On second thought, Privacy Badger does a good job alongside UBO Lite or any other adblocker. Most ad blockers just show you the total blocked with no details of what the blocked ones are, Privacy Badger shows you what's blocked and you can slide block them yourself. It's a worthwhile addon to any ad blocker of your choice.", "date": "Feb 25, 2019"}, {"stars": 1, "text": "This extension adds Ads in youtube videos right before they load. They also steal info from your chrome. So beware. !!!! DO NOT USE THIS !!!!!", "date": "Feb 22, 2019"}, {"stars": 1, "text": "WebRTC Leak test (using Express VPN Leak test):\nUBlock Origin = \"Your browser doesn't support WebRTC or WebRTC has been disabled.\"\nPrivacy Badger = \"Potential Leak\"", "date": "Jan 23, 2019"}, {"stars": 4, "text": "Great Functionality and Amazing Extension", "date": "Jan 4, 2019"}, {"stars": 2, "text": "It has great functionality and is well designed so it has potential to be a great ad blocker but the amount of work required from the user is tremendous.  A user will have to turn off trackers for days as they visit various websites because Privacy Badger green lights various trackers such as google analytics or connect.facebook. \nWhat gets my 2/5 stars is that Privacy Badger outright lies and claims google analytics and connect.facebook (and various other known trackers) are not tracking you... Show more", "date": "Dec 25, 2018"}, {"stars": 4, "text": "Great extension, and worked every day for a year. Although, recently been crashing my Google Chome session on Mac. Can the team look into crash reports?", "date": "Dec 19, 2018"}, {"stars": 2, "text": "The YouTube volume and resolution are initialized.", "date": "Nov 26, 2018"}, {"stars": 5, "text": "This is truly wonderful. Does what is expected and is more effective than any add on that my antivirus forces on me.", "date": "Nov 25, 2018"}, {"stars": 5, "text": "Perfect solution to the 1981-style tracking web future we're headed for. Don't forget to get HTTPS Everywhere as well.", "date": "Nov 21, 2018"}, {"stars": 5, "text": "News websites got SOOOO much better once I installed Privacy Badger.  Thanks EFF for watching out for us.", "date": "Nov 13, 2018"}, {"stars": 5, "text": "Indispensible, amazing extension. It does break many pages, but you can just enable the sources you want and it reloads the page. It's incredible how many trackers some pages have!", "date": "Nov 12, 2018"}, {"stars": 4, "text": "Great but images now blocked on at least two sites - autotrader and motors.", "date": "Nov 8, 2018"}, {"stars": 4, "text": "The Rotten Tomatoes web-page which I use extensively started to open with no pictures.  I suspected cookies & so cleared them out but to no avail.  The next suspect was extensions &, as this was the last one added, I switched off & voila!  Rotten Tomatoes is now loading correctly.\n\nHaving 'all else failed', I've now read the instructions & disabled PB on Rotten's site & all is well. Doh!", "date": "Oct 31, 2018"}, {"stars": 4, "text": "Note that yesterday's update has broken videos using both Flash and HTML5 formats for many sites on the Chrome browser.  Disabling it on those sites (or disabling the extension) will fix the problem.  The Firefox version did not have the effect of breaking these videos.", "date": "Oct 28, 2018"}, {"stars": 4, "text": "good enough for removing tracking content", "date": "Oct 5, 2018"}, {"stars": 5, "text": "A fantastic Anti-Tracking option that is far less intrusive than most and much simpler to manage & use without breaking website functionality... This is why I recommend this particular app to all my family & friends.  Keep up the Good Work EFF!!", "date": "Sep 15, 2018"}, {"stars": 5, "text": "Love this! But can you make a way to block tracking from cookies of the website I am currently on?", "date": "Sep 3, 2018"}, {"stars": 5, "text": "Better and safer than add blockers.\n\nAdds are a good way to support websites, as long as they don't track, nor make websites slow, nor waste bandwidth and resources.", "date": "Sep 2, 2018"}, {"stars": 5, "text": "fanastic!", "date": "Aug 31, 2018"}, {"stars": 5, "text": "Stopped eleven trackers on one website.\nLaptop seems faster and\nno buffering.\nCould be coincidence.\nBut at the very least\nFacebook doesn't know what I'm doing any more.", "date": "Aug 31, 2018"}, {"stars": 1, "text": "Blocked me from opening ads I wanted to see; articles I wanted to read; etc. And when I uninstalled it, Chrome acted erratically. DO NOT INSTALL THIS. I had to re-add it to Chrome to post this review. Now I will re-uninstall it.", "date": "Aug 27, 2018"}, {"stars": 2, "text": "An absolut nightmare in the last days. Quite a few web sites not loading even when I whitelist them. Once uninstalled, everything works and at an outstangin speed.", "date": "Aug 21, 2018"}, {"stars": 5, "text": "Great tool. Might be even better in some cases then adbock. And the tracked adjustments seems amazing!", "date": "Aug 14, 2018"}, {"stars": 5, "text": "My favorite tracker-blocker. I would trust this much more than stuff like Ghostery. Keep up the good work EFF.", "date": "Aug 13, 2018"}, {"stars": 5, "text": "Must have", "date": "Aug 12, 2018"}, {"stars": 5, "text": "Although, I would love an opt-in for Google, while still blocking the rest.", "date": "Aug 9, 2018"}, {"stars": 4, "text": "I think it's a great app in general but found an issue with adding embedded youtube videos to my 'watch later' list. If I click on 'watch later as xxx' it would pop up with an \"invalid request\" error message each time. I had to go through all my plug ins to figure out what was blocking this - it's a very handy feature, when I come across a YouTube video on a random site and want to watch it later I simply add it to my Watch Later list and view it when it's convenient. \n\nFor now, I have disabl... Show more", "date": "Jul 17, 2018"}, {"stars": 3, "text": "Not compatible with the Adguard :(", "date": "Jul 15, 2018"}, {"stars": 5, "text": "This extension is awesome. I always hated seeing ads for products or pages I just visited, its pretty obvious your activity is being tracked which really annoyed me. Anyways this totally solves that but it will also make you realize just how much you're tracked and by what websites/services. (PS. its scary)\n\nSometimes it can make certain website functions not appear or work properly but its easy to either allow that function or just white list the site.\n\nanyone who uses the internet should ha... Show more", "date": "Jul 11, 2018"}, {"stars": 1, "text": "Broke tumblr. Disabled it and the site is still not working. Most pictures and icons will not load. This was not an issue before this extension. While it was still enabled if i messed with the setting a few pictures would return, decided to get rid of it to fix the whole site. It did NOT WORK.", "date": "Jul 6, 2018"}, {"stars": 5, "text": "great", "date": "Jun 12, 2018"}, {"stars": 5, "text": "It starts to twitch on some sites and does not allow the use of switches.", "date": "Jun 10, 2018"}, {"stars": 1, "text": "Breaks 60-70% of all websites. Horrible little bugger.", "date": "Jun 9, 2018"}, {"stars": 3, "text": "On the settings page --> tracking domains list, you scroll down the list and move the tracking slider for each domain manually. Annoyingly, when you move the slider for a domain, you are auto-returned to the top of that list, meaning one has to re-scroll back down the list each time the slider is moved. Very frustrating when a large number of domains need adjustments to their tracking setting.", "date": "Jun 5, 2018"}, {"stars": 1, "text": "does not disable by default tracking on every page, need to disable tracker for every page manuel and even every source manuel. So what is the purpice?", "date": "May 27, 2018"}, {"stars": 5, "text": "Works well, I like how it learns which trackers are bad or good and adjusts accordingly to keep your browser and personal data safe! I have stopped use a adblocker because this works so well. Because a lot of advisements have malware trackers in them  , it's has stopped ads on Youtube.", "date": "May 27, 2018"}, {"stars": 5, "text": "Since it is from EFF, I know it is legitimate in its desire to protect my privacy.", "date": "May 26, 2018"}, {"stars": 5, "text": "Seems to work fine.\nSometimes I have to disable it to see needed content.\nBut that just tells me it is doing its job.\nI always have it on.", "date": "Apr 20, 2018"}, {"stars": 3, "text": "Good idea. \nUnfortunately does not block and does not even know of tracking of Yandex.Direct network.", "date": "Apr 18, 2018"}, {"stars": 1, "text": "Used to work great, but now it doesn't block anything.  What happened?", "date": "Mar 22, 2018"}, {"stars": 5, "text": "Love the app but it seems to be breaking images in google docs and google slides right now. Things like that mean that I occasionally have fight with settings I would rather not have to deal with.", "date": "Mar 14, 2018"}, {"stars": 5, "text": "With this latest chrome it is broken. I get black splotches on the page.", "date": "Mar 13, 2018"}, {"stars": 5, "text": "Love it you will not be disappointed.", "date": "Mar 8, 2018"}, {"stars": 4, "text": "works well for the simple stuff I do, causes bugs on some pages but all you have to do is toggle with the blocking settings so that's not a big deal.", "date": "Mar 6, 2018"}, {"stars": 5, "text": "good in 8.1", "date": "Mar 6, 2018"}, {"stars": 3, "text": "Not really suitable for first-line defense yet.\nNeeds more specialisation, research, and aggression. ~Okay for average users.", "date": "Mar 3, 2018"}, {"stars": 3, "text": "на panopticlick.eff.or не проходит:\n\"Does your browser unblock 3rd parties that promise to honor Do Not Track?\"\n\"Does your browser protect from fingerprinting?\"", "date": "Mar 2, 2018"}, {"stars": 5, "text": "It is great so far! Don't be alarmed when at first all tracker sites show as green. Once it realizes that a tracker follows you to other websites, it disables it. \n\nI tested it on a few privacy testing websites and it performed well.", "date": "Mar 2, 2018"}, {"stars": 2, "text": "I'm not sure how effective it is. It allows some trackers that it considers to be okay. Also, having it seems redundant if you're using uBlock Origin.", "date": "Feb 17, 2018"}, {"stars": 5, "text": "Privacy is Important , sharing is okay, but only with transparency", "date": "Feb 7, 2018"}, {"stars": 5, "text": "so far, so good.", "date": "Jan 25, 2018"}, {"stars": 5, "text": "Users should decide what extension to enable, independently. Latest Chrome version 64 forced it to unable. Found new Privacy Badger here in the store, whew.", "date": "Jan 25, 2018"}, {"stars": 1, "text": "I installed this and when I go to Extensions I get a warning that says \"Not From Chrome Web Store\", even though I added it from Chrome Web Store.", "date": "Jan 22, 2018"}, {"stars": 5, "text": "Great Stuff !", "date": "Jan 18, 2018"}, {"stars": 3, "text": "It basically works well but if your militant about blocking the deluge of junk being forced into your browsing experience then you may think Badger lets to much through by default. In a sense it does, as it requires you to be actively (pro-actively) adjusting the settings to suite your preferences which gets a bit tedious.", "date": "Jan 12, 2018"}, {"stars": 1, "text": "It whitelists every single ad company tracker. You have to manually set everything which means those crappy ad companies already got some of your data.", "date": "Jan 12, 2018"}, {"stars": 5, "text": "I've been using privacy badger for a while, It does what it's advertised to too, and not much of a hassle to deal with.\nEasy 5 stars in my book.", "date": "Jan 8, 2018"}, {"stars": 4, "text": "Works well enough to not destroy my experience online. I wonder why it keeps giving me message \"Not from Chrome Web Store\" when I look at the information about it, although it clearly came from the webstore.", "date": "Jan 5, 2018"}, {"stars": 1, "text": "It used to work, now it just green lists everything by default. I tried it on both firefox and chrome. I tried a variety of sites that have a variety of trackers and it just lists all the cookies and green lists all of them.", "date": "Dec 27, 2017"}, {"stars": 5, "text": "If you care about your own privacy, you just can't live without it!\nUnobstrusive and essential!", "date": "Dec 16, 2017"}, {"stars": 5, "text": "i use this with avast security for very good protection", "date": "Dec 9, 2017"}, {"stars": 5, "text": "Works very well but it's not magic; be prepared to manage some cookies yourself.", "date": "Nov 27, 2017"}, {"stars": 5, "text": "It's effective against intrusive ads and spying/tracking.", "date": "Nov 25, 2017"}, {"stars": 5, "text": "It just works A*****", "date": "Nov 21, 2017"}, {"stars": 5, "text": "IT IS TOTALLY AWESOME!!!", "date": "Nov 19, 2017"}, {"stars": 5, "text": "Does what is says it can do.", "date": "Nov 15, 2017"}, {"stars": 5, "text": "Added to all browsers", "date": "Nov 14, 2017"}, {"stars": 5, "text": "Great App!", "date": "Nov 12, 2017"}, {"stars": 2, "text": "privacy badger .used to work. It stopped.\now there are 2 of them. I am swamped with spyware, it is too late. I have to change 5,000+ PWS.\nThe WORLD WAS BETTER WITHOUT COMPUTERS.\nWIN3.1 was the best.", "date": "Nov 9, 2017"}, {"stars": 5, "text": "has very good stuff", "date": "Nov 5, 2017"}, {"stars": 5, "text": "I've been using this app on firefox for a while and loved it. Now that I'm on Chrome I've added it for the protection.", "date": "Oct 27, 2017"}, {"stars": 5, "text": "Awesome help and protection while brosing web, unfortunately terrible Google corp. blocked it :/", "date": "Oct 24, 2017"}, {"stars": 5, "text": "I always trust EFF.org software and it works great!", "date": "Oct 22, 2017"}, {"stars": 3, "text": "Privacy Badger new review 10/16/17\n\nBeen using this again, I like its coding, however I really think it needs a few  QOL changes...\n\n1. The top of each row is  Block / Cookie  / Allow I want these to be clickable allow all / Block ALL Cookies, and lastly Block ALL!\n\nI find it ridiculous I have to slide the bar on some sites 49 times to block? \n\n\n2. This one is huge, it needs a sync feature, where it be through Chrome or otherwise... I use PB on 2 computers and I have to constantly download ru... Show more", "date": "Oct 16, 2017"}, {"stars": 5, "text": "works fine, now I  don't get ads about search history", "date": "Oct 13, 2017"}, {"stars": 5, "text": "Solid piece of software for the chrome botnet.", "date": "Sep 29, 2017"}, {"stars": 3, "text": "It worked well for a while. Lately many sites are just not loading. I turned it off and things are back to normal. \n\nWhen I looked in the settings it was filtering over 3,000 web sites. perhaps that has created a performance issue? Maybe sites need to be removed from a list if they haven't been visited in say 30 days? \n\nAnyway, I'm not sure the cause, but privacy doesn't do much good if I can't get to the website at all.", "date": "Sep 28, 2017"}, {"stars": 5, "text": "I love it because it's doing things by itself.", "date": "Sep 24, 2017"}, {"stars": 5, "text": "Effective and very easy to use.", "date": "Sep 20, 2017"}, {"stars": 5, "text": "Spectacular !", "date": "Sep 17, 2017"}, {"stars": 5, "text": "aWaiting for this for so long.Effective, doesn't get in the way, doesn't ask ANY unnessecery quastions.\nThe EFF( Electronic Foudition) Is a small group of individualist fighting for a users right to freedom. I see more and more producers of privacy software(vpn's, etc gives some of their money from every product sold(5-20%).\nSo please donate, i did 25$, AND i,m a heroid addict in rehab.\nBEST MONEY SPENT IN AGES..", "date": "Aug 30, 2017"}, {"stars": 5, "text": "Aside from some live video blockage works great.", "date": "Aug 27, 2017"}, {"stars": 5, "text": "This extension is almost perfect - it would be nice to be able to change the colour of the blocked items indicators :D", "date": "Aug 26, 2017"}, {"stars": 5, "text": "good for privecy", "date": "Aug 21, 2017"}, {"stars": 3, "text": "Needs a reset button.  I made a couple of selections as something wasn't working on a site but later realised I was getting loads of new ads on a different site.\nNo way to no which blocked cookie did it and no ability, bar going through over 30 cookies and testing each one individually.", "date": "Aug 20, 2017"}, {"stars": 5, "text": "Extremely useful extension. Thanks EFF!", "date": "Aug 19, 2017"}, {"stars": 4, "text": "When I have this enabled, I'm unable to view images on Google Docs, they just show up as white space. When the doc loads, it says \"Some fonts could not be loaded.\" For now, I have to disable the app, but otherwise it's great.", "date": "Aug 18, 2017"}, {"stars": 4, "text": "Cute! I love my badger, plus they are tough as all get out. Still trying this out but so far I like what i see from privacy badger.", "date": "Aug 18, 2017"}, {"stars": 4, "text": "Feel better using this app.", "date": "Aug 16, 2017"}, {"stars": 5, "text": "It's working fine.Thank you!", "date": "Aug 16, 2017"}, {"stars": 5, "text": "Let's us fine tune who are allowed to track us or not - I use it also to block annoying click-bait!\nThe people behind it are worth checking out; the Electronic Frontier Foundation (EFF) - I trust them with my cyber-life ;)\nI always add it to all my compatible browsers (and my friends's)!", "date": "Aug 7, 2017"}, {"stars": 5, "text": "I'm all for browsing privacy so I got this extension when DuckDuckgo recommended it.", "date": "Aug 6, 2017"}, {"stars": 4, "text": "I love this extension. I only have one issue with it. When you register an account on a new site, Privacy Badger does not show Google Captcha boxes. Does anyone know how I can whitelist Captcha?", "date": "Jul 29, 2017"}, {"stars": 5, "text": "fierce & easy to use", "date": "Jul 25, 2017"}, {"stars": 5, "text": "I love it. It's so helpful.", "date": "Jul 19, 2017"}, {"stars": 5, "text": "Works great -highly recommended", "date": "Jul 10, 2017"}, {"stars": 5, "text": "i've used it for a gr8 way to stop the ads", "date": "Jun 23, 2017"}, {"stars": 1, "text": "Practically useless because it breaks so many websites.  Inexcusable as many of the blocked elements do not behave, identify, or act as ads or trackers.", "date": "Jun 20, 2017"}, {"stars": 5, "text": "I've had privacy badger for a few months now and it works as advertised. Some sites require custom permissions so I would say the extension is 90% automatic.\n\nI strongly recommend it for privacy conscientious people.", "date": "Jun 12, 2017"}, {"stars": 2, "text": "I use Ghostery & uBlock, so this ext is redundant 4 me 2 use!?!  But right now I can't seem 2 get rid off it like it knows & is hiding?!?   But I will Win!?! LOL  As others have said, more people 2 use it will make it better down the long road!?!", "date": "Jun 11, 2017"}, {"stars": 5, "text": "Thank you,developersI've been looking for this for Chrome and it works wonderful. Thank you!!", "date": "Jun 6, 2017"}, {"stars": 1, "text": "Causes pages to render incorrectly but as soon as this extension is removed the page is fine again.", "date": "Jun 2, 2017"}, {"stars": 5, "text": "I'm not very interested in the privacy aspect of this extension (because I use a VPN), but it can make websites like Fandom/Wikia load faster than the speed of light. Adblock Plus and Privacy Badger make an excellent duo.", "date": "May 29, 2017"}, {"stars": 5, "text": "This extension works wonderfully. It is conceptually innovative and works well as a practical matter. I haven't had major issues with it breaking websites, and it has not caused major slow downs. It has however significantly reduced the apparent incidence of tracking. Can't recommend it enough.", "date": "May 25, 2017"}, {"stars": 2, "text": "I have been using this extension for a while, but am probably going to uninstall it and go back to using AdBlock Plus for the moment. I think PB will improve as more people install it and, hopefully, they report the problems that they find with it. As of now, it breaks too many sites for seemingly innocuous things (images are a big problem, as is video), and I don't have the time to go through upwards of 20 settings to adjust per broken site.\n\nI really appreciate the work that has gone into d... Show more", "date": "May 24, 2017"}, {"stars": 5, "text": "Amazing!", "date": "May 19, 2017"}, {"stars": 5, "text": "I love it", "date": "May 16, 2017"}, {"stars": 5, "text": "HAHA! It's so fun seeing the badger catch those pesky snoops in my browser! Great extension, works like a charm.", "date": "May 5, 2017"}, {"stars": 5, "text": "Easy to use, works quietly, straightforward.  Highly recommend.", "date": "May 3, 2017"}, {"stars": 5, "text": "WOW! This worked well. It helped track bad adware! Thanks!!!", "date": "Apr 27, 2017"}, {"stars": 5, "text": "Great", "date": "Apr 22, 2017"}, {"stars": 5, "text": "Been using for a year. Works great.", "date": "Apr 21, 2017"}, {"stars": 5, "text": "best ever ad blocker", "date": "Apr 14, 2017"}, {"stars": 2, "text": "This is easy to use and works well - too well. It is too aggressive and broke many sites I use, and the big problem is you can't always tell a site isn't working properly. It isn't always obvious that large chunks of pages just aren't there. Particular problems for me were pictures, review comments, things like that, all legitimate and not the sort of thing I would expect anything to block \"out of the box\". I don't have the patience to spend hours fine tuning it, so after a few weeks I uninst... Show more", "date": "Apr 13, 2017"}, {"stars": 2, "text": "Broke too many sites.", "date": "Apr 12, 2017"}, {"stars": 5, "text": "One of my essential extensions", "date": "Apr 7, 2017"}, {"stars": 5, "text": "IT WORKS", "date": "Apr 2, 2017"}, {"stars": 5, "text": "Love the User Interface: get em PB...grrrrr... yummmy, cookies!", "date": "Apr 1, 2017"}, {"stars": 5, "text": "its good", "date": "Mar 25, 2017"}, {"stars": 5, "text": "its awesome...i love it", "date": "Mar 19, 2017"}, {"stars": 5, "text": "That's Awesome Privacy Badger extension !!!!!", "date": "Mar 13, 2017"}, {"stars": 5, "text": "Brill privacy tool. Very reliable. Easy to tweak. So far this has not caused any broken web pages. Privacy Badger does a great job :)", "date": "Mar 10, 2017"}, {"stars": 5, "text": "SO COOL!", "date": "Mar 5, 2017"}, {"stars": 5, "text": "if you can't get an 'anti ad block' killer working.   this works PERFECTLY at blocking ads on sites that block ad block users!!", "date": "Mar 1, 2017"}, {"stars": 2, "text": "I'm sorry. I'm truly supportive of what this plugin tries to achieve, but at this point it breaks so many websites I can't honestly recommend anyone to use it.", "date": "Feb 24, 2017"}, {"stars": 5, "text": "works great! I use it on both chrome and firefox. It is excellent adblocker also. Adblocker Plus gets detected by sites but this one sits on back and blocks everything smoothly. Thanks Developer.", "date": "Feb 23, 2017"}, {"stars": 5, "text": "Love this addon, works very well.  But I really wish there was a default settings to make this more aggressive.  It basically fully allows almost everything.  If you go to download.cnet.com for example all the ads and video players load all lsited as tracking domains.  WOuld be great if privacy badger could be set to block or block cookies on all 3rd party domains by default.", "date": "Feb 22, 2017"}, {"stars": 5, "text": "Works great! I use it on Chrome and Firefox", "date": "Feb 21, 2017"}, {"stars": 5, "text": "downloaded from chrome store but that isn't what the extension says?", "date": "Feb 14, 2017"}, {"stars": 5, "text": "Very Good!!!", "date": "Feb 10, 2017"}, {"stars": 5, "text": "EFF makes it, 'nuff said.", "date": "Jan 22, 2017"}, {"stars": 1, "text": "Sadly it breaks webpages too often", "date": "Jan 19, 2017"}, {"stars": 5, "text": "A must have. I was getting tired of advertisements following me around on the internet and this extension puts an end to it.", "date": "Jan 11, 2017"}, {"stars": 5, "text": "It works great! I would love it if there was a counter to show how many trackers have been blocked since the beginning.", "date": "Jan 9, 2017"}, {"stars": 3, "text": "better than other extensions", "date": "Dec 24, 2016"}, {"stars": 3, "text": "getting error\n\nThis extension failed to redirect a network request to data:application/javascript;base64,K***w== because another extension (Disconnect) redirected it to about:blank.", "date": "Dec 21, 2016"}, {"stars": 5, "text": "Been using this since it was in beta - an invaluable tools for monitoring and controlling trackers.", "date": "Dec 16, 2016"}, {"stars": 2, "text": "tried on 2 different machines and i have been unable to install it properly. same error as other the extension is corrupted", "date": "Dec 15, 2016"}, {"stars": 5, "text": "Edit: I now see the message, \"Not from Chrome Web Store\" in my Chrome extensions list, which is surprising as I installed it from the Chrome Web Store...\nBut it seems Privacy Badger 2016.12.15.1 fixed the corruption issue.  Thanks!\n\n---\n\nI'm still getting the error \"This extension may have been corrupted.\"  When visiting the Privacy Badger page in the Chrome Web Store, I also see the message, \"This item has been disabled in Chrome. Enable this item\".\n\nNeither the repair link in the Chrome ext... Show more", "date": "Dec 15, 2016"}, {"stars": 2, "text": "Using Chrome and keep getting extension is corrupt. No anti virus. disabled everything. Uninstalled, reinstalled same corrupt message. Tried support page. No help. just some common question and answers.", "date": "Dec 15, 2016"}, {"stars": 1, "text": "Added to Chrome multiple times and each time it comes back as 'corrupted' and will not run. Cannot repair. Reinstalled numerous times and same issue persists.", "date": "Dec 15, 2016"}, {"stars": 1, "text": "Corrupted and repair does not help.", "date": "Dec 15, 2016"}, {"stars": 1, "text": "I was unable to open Google Contacts from my Gmail account, it turns out Privacy Badger caused the problem - avoid this until the bug is fixed", "date": "Dec 15, 2016"}, {"stars": 2, "text": "This extension may have been corrupted (Windows 10)", "date": "Dec 14, 2016"}, {"stars": 5, "text": "Works as described out of the box.", "date": "Dec 14, 2016"}, {"stars": 1, "text": "No longer works (icon always has a 0 by it).  I also see the \"Not from Chrome Web Store.\"  I have removed and reinstalled.  It would be nice if this could be made to work again.  Using Version 55.0.2883.95 (64-bit) on macOS 10.11.6.", "date": "Dec 14, 2016"}, {"stars": 5, "text": "Been using this extension for a long time. Really useful to keep malware and ads off the websites I use - and fascinating sometimes to see how many trackers some sites are trying to use!", "date": "Dec 14, 2016"}, {"stars": 5, "text": "EDIT: They updated this same day and it is now fully functional. Thank you for existing EFF and all your help!!!\n\nUh oh.. \"This item has been disabled in Chrome. [Enable this item](link).\"\n\nClicked link and get the same error message. Will give 5 stars once updated. Thanks EFF!\n\nWindows 7\nChrome Version 55.0.2883.87", "date": "Dec 13, 2016"}, {"stars": 1, "text": "\"This extension may have been corrupted\"\n \nAny time frame for a fix?", "date": "Dec 13, 2016"}, {"stars": 5, "text": "EDIT: problem fixed, back to 5 stars.\n\n\"This extension may have been corrupted\"\n\nI uninstalled and reinstalled.  Same thing.\n\nmacOS 10.11.6 with the latest stable Chrome (updated today).", "date": "Dec 13, 2016"}, {"stars": 4, "text": "First time installed, and not working...\nAny clue how to fix it?\n\nPrivacy Badger 2016.12.8\nThis extension may have been corrupted.", "date": "Dec 9, 2016"}, {"stars": 4, "text": "I'm concerned the new version 2016.12.07.2 requires more permissions with no option to disable those permissions.", "date": "Dec 8, 2016"}, {"stars": 5, "text": "Good for peace of mind. The only problem is that when a web site seems broken, you have to remember to disable Privacy Badger for that site to see if it fixes the problem, as the way the tool works does break some sites that are designed in an unusual way. I just wish it had a *temporary* shut-off switch (\"Reload without Privacy Badger\"?) to help me establish if PB is the problem.\n\nIt has a side-effect of blocking some ads, which also causes some news sites to demand you disable it.", "date": "Nov 22, 2016"}, {"stars": 5, "text": "great", "date": "Nov 18, 2016"}, {"stars": 4, "text": "I just downloaded this, so I can't say it's great YET but I will say the onboarding upon download is superb! \n\nthank you EFF!!! great work!", "date": "Nov 11, 2016"}, {"stars": 4, "text": "Great app, very effective and easy to use.", "date": "Nov 3, 2016"}, {"stars": 5, "text": "This is a great extension, but there is one thing missing in my opinion. And that is an option to export and import the Filter settings and the white listed domains.\n\nBut then again I have no idea how that would need to be developed, so I hope the development team will someday add those options.", "date": "Nov 2, 2016"}, {"stars": 5, "text": "I love the extension. A pretty good adblocker.", "date": "Nov 1, 2016"}, {"stars": 5, "text": "The only tracking script blocking application that I trust. Thanks EFF!", "date": "Oct 29, 2016"}, {"stars": 4, "text": "Please add an option to disable all domain in a single click. I saw more than 600 traking domains and i cannot disable them one by one. 1 button to disable all would be good", "date": "Oct 24, 2016"}, {"stars": 5, "text": "Works fine", "date": "Oct 23, 2016"}, {"stars": 4, "text": "Mostly good and I applaud the effort.\nOne warning: It can 'break' podcast sites like Overcast.fm if www.podtrac.com is used.\nI backed off the setting on www.podtrac.com from 'Blocked' to 'Block cookies' (red to yellow) to get around it, for better or worse...", "date": "Oct 19, 2016"}, {"stars": 2, "text": "After fighting the rules several hours I've to give up and uninstall it. It makes too many chinese e-commercial website from working, and its too hard for who don't develop the site to decide how to make it works again - think of 20 domain each with 3 choices?", "date": "Oct 10, 2016"}, {"stars": 5, "text": "Many people have complained about the sensitivity of PrivacyBadger, but I've always found it very usable. When applications *do* break, adjusting settings is easy while the application learns the 'right' thing to do.\n\nPrivacyBadger is here to protect your *PRIVACY*, not to remove Ads. Many sites are operated by ad revenue and it's shortsighted to block these important opportunities to fund the site, provided they aren't including third-party tracking cookies and assets: A goal where PrivacyBa... Show more", "date": "Oct 5, 2016"}, {"stars": 2, "text": "Wrote the developer...here is the response:\n\n\"Thanks for writing to us! We are aware of this problem and are working on a fix.\"\n\nBest regards,\n\nElectronic Frontier Foundation", "date": "Sep 8, 2016"}, {"stars": 5, "text": "hot", "date": "Sep 6, 2016"}, {"stars": 5, "text": "Not Work! Version 53.0.2785.89 m (64-bit) \nWin 10 Enterprise LTSB x64 1607\nFixed pl! ty bro!", "date": "Sep 5, 2016"}, {"stars": 2, "text": "not working anymore becomes corrupt and can't repair", "date": "Sep 5, 2016"}, {"stars": 3, "text": "works on WIN, but doesn't on linux(ubuntu 16.04) :(", "date": "Sep 4, 2016"}, {"stars": 5, "text": "A very useful extension but with recent updates on Chrome. Something is not right.", "date": "Sep 4, 2016"}, {"stars": 5, "text": "good app", "date": "Sep 4, 2016"}, {"stars": 1, "text": "corrupted here too, fix please", "date": "Sep 1, 2016"}, {"stars": 2, "text": "Not working anymore\n\n\"This extension may have \nbeen corrupted.\"\n\nCorrupted in Chrome\nVersion 53.0.2785.80 beta-m (64-bit)", "date": "Aug 31, 2016"}, {"stars": 1, "text": "\"This extension may have been corrupted.\"\n\nCorrupted in Chrome version 53.0.2785.80 beta-m (64-bit)", "date": "Aug 31, 2016"}, {"stars": 5, "text": "cool add on, I'd love to have shortcut to toggle PB and also to enter settings", "date": "Aug 9, 2016"}, {"stars": 2, "text": "I really really wanted to like this extension as I feel I could trust the EFF over other competing extension authors. \n\nBut the plain truth is that it breaks too many pages. I have 5 or so pages totally whitelisted over the last few months of usage just so I can use them.", "date": "Jul 24, 2016"}, {"stars": 2, "text": "It's blocking much more than it should. I DON'T want to block ads. I just don't want to be tracked. There's a difference. Now half the sites I go to don't work.", "date": "Jul 19, 2016"}, {"stars": 2, "text": "Privacy Badger used to be good but this latest update (running in Chrome 51.0.2704.103 m (64-bit), Windows 10) now saves blocking preferences alongside cookies so when you clear cookies Privacy Badger resets itself. Privacy Badger only did one thing and now it doesn’t even do that. Utterly useless and now removed from Chrome.  Also, EFF offer no support for this extension, with the ‘support site’ link taking you to a FAQ so you can’t even report this error. Doubly useless.", "date": "Jul 11, 2016"}, {"stars": 5, "text": "brilliant product\ngreat company\nexcellent people", "date": "Jul 10, 2016"}, {"stars": 5, "text": "Love it. Blocks things as you browse and gets smarter the more you browse", "date": "Jul 3, 2016"}, {"stars": 5, "text": "Simple, effective.", "date": "Jun 30, 2016"}, {"stars": 5, "text": "A great way to block trackers, whilst not impacting the revenues of those sites who're using less intrusive ads.", "date": "Jun 10, 2016"}, {"stars": 5, "text": "No privacy product more solid and trustworthy.  Just what you'd expect from the EFF.  Give them money, they've got our backs.", "date": "Jun 4, 2016"}, {"stars": 5, "text": "optimal!", "date": "Jun 1, 2016"}, {"stars": 5, "text": "I have yet to find something comparably diligent and effective, simple to use, and helpful. I can now browse in peace :)", "date": "May 28, 2016"}, {"stars": 5, "text": "Awesome", "date": "May 27, 2016"}, {"stars": 5, "text": "excellent", "date": "May 24, 2016"}, {"stars": 4, "text": "I have run it under Firefox for about 6 months  and have not had any problems.  I just loaded it under Chrome, and started reading reviews that say it doesn't work well under Chrome so I may be deleting it in the very near future.", "date": "May 16, 2016"}, {"stars": 4, "text": "Like they said, it's not meant to be an ad-blocker, and I'm starting to get it. This extension must first WITNESS the trackers actually try to track you (despite Do Not Track settings) before actually deciding to block them, which makes sense. (Everything being green and allowed at first is a bit scary though...)\n\nUnfortunately, in the current state of the web, ads can be loud, obnoxious, animated, bandwidth-eating and even infect your computer immediately just from being loaded. As such, I j... Show more", "date": "May 16, 2016"}, {"stars": 4, "text": "Great extension, but I seem to be noticing some performance issues with this extension. Some sites tend to load faster when it's disabled.", "date": "May 14, 2016"}, {"stars": 5, "text": "great!", "date": "May 14, 2016"}, {"stars": 5, "text": ":) i <3 EFF!\nok, fanboying apart, awesome extension, and cute mascot.", "date": "May 6, 2016"}, {"stars": 4, "text": "good", "date": "May 1, 2016"}, {"stars": 3, "text": "This is a good app, but recently it's been slowing down my browsing substantially and I have to disable it entirely to have pages load in a reasonable period of time. \n\nI'm not sure that's because it's gotten bloated, or if it just can't handle the amount of rules it's developed for cookies and such as that list gets longer...", "date": "May 1, 2016"}, {"stars": 2, "text": "SInce installing it,  Chrome won't shut down properly all the time, I get constant crashes of tabs needing reloading etc etc.", "date": "Apr 27, 2016"}, {"stars": 1, "text": "Breaks too many websites", "date": "Apr 27, 2016"}, {"stars": 2, "text": "This extension worked great at first. But now it keeps hanging. All of a sudden, I'll notice that Privacy Badger isn't even running, meaning that I have to reload it.\nSad to see it leave my Chrome, but bye bye.", "date": "Apr 26, 2016"}, {"stars": 1, "text": "Breaks way too many sites in Chrome.  I realize that's the fault of the sites themselves, but if it's causing an inconvenience, then it isn't worth using.", "date": "Apr 24, 2016"}, {"stars": 2, "text": "I've been using this for a long time but I hadn't realised how much it had slowed my browsing down, and even completely stopped some safe sites from loading, until I disabled it.\n\nNow slow loading sites are back to the speeds they should be.\n\nI really liked this application when I started using it but something has gone badly wrong and until it's fixed by the developer I won't be using it again.", "date": "Apr 23, 2016"}, {"stars": 3, "text": "This application does the job it is designed to do very well. I am always interested in seeing the absurd number of intrusions that it has blocked in certain websites. My problem with it is that it seriously effects the working of a number of websites. In particular many websites are unable to play or load videos. While I am sure that some videos are problematic I dont believe as many as it is blocking are. The problem is that when you look at the drop down box it is impossible to see which o... Show more", "date": "Apr 20, 2016"}, {"stars": 2, "text": "This has become insanely slow. When I open the options and try to make a change to blocking a site, it might take up to 60 seconds to respond after clicking one slider, and it locks up Chrome. Win10-64, i7 3.2GHz, 12GB ram, Samsung SSD.", "date": "Apr 16, 2016"}, {"stars": 3, "text": "Breaks a few sites (especially ones using dynamically loads reviews). The bigger issue, for me, is that it often chews up CPU time.", "date": "Apr 15, 2016"}, {"stars": 4, "text": "Very useful", "date": "Apr 14, 2016"}, {"stars": 3, "text": "Used to work really well but recently it has suffered. Regularly the extension will prevent the page from loading. You'll see a \"waiting for Privacy Badger\" message. I assume it's because it's grabbing external scripts somewhere. There really should be a fall back option so that if it times out the page can still load. I keep having to disable it and am close to removing. I still have hope though!", "date": "Apr 12, 2016"}, {"stars": 3, "text": "This is a good extension, and it's worth using overall.\n\nHowever, it has a few problems that I'd love to see fixed in an update:\n\n- Speed, it does significantly slow down browsing and I'd hope it could be made faster.\n\n- Doesn't work with RefControl, and doesn't provide replacement functionality. I want to forge third-party referers as RefControl allows, but that's not possible with this extension. This causes some sites to behave unexpectedly (for example, forbes.com).", "date": "Apr 9, 2016"}, {"stars": 2, "text": "Periodically stops responding and only disabling and enabling it allows sites to load. Also breaks too many sites to be useful. Really, really, needs fixing then I'll consider it again.", "date": "Apr 8, 2016"}, {"stars": 2, "text": "slow\nslow\nslow", "date": "Apr 7, 2016"}, {"stars": 3, "text": "Just today realized this extension was causing the problem of pages that failed to load unless I restarted the browser.  It only started happening about 2-3 weeks ago. Before that, I would rate it a 5*.  If it starts working again, will update.  But have it disabled for now.", "date": "Apr 6, 2016"}, {"stars": 1, "text": "Works fine for a hot sec, then completely breaks Chrome.\n\nAnd I don't mean just breaks certain sites, or no CSS, or whatnot, no: it prevents anything from loading at all, as if your internet faucet had suddenly been turned off.", "date": "Apr 5, 2016"}, {"stars": 2, "text": "I've been using it for more than a year, and it stopped working. It doesn't do anything. I've also got Ghostery installed, and it  has also stopped working. I'm going to see if uninstalling and reinstalling will fix the problem.", "date": "Apr 2, 2016"}, {"stars": 3, "text": "I think it's an excellent concept that needs a lot of work. It crashes several times per day.", "date": "Mar 31, 2016"}, {"stars": 5, "text": "It works well and does what it says. It also breaks a lot of sites. However, when a site is broke by this extension I wonder why the site needs the information it is asking for. Then if you trust the site with that info, allow it to track and the site starts working again.", "date": "Mar 31, 2016"}, {"stars": 1, "text": "The idea of cool . But the execution is poor . Blocks this allowance even google and twitter and facebook . Maskra . This should be checked every blocked. Otherwise, the use of such a supplement does not make sense", "date": "Mar 26, 2016"}, {"stars": 2, "text": "Just recently it stops working chrome is not able to load as privacy badger never finish loading, once disabled chrome is working again", "date": "Mar 25, 2016"}, {"stars": 2, "text": "using it for quite a while, but it started to make problems a couple of weeks ago. \nI have noticed that it seems to slow Chrome since then. Not sure if there is an incompatibility with recent updates of Win 10.", "date": "Mar 24, 2016"}, {"stars": 3, "text": "Five stars all day...except for the regular crashes.\nI love what this extension does, and the functionality is great...when it functions. It occasionally just stops working, and nothing will load until I uninstall it. After seeing how many sites are tracking me, though, I keep reinstalling it. Fix the bugs, and this is five stars all day.", "date": "Mar 23, 2016"}, {"stars": 1, "text": "annoying", "date": "Mar 23, 2016"}, {"stars": 4, "text": "liked it", "date": "Mar 20, 2016"}, {"stars": 1, "text": "Seems their servers go down a lot, blocking entire page from loading.\n\nI find I have to disable privacy badget quite freuqentyl", "date": "Mar 20, 2016"}, {"stars": 2, "text": "While I love this thing in theory, it breaks everything.\n\nI installed it basically the day it was released, and it worked really well at first, but it's getting worse and worse.\n\nSome sites won't load the CSS at all, so the pages look like the 90s.\n\nPretty much any page with video on it won't work.\n\nLove it in theory, but they really need to fix it up.", "date": "Mar 18, 2016"}, {"stars": 3, "text": "Worked great for about a year, but just started seeing serious issues in Chrome 49 in the past week. Pages either fail to load or the formatting is completely screwed up half the time (and oddly only about half the time).", "date": "Mar 17, 2016"}, {"stars": 5, "text": "The best thing I like about it is that it doesn't interfere with other extensions like Blur & uBlock.", "date": "Mar 5, 2016"}, {"stars": 3, "text": "Half the time it works, other half it prevents any page from loading with \"Waiting for Privacy badger\"", "date": "Mar 1, 2016"}, {"stars": 5, "text": "I love what it does, but man does it slow everything down.  Come on, EFF.  Speed this thing up!", "date": "Mar 1, 2016"}, {"stars": 4, "text": "Privacy Badger is great but recently it felled up in a conflict with uBlock Origin. :((\nI forced to disable it.\nPlease make it work alongside uBlock Origin.", "date": "Feb 28, 2016"}, {"stars": 3, "text": "This is a really great idea that is very needed, but it's also dangerous for some pages.\n\nI've visited multiple websites (including my own) and the ads are blocked, it just show a Sad Face.\n\nAs I said, it's a great idea, and it would be awesome to fix the ads, as people live on the income from their websites!\n\nTHANKS :)", "date": "Feb 24, 2016"}, {"stars": 3, "text": "good idea sloppy implementation\n\n-no sync, import/export or similar\n- not aggressive enough,  that is, it takes forever before it starts blocking even 'well-known' trackers...\n\nBut I have seen that's capable to \"see\" trackers and third party crap, similar programs didn't.\n\nBottom line:\nFor the time being, I would only it as a secondary privacy protection solution next to whatever you've been using already...", "date": "Feb 22, 2016"}, {"stars": 5, "text": "Social Media buttons should be illegal!", "date": "Feb 22, 2016"}, {"stars": 2, "text": "Worked fine only a month ago and since then i had huge memory usage from it- At first i didnt know what was wrong with my pc since it usually froze but finally i managed to catch it slowly taking more and more ram all the way up to 3gb. Since disabling it i have no memory problems.", "date": "Feb 20, 2016"}, {"stars": 2, "text": "This extension interferes with at least one program: IQTELL. Too bad there is not a \"White List\" feature to turn it off for specific sites that it breaks.", "date": "Feb 20, 2016"}, {"stars": 4, "text": "Great idea, nice interface, but it does break a few websites unless you manually unblock the content.", "date": "Feb 19, 2016"}, {"stars": 5, "text": "I would trust the EFF with my daughters at a Motel 6.", "date": "Feb 11, 2016"}, {"stars": 2, "text": "It may be blocking, but it breaks Facebook. Pages are rendered as an outline with links instead of formatted pages.", "date": "Feb 9, 2016"}, {"stars": 5, "text": "It's good I guess. Also be careful of the known and reported bug where it may not let you download from Google Drive. I just disabled Badger for Google Drive and it fixed it.", "date": "Feb 7, 2016"}, {"stars": 5, "text": "my favorite extension... perfect!", "date": "Jan 28, 2016"}, {"stars": 3, "text": "requires training in order to tell good from evil (upon adjusting provides pretty decent protection); on the plus note - quite sensitive (better as ghostery)", "date": "Jan 24, 2016"}, {"stars": 3, "text": "It appears to be working as advertised.  BUT, the longer I had it installed the more it interfered with every page I used.  It slowed my browser to a crawl to the point that I was forced to uninstall it.", "date": "Jan 15, 2016"}, {"stars": 2, "text": "By default it lets through all sorts of crap --According to PB Scorecard Research is not tracking me (!).\n\nThere is no way to just turn off all trackers and social utilities.\n\nBack to Ghostery I go.", "date": "Jan 13, 2016"}, {"stars": 4, "text": "This is a great extension but is now causing very log loading delays, a lot of time in \"waiting for Privacy Badger\"...", "date": "Jan 10, 2016"}, {"stars": 5, "text": "works like it says", "date": "Dec 29, 2015"}, {"stars": 5, "text": "I find this to be a great tool, with no perceived slowdown.  It's recommended by the EFF and the app does what it says on the tin.  Try it, I don't think you will be sorry if you do.", "date": "Dec 27, 2015"}, {"stars": 3, "text": "I can definitely see the positive in this app. No doubt about that. But, I've had so many experiences with websites that just straight up don't work and I forget that I have this app and I complain to the website. Much more work needs to be done here if it's going to be a useful internet tool.", "date": "Dec 23, 2015"}, {"stars": 5, "text": "Like.", "date": "Dec 14, 2015"}, {"stars": 5, "text": "Gets rid of the crud that kept on trying to take over my pages. Love it", "date": "Dec 13, 2015"}, {"stars": 1, "text": "Even though I add some certain domains to the white list, Privacy Badger still keeps blocking the images from those domains. Stupid app.", "date": "Dec 12, 2015"}, {"stars": 2, "text": "Sure does the job, but no more web browsing then...", "date": "Dec 1, 2015"}, {"stars": 5, "text": "Been working flawlessly for 6 months. Only have 2 sites whitelisted (youtube being one of them unfortunately)", "date": "Nov 19, 2015"}, {"stars": 3, "text": "Keeps getting worse for me.\n\nThe extension crashes about two to three times a day, and it seems to struggle to load at times.\n\nThe whitelist domain functionality doesn't handle sub-domains, so even if I whitelist example.com, www.example.com is still being handled by the extension.", "date": "Nov 5, 2015"}, {"stars": 5, "text": "LOVE IT!!!!! Blocks those Nasty Trackers so you can browse in peace :D. I would recommend this to anyone looking for a way to block trackers Simply and Quickly!", "date": "Oct 29, 2015"}, {"stars": 2, "text": "I was reporting broken sites for 2 months, but they don't adjust the blocking settings.\n\nFine idea, but useless execution. It doesn't learn, it just blocks, and keep on blocking, even if you report the broken images and pages.", "date": "Oct 24, 2015"}, {"stars": 5, "text": "I love this App.\n\nthank you\"", "date": "Oct 23, 2015"}, {"stars": 3, "text": "I really like the idea of the app but unfortunately it would occasionally cause sites to not load properly. In 99% of cases I just needed to refresh the page and everything loaded fine but it got very tedious so I had to disable it. I look forward to trying it in the future when it is fixed.", "date": "Oct 21, 2015"}, {"stars": 1, "text": "After two months of use, truth is its a giant stinking pile of crap.\nIt breaks way too many sites and often in non visible ways.\n\nCommon examples: you click on a link or a button and it won't work, part of a form doesn't appear, some sites won't load, some will be blank, etc. You think there's a bug on a Web site but at some point, you realize it's because of this piece of crap.\n\nYou may not be tracked, but you won't have a fully usable Internet either.", "date": "Oct 20, 2015"}, {"stars": 1, "text": "A lot of sites just no longer load if privacy badger is enabled.", "date": "Oct 16, 2015"}, {"stars": 3, "text": "Why Privacy Badger using 400MB memory ?", "date": "Oct 4, 2015"}, {"stars": 2, "text": "Used so many resources I couldn't get anything in chrome to react while a tab was loading in the background. (ie. closing tab, closing browser, the usual steps to kill a resource hog)  The blocking seemed to work just fine, but I can't wait >15 seconds to load each webpage on a 2015 Macbook Pro.", "date": "Sep 28, 2015"}, {"stars": 4, "text": "while I browsing the shopping sites, it block them, too. but it just work, thanks", "date": "Sep 21, 2015"}, {"stars": 3, "text": "Please provide some stats about total number of blocked items. A list of suggested block list is really useful.\nThanks.", "date": "Sep 20, 2015"}, {"stars": 5, "text": "Great", "date": "Sep 19, 2015"}, {"stars": 2, "text": "Piece of junk. Stops working silently after couple of weeks", "date": "Sep 18, 2015"}, {"stars": 2, "text": "Dislike the general concept of blacklisting based on traffic analysis. Gave it a shot and waited a day of full browsing. Many many obvious trackers were still being loaded. Perhaps waiting longer will eventually fix this...not sure. But what a gamble. Eventual maybe privacy is not acceptable.\n\nI trust eff far more than I do Ghostery, but Ghostery just works.", "date": "Sep 11, 2015"}, {"stars": 5, "text": "Works flawlessly!", "date": "Sep 4, 2015"}, {"stars": 3, "text": "I like the concept and what you're trying to do for us, EFF, but this extension is breaking parts of the web.\nNotable Example: All of Wikia.", "date": "Sep 2, 2015"}, {"stars": 2, "text": "Am about to remove it from Chrome altogether as it caused so many problems. Yes, it did what it's supposed to but it also slowed Chrome down to the speed of treacle and also stopped so many pages and sites from loading altogether. By all means give it a try but don't say I didn't warn you.", "date": "Sep 2, 2015"}, {"stars": 5, "text": "Like the way that it learns as it goes. Never felt completely comfortable with everything blocked in ABP or Ghostery since they rendered many sites in error or non-functional. Wasn't such a big deal for me but made it problematic for less experienced user. Privacy Badger is easy to use for advanced users that want to block everything but still offers good protection AND functionality to users who just prefer to browse.", "date": "Sep 1, 2015"}, {"stars": 2, "text": "It still breaks too many sites and interferes with my preferred single sign on tool.", "date": "Aug 29, 2015"}, {"stars": 5, "text": "Amazing", "date": "Aug 29, 2015"}, {"stars": 3, "text": "Works as expected: Great!\nCPU hog: Not great.\n\nIt would regularly hit 80-100% CPU in Chrome's task manager when opening a new tab or page, and seemed to significantly slow down Chrome's launch time.", "date": "Aug 26, 2015"}, {"stars": 2, "text": "Does not work with Evernote Webclipper ... and therefore useless for me. Sadly ...\n\nbtw. why no a \"block all from standard\" setting ?", "date": "Aug 26, 2015"}, {"stars": 5, "text": "This plugin should be installed on every computer. Itś a bit scary  when you discover the amount of monitoring on every webpage.", "date": "Aug 22, 2015"}, {"stars": 1, "text": "Often when a site I use regularly suddenly won't load, this is the culprit. Over the time I've used it, it hasn't protected me in any meaningful way but it has caused me plenty of grief.", "date": "Aug 20, 2015"}, {"stars": 3, "text": "Concept is nice but...\n\n\"This extension is slowing down Google Chrome. You should disable it to restore Google Chrome's performance.\" <-- Bad.", "date": "Aug 16, 2015"}, {"stars": 5, "text": "Awesome plugin.", "date": "Aug 15, 2015"}, {"stars": 4, "text": "GREAT EFF", "date": "Aug 14, 2015"}, {"stars": 4, "text": "good!", "date": "Aug 14, 2015"}, {"stars": 4, "text": "I would rate 5 stars, but chrome keeps telling me that it's slowing down my browser. If this is normal please tell me because no matter what I won't uninstall this extension, but it would be nice if someone could help me with this. Other than that, this extension is a must have for everyone.", "date": "Aug 14, 2015"}, {"stars": 3, "text": "Causes quite a bit of issues unfortunately. Google Hangouts isn't working anymore (both video calls and the chat functionality in Google+), just like Google Drive is broken (downloads don't work anymore).\n\nAlso, Chrome is telling me that Badger is slowing down the browsing experience, so I have to disable it completely for now.\n\nGiving 3 stars because the concept is nice and I can see enabling it again when the detection works better.", "date": "Aug 13, 2015"}, {"stars": 2, "text": "need DEFAULT options to BLOCK ALL ...", "date": "Aug 13, 2015"}, {"stars": 3, "text": "I am constantly getting errors from chrome saying \"Warning:\nThis extension is slowing down Google Chrome. You should disable it to restore Google Chrome's performance.\"", "date": "Aug 12, 2015"}, {"stars": 4, "text": "Works on a lot od sites esp the 60 to 70 tracker sites but google is having a fit.\n\nWarning:\nThis extension is slowing down Google Chrome. You should disable it to restore Google Chrome's performance.", "date": "Aug 11, 2015"}, {"stars": 1, "text": "Too much user configuration needed, reverting to ublock", "date": "Aug 10, 2015"}, {"stars": 4, "text": "Please, add function in settings to disable number of blocked sites on icon.", "date": "Aug 10, 2015"}, {"stars": 3, "text": "This extension is slowing down Google Chrome. You should disable it to restore Google Chrome's performance.", "date": "Aug 9, 2015"}, {"stars": 2, "text": "It used to be great, but after the recent update none of the sliders are adjustable. If it blocks content I want, I can only see it by disabling the entire extension. Not sure why they felt the need to break core functionality. Why bother to have the sliders at all if they don't work?", "date": "Aug 8, 2015"}, {"stars": 2, "text": "Previous version was great, this version (as of Aug 8, 2015) does not let me block google, facebook or twitter. Sliding the sliders to yellow or red do nothing, they simply stay on green.", "date": "Aug 8, 2015"}, {"stars": 5, "text": "I love that I'm still supporting the sites I visit while regaining control over my privacy.", "date": "Aug 8, 2015"}, {"stars": 5, "text": "Nice. Thanks you!", "date": "Aug 8, 2015"}, {"stars": 3, "text": "Extremely good and useful. But recently slows surfing to a crawl. \n\nA lot of pages show \"waiting for Privacy badger\"", "date": "Aug 7, 2015"}, {"stars": 4, "text": "It has been great up until the recent update. Firstly, it is being flagged by Google as slowing down Chrome; and secondly, it is blocking the Buffer extension despite whitelisting and doesn't remember me selecting to unblock.\n\nEdit: uninstalling and reinstalling fixed the Buffer bug.", "date": "Aug 7, 2015"}, {"stars": 2, "text": "Does nothing for my computer. I have not seen this application be able to block anything. I tried it for a week and find it hard to believe that all the sites I visit are are tracker free and safe. I uninstalled this add-on today.", "date": "Aug 7, 2015"}, {"stars": 5, "text": "Love it !", "date": "Aug 7, 2015"}, {"stars": 5, "text": "Thank you EFF, great software.  It blocks things you don't want, on occasion, but the small hassle is worth it for the trustworthy plugin.\n\nKeep it up EFF!", "date": "Aug 6, 2015"}, {"stars": 3, "text": "It appears facebook, twitter, and ajax.googleapis have found a way to get around privacy badger.\nI just can not believe those 3 (and plenty of others) are not actively tracking me when they are listed under \"the domains below don't appear to be tracking you\"\ndevelopers, please take a closer look at this.\nIf their not tracking, then why are they present?", "date": "Aug 6, 2015"}, {"stars": 5, "text": "Works perfectly. Thank you!", "date": "Aug 6, 2015"}, {"stars": 5, "text": "works well!!", "date": "Jul 31, 2015"}, {"stars": 3, "text": "It breaks images in SalesForce. I had to re-enable the button to turn it off for those sites.", "date": "Jul 24, 2015"}, {"stars": 5, "text": "works well", "date": "Jun 15, 2015"}, {"stars": 4, "text": "Seems to work well but note that it blocks yourself from writing YouTube comments!", "date": "Jun 9, 2015"}, {"stars": 5, "text": "Really solid tracker blocker- sometimes breaks sites and you have to adjust settings- may confuse anyone who isn't a web dev.  Does a nice job of fairly comprensnsive blocking of major trackers.", "date": "Jun 7, 2015"}, {"stars": 1, "text": "Blocks literally nothing unless you manually go through each ad network per page... meaning that latimes article you clicked? Yeah prepare to go through each of the 57 ad networks individually everytime you visit a page. You'll spend more time individually filtering the ad networks then reading the article you clicked on, and at some point you might wonder what exactly the extension does?", "date": "Jun 3, 2015"}, {"stars": 4, "text": "This extension seems to prevent Facebook's nosiness with my Google searches.  Only suggestion is to improve stability since Chrome is more crash prone since adding this.", "date": "Jun 1, 2015"}, {"stars": 5, "text": "Perhaps I'm biased toward EFF, but the UI on Privacy Badger seems to do the best job of explaining the allow / block relationship with third parties of any of the tracker blocking extensions.\n\nA number of reviewers are confused about the way that trackers start as \"green\" when the extension is first installed; it takes a bit of browsing before the Badger's heuristics will recognise and classify every tracker.\n\nThere are definitely some things that need to be improved before this is out of \"be... Show more", "date": "May 13, 2015"}, {"stars": 5, "text": "The only one you can trust because if the EFF can't be trusted who else can?", "date": "May 13, 2015"}, {"stars": 1, "text": "though it says it is helping i just dont trust it", "date": "May 11, 2015"}, {"stars": 5, "text": "It's the only block tracker extension made by a non profitable company. It's the only one you can really trust. Please keep up your good work!", "date": "Apr 30, 2015"}, {"stars": 2, "text": "Does not block trackers by default nor does it give you the option to change this setting (in fact, it lacks any type of settings)", "date": "Mar 13, 2015"}, {"stars": 5, "text": "Guys, you should definitely make this wonderful thing for iOS!", "date": "Mar 10, 2015"}, {"stars": 5, "text": "Great and very customizable.", "date": "Mar 10, 2015"}, {"stars": 2, "text": "This used to be great, but lately it's whitelisting every tracker for some reason, even ones that are obviously ad trackers.  Sometimes it's even re-adding a website to the whitelist even after I manually add it to the blacklist.  This is a serious issue that's rendering it quite useless.", "date": "Mar 7, 2015"}, {"stars": 3, "text": "Love the concept, but it does seem to slow down performance and loading time. Default settings are a little aggressive, and it would be nice for the extension icon to not just show how many third-party scripts it's detecting, but maybe indicate how many you have not given attention to in addition to the total, or total blocked. (That is to say, the red badge makes me feel like I need to take action, even if I have adjusted settings for a given site.) Looking forward to seeing continued develo... Show more", "date": "Mar 4, 2015"}, {"stars": 4, "text": "A simple extension, though nowhere near as powerful or comprehensive as other similar extensions (such as Ghostery and Disconnect). It's good in conjunction with these or as a simple program for basic users, but it is otherwise not very useful.", "date": "Mar 2, 2015"}, {"stars": 5, "text": "This is Godsend!!Before start crying like babies about the extension,learn that the level of privacy can be adjusted by YOU.So,if a website does'nt load is because YOU are filtering EVERYTHING! 5 out of 5 stars and i wish i could give more!!", "date": "Mar 1, 2015"}, {"stars": 2, "text": "After installing it, pages would not load in Chrome. I am uninstalling it.", "date": "Feb 26, 2015"}, {"stars": 4, "text": "Really great app and is mostly a filter for my filter...I use ghostery for my MAIN tracking blocker however privacy badger is fantastic for catching the little ones that get missed by the bigger extension. All in all its not a bad product and really enjoy it. :D", "date": "Feb 25, 2015"}, {"stars": 3, "text": "Chrome browser started locking up and becoming unresponsive for 15+ seconds with this turned on. Also started messing with checkout at some online stores. Has been perfect up until this point, still going to keep using it.", "date": "Feb 23, 2015"}, {"stars": 4, "text": "I like it. It has always worked for me.", "date": "Feb 8, 2015"}, {"stars": 5, "text": "Very good way to see what is an legit web browser site.", "date": "Jan 29, 2015"}, {"stars": 5, "text": "so good", "date": "Jan 28, 2015"}, {"stars": 5, "text": "Catches a lot more stuff after its trained.", "date": "Jan 13, 2015"}, {"stars": 3, "text": "Loading really really slow. Sites are taking forever to open while waiting for this extension to load. This seems to be a recent development on the most recent Chrome Version 40.0.2214.28 beta-m (64-bit) on Windows 8.1.", "date": "Dec 9, 2014"}, {"stars": 5, "text": "Really good if you know enough to be able to unblock domains that are needed for sites to function.", "date": "Nov 22, 2014"}, {"stars": 5, "text": "Works perfectly! Never seen any 3rd party ads anywhere since I added this plugin.", "date": "Nov 13, 2014"}, {"stars": 4, "text": "Excellent little utility - very useful.", "date": "Nov 6, 2014"}, {"stars": 4, "text": "Functions very well, but the UI presentation is not to my liking. Requiring the chrome button to change the status of cookies is not ideal for me, a contextual menu item would be much more suitable. Of course these are only personal preferences and do not reflect rating score.", "date": "Nov 6, 2014"}, {"stars": 2, "text": "MASSIVELY slows the loading of the browser even on my top-end gaming PC. Makes the browser lock up (Windows states that it is unresponsive and asks if I want to close Chrome) for 30 to 40 seconds each and every time that the browser is loaded. The situation is predictably worse on this under powered notebook from which I am presently writing this review.  This add-on is a great idea, but has terrible execution.", "date": "Oct 27, 2014"}, {"stars": 5, "text": "Fantastic product that does what it says. Look forward to the every growing list of nasty 3rd party tracking cookies being blocked! \n\nThe more people that use it the more likely we are to reduce Facebooks share price :)", "date": "Oct 12, 2014"}, {"stars": 5, "text": "Stops a lot of video ads playing automatically. Only once have I ever had to disable it for a page to work right.", "date": "Oct 12, 2014"}, {"stars": 3, "text": "This app breaks reddit if it's installed for longer than a week. They need to fix this.", "date": "Oct 3, 2014"}, {"stars": 4, "text": "i really like this extension.when you first start using it a lot of sliders are green.but the more you browse they start turning to yellow and red.shows it is working.i really hope this extension is supported and gets only better.please support eff.they care about your privacy.", "date": "Oct 1, 2014"}, {"stars": 5, "text": "Works well. A bit overzealous sometimes but the interface is great and makes it easy to unblock stuff as required.", "date": "Sep 28, 2014"}, {"stars": 4, "text": "Works great. Still better on Firefox but getting there.", "date": "Sep 19, 2014"}, {"stars": 5, "text": "Great, does what it says.", "date": "Sep 15, 2014"}, {"stars": 3, "text": "The functionality is cool, but it messes up the layout of sites, such as reddit.", "date": "Sep 8, 2014"}, {"stars": 5, "text": "its more useful to let you know when (& by whom) tracked; more so I feel than stopping tracking.", "date": "Sep 4, 2014"}, {"stars": 1, "text": "Caused issues with other addons that I use.", "date": "Sep 4, 2014"}, {"stars": 4, "text": "Extention is blocking live search", "date": "Sep 1, 2014"}, {"stars": 5, "text": "No problems that I can see.  It seems to be working fine.  I do wonder, though, when (or if) they'll come up with a version for the Chrome browser on Android.", "date": "Aug 31, 2014"}, {"stars": 2, "text": "Blocked some images on one of our work sites from loading even though I had disabled it for that site.", "date": "Aug 28, 2014"}, {"stars": 5, "text": "Privacy Badger stole the cookie from the cookie jar! Thanks EFF!", "date": "Aug 27, 2014"}, {"stars": 5, "text": "tanks", "date": "Aug 27, 2014"}, {"stars": 5, "text": "great!!", "date": "Aug 17, 2014"}, {"stars": 5, "text": "This has been updated to allow for things like Facebook commenting just on certain sites without either disabling the extension altogether for that site or allowing Facebook to track me all over the web so my biggest criticism has been dealt with.\n\n5 stars now.", "date": "Aug 17, 2014"}, {"stars": 4, "text": "+1 for the EFF. Good extension...needs work, but does what it's supposed to do", "date": "Aug 17, 2014"}, {"stars": 5, "text": "So far I'm loving this extension. On the other hand I imagine that Google is hating it. And Facebook. And Twitter. And AddThis. And so on and so on...", "date": "Aug 15, 2014"}, {"stars": 5, "text": "love this extension, It does the its job well.", "date": "Aug 14, 2014"}, {"stars": 2, "text": "Breaks my Chrome auto-complete in address bar :(", "date": "Aug 14, 2014"}, {"stars": 5, "text": "Really excited that there's a maintained, non-nagging, effective ad blocker from a trustworthy organization.", "date": "Aug 12, 2014"}, {"stars": 5, "text": "so good", "date": "Aug 11, 2014"}, {"stars": 5, "text": "This works very well. If you are having bad results or a difficult time the tool does allow you to very easily adjust the settings per site. I have done this with great success. So if pictures aren't showing up or google isn't behaving - try using the slider on the tool itself. I love this tool and as a computer professional am putting it on all concerned family member browsers. Privacy is our right and I trust EFF to literally give us the tools to help defend us. So - just don't uninstall it... Show more", "date": "Aug 8, 2014"}, {"stars": 3, "text": "It was great when I first installed it a few weeks ago. But suddenly this week it seems to be causing problems with almost every site I use and more problems each day. I can't login to the supermarket, to a clothing shop I frequent, to news, to magazines and newspaper site. At this point I have to stop using PB or give up most of the sites I normally use on the internet. \nSad choice because I really liked PB and it looked terrifically useful when I started using it.", "date": "Aug 8, 2014"}, {"stars": 5, "text": "No problems here.", "date": "Aug 6, 2014"}, {"stars": 3, "text": "Nice!", "date": "Aug 1, 2014"}, {"stars": 5, "text": "Does what it supposed to do. Of course, some sites try to prevent this and stop working, but that's not the addon's fault.", "date": "Jul 30, 2014"}, {"stars": 5, "text": "Does a great job revealing/blocking the startling high number of 3rd party hooks into the sites I visit.\n\nWish it was available for  Chrome on Android.", "date": "Jul 30, 2014"}, {"stars": 2, "text": "Google Analytics does still track me - even if I block all trackers. This is useless.", "date": "Jul 28, 2014"}, {"stars": 1, "text": "Blocks all images and generally messes up the layout on a substantial number of news and commerce sites. I run a number of other spyware blocking tools and it's not clear why PB thinks there are problems when the other tools don't.\nThe plugin provides no explanation features or whitelisting tools so I can't tell if things are being blocked because the plugin is broken or more diligent. If the plugin provided some explanation of why things were blocked, I'd consider giving it more than one star.", "date": "Jul 27, 2014"}, {"stars": 5, "text": "Clever idea.", "date": "Jul 26, 2014"}, {"stars": 5, "text": "Awesome", "date": "Jul 24, 2014"}, {"stars": 5, "text": "Godsend. Must have!", "date": "Jul 23, 2014"}, {"stars": 2, "text": "Causes Chrome.exe to lingering around for some time after closing the browser. Disk and memory activity observed in Win 8 Task Manager. Try closing Chrome and immediately trying to open it again.\n\nWith Privacy Badger disabled Chrome.exe unloads fast on browser close.", "date": "Jul 23, 2014"}, {"stars": 3, "text": "Like the function, but it seems to mess up the layout in Chrome for certain sites such as Netflix and New York Times, among others.", "date": "Jul 23, 2014"}, {"stars": 5, "text": "Thanks to the developers for this app. My paranoia was justified", "date": "Jul 22, 2014"}, {"stars": 1, "text": "worked for a while then suddenly blocked login to gmail.\nUninstalling.", "date": "Jul 21, 2014"}, {"stars": 5, "text": "I've been a user since almost the first day this was released.   At first there were some issues staying signed into Google Plus and a few other Google services, no other issues outside of Google's walled garden.  Lately it works well with Google too.  I highly recommend this app.  We have to stick together to keep the bastages mostly honest.    Google is one of the worst offenders.", "date": "Jun 29, 2014"}, {"stars": 4, "text": "Need configurable exclusion list/whitelist.\n\nThe longer I use it the worse it interferes with google AND other logins!!", "date": "Jun 16, 2014"}, {"stars": 5, "text": "excellent, well done", "date": "Jun 15, 2014"}, {"stars": 4, "text": "As a side-effect it seems to disable also omnibox prediction service (Chcekbox in settings: \"Use a prediction service to help complete searches and URLs typed in the address bar or the app launcher search box\"). Maybe it should be optional / configurable?", "date": "Jun 13, 2014"}, {"stars": 4, "text": "Love the idea, but it messes up my logins to Google and Kinja. How about an option for exceptions?", "date": "May 30, 2014"}, {"stars": 4, "text": "Works Well, I like it as a more trustworthy alternative to ghostery", "date": "May 30, 2014"}, {"stars": 2, "text": "Had to disable it because it was blocking logins and harmless page elements (like embedded codepen.io examples) even when it was \"disabled.\"", "date": "May 28, 2014"}, {"stars": 5, "text": "Great plugin, keeps my browser safe.", "date": "May 28, 2014"}, {"stars": 5, "text": "Awesomeness", "date": "May 28, 2014"}, {"stars": 4, "text": "If it had whitelisting capability, it would make this app even better :D", "date": "May 28, 2014"}, {"stars": 3, "text": "google translate dont work with this extension active.", "date": "May 24, 2014"}, {"stars": 3, "text": "It seriously needs a whitelist that can be used to preset all the websites with wildcards to the domain names. Any website that uses single sign on or OAuth in any capacity has issues with this enabled.\n\nAside from those quirks, it is good.", "date": "May 23, 2014"}, {"stars": 4, "text": "Great plugin. Had some initial teething problems as I figured out what was OK to block and what wasn't. But once that was done it was smooth going.", "date": "May 18, 2014"}, {"stars": 3, "text": "I've had to disable this plugin because it seems to be messing with my Google login. A whitelist sure would be nice!", "date": "May 18, 2014"}, {"stars": 2, "text": "If it supported permanent whitelisting it would be much better.  \"Disable Privacy Badger for the site\" only works for that instance.  As soon as the page reloads, it's back on.\n\nEFF, please add a permanent whitelist capability!!!", "date": "May 15, 2014"}, {"stars": 2, "text": "For some reason, it blocks some screen sections that shouldn't do. For instance, I cannot see embedded youtube videos on facebook.\n\"Requests to the server have been blocked by an extension\". \nOnce I disable it, it worked fine.", "date": "May 14, 2014"}, {"stars": 3, "text": "Works real well for it's intended purpose. It screws up Google Login on  Gawker media sites though, I tried disabling it on this site only, but that doesn't work. I have to flat out disable all of privacy badger to get the google login's to work on Gawker media, and several other sites like Disqus. Then if you forget to turn it back on, It's useless.", "date": "May 13, 2014"}, {"stars": 3, "text": "It has the right idea, but it blocks too much, and doesn't let you customize it.  I also found that if you want to log into a Google service, it won't let you stay logged in, I don't know if this is by design, but it should let you toggle certain aspects on and off if needed.  Keep up the good work!", "date": "May 10, 2014"}, {"stars": 3, "text": "It blocks the two following Chrome settings and doesn't allow you to reactivate them (in Privacy):\n- Use a web service to help resolve navigation errors\n- Use a prediction service to help complete searches and URLs typed in the address bar \n\nI love the second one and I don't understand why it is blocked by default in Chrome Omnibar but still works fine on Google homepage.\nI want to be able to control this setting.", "date": "May 9, 2014"}, {"stars": 3, "text": "Blocks Facebook rec/share button on advocacy sites, even if disabled on that site, and/or all Badger FB options opened for the page/site. Only allows display of the button if extension completely disabled. Hopefully this bug can be squashed, otherwise a useful extension.", "date": "May 9, 2014"}, {"stars": 5, "text": "As a developer of the extension I am certainly biased, but I've been running the alpha release in my main browser for a few months, and it works very well for me.\n\nWe'll be monitoring the reviews here for bugs and trying to get those fixed as quickly as possible!", "date": "May 8, 2014"}, {"stars": 5, "text": "Works really well and now I don't have to delete the ad nodes in the inspector to make the annoying ads go away. Do not have the youtube/google problem many people have mentioned, everything still works the way I want. Would recommend.", "date": "May 7, 2014"}, {"stars": 4, "text": "Only problem I've had so far is what another user mentioned with YouTube/Google (having to disable entirely to comment on a video, or like another comment). Otherwise, top notch.", "date": "May 7, 2014"}, {"stars": 5, "text": "Does what it's supposed to do, rarely needs to have any setting adjusted. The amount of people failing to understand what this does and how to unblock stuff they need instead of turning the extension off like some are suggesting and leaving bad reviews is staggering.", "date": "May 6, 2014"}, {"stars": 2, "text": "Love the idea but the reality doesn't work. I primarily go to Facebook Fairyland. I have to remove it from chrome to get this game to function. Which of course means I get all of the ads and trackers. Needs more work. Has a lot of potential. Keep working at it.", "date": "May 6, 2014"}, {"stars": 1, "text": "cannot log in to hangouts extension, dont have a control panel to manually see _*ALL*_ domains of which privacybadger controls and set them by hand, so have to guess respective google domains and have to try to disable on them - no avail.", "date": "May 6, 2014"}, {"stars": 1, "text": "With this active you cannot log in to google.", "date": "May 4, 2014"}, {"stars": 1, "text": "Kills Google Hangouts, and corrupts a few too many pages for my liking. I'll try again later, post-beta.", "date": "May 4, 2014"}, {"stars": 5, "text": "Works just fine. And I'm more willing to trust the EFF with protecting my privacy than others, such as Ghostery. Minor matter - Alpha version seems to interfere with Kaspersky Security - I've suddenly been getting pop-ups from Kaspersky saying that it does not recognise a site's certificate.", "date": "May 3, 2014"}, {"stars": 4, "text": "Great idea! I wish you could add the option to remove the icon from the address bar and access it through the extension options exclusively though. But nice alpha anyhow :) PD: google services need to be fixed asap. Disabling it until update.", "date": "May 3, 2014"}, {"stars": 3, "text": "Good so far, but needs a customization page where you can exclude entire domains. My new tab page, for example, no longer has the quick links to my Google apps.", "date": "May 3, 2014"}, {"stars": 3, "text": "I very much want to use this, as the idea behind it it very good.\nHowever, it causes issues with youtube and google, even if set to \"disable for this site\". I have to disable Privacy Badger entirely, if I want to rate a comment on a youtube video, for example.\n\nWhile I could uninstall this, I am just going to toggle it off and on when needed.\n\nHopefully this alpha version of Privacy Badger will be improved upon to more accurately block out google tracking in a way that normal use of google se... Show more", "date": "May 3, 2014"}, {"stars": 4, "text": "Would be great if it would unblock the Hangouts extension.", "date": "May 3, 2014"}, {"stars": 4, "text": "Great app to block unwanted tracking ads. Works seamlessly. Only issue is it blocks Chrome Remote Desktop. I had to deactivate badger so Remote Desktop could work. Hopefully that will change with future updates.", "date": "May 3, 2014"}, {"stars": 5, "text": "Now all of my ads are irrelevant.", "date": "May 2, 2014"}, {"stars": 3, "text": "Nice extension but constantly signs you out from Google services.", "date": "May 2, 2014"}, {"stars": 4, "text": "good, but i cant seem to get it to stop blocking my google hangouts extension. only works when I open a google property in a tab too.", "date": "May 2, 2014"}, {"stars": 5, "text": "Blocks tracking ads and services with almost 100% accuracy. For the things it misses you're able to manually block or allow. Almost perfect.", "date": "May 2, 2014"}, {"stars": 5, "text": "Privacy Badger does a great job of blocking ads that track me across the internet! And it works automatically :)", "date": "Mar 14, 2014"}]