[{"stars": 1, "text": "Downloaded metamask.  Created new account in metamask.  Then tried to create a new account using connect to hardware wallet LEDGER.  get unknown error.  Tried everything suggested in help articles.  Does not connect.", "date": "Mar 10, 2024"}, {"stars": 2, "text": "You're better off without it. Very poorly made", "date": "Mar 9, 2024"}, {"stars": 1, "text": "Seed recovery phrase did not recover the right account. Funds lost forever.", "date": "Mar 9, 2024"}, {"stars": 2, "text": "Why is it inactive??", "date": "Mar 9, 2024"}, {"stars": 1, "text": "i cant no longer change the network?!", "date": "Mar 9, 2024"}, {"stars": 2, "text": "UNRELIABLE\noften loading forever, need to clear cache or even uninstall and reinstall", "date": "Mar 8, 2024"}, {"stars": 2, "text": "Have not been able to log in for 2 days. Just has a blank error screen page", "date": "Mar 8, 2024"}, {"stars": 5, "text": "https://support.metamask.io/hc/en-us/articles/360060268452-How-to-update-the-version-of-MetaMask\n\nI had the problem that Metamask was not working so I followed this to update it and it seems to work now.", "date": "Mar 8, 2024"}, {"stars": 1, "text": "why extention is keep loading not opening", "date": "Mar 8, 2024"}, {"stars": 1, "text": "the extension is not opening just loading in a continuous loop and i don't know why  if there is anything i need to do please help", "date": "Mar 8, 2024"}, {"stars": 1, "text": "I am not been able to log in.in it but can't even log in... please help me out i really need help becuause i dont now the secret phrase..... today I'm waiting for an endless load to process", "date": "Mar 7, 2024"}, {"stars": 5, "text": "Amazing wallet. I have been using this one since I got int ethereum in 2017. It never lets me down. Super easy to recover when theres an issue. All wallets should let you paste your entire recovery phrase into the first place and it autofill. \n\nnavigation is straight forward. It lets you pick transaction speed in a simple way.\n\nYou can connect and disconnect at will. No difficult add this, disable that. No sync issues. Nothing.\n\nWhy doesnt everyone use metamask? Add support for all wallet and... Show more", "date": "Mar 7, 2024"}, {"stars": 5, "text": "it is clear that 100% of the people who review MetaMask negatively are people hired by some competitor or people who do not know how to use a wallet.\n\nI have been using MetaMask since 2019 and I assure you that you will not lose money if you are careful with what you do.\n\nBalances don't disappear by magic, you're still a novice and lack the understanding and skills in using the software.\n\nThere is no doubt that there are better wallets. But stay away from anyone who says it's a scam and that ... Show more", "date": "Mar 7, 2024"}, {"stars": 1, "text": "I am not been able to log in even after giving my secret recovery phrase. Terrible, I am a first time user trying to make a account in it but can't even log in", "date": "Mar 7, 2024"}, {"stars": 1, "text": "Last week it worked normally, but today I'm waiting for an endless load to process my local development transaction.", "date": "Mar 7, 2024"}, {"stars": 1, "text": "endless loading when starting extension, no solution found after 2 weeks.", "date": "Mar 7, 2024"}, {"stars": 1, "text": "cannot log in", "date": "Mar 7, 2024"}, {"stars": 1, "text": "Not working! You can't enter, it was reported and they do absolutely nothing. Terrible service.", "date": "Mar 7, 2024"}, {"stars": 1, "text": "sad", "date": "Mar 7, 2024"}, {"stars": 1, "text": "sentry-install.js:1 TypeError: globalThis.stateHooks.getPersistedState is not a function\n  at i.o [as getMetaMetricsEnabled] (sentry-install.js:1:3225)", "date": "Mar 5, 2024"}, {"stars": 1, "text": "I'm missing the bullrun because Metamask team decided this was a good time to take risks. First the plugin would no longer load at all. Clearing caches, restarting and all that didn't work, only a clean install. All my settings are obviously gone. After getting eye assaulted with a billion useless pop ups I have to manually add all my networks again. First network I switch to (Polygon) immediately disables both access to SETTINGS and switching networks is no longer possible. Now I'm stuck her... Show more", "date": "Mar 5, 2024"}, {"stars": 3, "text": "my metamask dapp is not popping up while im connecting to any websites, i dont have any other wallet extensions, but still same problem , can u help me", "date": "Mar 5, 2024"}, {"stars": 3, "text": "Metamask is misbehaving seriously. It is suddenly not connecting to the sites I used to even while I have not log out. The dev should do something about it. I can't even switch between chains easily. It won't just go. Seems a hack id trying to happen.", "date": "Mar 5, 2024"}, {"stars": 1, "text": "i used to have it in chrome and around 150$ credit. I didn't access it for a few months and the extension disappeared. I tried to installed it again and login, but it created another wallet :| so my money are lost", "date": "Mar 4, 2024"}, {"stars": 1, "text": "Used to be a good wallet. The current rating reflects how bad it is currently", "date": "Mar 4, 2024"}, {"stars": 5, "text": "Cool, just set it for airdrop $ENGM https://nigame.company", "date": "Mar 4, 2024"}, {"stars": 1, "text": "Absoulotely Garbage. Super Expensive and just errors . Do not waste your time and money on this trash. they ate my 100$ and I can not withdraw it its just showing errors for high gas and saying you do not have enough funds while I do. Be away from this scam.", "date": "Mar 3, 2024"}, {"stars": 5, "text": "Kudos to gigi penalu... I'll just repeat her comment how to update.\n\nGuys you need to update the extension for it to work again! Right click on the extension and then manage extension. This will open a new window and then you need to activate developer mode and then it will show the update icon. Click update and then it will work again", "date": "Mar 3, 2024"}, {"stars": 4, "text": "To those unable to open the Chrome extension, the Firefox one works - just switch to that until this is fixed", "date": "Mar 3, 2024"}, {"stars": 1, "text": "not working today, insane...", "date": "Mar 3, 2024"}, {"stars": 1, "text": "Woooooooow Can't be serious right now. I'm thinking I need to update or something and the network just down... I dont like this. I will be working on a project up date for wallets after this for all my apps. This is not good at all.", "date": "Mar 3, 2024"}, {"stars": 1, "text": "Not loading!", "date": "Mar 3, 2024"}, {"stars": 2, "text": "oh! i;ve been on this for a while, i thought my network was jammed\nplease, do something", "date": "Mar 3, 2024"}, {"stars": 2, "text": "Not working. Please update.", "date": "Mar 3, 2024"}, {"stars": 5, "text": "please update, extension not loading", "date": "Mar 2, 2024"}, {"stars": 1, "text": "Please update!!! Cant update from version 11.7.4 and the extension is not working", "date": "Mar 2, 2024"}, {"stars": 1, "text": "No support no one cares for your problems. I deeply regret sending funds to this wallet...", "date": "Mar 2, 2024"}, {"stars": 1, "text": "i tried using my recovery phrase but its not even opening telling me its 12,..,24 words in a phrase even though the input tab's counted as (12) but don't see why its not letting me even to confirm the phrase i just entered developers please fix this .", "date": "Mar 2, 2024"}, {"stars": 1, "text": "fix it please not open it", "date": "Mar 2, 2024"}, {"stars": 2, "text": "cannot open metamask", "date": "Mar 1, 2024"}, {"stars": 5, "text": "GG", "date": "Mar 1, 2024"}, {"stars": 5, "text": "Guys you need to update the extension for it to work again! Right click on the extension and then manage extension. This will open a new window and then you need to activate developer mode and then it will show the update icon.Click update and then it will work again", "date": "Mar 1, 2024"}, {"stars": 5, "text": "Stay safe guys!", "date": "Feb 29, 2024"}, {"stars": 1, "text": "The chrome plugin no longer loads since a recent update to chrome. Poor.", "date": "Feb 29, 2024"}, {"stars": 5, "text": "Metamask Stopped working with Chromium update. Needs to be updated!", "date": "Feb 29, 2024"}, {"stars": 2, "text": "c'mon guys my metamask stopped working", "date": "Feb 29, 2024"}, {"stars": 1, "text": "Not work?", "date": "Feb 29, 2024"}, {"stars": 1, "text": "Not work 😏", "date": "Feb 29, 2024"}, {"stars": 1, "text": "My metamask is not opening. what is the problem? please tell me what should I do ?????", "date": "Feb 28, 2024"}, {"stars": 5, "text": "if its not loading up, update ur extensions like this https://support.cloudhq.net/how-to-manually-update-chrome-extensions/#:~:text=Start%20Google%20Chrome.&text=on%20the%20browser%20toolbar.,Select%20More%20Tools%20%2D%3E%20Extensions.&text=From%20there%2C%20you%20should%20see,Update%E2%80%9D%20button%20pop%20right%20up.", "date": "Feb 28, 2024"}, {"stars": 1, "text": "metamask not opening, it just keeps loading please fix it as soon as possible", "date": "Feb 28, 2024"}, {"stars": 5, "text": "Hey!guys!\nwho can't open metamask.Please update your extension.I put the link below that how can you update.Metamask always provide best service with their users.So be patien in hard situation.And trust on metamask.\nThank You.\nhttps://support.metamask.io/hc/en-us/articles/360060268452-How-to-update-the-version-of-MetaMask\n\nhttps://x.com/MetaMaskSupport/status/1762127863178817565?s=20\n\nhttps://twitter.com/selimctg07 This is my twitter.please follow.", "date": "Feb 28, 2024"}, {"stars": 1, "text": "metamask not opening", "date": "Feb 28, 2024"}, {"stars": 1, "text": "My metamask keep loading without opening pls fix this issue", "date": "Feb 28, 2024"}, {"stars": 4, "text": "l cant open my metamask account, just loading ,\nwhat must l do?", "date": "Feb 28, 2024"}, {"stars": 1, "text": "Extension not working?", "date": "Feb 28, 2024"}, {"stars": 1, "text": "unfortunately the time is running up for metamask... lets move to Rainbow", "date": "Feb 27, 2024"}, {"stars": 1, "text": "metamask no longer connects to Ledger. Cannot get to any of my tokens i held on my ledger through metamask. trash platform! i've never once had a good experience with them. The only help they provide is a computer that never understands what you're saying. thousands of dollars gone right before a bull cycle. how much will it end up costing me by the end of the year? anyone", "date": "Feb 27, 2024"}, {"stars": 1, "text": "My metamask extension stop working, what going on?", "date": "Feb 27, 2024"}, {"stars": 1, "text": "Metamask stopped working. Totally unusable. I am moving to Rabby. Use my referral code KIMCHII to get extra points for their upcoming airdrop.", "date": "Feb 27, 2024"}, {"stars": 1, "text": "ya dont down load this cant tranfer assets", "date": "Feb 27, 2024"}, {"stars": 2, "text": "Don't know what is going on with this extension right now.. Totally can't connecting anymore on pancake swap . Please settle this issue and give a reasonable response", "date": "Feb 27, 2024"}, {"stars": 2, "text": "Don't know what is going on with this extension right now, it was working normally, but now kinda misbehaving, not connecting anymore.", "date": "Feb 27, 2024"}, {"stars": 1, "text": "Worst app i am unable to get back to my pc account.", "date": "Feb 26, 2024"}, {"stars": 1, "text": "Metamask extension in my pc does not connect to websites airdrop for doing the task, inspite of that it connects to all websites which I added. I cleared cache, and even deleted my wallet on my other device, but nothing changed. appreciate your helping me with this issue.", "date": "Feb 26, 2024"}, {"stars": 3, "text": "Pretty useful, but  current day the extension unable to move network. For example to polygon to ethereum. \nThe extension need update or at least to fix this problem.", "date": "Feb 26, 2024"}, {"stars": 1, "text": "very lagging ,not unlock ,loading loading", "date": "Feb 26, 2024"}, {"stars": 1, "text": "Beware!", "date": "Feb 26, 2024"}, {"stars": 1, "text": "im lost all my money.was stolen by someone who controller this extension (and have backdoor key).", "date": "Feb 25, 2024"}, {"stars": 1, "text": "lost almost all of my asset because of this need to reinstall for it to work again better to find a better wallet than this", "date": "Feb 25, 2024"}, {"stars": 1, "text": "Don't have any security, very unsecured wallet. so many lost assets from this wallet and authority dont take necessary step or any responsibility. only bot will chat when anyone fall in problem without any solution. not recommended", "date": "Feb 25, 2024"}, {"stars": 1, "text": "Metamask shows 0 ETH balance but I can see my correct balance on Etherscan. What is going on???\n\nEDIT: Also, the process of connecting to another metamask account is awful: do I really need to remove the extension and install it again every time?", "date": "Feb 25, 2024"}, {"stars": 5, "text": "Just reinstall metamask then re-login, works for me", "date": "Feb 25, 2024"}, {"stars": 1, "text": "Stuck on loading screen!! Time to look at other wallets!", "date": "Feb 25, 2024"}, {"stars": 1, "text": "metamask extension stuck on loading screen , says cant connect to etherium mainnet", "date": "Feb 24, 2024"}, {"stars": 3, "text": "I can not open my wallet. I tried for all the day but still same \nplease fix it", "date": "Feb 24, 2024"}, {"stars": 1, "text": "as of today just writing a review so others are aware.  I can not access my wallets and there is nothing I Found that will fix this problem. I hope Meta Mask would want to fix such a bug.  there are too many recent reviews that are not good and some are down right sad to hear what some people have lost.  I hope the people at Meta Mask get a fix for these problems in the near future so people can actually use the services you provide.  last point:  I guess you get what you get when this is not... Show more", "date": "Feb 24, 2024"}, {"stars": 1, "text": "god this ruin my day i cant open my metamask and when i try to log it in on other browser my  wallet wont pop up please fix this", "date": "Feb 24, 2024"}, {"stars": 1, "text": "wallet loading screen stuck. Brave v1.63.162", "date": "Feb 24, 2024"}, {"stars": 1, "text": "wallet loading screen stuck. fix. as of feb 24.", "date": "Feb 24, 2024"}, {"stars": 1, "text": "Wallet no longer working on Chrome as of yesterday. It is working on Edge though.", "date": "Feb 24, 2024"}, {"stars": 2, "text": "wallet has been stuck since on loading screen. whats the issue please metamask.1o", "date": "Feb 24, 2024"}, {"stars": 1, "text": "Wallet stuck on loading screen", "date": "Feb 24, 2024"}, {"stars": 1, "text": "wallet is not opening on chrome browser", "date": "Feb 24, 2024"}, {"stars": 3, "text": "prompting me to add metamask which I already have!", "date": "Feb 23, 2024"}, {"stars": 3, "text": "cant open my wallet", "date": "Feb 23, 2024"}, {"stars": 2, "text": "The portfolio wont connect on Chromebook even though its installed??  Please fix this ASAP", "date": "Feb 23, 2024"}, {"stars": 3, "text": "wallet is not opening", "date": "Feb 23, 2024"}, {"stars": 2, "text": "Why is this not working properly?", "date": "Feb 23, 2024"}, {"stars": 2, "text": "please fix connecting to chrome!", "date": "Feb 23, 2024"}, {"stars": 1, "text": "Why do I keep getting prompted to install metamask when it is already installed?  Trying to buy a little bit of gas to get my funds OUT of MM because I am so disappointed in the wallet.", "date": "Feb 23, 2024"}, {"stars": 1, "text": "Hey guyz mine is working now, try updating your wallet extension", "date": "Feb 22, 2024"}, {"stars": 1, "text": "My metamask extention isn't opening.I don't have backups.Please tell me a way to unlock my wallet.", "date": "Feb 22, 2024"}, {"stars": 4, "text": "Good!", "date": "Feb 21, 2024"}, {"stars": 3, "text": "Mine (as an extension) just crashed. I will have to see what is required to reinitiate.", "date": "Feb 21, 2024"}, {"stars": 1, "text": "Why does this wallet not connect to dapp? Always ask to install? Stupid version", "date": "Feb 21, 2024"}, {"stars": 1, "text": "SCAMR", "date": "Feb 21, 2024"}, {"stars": 1, "text": "OH MY LORD, this Version is horrible, so many bugs... Go back to 11.4", "date": "Feb 21, 2024"}, {"stars": 1, "text": "For months my wallet wont connect just kept spinning unnecessarily smh a very buggy wack apps so frustrating and i won't forgive u all if they take snapshot before this works.\n\nYou deserve no stars fuvk...but I'll have to give one so the review will be seen work on it.", "date": "Feb 21, 2024"}, {"stars": 4, "text": "I was working on Chrome and today it decided not to work! it keeps looking for it, whirling and spinning around but it does not bring on Password Request session on it! It is at the Chrome extension, I have several times shut it down and again and again.\nI have 2nd Metamask extension on Brave browser and it is working. Thanks", "date": "Feb 21, 2024"}, {"stars": 1, "text": "The security of this wallet is zero, it is even more dangerous than zero. They can empty the wallet at any moment. It has happened to me and my friends several times. Please Google come and buy this garbage wallet and secure it with Google Authenticator. Never, never, even a dollar inside. Do not keep this because you will be scammed.", "date": "Feb 21, 2024"}, {"stars": 1, "text": "Full of errors, bugs, really slow. Interna JSON RPC Error that nobody can fix. Constant problems, I`m switching to Rabby after 6 years of MM", "date": "Feb 21, 2024"}, {"stars": 2, "text": "Cannot connect to Opensea, everytime I try it pops up for me to download Metamask for Chrome (which I have)", "date": "Feb 20, 2024"}, {"stars": 1, "text": "Dear Metamask Team. Why the pop up of metamask cant show up after i try to connect in DApps or login in other WEB3?. This case was suddenly since 3 weeks ago. I tried to uninstalled but always get this problem on chrome browser. My Metamask version is 11.10.0. Please, fix this problem. Thank you!", "date": "Feb 20, 2024"}, {"stars": 1, "text": "Unable to connect to Etherfi or other DApps. Please fix this. When try to connect it is redirecting me to the browser extension which is already installed. please suggest how to do", "date": "Feb 19, 2024"}, {"stars": 1, "text": "Unable to connect to LDO or other DApps. Please fix this. When I try to connect it is redirecting me to the browser extension which is already installed.", "date": "Feb 19, 2024"}, {"stars": 2, "text": "getting issue to Dapp app", "date": "Feb 19, 2024"}, {"stars": 1, "text": "Why metamask is not connecting to any Dapps??? What is the issue? please reply are you guys doin work on it or not?", "date": "Feb 18, 2024"}, {"stars": 1, "text": "Why metamask is not connecting to any Dapps??? What is the issue?", "date": "Feb 17, 2024"}, {"stars": 1, "text": "whats happening in metamask, cant connect dapp, no response", "date": "Feb 17, 2024"}, {"stars": 1, "text": "metamask no longer lets me connect to the dapps everything was fine now I can't connect to any dapp what happened?", "date": "Feb 17, 2024"}, {"stars": 1, "text": "Been hacked and lost a bunch of crypto coin couple days ago  too , too bad , it's been compromised. stay away from it people , or buy a hardware wallet", "date": "Feb 16, 2024"}, {"stars": 5, "text": "Good wallet for web3", "date": "Feb 16, 2024"}, {"stars": 1, "text": "Loose 10K BUSDT! Simply opened wallet and loose all my money! How it's possible that you didnt put attention on security at all! I destroyed and don know what to do!", "date": "Feb 15, 2024"}, {"stars": 1, "text": "This wallet hacked me today.. I haven`t done any transaction but my token suddenly lost and transferred to other wallet. I would not give any star for rating if its possible.", "date": "Feb 15, 2024"}, {"stars": 1, "text": "Don't trust METAMASK !!\nFind another wallet !!\nSTAY SAFE !", "date": "Feb 15, 2024"}, {"stars": 1, "text": "Hi, I have a problem I connect my meta mask with my kiwi browser but I cant connect any site few days ago every think is ok but now not working, any site I connect there is no sign in my meta mask please fix this or help me how to solve this", "date": "Feb 14, 2024"}, {"stars": 1, "text": "please fix this metamask", "date": "Feb 14, 2024"}, {"stars": 1, "text": "This extension is so bad. its not even opening", "date": "Feb 14, 2024"}, {"stars": 1, "text": "I can not connect my metamask when I press connect to metamask from a trusted site like https://dappradar.com/hub/wallet/. I installed windows 11 from windows 10 and still can not. I surely have the latest metamask since I install new windows 11 but no luck. removed the extension and install again still can not connect. Both windows 10 and windows 11 could not connect. I can in my Andoid device but windows and chrome no.", "date": "Feb 14, 2024"}, {"stars": 5, "text": "Good wallet", "date": "Feb 13, 2024"}, {"stars": 3, "text": "it really does not pop-up for connection anymore. this needs a fix. it was working perfectly before the last chrome update. still works well on brave.", "date": "Feb 12, 2024"}, {"stars": 5, "text": "ultimate", "date": "Feb 12, 2024"}, {"stars": 5, "text": "Gg", "date": "Feb 10, 2024"}, {"stars": 5, "text": "Brilliant  work", "date": "Feb 8, 2024"}, {"stars": 5, "text": "Does exactly what you would hope for.", "date": "Feb 8, 2024"}, {"stars": 1, "text": "Mining detected", "date": "Feb 8, 2024"}, {"stars": 1, "text": "worst eth wallet", "date": "Feb 8, 2024"}, {"stars": 2, "text": "MM wallet not popping up when asked to sign on my wallet, what's wrong with the extension?", "date": "Feb 8, 2024"}, {"stars": 5, "text": "when airdrop when?????", "date": "Feb 8, 2024"}, {"stars": 4, "text": "Is users friendly and have a very good Interface", "date": "Feb 8, 2024"}, {"stars": 5, "text": "A great, secure and versatile wallet for digital assets", "date": "Feb 7, 2024"}, {"stars": 1, "text": "trash", "date": "Feb 7, 2024"}, {"stars": 5, "text": "Nice wallet 👍👍", "date": "Feb 7, 2024"}, {"stars": 1, "text": "I've been unable to connect my metamask extension to any site for weeks now and every browser and extension is updated. I even tried connecting manually to a site and still nothing popped after saying connected and its always showing MM has access to this site, please help fix this thanks", "date": "Feb 7, 2024"}, {"stars": 3, "text": "I cannot create a new account, MM just not reflecting to my action", "date": "Feb 7, 2024"}, {"stars": 3, "text": "connect wallet is not working can this be fixed", "date": "Feb 7, 2024"}, {"stars": 1, "text": "Something is not right with MM wallet that we are all familiar with. Wallet can not pops up to connect wallet or approve transaction nor can we even sign message.", "date": "Feb 7, 2024"}, {"stars": 2, "text": "Connecting pop up not working. Taking me to the download page again", "date": "Feb 7, 2024"}, {"stars": 2, "text": "connecting popup not opening, fix this", "date": "Feb 7, 2024"}, {"stars": 1, "text": "it's not popping up, can't log in too", "date": "Feb 6, 2024"}, {"stars": 4, "text": "Good", "date": "Feb 6, 2024"}, {"stars": 1, "text": "What's the problem with metamask, it's not popping up, can't log in too, this is really frustrating", "date": "Feb 6, 2024"}, {"stars": 5, "text": "Best wallet!!!", "date": "Feb 6, 2024"}, {"stars": 1, "text": "is not popping up some site even says metamask not installed", "date": "Feb 6, 2024"}, {"stars": 1, "text": "it needs an update of fix the problems. becomes irritating", "date": "Feb 6, 2024"}, {"stars": 5, "text": "goog", "date": "Feb 6, 2024"}, {"stars": 5, "text": "Very nice apps.", "date": "Feb 5, 2024"}, {"stars": 2, "text": "doesn't pop up or allow connections, fix up you got lots of competitors.", "date": "Feb 4, 2024"}, {"stars": 1, "text": "doesn't work.", "date": "Feb 4, 2024"}, {"stars": 5, "text": "Best EVM wallet I've ever used!", "date": "Feb 4, 2024"}, {"stars": 1, "text": "It stopped working & it doesn't pop up, I can't connect to any sites other wallets works fine, please you need to fix this like now please", "date": "Feb 4, 2024"}, {"stars": 1, "text": "Stopped working. Doesn't pop-up when I try to connect to sites.", "date": "Feb 1, 2024"}, {"stars": 5, "text": "Amazing", "date": "Jan 30, 2024"}, {"stars": 1, "text": "i can't not confirm my Secret Recovery Phrase to make a wallet of metamask\nplease fix the confirm button", "date": "Jan 30, 2024"}, {"stars": 2, "text": "Last update failed half of connection", "date": "Jan 29, 2024"}, {"stars": 5, "text": "nice wallet", "date": "Jan 27, 2024"}, {"stars": 5, "text": "while using V11.7.4, I am unable to add snap \"NEAR Protocol\". Please Fix it", "date": "Jan 27, 2024"}, {"stars": 3, "text": "snap not work", "date": "Jan 27, 2024"}, {"stars": 1, "text": "no work", "date": "Jan 27, 2024"}, {"stars": 1, "text": "seriously Fix this. It has refused to open for months now", "date": "Jan 27, 2024"}, {"stars": 1, "text": "Fully scam & crash extension", "date": "Jan 26, 2024"}, {"stars": 2, "text": "Good project", "date": "Jan 26, 2024"}, {"stars": 3, "text": "dont open it  today.still loading", "date": "Jan 26, 2024"}, {"stars": 2, "text": "keep crash everytime i install. so tired to set up my account over and over. has been 3 days metamask keep crashing.\nrepair, set up account. tommorow error again.", "date": "Jan 26, 2024"}, {"stars": 3, "text": "repeatedly asking to install metamask while its already installed.fix it please", "date": "Jan 25, 2024"}, {"stars": 1, "text": "I had to reinstall my wallet on my desktop. When I connect my metamask wallet with YPred it asks to install the wallet on my browser. My wallet IS installed on my browser (Google Chrome) and my tokens now show ZERO.", "date": "Jan 25, 2024"}, {"stars": 1, "text": "after working 1 year its not able to open again just loading", "date": "Jan 25, 2024"}, {"stars": 1, "text": "The technology in this wallet is extremely angering. When I use the \"bridge\" function from the extension, it opens a full window on my desktop. I select the token to bridge, but the amount shown in the window differs from the extension amount, preventing me from bridging. The extension also continuously notifies me of a \"newly found\" token in my account, asking if I want to import it, yet it's clearly listed in the window Metamask just opened for me, raising concerns about potential scams. My... Show more", "date": "Jan 24, 2024"}, {"stars": 1, "text": "sucks", "date": "Jan 24, 2024"}, {"stars": 3, "text": "Chrome extension is useless, countless requests to connect. move on IT SIMPLY doesn't do the job any longer.", "date": "Jan 23, 2024"}, {"stars": 1, "text": "why does it always link me to another wallet when i'm clearly trying to link with metamask? please fix this issue", "date": "Jan 23, 2024"}, {"stars": 1, "text": "The extension would just loop when I try to login.", "date": "Jan 22, 2024"}, {"stars": 1, "text": "I hate this thing so much.  All i want to do is play God's Unchained and I'm forced to spend hours trying to figure out why i have multiple wallets and where all my money went?  I have an account somewhere with a ton of eth on it i cant find because this app uses some ridiculous \"lose your key-phrase and lose everything\" system.  \n\ngood lord, if this is the future of \"money\" ill be poor.", "date": "Jan 22, 2024"}, {"stars": 3, "text": "its pretty good, used them for a while, but little buggy lately", "date": "Jan 22, 2024"}, {"stars": 1, "text": "Unable to create a new account! Also some of the accounts are shown twice in the list of accounts. Unable to remove accounts that are imported. everything is buggy since yesterday. what's happening? anybody facing similar issues?", "date": "Jan 22, 2024"}, {"stars": 3, "text": "seriously Metamask used to be the best as the original but it doesn't connect a lot of times and just simply doesn't work other times.  it is slow when it is working.  cant we go back to a simple web3 wallet without whatever is always slowing it down in the back end because i love the brand.  Please fix the issues to make Metamask the best again!  thanks", "date": "Jan 21, 2024"}, {"stars": 1, "text": "useless, \nnot connecting , I am trying from long time .", "date": "Jan 21, 2024"}, {"stars": 1, "text": "lame and outdated app, tons of useless nonsense, god, I just want to deposit and withdraw any currencies, and change anything for anything, I don’t care about all these networks, etc. Trust Wallet is much better ", "date": "Jan 21, 2024"}, {"stars": 2, "text": "Lately this extension has not been connecting to dapps.  Sometimes Im unable to  open extension does anyone now why?", "date": "Jan 21, 2024"}, {"stars": 1, "text": "very bad", "date": "Jan 21, 2024"}, {"stars": 5, "text": "good", "date": "Jan 21, 2024"}, {"stars": 2, "text": "not connecting dapps", "date": "Jan 20, 2024"}, {"stars": 1, "text": "Many bugs go unaddressed and unhandled. After all these years, not even a well-made wallet.", "date": "Jan 20, 2024"}, {"stars": 1, "text": "not connecting to sites.... what s wrongs? Please fix this bug", "date": "Jan 20, 2024"}, {"stars": 2, "text": "not connecting to sites \nfix this asap", "date": "Jan 20, 2024"}, {"stars": 2, "text": "connecting problem solve pls", "date": "Jan 20, 2024"}, {"stars": 4, "text": "Metamask not connecting with any sites, why? Please solve this!", "date": "Jan 19, 2024"}, {"stars": 5, "text": "Easy to download and create new wallet", "date": "Jan 18, 2024"}, {"stars": 1, "text": "Can't connect to anything man! wth", "date": "Jan 18, 2024"}, {"stars": 2, "text": "Working like trash, cant connect to anything and tells me i dont have MM installed on chrome", "date": "Jan 17, 2024"}, {"stars": 2, "text": "extremely buggy right now. Is there an update soon?", "date": "Jan 16, 2024"}, {"stars": 5, "text": "why failed transaction in well3.com ?PLZ help me", "date": "Jan 16, 2024"}, {"stars": 1, "text": "Not working in Chrome Canary.", "date": "Jan 16, 2024"}, {"stars": 2, "text": "Extremely buggy.", "date": "Jan 14, 2024"}, {"stars": 5, "text": "Bitcoin, the world's foremost cryptocurrency, has revolutionized the way we perceive and use money in the digital age. With its decentralized and secure nature, Bitcoin offers individuals unprecedented control over their finances and transactions. However, as with any digital asset, the possibility of loss or theft exists, making the need for effective Bitcoin recovery services increasingly crucial.\n\nAs the popularity of Bitcoin continues to soar, so does the risk of potential loss or theft. ... Show more", "date": "Jan 13, 2024"}, {"stars": 1, "text": "Got Hack 2 wallet make me broke unsafe at all. \nLoad take longer take give miner low gas fee (-_-).", "date": "Jan 12, 2024"}, {"stars": 1, "text": "very very bad app....... all time loading", "date": "Jan 12, 2024"}, {"stars": 1, "text": "Metamask does not connect to sites via Google Chrome", "date": "Jan 12, 2024"}, {"stars": 1, "text": "GARBAGE. I!!!", "date": "Jan 12, 2024"}, {"stars": 5, "text": "Best wallet EVER! supports many different chains, fast and simple! Keep it UP!", "date": "Jan 12, 2024"}, {"stars": 5, "text": "Best wallet EVER! supports many different chains, fast and simple! Keep it UP!", "date": "Jan 11, 2024"}, {"stars": 4, "text": "Good wallet", "date": "Jan 10, 2024"}, {"stars": 1, "text": "very unsafe", "date": "Jan 9, 2024"}, {"stars": 1, "text": "unsafe", "date": "Jan 9, 2024"}, {"stars": 1, "text": "Wouldn't touch this with a 100ft pole. Couldn't pay me a million dollars to use it. Because it'll get hacked anyway. \n\n1. There are FAR superior alternatives with better security such as MPC and still can access DeFi. Zengo, among others, and some of these alternatives have never seen a user get hacked. Metamask uses seed phrases of course, has history of exploits and code issues, and billions of dollars have been hacked due to this sub-par tech. \n\nNo reason to use such an old school wallet t... Show more", "date": "Jan 7, 2024"}, {"stars": 5, "text": "BEST WALLET", "date": "Jan 7, 2024"}, {"stars": 1, "text": "17 popups in a single use! and it still did not work, but hey your spam worked out fine", "date": "Jan 7, 2024"}, {"stars": 5, "text": "Great project", "date": "Jan 5, 2024"}, {"stars": 5, "text": "I don't know why, I kept on repeating the steps and it always says \" install metamask \" when it's already been installed. How come this chain wasn't convinient at all.", "date": "Jan 4, 2024"}, {"stars": 5, "text": "Good weeb 3", "date": "Jan 4, 2024"}, {"stars": 5, "text": "I Love this tool for web3!tanks Metamask!", "date": "Jan 3, 2024"}, {"stars": 5, "text": "Nice", "date": "Jan 3, 2024"}, {"stars": 2, "text": "I kept on repeating the steps and it always says \" install metamask \" when it's already been installed. Tried to unistall and  installed again, imported my account and still does not work", "date": "Dec 30, 2023"}, {"stars": 5, "text": "Thanks Great App", "date": "Dec 28, 2023"}, {"stars": 2, "text": "I don't know why, I kept on repeating the steps and it always says \" install metamask \" when it's already been installed. How come this chain wasn't convinient at all.", "date": "Dec 27, 2023"}, {"stars": 1, "text": "metamask become unusable these day i can't connect any site with this wallet.", "date": "Dec 26, 2023"}, {"stars": 2, "text": "why cant it detect my chrome extension.. asking me to install when its already installed.", "date": "Dec 26, 2023"}, {"stars": 1, "text": "this getting stupid every 3 to 6 months have to uninstall and re-install so i can connect to other sites seriously metmask get with the program here, also have to re-import my tokens because they arent there anymore. i am a programmer and web developer maybe hire competent programmers !", "date": "Dec 25, 2023"}, {"stars": 1, "text": "Whats problem with extension today? unable to open. No lock screen...", "date": "Dec 25, 2023"}, {"stars": 1, "text": "worst wallet.\ncan't connect sites,keep asking me to install metamask even its already installed", "date": "Dec 25, 2023"}, {"stars": 1, "text": "am having issue with connecting to some site, also at time its asking me to install meta mask when its already install. is anyone else facing this issue?", "date": "Dec 24, 2023"}, {"stars": 2, "text": "Very buggy lately. Transactions won't pop up (must restart browser), RPC lagging (other wallet working just fine with the same chain). I'm one step away from ditching MM for Phantom.", "date": "Dec 23, 2023"}, {"stars": 1, "text": "very buggy process and poor solution", "date": "Dec 22, 2023"}, {"stars": 1, "text": "Terrible customer service and a terrible product. 11 days I've been dealing with the same issue, I've had 8 different agents tell me to do the same thing, no matter how many times I tell them the last one told me to this. I couldn't interact with any of my positions and lost a few grand on one position before it would finally close and the other wouldnt close and was liquidated due to low collateral (could not add to it). No matter what I did they kept giving me the run around and will tell m... Show more", "date": "Dec 20, 2023"}, {"stars": 2, "text": "Insane fees for transaction and it's even for swapping crypto. Feels like can't make small transactions..for ex: needs to swap a currency with a profit of 20$ but the fee is 30$", "date": "Dec 19, 2023"}, {"stars": 1, "text": "never trust this wallet", "date": "Dec 18, 2023"}, {"stars": 1, "text": "worst wallet ever i dont suggest to use it", "date": "Dec 17, 2023"}, {"stars": 1, "text": "Sites keep using MetaMask although I requested another wallet or walletConnect. Very annoying. Might remove MetaMask for now...", "date": "Dec 16, 2023"}, {"stars": 4, "text": "Who's using it for The Sandbox?", "date": "Dec 15, 2023"}, {"stars": 1, "text": "Totally a trap wallet, dont use.", "date": "Dec 14, 2023"}, {"stars": 1, "text": "Many website saying metamask is not detected and its pin in my browser and i can't open it with single click i try multiple times before it's opened", "date": "Dec 14, 2023"}, {"stars": 3, "text": "How do we update to the new version?", "date": "Dec 14, 2023"}, {"stars": 4, "text": "New version isn't availbale yet", "date": "Dec 14, 2023"}, {"stars": 1, "text": "buggy, and blocks projects...", "date": "Dec 14, 2023"}, {"stars": 1, "text": "buggy :(", "date": "Dec 14, 2023"}, {"stars": 4, "text": "buggy", "date": "Dec 13, 2023"}, {"stars": 3, "text": "too buggy", "date": "Dec 9, 2023"}, {"stars": 5, "text": "The best wallet in world !!!", "date": "Dec 8, 2023"}, {"stars": 1, "text": "The worst.", "date": "Dec 7, 2023"}, {"stars": 4, "text": "wow amazing", "date": "Dec 6, 2023"}, {"stars": 1, "text": "Enables scammers like NFT Trade Place.", "date": "Dec 6, 2023"}, {"stars": 1, "text": "never met such a stupid and heavy dapp", "date": "Dec 6, 2023"}, {"stars": 1, "text": "dont not use, they always hacked. and staff dont help either, always saying we cant help", "date": "Dec 5, 2023"}, {"stars": 2, "text": "Staked Eth through LDO.  Earned $15.  Now Mask wants $29 to unstake.   Arghhh!", "date": "Dec 4, 2023"}, {"stars": 1, "text": "i wanted to make a 6$ transaction.. ended up spending 20$ and still not being able to make the 6$ transaction.. The fees are insane", "date": "Dec 3, 2023"}, {"stars": 2, "text": "All my eth balance shows converting  wings", "date": "Dec 3, 2023"}, {"stars": 1, "text": "way too easy to get hacked... better wallets on the market these days...", "date": "Dec 3, 2023"}, {"stars": 1, "text": "Insane this is advertised across major media when the risk of hacks and catastrophic security incidents is so high even for those who work in crypto with advanced PhDs and entire security teams. It's one thing if libertarians want to do that on their own and self custody and all, but why is this being advertised to the masses so heavily .e.g. across Reddit? \n\nI'm an incoming US grad student who had $73k stolen, much of which were stablecoins. \n\nThis will cause civil unrest at a societal scale... Show more", "date": "Dec 3, 2023"}, {"stars": 1, "text": "For one month I can not claim any token in Polygon... Always it says : We were not able to estimate gas. There might be an error in the contract and this transaction may fail.", "date": "Dec 1, 2023"}, {"stars": 2, "text": "Its a good app but I have a bad expérience with metamask  cause\nBalance note showing , scamers , and hakers .\n I think app need kyc . And extention buy the dev", "date": "Nov 30, 2023"}, {"stars": 2, "text": "Same as many others, stuck transaction spinning forever and wont allow me to send 0 value transaction to myself or anyone else to cancel the stuck transaction as per THEIR instructions, so for months Crypto is stuck in my account and I cant do a damn thing about it apparently.", "date": "Nov 30, 2023"}, {"stars": 1, "text": "garbage product. \"cant connect to ethereum mainnet\" forever.\n\nwont tell me why\nno support on their website for the issue\nhad to reinstall extension 4 times\ngarbage garbage garbage", "date": "Nov 29, 2023"}, {"stars": 5, "text": "Not your keys, Not your crypto. Make sure to get them off of exchanges, and into wallets.", "date": "Nov 28, 2023"}, {"stars": 5, "text": "latest update sigh, wont show proepr balances in Linea\nusually works great though and still best eth wallet to date, cheers \\m/", "date": "Nov 26, 2023"}, {"stars": 4, "text": "Mosted \"goated\" trading extension out there. Easy asf to use and quite simple as well. Use this if you like things to be simple and efficient. 10/10 jk 9.2/10", "date": "Nov 25, 2023"}, {"stars": 1, "text": "Can't seem to purchase from opensea. Tells me to download extension and I already have extension. POS", "date": "Nov 24, 2023"}, {"stars": 2, "text": "A little frustrating when I click my MetaMask my trust wallet will connect I don't understand", "date": "Nov 23, 2023"}, {"stars": 1, "text": "Useless, randomly unconnected from my account. Went to readd extenstion and all my accounts gone", "date": "Nov 23, 2023"}, {"stars": 1, "text": "When I click login from Opensea it says to add the MetaMask extension, but I already have. It is not working properly to be able to use this.", "date": "Nov 22, 2023"}, {"stars": 1, "text": "not working properly. slow", "date": "Nov 22, 2023"}, {"stars": 1, "text": "now metamusk extension not working properly. solve this problem as soon possible.", "date": "Nov 22, 2023"}, {"stars": 1, "text": "Broken, can't open my matamask wallet.", "date": "Nov 21, 2023"}, {"stars": 1, "text": "not working properly. slow", "date": "Nov 18, 2023"}, {"stars": 1, "text": "Every so often will break in my browser, you'd think with so much money and success they'd be good at maintaining the basics...", "date": "Nov 18, 2023"}, {"stars": 1, "text": "Use a 12-digit secret code to log in, but get another ID? Plase help", "date": "Nov 17, 2023"}, {"stars": 2, "text": "Too many alternatives that's way better than metamask.\n\nThis is old and the team is not really trying to improve it. It's the #1 only because it's old.\n\nWhat a shame.", "date": "Nov 17, 2023"}, {"stars": 2, "text": "The wallet is asking for an update. Although I have the latest version installed. Works with bugs, frequent errors when interacting with sites", "date": "Nov 14, 2023"}, {"stars": 1, "text": "cannot add bnb smart chain", "date": "Nov 7, 2023"}, {"stars": 1, "text": "We need an official Metamask site,  The chrome store is full of hacked and corrupted scamware, no oversite . Google should be sued by people who lost their life savings, they dont care about us", "date": "Nov 7, 2023"}, {"stars": 3, "text": "My Metamask doesn`t want to open in the Brave Browser. With other Browser it is no problem. Please fix this, I need acces to this wallet asap", "date": "Nov 6, 2023"}, {"stars": 1, "text": "Very very bad, always loading after update", "date": "Nov 5, 2023"}, {"stars": 1, "text": "Lost my crypto because of a bug that metamask had. Absolutely horrible", "date": "Oct 27, 2023"}, {"stars": 3, "text": "Definitely best wallet so far but their UI/UX designer should be fired. Most of text are hidden, it can't load assets automatically from transactions. Most of assets show zero meanwhile I have coins there.", "date": "Oct 25, 2023"}, {"stars": 1, "text": "USELESS PIECE OF TRASH", "date": "Oct 7, 2023"}, {"stars": 1, "text": "made an account, literally took a photo of the password that was accepted.\nget logged out, now wont accept the correct password, absolute joke", "date": "Oct 5, 2023"}, {"stars": 1, "text": "Lost my 4500$ from the metamask account. No satisfactory answered. I trusted their extension.", "date": "Oct 2, 2023"}, {"stars": 2, "text": "I can't delete my accounts and networks and have to reinstall the app", "date": "Oct 2, 2023"}, {"stars": 1, "text": "a lot of bugs, lost 20$ on bugs with metamask. also there's even no button to accept funds, i cant accept crypto on metamask , the worst wallet ever", "date": "Sep 23, 2023"}, {"stars": 1, "text": "Don't trust this extension. As one of the blockchain developer, they are gathering balances from idle wallets that they covered. They have private keys to handle your wallet, and they will still your money whenever. Leave from Metamask please!! Just use verified platform instead even it's hard to use.", "date": "Sep 20, 2023"}, {"stars": 2, "text": "There is no way I can connect the application on the Brave browser. Until I get this, 2 stars will remain.", "date": "Sep 19, 2023"}, {"stars": 1, "text": "guys dont use this.. if you lose your money there is no where to go.. all these replies are scams. not metamask replying so becareful", "date": "Sep 17, 2023"}, {"stars": 1, "text": "disgusting wallet", "date": "Sep 7, 2023"}, {"stars": 1, "text": "To begin with, please allow us to search and select the network to be used. I do not agree with the time wasting UI design.", "date": "Sep 6, 2023"}, {"stars": 4, "text": "Basically works fine but pop ups dont show in some cases", "date": "Sep 5, 2023"}, {"stars": 1, "text": "Account lost. These bunch of moneys never told to save the private keys, rather over emphasized on seed phrases.", "date": "Sep 4, 2023"}, {"stars": 1, "text": "no working", "date": "Sep 2, 2023"}, {"stars": 2, "text": "why its suddenly very difficult to connect to web3 chrome browser now? for example this site https://onchainsummer.xyz/, galxe etc.   always there will be  new tab askin to 1. create new wallet 2. export existing wallet 3. connect hardware ledger. pls provide solution or guide .", "date": "Aug 27, 2023"}, {"stars": 1, "text": "Wasn't even able to set it up. The Continue button was greyed out. Refreshing the page prompted me to enter my first seed word but it was impossible to type anything into the box. (This was using the extension in the Brave browser). Please fix the bugs.", "date": "Aug 23, 2023"}, {"stars": 1, "text": "why ERC-1155 NFT assets is not yet supported? This shows the weakness of the program.", "date": "Aug 22, 2023"}, {"stars": 4, "text": "nice wallet", "date": "Aug 22, 2023"}, {"stars": 2, "text": "Lots of problems.  Interface is laggy.  Crashes and consumes systems resources.  Not simple.  Barely functional in many instances.  Not configurable.  Not able to issue simple transaction replacement.  Lots of issues and no customer service.  Still, it's one of the few options.  Sometimes it actually works.  \n\nA great example of why there's no actual possibility of crypto being anything other than an interesting \n internet scam.", "date": "Aug 17, 2023"}, {"stars": 5, "text": "Nice wallet!", "date": "Aug 11, 2023"}, {"stars": 1, "text": "Please fix this error:\nMessage: Cannot destructure property 'balance' of '(0 , r.useSelector)(...)' as it is undefined.\n\nCode: TypeError\n\nStack:\nTypeError: Cannot destructure property 'balance' of '(0 , r.useSelector)(...)' as it is undefined.\n  at n.useGasFeeErrors (chrome-extension://nkbihfbeogaeaoehlefnkodbefgpgknn/ui-8.js:1:14207)\n  at n.useGasFeeInputs (chrome-extension://nkbihfbeogaeaoehlefnkodbefgpgknn/ui-8.js:1:19393)\n  at c (chrome-extension://nkbihfbeogaeaoehlefnkodbefgpgknn/ui-7.js... Show more", "date": "Aug 11, 2023"}, {"stars": 2, "text": "The UX/UI is terrible, it used to be better before the recent upgrades. The windows were you select wallet / blockchain are way too small, the official icons are missing, text is crispy. I can't believe how much Metamask is lagging behind the competition. Such a shame considering they were among the earliest in the space.", "date": "Aug 10, 2023"}, {"stars": 5, "text": "Good, fast, secure!!!", "date": "Aug 9, 2023"}, {"stars": 1, "text": "why does it writes \"metamask encountered an error\" every two days", "date": "Aug 4, 2023"}, {"stars": 2, "text": "Buggy and difficult to use.", "date": "Aug 3, 2023"}, {"stars": 1, "text": "Completely destroied metamask. Impossible to change network and other bugs.", "date": "Aug 2, 2023"}, {"stars": 5, "text": "please return the \"check wallet on Scan Explorer\" button\n\nupdate: got a quick response, they updated it. Very important utility features. metamask always da best", "date": "Aug 2, 2023"}, {"stars": 1, "text": "not easy to use, bad UX/UI", "date": "Aug 2, 2023"}, {"stars": 1, "text": "slow service and poor", "date": "Aug 1, 2023"}, {"stars": 2, "text": "godawful performance in Chrome with latest Metamask update.  Having to use Brave on desktop or Mobile Metamask to workaround \"blank\" Metamask probelem", "date": "Jul 30, 2023"}, {"stars": 1, "text": "Its a Top wallet, it is one of the best, one of the best for defi for sure. BUT by far one of the worst wallets when used with the Brave Browser\nReason for one star..... Works maybe 10% of time on Brave Browser, everyone has the issue, they dont seem to ever sort it out. once upon a time few moons ago it worked 90% of the time, good but not great.", "date": "Jul 30, 2023"}, {"stars": 2, "text": "very poor service", "date": "Jul 29, 2023"}, {"stars": 1, "text": "Very bad update. Nothing works well. Won't copy address and won't show me my recovery phrase", "date": "Jul 28, 2023"}, {"stars": 1, "text": "This wallet is pure garbage and very vulnerable to hacks, I lost my funds this week because of their team incompetence.", "date": "Jul 26, 2023"}, {"stars": 5, "text": "Not the best UI, but it's the best wallet there is", "date": "Jul 25, 2023"}, {"stars": 2, "text": "Infinite loops until reinstalled extension.", "date": "Jul 25, 2023"}, {"stars": 4, "text": "Kindly tell us where to get an official  10.33.0 ,  until you  get a bug free update.\n1 order processing in an infinite loop. Tried every solution, that was in help pages.Etherscan can't find it either.", "date": "Jul 23, 2023"}, {"stars": 1, "text": "Updates are bad, it's hard to connect and often comes out on its own, please fix it as soon as possible", "date": "Jul 23, 2023"}, {"stars": 4, "text": "why i cant connect to OpenSea with this wallet?", "date": "Jul 20, 2023"}, {"stars": 1, "text": "The address cannot be copied. Also unable to open the blockchain explorer. You've ruined everything.", "date": "Jul 19, 2023"}, {"stars": 1, "text": "The new version 10.34.0 sucks, my Chrome lags a lot.", "date": "Jul 18, 2023"}, {"stars": 1, "text": "I loved metamask up untill a few days ago. Starting with version 10.33.1 and the latest 10.34, both does not work in Chrome but a manual install of 10.33.0 still works fine even with phantom wallet enabled at the same time. I can't say the same with Brave..omg. dApps will not recoqnize MM and Phantom enabled at the same time, must disable one to use the other. pretty lame", "date": "Jul 17, 2023"}, {"stars": 1, "text": "worst update ever, impossible to copy the wallet address", "date": "Jul 16, 2023"}, {"stars": 2, "text": "metamask has become inconvenient everything is too confusing and finely written, where to switch networks? where you can see what network?", "date": "Jul 16, 2023"}, {"stars": 2, "text": "After the last metamask update, everything is inconvenient, the network is not visible, everything is very small and inconvenient to use, HORROR!", "date": "Jul 16, 2023"}, {"stars": 1, "text": "Can you tell me who changed the default account name? Previously, it was possible to create accounts without entering a username, and the system would automatically increment the account name with a number. Now, it's necessary to manually enter a username to create an account. Is it possible to revert to the previous method? The original way was more convenient.", "date": "Jul 14, 2023"}, {"stars": 1, "text": "Absolute garbage as I cannot even cannot metamask to any web3 page... Keeps  telling me that it is unable to switch to ethereum network.... Based on the reviews lately, I see that I am experiencing the  same problems as the rest who updated this garbage app", "date": "Jul 12, 2023"}, {"stars": 1, "text": "Forced re-haul of the GUI with no way to use the old one. There's nothing like taking things that used to be one button click and adding 2 more clicks for absolutely no reason.\n\nI also have a bug where importing a wallet using a private key, creates a un-removeable wallet that's also named the private key. Lord.", "date": "Jul 12, 2023"}, {"stars": 1, "text": "NEW update broken apps, fatal error", "date": "Jul 11, 2023"}, {"stars": 3, "text": "latest update causes an infinite load on OpenSea.\n\nto others experiencing this, do this:\n- disconnect from the site\n- re-connect", "date": "Jul 11, 2023"}, {"stars": 3, "text": "Latest update does not connect to OpenSea or Rarible. When I try, I get an erratic loading bar from OS and can't connect. Rarible shows an endless loading wheel.. Any help would be greatly appreciated as I am now dead in the water. Chrome is updated, the MM extension is updated. This is the first time I have had any issue like this. Hopefully I am not the only one with this issue and you are aware of it and currently working on a hot fix...", "date": "Jul 11, 2023"}, {"stars": 3, "text": "New design is unbearable. Everything became and brighter (?)\nWhy would you make button for switching networks so small. \nI'm switching networks several times a day.\nMaybe remove that button or hide it somewhere deep if you think it's not important? (sarcasm)\nAlso it became harder to select a network. I think before I could see like 5 of them at once and now it's only 3?! Now I have to waste several seconds more to scroll and find the right network...\n\nAlso showing network next to EACH COIN IC... Show more", "date": "Jul 10, 2023"}, {"stars": 2, "text": "last 2 versions 10.33 (latest) metamask start crashing and freezes during some transaction approve\n\n2 years no problem and right now it's impossible to use :(", "date": "Jul 10, 2023"}, {"stars": 1, "text": "How to reveal Secret phrase in mises browser.\nI hold button a few minutes But not showing  reveal SECRET PHRASE .\nI use Mises Browser android", "date": "Jul 9, 2023"}, {"stars": 5, "text": "Amazing", "date": "Jul 7, 2023"}, {"stars": 5, "text": "good app", "date": "Jul 6, 2023"}, {"stars": 1, "text": "i can boldly say that it is the dirtiest wallet i have ever seen in my life", "date": "Jul 4, 2023"}, {"stars": 3, "text": "With the latest version 10.32.0 , I always got stuck when I try to sign for voting with any contact. It's hang suddenly whenever pop up jump out. It happen with every browser that I try. Never had this issue before.", "date": "Jul 4, 2023"}, {"stars": 2, "text": "Recently my Firefox version Metamask stopped working, and now chrome too.", "date": "Jul 4, 2023"}, {"stars": 5, "text": "Very bad ...every sites shows not installed metamask when I tried to connect", "date": "Jun 30, 2023"}, {"stars": 1, "text": "Hold to reveal private key function does not work at all in extension...donot use this bad extension if you donot saved your private key for extension then it is same as lost as hold to reveal function doesnot work at all.", "date": "Jun 29, 2023"}, {"stars": 1, "text": "Lost fund 3 times , there is lost of security issue, Please aware before hold funds", "date": "Jun 29, 2023"}, {"stars": 1, "text": "Connecting to Defi Oracle Meta Mainnet! I cannot get past this! Nothing happens. Two days now", "date": "Jun 28, 2023"}, {"stars": 5, "text": "I bought a Defi Mev from mevengine.com and metamask works well with this bot.\nI love metamask!", "date": "Jun 28, 2023"}, {"stars": 1, "text": "I lost my 1.16 ropsten eth, which is almost 1,808.68$, because of that deprecation of ropsten i lost a whole life money", "date": "Jun 27, 2023"}, {"stars": 1, "text": "Terrible app freaking poor user experience. Switching to a chain and getting stuck. This app should be deleted from Chrome store", "date": "Jun 24, 2023"}, {"stars": 1, "text": "THIS IS ABSOLUTELY THE WORST PROGRAM EVER. THERE IS NO HELP INFO ON GETTING THIS PROGRAM TO WORK FOR YOU. CAN'T SIGN IN, NO PROMPS TO GUIDE YOU NOTHING JUST A WAIST OF TIME BEING HERE.", "date": "Jun 22, 2023"}, {"stars": 1, "text": "the worst thing i've ever seen very hard to manage the worst the worst isn't enough word", "date": "Jun 21, 2023"}, {"stars": 2, "text": "I cannot open my wallet,it says error", "date": "Jun 17, 2023"}, {"stars": 5, "text": "super", "date": "Jun 17, 2023"}, {"stars": 2, "text": "Recent update on chrome extension, I can't hold SRP button to reveal my seedphrase..  how do I get my seedphrase.. ?", "date": "Jun 16, 2023"}, {"stars": 5, "text": "hello dear i bougt some token buy not lunch yet but doesnt show on my wallet what can i do thanks\nmy wallet address\n0xDcdd8E131f8eECeF87095e628Bb8089b1BA635d2", "date": "Jun 12, 2023"}, {"stars": 5, "text": "right click to change what it can do but a nice wallet", "date": "Jun 10, 2023"}, {"stars": 1, "text": "For some reason impossible to log in to my wallet from Chrome... while no problem to do so on Firefox. When it comes to MetaMask wallet - super complicated to use for non crypto person.", "date": "Jun 8, 2023"}, {"stars": 5, "text": "Harder to use than most wallets, but if you're an advanced user or professional, this is the best software wallet.", "date": "Jun 7, 2023"}, {"stars": 1, "text": "I made screenshot of recovery phrase for backup. Recently I was forced to reinstall windows, so I should re-import wallet.\nFor some reason it says that my phrase is invalid but it is impossible. Cool.", "date": "Jun 4, 2023"}, {"stars": 1, "text": "Just waste of time", "date": "Jun 3, 2023"}, {"stars": 1, "text": "IT IS A TORJAN DO NOT USE IT. THEY TRACK YOUR IP AND KNOW WHICH SITE YOU VISIT AND READ WHAT YOU HAVE COPYED AND PASTED.", "date": "Jun 3, 2023"}, {"stars": 1, "text": "worst system for accounts lost all my accounts after needing to reset my exention. and importing stuff accounts is way to complicated. DO NOT USE METAMASK EVER", "date": "Jun 1, 2023"}, {"stars": 1, "text": "worst system for accounts lost all my accounts after needing to reset my exention. and importing stuff accounts is way to complicated. DO NOT USE METAMASK EVER", "date": "Jun 1, 2023"}, {"stars": 1, "text": "worst system for accounts lost all my accounts after needing to reset my exention. and importing stuff accounts is way to complicated. DO NOT USE METAMASK EVER", "date": "Jun 1, 2023"}, {"stars": 2, "text": "I installed it but now Windows Security found a trojan on MetaMask extension folder. It's so weird!\nDetected: Trojan:JS/Phish!MSR\nAffected items:\nfile: C:\\Users\\...\\AppData\\Local\\Microsoft\\Edge\\User Data\\Default\\Extensions\\nkbihfbeogaeaoehlefnkodbefgpgknn\\10.30.4_0\\background-1.js", "date": "Jun 1, 2023"}, {"stars": 5, "text": "Best wallet. Brothers who use Metamask, can join TrustClaim (Coinmarketcap) - now you can claim free tokens and NFT's for new users: https://trustclaim.co/", "date": "May 29, 2023"}, {"stars": 1, "text": "Metamask is trash. They have had this failed transaction problem for months and they have not fixed it. I feel like they are making money on the problem which is why they have not fixed it. I cant wait to find a better solution. ABSOLUTE TRASH!", "date": "May 29, 2023"}, {"stars": 3, "text": "Why my antivirus show me TROJAN when i'm trying to downloud new version???????????", "date": "May 28, 2023"}, {"stars": 5, "text": "best wallet in web3", "date": "May 25, 2023"}, {"stars": 1, "text": "i can't connect automatic from wallet web to metamask", "date": "May 21, 2023"}, {"stars": 1, "text": "worst system for accounts lost all my accounts after needing to reset my exention. and importing stuff accounts is way to complicated. DO NOT USE METAMASK EVER", "date": "May 21, 2023"}, {"stars": 2, "text": "Fantom, API3, just disappeared.", "date": "May 20, 2023"}, {"stars": 1, "text": "it just doesn't work. he has no future. only earn money from commissions.", "date": "May 18, 2023"}, {"stars": 1, "text": "Metamask stole $1449 from my wallet and they don't want to return it. Don't send money here, it's a scam.", "date": "May 16, 2023"}, {"stars": 3, "text": "一直在转圈。。。。。好几天了\n\nError: PollingBlockTracker - encountered an error while attempting to update latest block: TypeError: Failed to fetch at e.<computed> (chrome-extension://nkbihfbeogaeaoehlefnkodbefgpgknn/sentry-install.js:1:693) at chrome-extension://nkbihfbeogaeaoehlefnkodbefgpgknn/sentry-install.js:76:16233 at chrome-extension://nkbihfbeogaeaoehlefnkodbefgpgknn/runtime-lavamoat.js:10628:24 at chrome-extension://nkbihfbeogaeaoehlefnkodbefgpgknn/runtime-lavamoat.js:10628:24 at chrome-extension... Show more", "date": "May 16, 2023"}, {"stars": 1, "text": "Awful wallet with outdated interface and new bugs appearing out of nowhere. Seems like developers got stuck in 2017. Terrible experience. The only one reason I keep using it is a support of test networks. Otherwise there are much more better extension wallets to use.\nFor the current moment there are 2 critical bugs that prevent from using this piece of sht. Malfunction of gas estimation on Optimism chain. And random error on token approval, mm just shows error and does nothing with very \"usef... Show more", "date": "May 15, 2023"}, {"stars": 1, "text": "Looking for a replacement. Each update brings new bugs, without any useful features. Instead of fixing tons of critical bugs, the development team works on removal of working (and actually important) features. For example:\nSo would has been \"Improved\" last time:\n- Address book became unusable. It is easier to remember address then to find an address in metamask contact book or to add it there. \n- It is simply impossible to customize Fee. Buttons just disabled. So you will pay as much as Metam... Show more", "date": "May 12, 2023"}, {"stars": 2, "text": "always an error and asking to be repaired is very annoying, please fix it as soon as possible", "date": "May 12, 2023"}, {"stars": 1, "text": "There's a bug! The extension keeps crashing!", "date": "May 11, 2023"}, {"stars": 1, "text": "The future of finance 🤡🤡🤡🤡🤡🤡🤡", "date": "May 11, 2023"}, {"stars": 1, "text": "security is 0, and they don't care about your funds. a lot of people lost their funds because of their basic system. don't trust to have your funds in here. and in the end they will tell was your fault. better have your funds on binance, if something happen they cover yours losses", "date": "May 11, 2023"}, {"stars": 5, "text": "Great extension and perfect wallet for standard ERC20 tokens / chains. Also it has a good integration into development tools like remixIDE. I had to laugh when reading all the negative comments. Maybe people should try understand what they are doing before putting money in a technology they do not understand and where they are completely responsible for their own actions. \nBlaming MetaMask for high fees clearly shows that there is zero understanding of the topic. Its like blaming your car for... Show more", "date": "May 11, 2023"}, {"stars": 1, "text": "Don't use it. The software is so broken. \nThey stole me almost 4000$ from my wallet.\n\nWallet was used only on clean pc (pc was only for this purpose). My unique words wasn't saved anywhere.", "date": "May 10, 2023"}, {"stars": 2, "text": "Can't run the extension", "date": "May 5, 2023"}, {"stars": 1, "text": "Always on load / refresh, crashes, completely unacceptable. I can't even access my funds to bridge because this thing won't show my tokens ... Unless absolutely necessary, never use this wallet. The UX is also horrendous. No tooltips, nothing intuitive.", "date": "May 4, 2023"}, {"stars": 4, "text": "I don't know why. But with this MetaMask extension in the browser active (enabled), I cannot log in to the battle.net site. When I disable the MetaMask extension in the browser settings, I can log in to the battle.net site. Fix it.", "date": "May 2, 2023"}, {"stars": 1, "text": "Unable to even confirm my security phrase.", "date": "May 1, 2023"}, {"stars": 2, "text": "i can´t connect to any website what is going on???", "date": "May 1, 2023"}, {"stars": 1, "text": "trash wallet. unable to connect to uniswap, 1inch. tried everything and still this wallet won't appear on uniswap's wallet options", "date": "May 1, 2023"}, {"stars": 1, "text": "Poor UX, several bugs that were never fixed. Poor gas manager, I'm always paying more than I should. Slow development. I'm done.", "date": "May 1, 2023"}, {"stars": 1, "text": "It won't let me sign in. Garbage...", "date": "Apr 29, 2023"}, {"stars": 5, "text": "Best Crypto Currency Wallet for Beginners ;-)", "date": "Apr 29, 2023"}, {"stars": 1, "text": "I tried so hard to find the browser inside the metamask but there's no where to find.This extension doesn't include the app browser, please update it.", "date": "Apr 29, 2023"}, {"stars": 1, "text": "Unable to find edit gas fee", "date": "Apr 28, 2023"}, {"stars": 5, "text": "not bad", "date": "Apr 21, 2023"}, {"stars": 3, "text": "Nice wallet used for two years but it stopped working in Google Chrome since 10th of April 2023. The wheel is hanging without displaying the field for login and password input. 20th of April it also stopped working in Opera. Error in console: runtime-lavamoat.js:7087 ReferenceError: LavaPack is not defined\n  at ui-5.js:1", "date": "Apr 20, 2023"}, {"stars": 5, "text": "Hi\n\nCant connect to any site after a new version is installed\nChrome browser - version 109.0.5414.119\nMacbook pro - Ventura OS", "date": "Apr 19, 2023"}, {"stars": 1, "text": "I have remaining balance of .9 JMPT on my JumpTask account and someone hacked and stole it with my bnb remaining balance. There's a transaction that my wallet has sent jmpt to another wallet, which I never recognize 0xc3a7b06286992e05f4e3a63f0cc10ff76287851a. I cannot see that I approved the signature on BSCSCAN - Token Approval section as I checked there. And no one on Metamask even bothers to fix it after sending them report and ticket. They have weak security and it is really frustrating t... Show more", "date": "Apr 17, 2023"}, {"stars": 1, "text": "hasn't been working properly since the last update. zzz", "date": "Apr 16, 2023"}, {"stars": 2, "text": "Websites that I want to connect dont detect my metamask. I have this problem for a week. What's the problem.", "date": "Apr 14, 2023"}, {"stars": 5, "text": "Keep upgrading and making it more user friendly!! Lets Go MetaMask!!! You Got This!!! NFT Detection.... Stronger Privacy.... Easier logins for the user but safer.... Auto pulls for updating internet..... Just keep doing all of this and you are good!!! Hey I need investors, 'Cough' 'Cough' - MetaMask - 'Cough' Lol I am just saying... have a great crypto ready to rock and roll!!!!!!!!", "date": "Apr 14, 2023"}, {"stars": 1, "text": "Terrible wallet. I have it installed in Google, but when I log in to Open Sea, a window pops up in the Google store, where it suggests deleting it. It turns out a vicious circle, there is no way to use", "date": "Apr 11, 2023"}, {"stars": 4, "text": "Please why my wallet cant connect to website at Chrome?", "date": "Apr 11, 2023"}, {"stars": 1, "text": "Whats wrong with this update please. I can not detect my wallet again. Not dapp detects my metamask instead they will ask me to download it again when already downloaded and installed", "date": "Apr 10, 2023"}, {"stars": 1, "text": "Not connecting to OpenSea after update. Tried to remove and reinstall. Not connecting! Devs Do SOMETHING!", "date": "Apr 10, 2023"}, {"stars": 3, "text": "Seems to be some issue with connecting to my metamask wallet. Not sure if anyone is experiencing the same issue since 09 April 2023. whenever i try to connect in Opensea, it leads me to the landing page of \"Install Metamask on your Browser\" when I've already had metamask wallet installed", "date": "Apr 10, 2023"}, {"stars": 1, "text": "bad i hate web3 bad", "date": "Apr 10, 2023"}, {"stars": 1, "text": "new update can not connect any website to metamask", "date": "Apr 9, 2023"}, {"stars": 3, "text": "after new update can not connect any website to metamask \nplease resolve this issue", "date": "Apr 9, 2023"}, {"stars": 2, "text": "I can't delete network", "date": "Apr 9, 2023"}, {"stars": 4, "text": "I've been having trouble connecting to sites for 3 days. do you have a solution suggestion?", "date": "Apr 8, 2023"}, {"stars": 5, "text": "Amazing wallet extension. I using connected daily to any site for manage my crypto assets. If I find some bugs or troubles for new version updated, then I download previous package on github (https://github.com/MetaMask/metamask-extension/releases)", "date": "Apr 8, 2023"}, {"stars": 2, "text": "It was once the standard-browser-wallet but this has long changed, it's riddled with bugs and development obviously has stopped. The loading-screen bug which is 2 years old still exists... always issues connection to polygon rpc, wallet-saldo is wrong, nft's are not recognized and so on and on, the portfolio site is a nice idea, but it's not actually working like the browser-extension so it's worthless as well. I recommend Trust Wallet, which still has active development.", "date": "Apr 8, 2023"}, {"stars": 1, "text": "we are facing issue even on importing wallet , creating ..etc! it doesn't work anymore ! what happened?", "date": "Apr 8, 2023"}, {"stars": 1, "text": "worst crypto wallet,i cant get my money back. I am stuck beacause of gas fees, i cant pay them since i don't own any eth.", "date": "Apr 7, 2023"}, {"stars": 1, "text": "Not detecting any website", "date": "Apr 7, 2023"}, {"stars": 2, "text": "SUDDENLY it doesn't work anymore after the chrome update!!!! WTH??", "date": "Apr 7, 2023"}, {"stars": 2, "text": "Switch chain doesn't work after update to latest version from all web3. Hard to use and no function sorting network/pin/favourite network. Please fix", "date": "Apr 7, 2023"}, {"stars": 2, "text": "The worst wallet... but it is everywhere on the web3 lel", "date": "Apr 6, 2023"}, {"stars": 2, "text": "I'm not sure what's happened, but after a certain point my metamask wallet is basically unusable.  I'm using sepolia testnet for ethernaut and the behavior is extremely inconsistent.\n\n- some times the window stays spinning forever even if an action was successful\n- some times I can't transfer assets, the button remains grayed out even if I have an adequate balance\n- half of the time, my assets don't show up and I have to close and re-open the wallet for them to show\n- some times the wallet cr... Show more", "date": "Apr 6, 2023"}, {"stars": 3, "text": "Ok", "date": "Apr 1, 2023"}, {"stars": 1, "text": "I don't like it. I'm not allowed to post on their forum because I have to read 100 other posts.\nThe subredit keeps deleting my posts because of muh karma.\nI installed it on my phone, it also has a browser included that nobody asked for.\nand the taxes are awful, especially in AVAX. IDK why they even added it. \nI would have rated you 3 stars but you added a browser in your mobile app which I absolutely hate... and nobody asked for it. Just because you can add a browser as a wallet app it doesn'... Show more", "date": "Mar 31, 2023"}, {"stars": 3, "text": "Now I often can't connect to the app, please help the developers to update this problem so that users are more comfortable using metamask", "date": "Mar 31, 2023"}, {"stars": 5, "text": "Best wallet!", "date": "Mar 29, 2023"}, {"stars": 1, "text": "WHEN I WAS TRYING TO FIND the connect button cause i logged in i couldn’t find it\nthe most basic terrible thing to happen", "date": "Mar 29, 2023"}, {"stars": 2, "text": "Cannot cancel the transfer. It has been in a pending state for 24 hours", "date": "Mar 29, 2023"}, {"stars": 1, "text": "Guys, as a multi-million user base wallet you MUST hire a great UX/Concept designer and a product owner. The updates you do (for a long time!) prove that there's no capable UX/product yet.\n\nNow onto the subject. How could you replace the \"Log Out\" button with \"Lock\"? By missing the screen to import the wallet in forever-changing onboarding flow, now I simply can't import another seed phrase after logging in.\n\nHint: please don't do crazy design decisions and make it simple to understand. Like,... Show more", "date": "Mar 28, 2023"}, {"stars": 3, "text": "How to log out from wallet?? Is hard to find where is logout  button!!", "date": "Mar 27, 2023"}, {"stars": 1, "text": "This is the most insecure wallet in the world!\nIf you want to lose your assets use Metamask\nI lost about 6k$ because of Metamask\nPlease DO NOT keep even a Cent in this wallet", "date": "Mar 24, 2023"}, {"stars": 2, "text": "The activation has been rejected by the provider. wy?", "date": "Mar 23, 2023"}, {"stars": 1, "text": "Unusable interface due to sluggishness and constant connection issues, borderline trash at this point. It has gotten slower all the time during last few years, up until the point it doesn't reliably load gas values or barely even connect's to the chosen RPC's after few minutes since initially opening/loading the extension.", "date": "Mar 22, 2023"}, {"stars": 3, "text": "In the past 2 weeks metamask has been uninstalled from Chrome without me doing anything around 5-7 times. Most of the time I just reinstalled it and entered my password, twice I had to put in my seed phrase. What's going on?? I only have it connected to Ledger X accounts.", "date": "Mar 22, 2023"}, {"stars": 2, "text": "Doesn't work with Ledger Nano S Plus.", "date": "Mar 22, 2023"}, {"stars": 4, "text": "Very nice", "date": "Mar 21, 2023"}, {"stars": 4, "text": "10.26.1 windows notification memamask now work fix please!", "date": "Mar 19, 2023"}, {"stars": 1, "text": "Used to be perfect and simple, now, it literally just stops working all the time and i have to restart it completely.", "date": "Mar 19, 2023"}, {"stars": 3, "text": "Was fine until the update 2 days ago...stopped working on Chrome + OperaGX, Firefox still works but yeah maybe testing your updates on a large scale/different browsers before actually pushing them out would be an idea?", "date": "Mar 16, 2023"}, {"stars": 3, "text": "If you are facing problem with connecting to dapps, hide all the extensions and on metamask only. It will work, do it.", "date": "Mar 16, 2023"}, {"stars": 5, "text": "the best wallet out here on crypto space", "date": "Mar 16, 2023"}, {"stars": 1, "text": "The new feature that forces the domain names to be the same is breaking a lot of Dapps: \nI get this message all the time \"Error: SIWE domain is not valid\" and Signature popup is closing instantly", "date": "Mar 15, 2023"}, {"stars": 5, "text": "As a temporary fix for the new update, disable other extensions and refresh the browser. You can also try enabling some extensions that are not conflicting with metamask.", "date": "Mar 15, 2023"}, {"stars": 1, "text": "new update MARCH 14 renders it unusable. Doesn't connect to dApps\n\nNote for devs: I'm on the latest version of brave browser. Firefox and normal Chrome work well.", "date": "Mar 15, 2023"}, {"stars": 3, "text": "good extension most of the time, but from this morning it became useless as i can't connect it to any of the dapp site. how can we get back to use it???? please help", "date": "Mar 15, 2023"}, {"stars": 3, "text": "Have been using for a LONG time. After the new update, it is completely un-usable and does not let me connect to any dapps. PLEASE FIX ASAP THIS IS RIDICULOUS.", "date": "Mar 15, 2023"}, {"stars": 1, "text": "Super slow and after last update keeps crashing my whole chrome.\nAdd option where i can select 'Aggressive' as my default, advanced settings are useless because it you switch chains it will give wrong gas calculations.\nWhen i want to make any TX in any chain, there is always this 1-3 second loading that makes the 'Send' button grey but sometimes i want to quickly click why does it grey out these 2-3 seconds? Just let me instantly click Send sometimes we need full speed.", "date": "Mar 15, 2023"}, {"stars": 5, "text": "good", "date": "Mar 15, 2023"}, {"stars": 3, "text": "My metamask can't be detected by sites or dapps. When I press the connect button, nothing happens. I tried different ways but it didn't work. I use the Metamask extension on Chrome.", "date": "Mar 15, 2023"}, {"stars": 2, "text": "After update cannt read notification", "date": "Mar 13, 2023"}, {"stars": 1, "text": "so bad, too many bugs", "date": "Mar 13, 2023"}, {"stars": 5, "text": "Easy to use later on but has a bit of a learning curve as with any new tech", "date": "Mar 10, 2023"}, {"stars": 5, "text": "Metamask has been around since day one. It has not behaved incorrectly. It works. It is good for the space. And its OG.", "date": "Mar 1, 2023"}, {"stars": 2, "text": "It's ugly, slow, cluttered and buggy. Can't believe it is still one of the best options out there.", "date": "Feb 28, 2023"}, {"stars": 2, "text": "disliked the metamask wallet because the wallet i have own 12 phase word i,m doing new window on my laptop then install metamask but metamask say say 24 phase word in import wallet but i don,t have 24 phase word i have 12 phase word only where i take 24 phase word to import wallet its scam wallet thanks", "date": "Feb 27, 2023"}, {"stars": 5, "text": "great", "date": "Feb 22, 2023"}, {"stars": 2, "text": "leaked my email address to a scammer, then denied it in a support conversation and disconnected me from the agent.", "date": "Feb 20, 2023"}, {"stars": 1, "text": "it forces to get BNB. why cant i pay for swapping from my own type of asset?", "date": "Feb 19, 2023"}, {"stars": 1, "text": "official metamask is SCAM i lost my balances without share my private key or mnemonic", "date": "Feb 17, 2023"}, {"stars": 1, "text": "when I active Metamask, on some of the website, it's always active a fake service worker and taking my processor's power. in my case, the fake service worker is https://wp.pl but the name of the service work is probably fake, because when i block wp.pl service worker, it still shows up. I see it everytime when I open site : www.olx.pl while the Metamas extension is actived. \n\nDoes Metamask hacked your PC for mining?", "date": "Feb 15, 2023"}, {"stars": 5, "text": "good", "date": "Feb 13, 2023"}, {"stars": 1, "text": "Rubbish with too many bugs!", "date": "Feb 11, 2023"}, {"stars": 2, "text": "The most frustrating app in crypto; which is saying a lot. For a product with great brand recognition, the user experience just keeps gets worse. Moved to Rainbow wallet and no looking back.", "date": "Feb 11, 2023"}, {"stars": 3, "text": "Cannot read properties of undefined (reading 'balance')\n\n\nTypeError: Cannot read properties of undefined (reading 'balance')\n  at n.isBalanceCached (chrome-extension://nkbihfbeogaeaoehlefnkodbefgpgknn/common-7.js:1:134123)\n  at chrome-extension://nkbihfbeogaeaoehlefnkodbefgpgknn/ui-3.js:1:200583\n  at chrome-extension://nkbihfbeogaeaoehlefnkodbefgpgknn/ui-3.js:1:201080\n  at R (chrome-extension://nkbihfbeogaeaoehlefnkodbefgpgknn/ui-5.js:1:408886)\n  at ha (chrome-extension://nkbihfbeogaeaoehlefn... Show more", "date": "Feb 8, 2023"}, {"stars": 1, "text": "this is a VERY nasty extension as it's a MAJOR invasion of privacy ... they even SAY they're gonna invade your privacy:\n\n\"MetaMask collects the following:\n\nUser activity\nFor example: network monitoring, clicks, mouse position, scroll, or keystroke logging\"\n\nafter installing, i started getting two or three emails a day every day from NEW spam sources ... unsubscribing didn't slow the onslaught ... given the nature of the spam, it seemed to me that something was harvesting my cookies, so i star... Show more", "date": "Feb 7, 2023"}, {"stars": 5, "text": "Good job Man 🔥🔥", "date": "Feb 6, 2023"}, {"stars": 2, "text": "I do not recommend this as a wallet for any user. The wallet fails all the time, it does not load tokens in even with the enhanced token detection, there are many times where I have a panic attack because MM shows I have 0 tokens but it was just a glitch on their part. I would use any other wallet than this one, this wallet has too many issues and overall sucks.", "date": "Feb 2, 2023"}, {"stars": 1, "text": "Used since 2020 however I am no longer a user.  The mobile app has been disregarded and still sux really bad.   Competitors have surpassed Metamask and it's going to take a massive change to get me back", "date": "Feb 1, 2023"}, {"stars": 1, "text": "Way too many bugs. Only use if you enjoy missing out on trades and wasting your time.", "date": "Jan 28, 2023"}, {"stars": 5, "text": "Are you ready to step up your crypto game? Look no further than MetaMask, the ultimate Ethereum wallet extension for your browser. This bad boy injects the Ethereum web3 API into every website you visit, so you can access all those fancy dapps like a boss. Plus, you can create and manage your own identities, so you're always in control of your transactions. And if you're worried about falling for phishing scams, MetaMask has got you covered with warnings for suspicious sites.\nIt's like having... Show more", "date": "Jan 27, 2023"}, {"stars": 1, "text": "SCAM (DO NOT USE)\n\nReinstalled MetaMask using my Secret Recovery Phrase (SRP) and lost my funds and sub-account (0x #). Contacted tech support and what was their solution? Create multiple accounts until it hopefully comes back. This is a scam. They offer no real support. My money is now gone.", "date": "Jan 23, 2023"}, {"stars": 2, "text": "what does mean ''gas estimation failed''", "date": "Jan 22, 2023"}, {"stars": 3, "text": "use metamask from 2020 and now I got error: MetaMask had trouble starting. This error could be intermittent, so try restarting the extension.\n\nwhat happend? I have 2 wallet in metemask did'nt yet save privatekey :(", "date": "Jan 21, 2023"}, {"stars": 3, "text": "Idk if it's just me but the extension just doesn't open no more, even if i reload the page just blank but if a dapp wants to sign a transaction it auto opens and i can sign but after that it's back to blank page", "date": "Jan 20, 2023"}, {"stars": 1, "text": "Crashed chrome twice, then crashed extenstion, I cancelled 2 transactions and reinstalled extension because transactions are not proceed (in another browser was ok at the same time). Then made one more transaction and in then metamask made one of previous cancelled transactions. In total I lost $100. It happened when I removed few tokens from the list of tokens.", "date": "Jan 18, 2023"}, {"stars": 1, "text": "randomly lost price conversion data", "date": "Jan 17, 2023"}, {"stars": 1, "text": "i got hack", "date": "Jan 11, 2023"}, {"stars": 5, "text": "very coo! app! it's definitely a useful app for me! THX THX THX", "date": "Jan 11, 2023"}, {"stars": 2, "text": "Used since 2020 however I am no longer a user.  The mobile app has been disregarded and still sux really bad.   Competitors have surpassed Metamask and it's going to take a massive change to get me back", "date": "Jan 10, 2023"}, {"stars": 1, "text": "metamask not working stopped working please do something Metamask used to work fine Now it doesn't work anymore", "date": "Jan 8, 2023"}, {"stars": 4, "text": "W A R N I N G:  I see quite a few \"reviews\" and/or responses to reviews here where the poster implies that they represent Metamask and suggests that they are to be contacted on a GMAIL account for further assistance.\n\nContacting these fake scammers would most likely lead to your wallet/s being compromised in one way or another.  One of the latest attacks is that of sweeper bots, which once attached to your wallet address, will literally transfer your funds out of your account as well intercep... Show more", "date": "Jan 8, 2023"}, {"stars": 5, "text": "i am satisfied with this and this is really good.", "date": "Jan 7, 2023"}, {"stars": 5, "text": "Metamask is the best wallet with its support as extensions, app, explorer links, balances, importing different tokens, and much more.It comes in very handy to use and connect with other applications when in need, but you need to be careful and keep an eye on how you name your account for each network or partner or it may get really tricky.", "date": "Jan 7, 2023"}, {"stars": 1, "text": "metamask is not supporting in open sea ,the wallet is not connecting they show me to install ,i am already installed in my laptop, why this is happing \n\n\nfix it", "date": "Jan 7, 2023"}, {"stars": 1, "text": "Very bugy apps !!!", "date": "Jan 6, 2023"}, {"stars": 5, "text": "The best Defi EVM wallet on earth.", "date": "Jan 4, 2023"}, {"stars": 1, "text": "If i login in multiple devices it show an error like a incorrect password while i login again previous device its login then  login successfully", "date": "Jan 4, 2023"}, {"stars": 2, "text": "this is the dumbest wallet ever, my PC crashed and when I restored it it had nothing but the default account which was there and I had nearly 20 wallet addresses and tokens all fkn lost. Doesn't this thing save data on the cloud or something or it's just a dumb thing?! I'd rather look for an alternative that actually saves stuff automatically otherwise this means one must always create backups each and everyday or your money and tokens would fly to hell", "date": "Jan 3, 2023"}, {"stars": 2, "text": "My money got stolen multiple times", "date": "Dec 31, 2022"}, {"stars": 3, "text": "WARNING!!!\n!! The MetaMask support team will never ask for your seed phrase or private key !!\nMetamask email address is support@metamask.io other accounts are HACKERS!\n\n===\n\n\nOutgoing transactions are blocked. Also the Android app has installation issues which Play Store cannot handle the installation with no specific error.\n\nThere is bug (maybe) with this extension which will cancel outgoing transactions. I have increased the gas even up to double times larger than the transfer amount, and t... Show more", "date": "Dec 23, 2022"}, {"stars": 4, "text": "Works well", "date": "Dec 23, 2022"}, {"stars": 3, "text": "I have this very annoying error with duplicated accounts when creating new wallets.. \nEVERY time it happends i have to delete metamask and import my wallets once again, really getting tired of it so why did you remove the \"remove account\" from the settings!!", "date": "Dec 22, 2022"}, {"stars": 5, "text": "good", "date": "Dec 22, 2022"}, {"stars": 2, "text": "i lost all my fund coz hacker are able to courrpt the wallet extension . they withdraw all my fund .. who will pay for it now ?", "date": "Dec 22, 2022"}, {"stars": 5, "text": "Best wallet and best community.\n\nIt changed my life, thank you.", "date": "Dec 17, 2022"}, {"stars": 1, "text": "Horrible experience. Another victim of sweeper bot. The money you transfer may be automatically be gone by a sweeper bot. Zero security, non user friendly. Horrible!", "date": "Dec 16, 2022"}, {"stars": 2, "text": "I updated recently and cant connect it to any website/dapps :( PLEASE FIX", "date": "Dec 16, 2022"}, {"stars": 3, "text": "AFTER THE RECENT UPDATE IT IS NOT CONNECTING TO ANY WEBPAGE", "date": "Dec 16, 2022"}, {"stars": 1, "text": "I updated to the latest version 10.23.0  and that's and\nStopped connecting to any sites. \nTo the old, working, new, test networks. reinstallation did not help. It just doesn't work.", "date": "Dec 15, 2022"}, {"stars": 5, "text": "I am loving it", "date": "Dec 14, 2022"}, {"stars": 1, "text": "It was ok before.Why suddenly i cannot connect this in web3", "date": "Dec 14, 2022"}, {"stars": 1, "text": "Almost impossible to use for the average person.  It automatically adds account 1 and when you add your Trezor it adds another account.  The first time it connected, but not since.  I have deleted and re-added.  Mobile app is even worse.  The help files for either the extension or mobile app are just plain wrong.", "date": "Dec 14, 2022"}, {"stars": 1, "text": "Super not user friendly!  SUCKS!!", "date": "Dec 13, 2022"}, {"stars": 5, "text": "if you disable the extension, and then enable it again, then the sites do not see the metamask extension", "date": "Dec 13, 2022"}, {"stars": 1, "text": "Really not user friendly in the least.\n\nWouldn't recommend it at all!\n\nResulted in me accidentally sending crypto to the right address, but on the wrong network.\n\nI'm absolutely not using metamask again.", "date": "Dec 11, 2022"}, {"stars": 5, "text": "So far so good.", "date": "Dec 11, 2022"}, {"stars": 1, "text": "Very bad, there is no customer service, and thieves work to steal money, and after tracking the transfers, it turns out that they are completely transferred to one address that contains billions\n\nIt seems from the comments that the problem is repeated with many users", "date": "Dec 7, 2022"}, {"stars": 1, "text": "A very bad application that works to steal money and does tracking, yet it does not refund the stolen money\n\nAnd by tracking the transfers, it became clear that all the stolen goods were transferred to several addresses, and in the end they reach one address of their own and in the SMART network that contains more than 45 billion dollars\n\nDo not deal with him at all", "date": "Dec 7, 2022"}, {"stars": 1, "text": "Ananda", "date": "Dec 1, 2022"}, {"stars": 3, "text": "So I am using the \"yandex browser\" and metamask, c98-wallet extensions are very slow. When I clicking on the extension it takes like 3 seconds to open. The PC is decent. Trust wallet extension sucks its so undeveloped", "date": "Nov 29, 2022"}, {"stars": 1, "text": "after updating i cann't connected to any website, and there is no any resolution", "date": "Nov 28, 2022"}, {"stars": 3, "text": "信息：Cannot read properties of undefined (reading 'balance')\n\n代码：TypeError\n\n栈：\nTypeError: Cannot read properties of undefined (reading 'balance')\n  at n.isBalanceCached (chrome-extension://nkbihfbeogaeaoehlefnkodbefgpgknn/common-9.js:1:81917)\n  at chrome-extension://nkbihfbeogaeaoehlefnkodbefgpgknn/ui-3.js:1:206652\n  at chrome-extension://nkbihfbeogaeaoehlefnkodbefgpgknn/ui-3.js:1:207149\n  at M (chrome-extension://nkbihfbeogaeaoehlefnkodbefgpgknn/ui-5.js:1:388438)\n  at ha (chrome-extension://nk... Show more", "date": "Nov 28, 2022"}, {"stars": 5, "text": "Best Wallet Ever", "date": "Nov 27, 2022"}, {"stars": 1, "text": "MetaMask now tracks your IP address and makes it difficult to avoid by default. Removing in favour of alternative until this changes.", "date": "Nov 25, 2022"}, {"stars": 1, "text": "It was good while it lasted. Now that they are spying on your wallet addresses and saving your ip address for dubious compliance claims it's not usable any more.", "date": "Nov 25, 2022"}, {"stars": 1, "text": "Metamask started to be spyware! Sic! By default it collect's your IP's and other privacy information via node. When you going to sill use this app do not be suprsised when one day it will turn against you and your funds will not be safe anymore. There are other wallets that protect user data, do not hestitate to change. Gave 1 star because there is no option for zero. There is no compromise on privacy issue. Protect yourself!", "date": "Nov 25, 2022"}, {"stars": 1, "text": "Uninstalled this JPM spyware; rating it 1 star because there's no option for zero.", "date": "Nov 25, 2022"}, {"stars": 1, "text": "Has started logging IPs to public addresses, potentially revealing your location. Change the default RPC address if you don't want this. Very distasteful and ridiculous change.", "date": "Nov 25, 2022"}, {"stars": 1, "text": "MetaMask\n to start collecting user IP addresses  and Ethereum wallet addresses during on-chain transactions.", "date": "Nov 24, 2022"}, {"stars": 1, "text": "Collecting too much data, killing decentralization", "date": "Nov 24, 2022"}, {"stars": 5, "text": "Extension not working", "date": "Nov 22, 2022"}, {"stars": 5, "text": "This is the wallet app that I am using for personal use (for ERC-20, BEP-20 and MATIC) and also for development. I find it quite useful and easy to use. The only thing that needs some improvement (not sure if this have to be done from the Metamasks' devs, but when I click the extension icon, it opens it for a couple of seconds, not instantly.", "date": "Nov 16, 2022"}, {"stars": 2, "text": "This is a great extension unless something goes wrong, and then tech support are less than useless. They replied three times in 10 days, and each time they didn't read what i was saying and just repeated gave me links to articles online. Useless and I lost £1000s sadly.", "date": "Nov 13, 2022"}, {"stars": 5, "text": "Simple yet feature rich way to interact with blockchain nodes and web3. I wish if you could support Cardano network too.", "date": "Nov 12, 2022"}, {"stars": 1, "text": "this wallet is a complete scam. The 12 seed recovery phrase they provide for you will NOT be valid when something does happen and you have to try to import it. so much money down the drain for some low lifes to be able to access all of my tokens and LP's. its still unbelievable to me how popular this wallet is and how many people are using it without any issues, because this was the biggest loss I have ever had. It practically ruined my life.", "date": "Nov 8, 2022"}, {"stars": 5, "text": "It's done it's job very nicely to date.", "date": "Nov 7, 2022"}, {"stars": 1, "text": "Not secure, Just lost 3k USD equivalent crypto. They can't even detect a simple trojen virus.", "date": "Nov 5, 2022"}, {"stars": 1, "text": "my wallet was hacket all my coins lost my stakes was canceled and also lost", "date": "Nov 4, 2022"}, {"stars": 1, "text": "Stay away not secure... Just got hacked and lost over 6k in crypto.", "date": "Nov 4, 2022"}, {"stars": 5, "text": "So nice", "date": "Nov 2, 2022"}, {"stars": 1, "text": "Instead of \"Receive\" button now I see the \"Buy\" button. It took me few minutes to find a place with QR-code to scan. Very very usable.", "date": "Nov 1, 2022"}, {"stars": 1, "text": "installed and reinstalled multiple times, barely works. Annoying that it's the thing most web3 sites seems to use because I hate it.", "date": "Nov 1, 2022"}, {"stars": 4, "text": "Latest update doesn't work, instead shows: new BigNumber() not a number: undefined and an error. \n\nThe support process is abysmal. 🥰", "date": "Oct 31, 2022"}, {"stars": 2, "text": "Metamask is the most comfortable web 3 wallet i've used, but it's also the slowest, most laggy and literally the worst user experience i've ever used.\nmetamask needs to up their game badly\nthis is good as a base wallet, but for transactions?\ni wouldn't recommend this at all", "date": "Oct 28, 2022"}, {"stars": 5, "text": "good", "date": "Oct 28, 2022"}, {"stars": 1, "text": "Garbage. Unable to send", "date": "Oct 27, 2022"}, {"stars": 1, "text": "It makes some websites behave strangely.\nThis extension prevents battle.net logins.", "date": "Oct 22, 2022"}, {"stars": 5, "text": "Works like a charm for me🧡💛", "date": "Oct 16, 2022"}, {"stars": 1, "text": "Worst piece of software I have ever used in my life", "date": "Oct 16, 2022"}, {"stars": 1, "text": "do not install. it cannot be installed and automatically open on your tab..then gives you an error", "date": "Oct 9, 2022"}, {"stars": 1, "text": "This wallet is definitely not secure and highly risky. You better be a pro! The wallet was allowed to connect to a cloned legit site offering staking. I staked and lost 35K worth of coins. Not only did it take the staked coins but it cleaned out my other crypto in the wallet without my authorization. I even hit REJECT when it tried to approve the other crypto. Come on Metamask, you need to make it so coins can not be stolen simply connecting to a website. ALL WEBSITES offering Metamask connec... Show more", "date": "Oct 5, 2022"}, {"stars": 3, "text": "The wallet is good, supports many networks, but switching between networks is an ordeal(((((\n1. It is very necessary to add Search function for switching between networks, as you added it to the wallet search. I have more than 50 networks in mm and often have to switch manually, the function to show test networks does not work.\n2. It would also be very cool to add the ability to pin a network and also add a function to pin a wallet.", "date": "Sep 28, 2022"}, {"stars": 5, "text": "Metamask is certainly quirky to those who haven't a clue about how to interface with the blockchain, I don't care what their credentials are it is strange but once you get the hang of blockchain and understand it a bit its actually very straightforward to use.\n\nThere may or may not be an issue with metamask regarding security, but by and large the issues most are probably having around security is likely of their own doing much of the time. I'm just giving general advice here..... there's no ... Show more", "date": "Sep 27, 2022"}, {"stars": 1, "text": "Don't use it! It's dangerous! A simple malware can access it and transfer all your funds without your knowledge or any confirmation from you. Support nonexistent.", "date": "Sep 23, 2022"}, {"stars": 5, "text": "injected web3 ENVIRONMENT not showing remix.\nSo, how can I use \"inject web3\" and upload my solidity codes to my account?", "date": "Sep 18, 2022"}, {"stars": 1, "text": "takes 5 attempts to switch to matic network. then takes all my tokens and fails my transaction. happened twice. find another wallet", "date": "Sep 18, 2022"}, {"stars": 5, "text": "The extension works perfectly. Keeping the download size to a mere 18.62 mb is convenient as well.\nThe overall layout is very modern and the site is very stable with smooth animations.", "date": "Sep 5, 2022"}, {"stars": 5, "text": "Simple Hot Wallet for Ethereum and Polygon!", "date": "Sep 4, 2022"}, {"stars": 1, "text": "** 🚨 ⚠️ DO NOT TRUST ON METAMASK**\nI lost my all money, use legit extension nkbihfbeogaeaoehlefnkodbefgpgknn 10.18.3\nNot sure how metamask shares the secrets to hackers.\nI am developer and  very careful about my credentials. \nI can vouch that this is clearly stealing from metamask. \n\n** 🚨 ⚠️ DO NOT TRUST ON METAMASK**", "date": "Sep 3, 2022"}, {"stars": 2, "text": "Awful", "date": "Sep 1, 2022"}, {"stars": 2, "text": "So i had a common issue of my metamask extension not opening, i cleared cache as they suggested but to no success. i then uninstalled metamask and reinstalled it with my seedphrase, only to find that all my custom tokens not reflecting after ive added those networks again. ive seeked for help on the mm forum community but it seems many people have been having this issue, when importing their account, and now still, my mm extension doesnt open when i click on it. The concepts and ideas put out... Show more", "date": "Aug 31, 2022"}, {"stars": 1, "text": "Awful, unintuitive, and riddled with security/interface problems that can leave any money you invest vulnerable. Avoid at all costs - especially if concepts like \"Ethereum\" are new to you.", "date": "Aug 23, 2022"}, {"stars": 1, "text": "I thought I would have a cool mask on my google browser", "date": "Aug 20, 2022"}, {"stars": 1, "text": "I lost money , was running legit extension nkbihfbeogaeaoehlefnkodbefgpgknn 10.18.3\nNot sure how metamask shares the secrets to hackers /website . \nI have macbook and I have worked myself in antivirus company , I am very careful about my credentials. I can vouch that this is clearly stealing from metamask . \n\nMetamask this transaction I did not make it 0x9b00c036a0432e6704f3bfa72179ab3b52ca8fa7578e1fffbf8cacbf151206ff", "date": "Aug 19, 2022"}, {"stars": 1, "text": "This isn't worth the hassle. You need to fix this desktop piece of garbage, what a waste of my time :(", "date": "Aug 17, 2022"}, {"stars": 2, "text": "it's not installiing in my chrome after updating chrome.", "date": "Aug 16, 2022"}, {"stars": 2, "text": "Latest update doesn't work, instead shows: new BigNumber() not a number: undefined and an error. \n\nThe support process is abysmal. It's so buggy and horrible interface anyway. Will try other wallets.", "date": "Aug 14, 2022"}, {"stars": 3, "text": "They got rid of advanced gas options. (Need this to set as default for EVERY transaction)", "date": "Aug 13, 2022"}, {"stars": 1, "text": "No help from support for moving tokens from one network to another. eth wallet wont load tokens. glad i only lost $40 and not any more than that. mostly user error as i am stil learning but wallet doesnt seem to work properly. it should show tokens sent to it regardless of what the token is", "date": "Aug 5, 2022"}, {"stars": 2, "text": "I give it two stars, because every time I want to make an exchange it tells me an error in the quotes, tell me a solution. Thank you", "date": "Aug 3, 2022"}, {"stars": 1, "text": "I'lost my weth. seed phrase was printed and safe", "date": "Jul 23, 2022"}, {"stars": 1, "text": "A security vulnerability made me loose control of all of my wallets to hacker.\n\nHighly recommended if you just wanna get screwed.", "date": "Jul 22, 2022"}, {"stars": 1, "text": "DO NOT USE, I've lost all my ethereum through a transaction I did not authorize, no email nothing , currently goign through support but it says I wont get anything back. Hugely disappointed", "date": "Jul 22, 2022"}, {"stars": 3, "text": "App so slow after some time! Only uninstalling and reinstalling helps, all other solutions don't work. How tired of it. Fix it!", "date": "Jul 20, 2022"}, {"stars": 1, "text": "No longer works in Brave", "date": "Jul 18, 2022"}, {"stars": 4, "text": "Great open source software, I'm glad they finally added a dark mode. There are some quirks, like when switching to a new network where the endpoint is down, its hard to cancel the action. I also wish it came with more network endpoints pre-configured (embrace EVM, not just Ethereum).", "date": "Jul 18, 2022"}, {"stars": 5, "text": "Have made a multitude of transactions with metamask and have had zero issues on mobile or desktop. If your devices are secure and up to date this thing runs fairly flawlessly. Not really understanding the bad reviews by those who spell \"steal\" wrong, but, if you have a few brain cells Metamask will work well for you", "date": "Jul 17, 2022"}, {"stars": 1, "text": "Wyre literally just does not work", "date": "Jul 15, 2022"}, {"stars": 1, "text": "As of today July 13, I keep getting Avast notifications for phishing scams everytime I turn on chrome with this extension. It's terminating the app and metamask.github.io connection right away. I can't even delete it because my money is on this wallet. Fix this asap!", "date": "Jul 13, 2022"}, {"stars": 4, "text": "It's a good piece of software. \n\nMost people here, who give only one star, do so because they are frustrated or got scammed by some party that has nothing to do with metamask xD\n\n4/5 because the extension is a bit sluggish. I hope performance optimisation can land on the agenda.", "date": "Jul 13, 2022"}, {"stars": 1, "text": "NOTHING DIDN'T WORK PROPERLY !\nNEED MORE OPTIONS !", "date": "Jun 24, 2022"}, {"stars": 1, "text": "This extension is so full of bugs it's barely usable. I literally can't use it for more than one minute straight without stumbling upon some crippling bug. Absolutely pathetic.", "date": "Jun 19, 2022"}, {"stars": 1, "text": "broken.", "date": "Jun 14, 2022"}, {"stars": 1, "text": "NEXT LEVEL GARBAGE DOESNT EVEN OPEN!!!!!!!", "date": "Jun 13, 2022"}, {"stars": 1, "text": "i cant install MetaMask", "date": "Jun 7, 2022"}, {"stars": 5, "text": "Since there's a reject all transactions function, I'd also like to suggest to add an accept all transactions function.", "date": "Jun 7, 2022"}, {"stars": 3, "text": "cant connect to any wallet, metamask can't detection", "date": "Jun 6, 2022"}, {"stars": 1, "text": "garbage", "date": "Jun 6, 2022"}, {"stars": 5, "text": "Hi, I find Metamask brilliant. However, I recommend using this Dapp to add the BSC ( Binance Smart Chain ) and Polygon network on the wallet (ETH is obviously the default) and configure all the tokens you own on the networks (without having to do it manually).\n\nhttps://app.ekstra.io/\n\nThis way when you buy a new crypto you won't be surprised that you don't see it in the wallet.\n\nI also recommend that you regularly install and uninstall the Metamask extension for security and update reasons at... Show more", "date": "Jun 3, 2022"}, {"stars": 5, "text": "Works great. Superb. Has all that I need. Never had any trouble with this", "date": "Jun 3, 2022"}, {"stars": 1, "text": "Today i transferred 1.80 AVAX to my MM wallet and immediately the amount was stolen - transferred in a different MM wallet at the minute of arrival.\nHOW IS THIS POSSIBLE??? DON'T USE THIS TRASH!!!", "date": "Jun 2, 2022"}, {"stars": 1, "text": "This extensions modify other sites request headers and crash some certain site, such as Battle.net login", "date": "Jun 1, 2022"}, {"stars": 1, "text": "sooooooooooooo bad", "date": "May 31, 2022"}, {"stars": 1, "text": "I created a new wallet i sent BNB into it and it disappears immediately, please can you explain how this happens?", "date": "May 26, 2022"}, {"stars": 1, "text": "Fix the files timestamp, it is 2022 not 2098", "date": "May 26, 2022"}, {"stars": 4, "text": "I am facing an error on Window Google Chrome and cannot connect to Pancake (window.ethereum.enable is not a function) I can only connect when in incognito mode. It's annoying because of this, any fix", "date": "May 25, 2022"}, {"stars": 1, "text": "Breaks all image uploads on all websites!!! worst!", "date": "May 25, 2022"}, {"stars": 1, "text": "i have had several issues with metamask, from people steeling my money and metamask not asking for confirmation before the funds get sent, to my latest issue where the transaction failed and i still paid for the transaction to etherscan. they say its not their fault but when you use a \"trusted\" wallet like metamask you expect to be more secure about your money ad i think for failed transaction the individual doesn't have to pay for external issues that are not his fault", "date": "May 19, 2022"}, {"stars": 1, "text": "if u wanna get phished or hack... just install this", "date": "May 19, 2022"}, {"stars": 1, "text": "Well, it ultimately happened. I logged in to my Metamask when it was time to pay node fees and noticed my balance was zero. Odd considering I had $450 of ETH in there as of 14 days ago. I checked the activity and nothing said \"outgoing\" or \"paid\". It only showed the transactions I had done properly a month before that. I reached out to support and of course, they said right off the bat they can't reimburse me and did I share my password with anyone. No, in fact, my private key and phrase are ... Show more", "date": "May 19, 2022"}, {"stars": 1, "text": "This extension is currently useless. I had it working correctly for a year but then I had to reinstall the extension. Once i installed the extension all Im getting is a blank white screen. No setup no nothing. Ive  tried all the basic steps given to me by support with no luck. Supports suggestion was to try a different browers other than chrome. So basically Metamask for Chrome doesnt work on chrome. Ive literally had metamask on this computer before so Idk if theres something wrong with an u... Show more", "date": "May 17, 2022"}, {"stars": 1, "text": "Too slow + can't desactivate the auto-logout + the application don't tell you when you have been automatically logout, which make me lose money because sometime i'm doing market predictions and i'm missing some predictions because of this. So these unskilled developpers make me lose money. Those useless developpers should start to learn how to code and how to respect the people.", "date": "May 17, 2022"}, {"stars": 1, "text": "MetaMask has stalled my transactions. When I went to cancel them since they were preventing me from trading for 2 weeks I decided to cancel my transactions. I remembered reading that there was a cost to this so I understood I would have to pay. However, Meta Mask is in it to rob people. Meta Mask showed that the cost was $0.00 so I was happy to cancel all my back logged orders. However, after doing the majority of my transactions, my ethereum was wiped. I lost over a hundred dollars to this t... Show more", "date": "May 14, 2022"}, {"stars": 5, "text": "BEST", "date": "May 14, 2022"}, {"stars": 1, "text": "doesn't work", "date": "May 13, 2022"}, {"stars": 1, "text": "This extension isn't working on Windows 8.", "date": "May 13, 2022"}, {"stars": 1, "text": "I thought I'd finally give it a go and saw many people recommending metamask. Never shared my seed phrase or password. only used my wallet link for coinbase and openseas to connect wallet. No other activity. For the first time I bought money in coinbase and transferred it to metamask wallet. What happened? within a minute my metamask wallet said it 'received' the ETH but it was still showing me 0ETH. There was no signs of it being transferred out again in the activities. Checked the Etherscan... Show more", "date": "May 11, 2022"}, {"stars": 5, "text": "Looking at these reviews leaves me sick, lol. They are all so outdated, and most of all the things users were experiencing issues with are easily resolvable now. So much has been updated with MM, and currently it's my GO TO wallet. I don't think I would even consider another one, because it's such a streamline Crypto companion for me right now. Cross-chain support, nice time stamps, easy UI, and over time I trust it more and more. Thousands of dollars have been exchanged on my wallet, and not... Show more", "date": "May 10, 2022"}, {"stars": 1, "text": "I was hacked out of nowhere, I realized this after trying to put in 30€ of BNB for the first time (stolen in less than 5 seconds). They should improve wallet security with two-factor security.", "date": "May 5, 2022"}, {"stars": 1, "text": "whitescreen", "date": "Apr 30, 2022"}, {"stars": 4, "text": "unable to connect , user rejected ?", "date": "Apr 27, 2022"}, {"stars": 1, "text": "I don't know if it's the worst wallet but it is definitly a very bad one. The support is very bad and useless too", "date": "Apr 27, 2022"}, {"stars": 3, "text": "Breaks the ability to login to battle.net if you have an authenticator. Doesn't wait for the login to process. Please fix.", "date": "Apr 27, 2022"}, {"stars": 1, "text": "I can't even start it. It just gets stuck at explaining phrases to me. VERY frustrating", "date": "Apr 25, 2022"}, {"stars": 1, "text": "I've installed Metamask a few days ago and imported the wallet today, then tried to exchange 10 euros on Plutus.it just to test. Bad Metamask's UX and it bugs made me send the same amount 3 times (THREEE!) instead of one. When the money was already sent, the confirmation window reappeared twice and I clicked confirm thinking I was confirming the same (single) transaction. If you make such stupid bugs that make the confirmation windows reappear, why don't you at least warn that the same amount... Show more", "date": "Apr 23, 2022"}, {"stars": 3, "text": "metamask not working in brave", "date": "Apr 22, 2022"}, {"stars": 3, "text": "it works half the time", "date": "Apr 20, 2022"}, {"stars": 1, "text": "scam, am lost money on MetaMask, but no one support, i cant change prt key", "date": "Apr 20, 2022"}, {"stars": 1, "text": "I LOST 35,000 INR in meta wallet and cyrpto chrome browser ! dont use this app its not safe !", "date": "Apr 20, 2022"}, {"stars": 5, "text": "Life in cypto without metamask is useless", "date": "Apr 17, 2022"}, {"stars": 1, "text": "xz", "date": "Apr 17, 2022"}, {"stars": 1, "text": "Unfortunately, MetaMask won't let me connect to any web3 page anymore - using Brave Browser and the extension suddenly stopped working.", "date": "Apr 14, 2022"}, {"stars": 1, "text": "Scam Wallet. Blocked my transaction and freezed my money for over a month because as they said \"I set too low priority\" which actually was their default option (and still is). Also money still frozen and i have to PAY them again to cancel the transaction. It was their fault for calculating wrong gas fees. Never had any of this trouble in other wallets", "date": "Apr 14, 2022"}, {"stars": 4, "text": "Usually pretty solid, but sometimes there's weird errors that take a lot of troubleshooting to resolve.", "date": "Apr 13, 2022"}, {"stars": 1, "text": "Hahahaha, very unsecured Metamask. It will automatically send funds to the scammer's account without an 2-step authentication. Garbage", "date": "Apr 12, 2022"}, {"stars": 1, "text": "Do not use without a hardware wallet to verify.\n\nHACKED ON CHROME, LOST EVERYTHING, NOTHING THEY CAN DO.\n\nProtect yourself, this and Chrome are flawed, I know, I dont have anything left now, fact.", "date": "Apr 12, 2022"}, {"stars": 3, "text": "Sad because this is 1 of the most used wallets for the eth network. I have heard nothing but horror stories of this wallet. Was going to start using it for some cross chain defi rethinking after the reviews. Sure for long term or more knowledgeable Crypto users works great i will just wait until i learn more. I have a meta mask but never used so i cant give a honest review on the use just what i have heard. Sure like most things in crypto its user error they have a mobile version make sure yo... Show more", "date": "Apr 11, 2022"}, {"stars": 1, "text": "It blocks random sites, with are not scam or anything else.", "date": "Apr 11, 2022"}, {"stars": 5, "text": "usefull", "date": "Apr 10, 2022"}, {"stars": 1, "text": "This popular wallet is what most sites want\nbut use another wallet as much as possible\nbecause every wallet has more security than this", "date": "Apr 10, 2022"}, {"stars": 1, "text": "When you create your password, you get transited to the page with the video, and \"Next\" button. Video is not viewing and the whole site crashes in a second. Basic troubleshoot and reinstalling the extension didn't help. I used latest chrome version on a 2017 iOS and have a screencast with the issue. What the actual ***** is going on with this page? Developers, hello?", "date": "Apr 8, 2022"}, {"stars": 3, "text": "I don't have issues with it as of yet. I've been reading reviews from all of the different wallet extensions and they are all bad. I'm assuming there is some kind of learning curve issue or something of that nature. If you're new in the space take it easy and don't put all of your eggs in one basket. Have multiple wallets and become very experience in how to use them all. Do small transactions as a test run and if all looks good then do a bigger one. NEVER share your recovery phrase. If you a... Show more", "date": "Apr 4, 2022"}, {"stars": 5, "text": "Althrough it's not extremely user-friendly, it's convenient.", "date": "Apr 4, 2022"}, {"stars": 1, "text": "I kept receive metamask sending email to me asking me to verify. I do not know whether it is a scam as there is a high possibility since NFT is so popular now. Metamask does not have a official website where I can verified from there. I am not going to click the link that is sent to my email.", "date": "Apr 3, 2022"}, {"stars": 1, "text": "bugmask", "date": "Apr 1, 2022"}, {"stars": 1, "text": "unsecured wallet with no support to address your issue. My metamask wallet is already hacked and metamask support team just copy paste you the same template in response.", "date": "Apr 1, 2022"}, {"stars": 2, "text": "to confusing to use. information to import coins doesn't match reality.", "date": "Mar 29, 2022"}, {"stars": 2, "text": "Nightmare. Ledger works, then it doesn't, then it only works on FF MetaMask extension, then stops working there, can't connect, no approval confirmations, endless spinners and NO user error messages or dev/debug messages to give you the faintest idea of what is going on. Terrible user experience.", "date": "Mar 29, 2022"}, {"stars": 1, "text": "Have never stored my password, seed phrase or any other info on my personal PC, only ever hand written in a small notebook where only I can access it.. never allowed sites to access my wallet, kept everything fully \"secure\" including my PC, somehow there's an unauthorised transaction and my funds have been drained.... luckily it was only a small amount, but still not secure regardless.", "date": "Mar 27, 2022"}, {"stars": 1, "text": "Is the most insecure wallet in the world, without making a mistake all my BSC was stolen, who is responsible?\nI gave it a star just to be able to tell others this wallet is not safe, be careful with your money,\nand it did not just happen to me, they stole a lot of people", "date": "Mar 26, 2022"}, {"stars": 1, "text": "After last chrome update I'm not able to connect with my MetaMask to any website (Eg. Pancake Swap).", "date": "Mar 26, 2022"}, {"stars": 1, "text": "Someone hacked me. 0 security. If you visit any site just to see statistics, they will drain your wallet. The most unsecure wallet that provide unlimited access to scammers. \nWho had idea to give scammers unlimited access to your wallet? \nNever use Metamask for staking.", "date": "Mar 26, 2022"}, {"stars": 5, "text": "Love it.", "date": "Mar 26, 2022"}, {"stars": 1, "text": "bad wallet", "date": "Mar 23, 2022"}, {"stars": 3, "text": "Cant use all functionality with Microsoft Surface...bummer. No browser capabolities, so no defi.", "date": "Mar 21, 2022"}, {"stars": 1, "text": "just lost 5000usd+ after i bought some nft in opeasea , never reveal my password, antiviruis/malware was clean , just unsecured , heart is crushed", "date": "Mar 17, 2022"}, {"stars": 2, "text": "It might have been good in the early blockchain years. But now it just doesn't feel good to use, especially for people that need to move between chains and customize gas often. And my god it is soooooo slow.", "date": "Mar 17, 2022"}, {"stars": 1, "text": "I lost $200 ETH, metamask is locked. Private key is not stored in computer. Virus scan is no finding. No idea, how it happens.", "date": "Mar 14, 2022"}, {"stars": 1, "text": "Lost $500 worth of ETH using a new wallet with this horrible extension. Looking for another viable option as we speak. My funds were literally stolen a few minutes after being transferred from my Gemini crypto exchange. UNBELIEVABLE!!", "date": "Mar 13, 2022"}, {"stars": 1, "text": "Absolutely horrible extension! Completely unsecure!! Lost a lot of crypto transferring funds to this wallet and their support is atrocious. STAY CLEAR of this extension. They are not support and you will eventually get your wallet hacked....sooner or later.", "date": "Mar 13, 2022"}, {"stars": 1, "text": "BEWARE: COMPLETELY UNSECURE AND EASY TO HACK\n\nI lost over $2000 worth of ETH using this extension which offers absolutely 0 support! One address I used was rarely used. I didn't even access the private key for and somehow got hacked (not even sure how as my cpu has no viruses after several scans from several antivirus programs). I transferred funds from Coinbase exchange to this wallet and exactly 2 minutes later (which tells me this is a bot), my funds were automatically sent to another addr... Show more", "date": "Mar 13, 2022"}, {"stars": 1, "text": "Getting worse after each update. Can't resend tx with same nonce without getting error, tx cancel not working, advanced gas controls requiring more clicking after every update, a complete fustercluck for more advanced users. Also getting slower. Trash. Looking for better alternatives.", "date": "Mar 13, 2022"}, {"stars": 1, "text": "It is far from secure. I kept mine tight and connected to very few sources. It still got hacked.\nSupport is a cut and paste respone. Beware!", "date": "Mar 13, 2022"}, {"stars": 1, "text": "This app on chrome is pathetic! zero star!", "date": "Mar 9, 2022"}, {"stars": 1, "text": "Update - this extension is still awful - cannot even remove an account from it - just horrible piece of software - developed by geeks who don't understand customers. Doesn't sync devices, too much expected from the user, try making their life easier not harder.", "date": "Mar 7, 2022"}, {"stars": 1, "text": "Just stopped working. There is absolutely no support -- you have to navigate a chat system -- which just shows this app and the people running could care-less about it's users. Luckily I didn't have a ton of money locked up in this scam of an app, but still very annoying.", "date": "Mar 7, 2022"}, {"stars": 1, "text": "I was just trying to add Metamask as an extension to my Chrome on Mac. Right after choosing new wallet and creating a password it takes me to the next page of the explanation video. It starts to play with the sound but no visual whatsoever. Clicking on the 'next' button only plays the sound or pause it. Tried to remove and add that extension about four times. At this point I just give up. As my conclusion, I think it is made for Windows computers but not Mac.", "date": "Mar 6, 2022"}, {"stars": 1, "text": "Junk.  Doesn't sync with mobile.  Imported account using passphrase, shows all balances at zero, despite holdings in mobile.  Useless.", "date": "Mar 5, 2022"}, {"stars": 1, "text": "Why is this garbage the #1 recommended wallet for most websites? Literally can't use Trust Wallet for most NFTs now but they recommend this trash that doesn't even work??? Clown world.", "date": "Mar 4, 2022"}, {"stars": 1, "text": "Limiting certain countries from using the app kind of goes against what this all stands for.... sad to see it.", "date": "Mar 4, 2022"}, {"stars": 1, "text": "Windows 11 ,chrome and EDGE dont work at any website .", "date": "Mar 3, 2022"}, {"stars": 1, "text": "It is just absurd that you have to insert your seed phrase in order to log in in the chrome extension , I got hacked just because of this.... Instead of doing a QR Scan code to log your wallet from phone to desktop , you ask people to insert the seed phase in order to connect... I just dont get it", "date": "Mar 2, 2022"}, {"stars": 1, "text": "Don't buy this. You can't use trezor with metamask in opensea jeezz!!", "date": "Mar 2, 2022"}, {"stars": 5, "text": "How to reset my password ,\ni lost my mobile,security peach & password.\npls help me", "date": "Mar 2, 2022"}, {"stars": 1, "text": "The Android app works pretty decent. I still use Trust or Coinbase wallet for most of my needs but I exclusively use MM on PC. I have had this Chrome extension for a while and I am appalled at the discrepancy between the quality you get on PC versus on mobile.\n\nMetamask Chrome extension does not load any coins unless I add them manually and shows 0 transactions on anything. The Activity page is always empty and yes I have all the settings set correctly to discover and fetch those. Also gets a... Show more", "date": "Mar 2, 2022"}, {"stars": 1, "text": "darn", "date": "Mar 2, 2022"}, {"stars": 1, "text": "I got average 50 errors daily on MM, is not stable on Chrome, so many times doesn't calculate the GAS fees and shows me GAS limit 0, i have so many failed transactions, blockchain is weird place i lost over 200$ for 1 year just because this stupid apps and blockchains", "date": "Feb 28, 2022"}, {"stars": 5, "text": "i love it", "date": "Feb 26, 2022"}, {"stars": 1, "text": "doesnt work with open sea brings me to download page when i already have it smh", "date": "Feb 24, 2022"}, {"stars": 1, "text": "How can I trate it when I can't log in???????????", "date": "Feb 24, 2022"}, {"stars": 1, "text": "actually stole my money... lol", "date": "Feb 23, 2022"}, {"stars": 3, "text": "On a fresh install windows 11 and chrome browser ,I cant connect my metamask to any app ,When I click the connect button on app , even popup is never shown!  I have tried several big dapps ,uniswap,1inch,some bridge apps etc...", "date": "Feb 22, 2022"}, {"stars": 5, "text": "Great", "date": "Feb 20, 2022"}, {"stars": 1, "text": "garbage application that keeps freezing transactions in \"pending\" status and has cost me thousands\n\nresetting metamask doesn't work either. Laggy as hell also. Overall it's just terrible software and deserves to get beaten on the market asap", "date": "Feb 20, 2022"}, {"stars": 3, "text": "Every time I try to connect my wallet to OpenSea it doesn't work.....I need to reinstall extension everytime I try to connect. Metamask Wallet does not gives response. Can anyone help me with it?", "date": "Feb 19, 2022"}, {"stars": 2, "text": "its not easy to use... bugs are around\ntrust wallet is much better", "date": "Feb 19, 2022"}, {"stars": 2, "text": "Bad work in chrome", "date": "Feb 19, 2022"}, {"stars": 2, "text": "what are all these emails i keep getting, saying to  me to verify my account  , well how many times do i have to do this before you stop sending emails telling me i have till 20th feb or i loose my account, i the extension on my browser,  should i remove my coins , as i have verifified loads of times put my phrase in everytime, but i keep getting emails", "date": "Feb 18, 2022"}, {"stars": 1, "text": "I had the displeasure of installing Chrome Browser on my laptop again. Metamask needs to get an extension for Opera.", "date": "Feb 17, 2022"}, {"stars": 3, "text": "Where do I find the add wallet button? I am new to cryptocurrency and looking to learn by opening an account and add networks like mainnet or testnet. I am using Chrome for this on a windows  OS.", "date": "Feb 15, 2022"}, {"stars": 2, "text": "The extension is freezing my computer. I don't feel safe using it.", "date": "Feb 15, 2022"}, {"stars": 5, "text": "very nice", "date": "Feb 15, 2022"}, {"stars": 1, "text": "The most dumb design in the universe.  You can only add new accounts but can not delete it. You can only backup the private key for new accounts but not recovery phrase for that new accounts. You can import recovery phrase for your first account but for the other accounts you are only allowed to use private key to import. And worst of all, when you are doing backup of your recovery phrase you are actually only backing up your first account not including the other accounts, and this design sim... Show more", "date": "Feb 13, 2022"}, {"stars": 1, "text": "After latest update its not working with openseas and etc. Every time i need to log in have to delete it and reinstal it. Before that it worked without problem.", "date": "Feb 13, 2022"}, {"stars": 1, "text": "They ask you to enter your personal data and enter there what kind of money do you keep for idiots?", "date": "Feb 13, 2022"}, {"stars": 1, "text": "GARBAGE", "date": "Feb 12, 2022"}, {"stars": 5, "text": "Broken on latest chrome 98, button Cancel and Next floats incorrectly maybe because of a broken scrollable div when connecting to metamask", "date": "Feb 12, 2022"}, {"stars": 1, "text": "yesterda metamaks stopped working. i have multiple networks i need access to and this wallet is seriously pissing me off", "date": "Feb 12, 2022"}, {"stars": 5, "text": "gg for me", "date": "Feb 9, 2022"}, {"stars": 1, "text": "Now I think that it is Metamask who actually steals our money from our wallets. \n\nCHANGE MY MIND :)", "date": "Feb 9, 2022"}, {"stars": 1, "text": "Someone hacked 3000 USDT from my Metamask wallet!!!", "date": "Jan 28, 2022"}, {"stars": 1, "text": "First time buying curreny and all money taken before even appearing in wallet", "date": "Jan 27, 2022"}, {"stars": 2, "text": "Poor experience so far. I purchased funds through Wyre, it shows on chain, and my balance will not update in MetaMask. It just shows as \"Balance may be outdated\". Contacted support and haven't heard back in two days.", "date": "Jan 27, 2022"}, {"stars": 1, "text": "When I deposit MATIC or BNB on Metamask it automatically sent to other guy. Which doesn't sent by me. 3 Times I lose my money using metamask. I try to contact them but they never reply me. Fake  and Scam.", "date": "Jan 26, 2022"}, {"stars": 1, "text": "Really disappointed with this app. So complicated you need to Add Token, set many things and something you don't receive your fund but the support can't help you.\n\nNot recommended if you don't want to lose money", "date": "Jan 25, 2022"}, {"stars": 2, "text": "How the hell you can sign into this???? Does nothing even after you put in the Password or the recovery phase. Is this extension actually working?", "date": "Jan 24, 2022"}, {"stars": 1, "text": "Most of transaction fail\nso lame", "date": "Jan 24, 2022"}, {"stars": 1, "text": "this wallet is very very hard to connect to nft games... pls improve this wallet .. hard to pull up ... waste of time", "date": "Jan 23, 2022"}, {"stars": 1, "text": "My money has been stolen from Metamask and there was a transaction that I did not do. Now I cannot get back my money. I would never recommend anyone to use Metamask.", "date": "Jan 21, 2022"}, {"stars": 1, "text": "Please check the extension. When I used opensea to connect with metamask, it told me to install the extension even I had install the latest metamask extension.", "date": "Jan 20, 2022"}, {"stars": 1, "text": "MetaMask is literaly made to aid criminals and scammers. I lost my life savings over $120,000 USD because of the lack of Metamask lack of security. When I contacted them they gave me a generic answer saying it was my fault. I'm in the process of filing a class action law suit against them because too many people are victims of many scams involving metamask. If you been a victim, contact me to make our case stronger in court. Stay away from metamask or you will lose everything you have!", "date": "Jan 20, 2022"}, {"stars": 1, "text": "It keeps taking my money. I absolutely HATE THIS APP. Do yourself a favor and use anything but metamask. I really wanted to like it.", "date": "Jan 20, 2022"}, {"stars": 1, "text": "Doesnt work in chrome in Ubuntu 18.04.", "date": "Jan 19, 2022"}, {"stars": 1, "text": "always and always \"The account you're are trying to import is a duplicate\" and no answer from the admin", "date": "Jan 19, 2022"}, {"stars": 1, "text": "The GAS fees are astronomical! I had to pay 71% fee to cash out my ETH to Gemini. Totally not worth it.", "date": "Jan 17, 2022"}, {"stars": 1, "text": "After adding funds, now every day I get $110 deducted from my account for Crypto NFT purchases.", "date": "Jan 16, 2022"}, {"stars": 1, "text": "SUCKS!", "date": "Jan 15, 2022"}, {"stars": 1, "text": "Token import doesn't work, stack 'loading tokens'. Worst FAQ, no way to find how to fix any important issues.", "date": "Jan 15, 2022"}, {"stars": 1, "text": "I have sent 40$ worth of ETH to Binance and never received it even throught my balance is now 0\n\nI also took me 2 hours to figure out how to buy MATIC as that we're no instruction whatoever\n\nSo not only i lost my time but also my money. will stick with ShakePay, they have higher fees but at least they don't steal your crypto", "date": "Jan 14, 2022"}, {"stars": 5, "text": "FYI - A lot of the poor reviews as of late seem poorly constructed and all seem to share one similar thing. They share a scam website and condemn metamask for \"blocking\" it to get users baited into visiting. \n\nI've used metamask for years and have only ever had one issue. The issue was reinstalling metamask on a new hard drive and losing temporary access to my many wallets. \n\nI contacted the developer and he let me know that once you reinstall metamask and enter your private key you'll hit \"A... Show more", "date": "Jan 11, 2022"}, {"stars": 1, "text": "trying to accept bid but everytime i am getting this error :- Internal JSON-RPC error. { \"code\": -32000, \"message\": \"gas required exceeds allowance (0)\" } don't know what this error about!! metamask help us out on this error why we getting this error whenever we get good bid on nfts???", "date": "Jan 8, 2022"}, {"stars": 2, "text": "Bugs bugs bugs. Too many 'til I'm lazy to mention. Use it and you can already reproduce some.", "date": "Jan 8, 2022"}, {"stars": 2, "text": "Doesn't switch to Polygon network.", "date": "Jan 7, 2022"}, {"stars": 1, "text": "Glitchy. Just sucks. Wish there was an alternative for desktop.", "date": "Jan 6, 2022"}, {"stars": 5, "text": "good", "date": "Jan 6, 2022"}, {"stars": 1, "text": "I couldn't withdraw all my cryptocurrency out of this stupid wallet, never gonna use this again!!", "date": "Jan 2, 2022"}, {"stars": 5, "text": "Good", "date": "Jan 2, 2022"}, {"stars": 1, "text": "blocks legitimate sites with no formal dispute process", "date": "Dec 30, 2021"}, {"stars": 1, "text": "Stuck on viewing secret phrase video on initial setup on Brave. Will not let me do anything. The video is not shown playing but is playing.", "date": "Dec 29, 2021"}, {"stars": 5, "text": "great", "date": "Dec 29, 2021"}, {"stars": 1, "text": "Metamask is the worst hot wallet I use so far, I been hacked last month then I reinstall my pc, create new metamask wallet, didn't share my seed phrase, only connect 3 official website, yesterday my metamask been hacked AGAIN! WHAT THE XXXX.", "date": "Dec 27, 2021"}, {"stars": 3, "text": "so diferent from the mobile version .. i cant see the nft collection and also no option to show all my curency in one page.. very weird and illogic compare to mobile version", "date": "Dec 26, 2021"}, {"stars": 5, "text": "Worked pretty well for me. One issue is I am unable to remove a wallet from the MM on chrome without having to reset the entire MM.", "date": "Dec 22, 2021"}, {"stars": 1, "text": "Up until a few days ago my account was working , now all of a sudden my account can't be accessed and can't recover anything . \nWhat's going on ?", "date": "Dec 21, 2021"}, {"stars": 1, "text": "absolutely hate this app. hate it. despise it. never hated anything more.\n\nmakes things HELLA complicated, ridiculous that you have to 'add tokens'\n\nno security WHAT.SO.EVER. was cashing out at a crucial time suddenly it wasnt working and when i restarted my password was changed??\n\nand it couldnt be a hacker.\n\ni hate hate hate hate hate hate HATE HATE HAAAAAAAAAAATE THIS APP!!!!!!!!!!!!!!!!!!!!!!!!", "date": "Dec 21, 2021"}, {"stars": 1, "text": "Bought 2 nfts for $400 that I didnt want!!!!! I rejected them and it still bought them!! I want to kill myself", "date": "Dec 21, 2021"}, {"stars": 1, "text": "I had all of my ENS coins and ETH drained and hacked way too easily. There needs to be additional security features here that like a confirmation that pops up on your phone approving a transfer! I lost thousands and can not do anything about it!", "date": "Dec 21, 2021"}, {"stars": 1, "text": "This metamask is a scam....!", "date": "Dec 19, 2021"}, {"stars": 5, "text": "love it!", "date": "Dec 16, 2021"}, {"stars": 5, "text": "hi dear @admin , I have made 1 mistake by transferring my funds (BUSD) from Binance to Metamask, .... instead of copying metamask (BUSD) account, I have copied my ETH - metamask account.............. now my BUSD balance is not showing in my metamask wallet .....what should I do plz help ???", "date": "Dec 13, 2021"}, {"stars": 1, "text": "I have had to put in so much money just to do a simple swap. Now, no matter how many times I download the app it will not open.", "date": "Dec 13, 2021"}, {"stars": 1, "text": "only 2 Networks avalaible. Now you must google and add by yourself the configuration for the Network you need and take the risk to use malicious datas", "date": "Dec 13, 2021"}, {"stars": 5, "text": "some times error when doing transaction , like header not found and others error .", "date": "Dec 11, 2021"}, {"stars": 4, "text": "I love metamask!!", "date": "Dec 8, 2021"}, {"stars": 5, "text": "love it", "date": "Dec 6, 2021"}, {"stars": 1, "text": "well does anyone have any recent reviews of this or is metamask still a scam? if so what should i be using instead anyone got any suggestions?", "date": "Dec 5, 2021"}, {"stars": 3, "text": "writing the secret recovery phrase is a chore", "date": "Dec 5, 2021"}, {"stars": 1, "text": "Metamask has extremly low secuity. My wallet has been cleared. I have used metamask only on my phone where biometrics are needed. Furthermore there is no way to contact them. My tokens are still visible on thief account and I can do nothing about it. How ridiculous. Avoid Metamask.", "date": "Dec 3, 2021"}, {"stars": 3, "text": "idk why metamask now are slow... but its nice wallet", "date": "Dec 2, 2021"}, {"stars": 1, "text": "it won't connect to pancakeswap", "date": "Dec 2, 2021"}, {"stars": 1, "text": "The money disappeared from my wallet!!!!", "date": "Dec 1, 2021"}, {"stars": 1, "text": "my account has been hacked with fake login metamask", "date": "Nov 30, 2021"}, {"stars": 1, "text": "Metamask is simply a SCAM!", "date": "Nov 29, 2021"}, {"stars": 1, "text": "Slow..Wallet idiot", "date": "Nov 29, 2021"}, {"stars": 3, "text": "for last few days its not working on my chromebook, its very dissappointing that they removed support for older devices", "date": "Nov 28, 2021"}, {"stars": 1, "text": "I can also testify, that metamask is a big scammer, I was once a big fan of metamask before, coz' of multi coin than any other wallet. I didn't also listen to a negative feedback from other users before. But when i experience what others are telling us here... is PURELY TRUE. They drain all the balances that i have in my wallet each of them, slowly and slowly 'til it became zero. The big question is... Why is it there are no HISTORY of the transaction listed? if all the balance available is t... Show more", "date": "Nov 28, 2021"}, {"stars": 1, "text": "Hopeless user interface. Very very bad. Complcated. It's easy to make mistakes. Activities not complete. Paradise for hackers!!! BE CAREFULL!", "date": "Nov 27, 2021"}, {"stars": 2, "text": "Cant sync data from Metamask on my Android phone to my Chrome Extension, Cant delete networks that I added in the Chrome Extension after I added them, Theres a bug in the chrome extension that doesnt let you edit networks that you added after you add them. Too many bugs.", "date": "Nov 27, 2021"}, {"stars": 1, "text": "OMG, please do not use Metamask. I lost $600 worth of funds using this service. I moved funds from 1 account to the other, is lost.. and then in another instance, after a day I bought SAFEMOON tokens some automatic transaction moved funds to some account, which I didn't authorise and there's no one responds to how to get my tokens/funds back in to my account. It's absurd. This is freaking me out. Save yourself lads", "date": "Nov 26, 2021"}, {"stars": 2, "text": "Works but i have to pay a $150+ fee just to receive $15? That's unbeliveable", "date": "Nov 25, 2021"}, {"stars": 1, "text": "I hate how complicated it is and that the app is not smart enough to convert tokens by itself to get the gas fee", "date": "Nov 25, 2021"}, {"stars": 2, "text": "MetaMask 遇到了一个错误\nTry again by reloading the page, or contact support 这里.\n错误详情\n信息：Function.prototype.apply was called on undefined, which is a undefined and not a function\n\n代码：TypeError\n\n栈：\nTypeError: Function.prototype.apply was called on undefined, which is a undefined and not a function\n  at chrome-extension://nkbihfbeogaeaoehlefnkodbefgpgknn/ui-3.js:1:169487\n  at chrome-extension://nkbihfbeogaeaoehlefnkodbefgpgknn/ui-3.js:1:170997\n  at Object.assign.cameraDistance (chrome-extension://nkbih... Show more", "date": "Nov 25, 2021"}, {"stars": 3, "text": "i cant connect my metamask to my opensea anyone else having that problem?", "date": "Nov 25, 2021"}, {"stars": 1, "text": "I lost all my coins ~ $250K today while the account was setup few months ago and I don't touch anything on the seed nor private key. I don't accept any strange contract or send any trash coin.", "date": "Nov 24, 2021"}, {"stars": 1, "text": "ALL MY MONEY IS GONE, install at your own risk. I did nothing wrong, they stole the money, that simple.", "date": "Nov 24, 2021"}, {"stars": 3, "text": "ok", "date": "Nov 23, 2021"}, {"stars": 1, "text": "Non-operational, no support at all.  I downloaded this to my phone, but really need the browser extension.  Downloaded it, and can't login.  My browser account is non-operational.  I need the functionality of the computer keyboard to execute.  There is literally NO Support which is stupid when you are dealing with money and finance. At some point, you have to talk to a person especially when the OS doesn't even begin to work.", "date": "Nov 23, 2021"}, {"stars": 5, "text": "Good", "date": "Nov 23, 2021"}, {"stars": 3, "text": "I have been trying to get in touch with Metamask Support. I have submitted a support ticket 3 weeks ago however have not received a response. I transferred ETH from Coinspot to Metamask and it has not come through. Does anyone have any advice or know how I can get a response from Metamask? TIA!", "date": "Nov 23, 2021"}, {"stars": 2, "text": "First of all, I would like to thank the project team. A wallet you can use to get started and easily buy/sell. But there are so many security issues, they urgently need to update mobile number matching or bring biometric face scanning feature.", "date": "Nov 22, 2021"}, {"stars": 1, "text": "Only displays in Arabic with no override settings just because I'm in an Arabic country doesn't mean I want my apps in Arabic.", "date": "Nov 20, 2021"}, {"stars": 1, "text": "If you use AVAX + Metamask + Trezor, this can be a disaster. Your AVAX tokens will get stuck in MM and you won't be able to move your tokens. MM is very perfunctory to requests from hardware wallet vendors to merge. Basically the developers of MM are just on a silver platter. Hardware wallet vendors now really did all the work, now Metamask just has to push the button, but they don't want to. Is this really a community led plugin? Interesting.", "date": "Nov 18, 2021"}, {"stars": 3, "text": "Chrome extension is nice, except there's no way to remove an account, and no way to sync with the mobile app. Yes you can import the seed phrase, but what good does that do me when I have to also import dozens of accounts and token addresses?", "date": "Nov 18, 2021"}, {"stars": 5, "text": "Great extension!", "date": "Nov 18, 2021"}, {"stars": 1, "text": "Slow and customer support is terrible. Chat said I was being transferred, been waiting over 10 minutes. Nobody's around!", "date": "Nov 17, 2021"}, {"stars": 1, "text": "How to check the contract I been signed before for BSC? my money transfer to another wallet without my approval", "date": "Nov 16, 2021"}, {"stars": 1, "text": "Too stuck, not easy to use", "date": "Nov 15, 2021"}, {"stars": 3, "text": "Can't wait for MM to actually be nice to use with Ledger. It is still buggy and hard on one's patience.", "date": "Nov 14, 2021"}, {"stars": 1, "text": "this application can do wrong it is possbile . \n2 week ago i made an account when i loged in to account i saw there was some eth in it it was 0.007eth or so . i tought its a bug so i didnt mentioned it . then i used the same seed phrase that meta mask gave me to register to ronin wallet . \nthe fun part is after i deposit money to the ronin account it went missing in 12 hour . \ni was shocked cuase i didnt give me seed to anyone so . what was happening . \nafter 4 days i understand that meta mas... Show more", "date": "Nov 14, 2021"}, {"stars": 2, "text": "never got password or secret words. very poor user instructions.", "date": "Nov 13, 2021"}, {"stars": 1, "text": "Metamask has been a disaster on Brave for me. Removing and reloading makes no difference. Impossible to get any meaningful help from Metamask or Brave. However works on other browsers, but I need on Brave. Sigh!", "date": "Nov 13, 2021"}, {"stars": 1, "text": "save your money and dont use this...", "date": "Nov 11, 2021"}, {"stars": 5, "text": "Great product! Works well and easy to use!", "date": "Nov 11, 2021"}, {"stars": 1, "text": "DO NOT USE THIS TRASH! ETH STOLEN!!!!!\n\nMy very 1st transfer to Metamask, my .4/ETH ($2,300) was stolen!!!!!!!!!!!!!!!!!!!!!! ON MY VERY FIRST TRANSFER!!!!!!!!!!!!!!!!!!!!! DO NOT USE THIS TRASH!!!!!!!!!!!!!!!!!!!11", "date": "Nov 10, 2021"}, {"stars": 5, "text": "Awesome extension to make my transactions on various swaps easy, versus the mobile wallet. I do recommend setting up your mobile wallet first. then add the chrome extension. Also, be prepared to add coins that you purchase on chrome to your mobile wallet using the contract address of the coin.", "date": "Nov 9, 2021"}, {"stars": 2, "text": "I transferred some BNB tokens into Flokinomics tokens on Pancake swap and then stored them on Metamask. I had over 330K tokens and now I am down to around 17K tokens and I have no idea why. My money is simply gone.", "date": "Nov 9, 2021"}, {"stars": 1, "text": "SCAM, I sent etherium to the account. I bought what I needed. Everything went well, spent the crazy fees to transfer the coins i needed. Logged in today and all the coins I had in there are GONE!! Buy your coins somewhere else, not safe at all.", "date": "Nov 9, 2021"}, {"stars": 2, "text": "You need to be aware that the whole crypto world is a very risky place where you get no insurance in anything, especially from Metamask support if something bad happens. They will not help you at all. Be aware of that.", "date": "Nov 7, 2021"}, {"stars": 1, "text": "I have transferred BNB to the metamask wallet but it is not shown in the wallet. I have contacted the metamask support team several times but no response at all. Looks like it is a scam. Be careful, your money may be lost.", "date": "Nov 7, 2021"}, {"stars": 1, "text": "I lost all my coins on the fist day I installed this extension, it happened that all my coins were changed to BNB then was transfered to other wallet.", "date": "Nov 6, 2021"}, {"stars": 4, "text": "simple & user friendly", "date": "Nov 4, 2021"}, {"stars": 3, "text": "Why does the site direct to bscscn.com instead of bscscan.com?", "date": "Nov 4, 2021"}, {"stars": 2, "text": "Dapps more like crapps lol", "date": "Nov 3, 2021"}, {"stars": 1, "text": "MetaMask gives no prior warning that the money you are about to transfer will incur HEAVY fees.  Once it is in your \"wallet\", it either stays there or you lose a substantial amount to get it back.  Absolutely trash.  Anyone that thinks this is acceptable is an idiot.", "date": "Nov 3, 2021"}, {"stars": 1, "text": "I have over $20,000 in my wallet and I can do anything my money is stuck. And when I download the app it doesn't show any of my assets, even though I put in my phrase...\nDO NOT USE...", "date": "Nov 2, 2021"}, {"stars": 1, "text": "I sent 2 transactions to MetaMask from Coinbase.  I Etherscanned, and all my information is correct; I can see activity in MetaMask that the funds were received.  However, my balance shows 0, and I cannot use my funds. Sent 2 tickets with no response.", "date": "Nov 2, 2021"}, {"stars": 5, "text": "Why are so many people hating on this extension? It's a great peace of software, if you know what you're doing. From my own experience, every time I \"lost\" funds was completely on me, doing it the wrong way (mostly, picking a wrong mainnet to send my funds to). Learn to accept your own mistakes, people - it's nothing to do with the app and everything to do with you.", "date": "Nov 1, 2021"}, {"stars": 1, "text": "Burger menu missing totally, cannot use at all", "date": "Nov 1, 2021"}, {"stars": 1, "text": "Please do not use metamask. Metamask stole my token. I made sure that I copied my address right when I made a transfer after logging on to my metamask again with my seed phrase, the token is gone because my address changed.", "date": "Oct 31, 2021"}, {"stars": 5, "text": "Good app for everyone who join crypto", "date": "Oct 31, 2021"}, {"stars": 5, "text": "Good extension for crypto to send, receive, swap cryptocurrency in the world.", "date": "Oct 31, 2021"}, {"stars": 1, "text": "Fees are ridiculously high", "date": "Oct 31, 2021"}, {"stars": 1, "text": "why i can not view my a/c", "date": "Oct 31, 2021"}, {"stars": 5, "text": "ok", "date": "Oct 30, 2021"}, {"stars": 1, "text": "I was attempting to add a token and I was charged for it $$$ but the token couldn't be used.  I removed the metamask from chrome and added it back in (yes, using my recovery phrase), and all my tokens were gone.  I have tried several recommended things to get my account back but nothing!  Use this extension only at risk of losing a LOT of money.", "date": "Oct 29, 2021"}, {"stars": 5, "text": "Very usefull, I use it everyday and no problems so far. <3 <3", "date": "Oct 28, 2021"}, {"stars": 1, "text": "When trying to connect to smart chain, continiously getting the info that ``tokens are loading`` but nothing happens. I can not solve the problem..", "date": "Oct 27, 2021"}, {"stars": 1, "text": "i tried to deposit my ether to my new metamask wallet and the money never showed up... this is a SCAM!!!!!!!!!", "date": "Oct 26, 2021"}, {"stars": 1, "text": "bruh this thing just stole all my crypto outta my account 100% a scam dont use", "date": "Oct 25, 2021"}, {"stars": 4, "text": "good", "date": "Oct 24, 2021"}, {"stars": 3, "text": "Hi guys, I transferred my SHIBA from Binance to Metamask BSC mainnet not knowing SHIBA is only for ETH mainnet. I think I just lost my money, Would you mind giving suggestions?", "date": "Oct 23, 2021"}, {"stars": 1, "text": "What the f*** is wrong with this extension. I cant even add network.", "date": "Oct 22, 2021"}, {"stars": 1, "text": "Stay as far away as possible from this! The gas fees for transactions is INSANE!", "date": "Oct 21, 2021"}, {"stars": 4, "text": "Was great but now I cant sign into any sites using the extension. Chrome Version 95.0.4638.54 (Official Build) (x86_64)", "date": "Oct 21, 2021"}, {"stars": 1, "text": "cant sign inn at all on it,  cant find it on my browser also.", "date": "Oct 20, 2021"}, {"stars": 1, "text": "AVOID! Regularly fails to complete transactions with out of gas errors. Lost a lot of ETH because of this badly coded wallet.", "date": "Oct 19, 2021"}, {"stars": 5, "text": "ok", "date": "Oct 16, 2021"}, {"stars": 1, "text": "I logge in on MetaMask and my money get stolen within 10min", "date": "Oct 16, 2021"}, {"stars": 1, "text": "I transferred $550 worth of Ethereum to Meta mask and when i withdrew it I was left with $440.\nThey will not allow you to transfer neither withdraw. Afetr multiple rejections and loads of gas money later it allowed me to withdraw my amount. \nI will never use this again in my life.", "date": "Oct 15, 2021"}, {"stars": 1, "text": "Have probably lost more money through exchanging tokens on metamask than on certain \nprize crashes. Yesterday I lost around 170 dollars changing BeltBtc to Btcb. And no it wasn't \ndue to a high gas fee. Really do not know what happened. I try to avoid metamask like\nthe plague but sometimes there are no other option. I have not had the same problem on any \nother defi exchange or wallet. Pure Garbage IMHO.", "date": "Oct 15, 2021"}, {"stars": 4, "text": "I wish meta mask would come up with dark theme mode. it hurts staring at the white screen", "date": "Oct 13, 2021"}, {"stars": 1, "text": "Horrible extension and all these issues people have and nothing has been done.  Sorry group of developers for sure.  You can't sync with mobile.  You can't add tokens.  You have to do double work and go through hell to get anything done between a mobile device and your Desktop.  Get your stuff together people.  This is a shame.", "date": "Oct 13, 2021"}, {"stars": 1, "text": "i downloaded it but its not letting me buy anything on open sea.. it says its connected but it dont let me download. its weird i have a mac", "date": "Oct 11, 2021"}, {"stars": 3, "text": "Can't set it up, it's all in Japanese ???", "date": "Oct 11, 2021"}, {"stars": 1, "text": "Doesn't give accurate gas prices, so your money is loss because of insufficient gas. Now having a problem sending USDT through the same network, Metamask is just sloppy.", "date": "Oct 11, 2021"}, {"stars": 1, "text": "i just made an account tonight went right back to login, wont let me, i tried feverishly for a couple hours.  couldnt get back on.  il try again tomorow.  but glad i didnt use it now  if i do get in, ill remove this post", "date": "Oct 11, 2021"}, {"stars": 1, "text": "i'm pretty busy these days i haven't logged in to my metamask wallet but today i checked my wallet and all my bnb and DEC coins are gone. I checked the history and saw that my wallet has transferred the above coins to the wallet 0x167454c4c7e791195f97E6fce3F4C3e31aC49DC6 although I am not logged in . help me get back my lost coins this is my wallet 0x3116d20AC7E8d487dfFc97252dA54CDebFc5576D", "date": "Oct 10, 2021"}, {"stars": 5, "text": "Very good", "date": "Oct 10, 2021"}, {"stars": 2, "text": "transactions take for ever", "date": "Oct 10, 2021"}, {"stars": 5, "text": "ok", "date": "Oct 10, 2021"}, {"stars": 5, "text": "Can't I input additional password?", "date": "Oct 9, 2021"}, {"stars": 5, "text": "This is good. I like this project and it's features are good.", "date": "Oct 7, 2021"}, {"stars": 1, "text": "cannot view anything where is the wallet?", "date": "Oct 6, 2021"}, {"stars": 1, "text": "Download the metamask extension on my computer, and save the seed phrase with great caution and precision, following the instructions exactly.\n\nFor reasons that when opening NFT games, it gave me a network error, and it was because the crhome certificates were no longer valid for windows 7, I decided to update my computer to windows 10.\nwhen opening metamask and configuring the smart chain network, I realize that the wallet is not the initial wallet because the address is different. How did t... Show more", "date": "Oct 4, 2021"}, {"stars": 4, "text": "Good but should be better.", "date": "Oct 4, 2021"}, {"stars": 5, "text": "Fast response and accurate information", "date": "Oct 4, 2021"}, {"stars": 2, "text": "Constantly disconnects from exchanges. Cant load balances on poly network. Has cost me lots in missed trades etc. No support from team when emailed. Fix it and ill update. For now this is s***.", "date": "Oct 1, 2021"}, {"stars": 5, "text": "great project!!!", "date": "Oct 1, 2021"}, {"stars": 5, "text": "Excellent app and thanks for the hard work", "date": "Sep 29, 2021"}, {"stars": 1, "text": "My id was missing I don't have private keys please help me anyone how can I restore my id my ETH stuck with the id please how can I get my private keys if any possibilities to recover my private keys", "date": "Sep 28, 2021"}, {"stars": 1, "text": "i got hack", "date": "Sep 27, 2021"}, {"stars": 1, "text": "Really buggy. I have to reinstall about every 10 transfers.", "date": "Sep 26, 2021"}, {"stars": 5, "text": "love it", "date": "Sep 25, 2021"}, {"stars": 1, "text": "They get hacked all the time.  No 2FA.  No way to protect yourself.  Artists and collectors have lost thousands of pieces and MetaMask does nothing to protect them.\n\nAvoid, avoid, avoid", "date": "Sep 24, 2021"}, {"stars": 5, "text": "when trying to claim rewards in Fantom Wallet, It prompts me to select opera chain in meta mask. I select opera chain and the same message pops up.", "date": "Sep 22, 2021"}, {"stars": 1, "text": "language is wrong and no option to change it", "date": "Sep 22, 2021"}, {"stars": 3, "text": "I don't see a use in it.  It's really confusing", "date": "Sep 22, 2021"}, {"stars": 1, "text": "I sent over a few coins over and now I cant even get them out because of eth gas fee and wont take some of the fee from the coins itself to pay for it. Not even an option to switch them to eth either.", "date": "Sep 20, 2021"}, {"stars": 4, "text": "It works great people, just let be honest. This is a new amazing world opening in front of us and it's tricky to understand it at this point. It took me probably 20 - 30 minutes to get it.", "date": "Sep 18, 2021"}, {"stars": 5, "text": "No idea what's with all the bad reviews in here but Metamask is working perfectly fine here in Brunei or anywhere else in world I might add as I am in a few NFT discords and Metamask is renowned for its use for ETH NFT purchases so don't listen to these clowns rating it below 5. I also have DEX in which I move ETH to and fro Metamask and has worked flawlessly.", "date": "Sep 16, 2021"}, {"stars": 1, "text": "Yo what am I doing wrong that to do anything send or swap tokens it costs me at least half of what I have. Won't let me send token to another wallet? I might as well given you $100 as a donation.", "date": "Sep 16, 2021"}, {"stars": 5, "text": "it's work just fine, It would be great if Metamask add full support for ERC-1155", "date": "Sep 15, 2021"}, {"stars": 1, "text": "After few recent updates, the more \"Sorry, We are unable to locate this TxnHash\" appears more and more, same as the mobile version. It shows transactions on etherscan after 1-4 minutes, that's tooooo slow.\nI've to use SafePal on my mobile and never face this type of issue, transaction appear on etherscan immediately. But chrome on desktop, I have no choice other than MetaMask, so, please resolve this kind of issue.", "date": "Sep 13, 2021"}, {"stars": 1, "text": "my transactions keeps failing my balance is in half ive wasted my money by using this wallet", "date": "Sep 11, 2021"}, {"stars": 1, "text": "Don't is working in Chrome.", "date": "Sep 11, 2021"}, {"stars": 2, "text": "I do not know why this is opening in spanish or some other language. i need english so cannot crete account!", "date": "Sep 10, 2021"}, {"stars": 2, "text": "At first they were good..but with the amount of wallet we have now and the number of dapp..they jut can't scale and it consistently bugs and stop working! this is more of a 1st generation wallet so outdated!", "date": "Sep 9, 2021"}, {"stars": 1, "text": "METAMASK IS A SCAM!!!!  I cannot stress this enough to anyone trying to put their crypto in a Metamask wallet.  On 3 separate occasions I had my BNB stolen out of my account.  First it was 11 BNB, then 4 BNB, and as I was trying to get my last remaining crypto out I had to deposit only $50 worth of BNB for the transaction fee.  After removing my other coins, the remaining balance was negated to $0 in literally minutes.  Overall I lost at least $5000 using this awful wallet.  I reached out to ... Show more", "date": "Sep 9, 2021"}, {"stars": 1, "text": "WORST Experience EVER!!! (1) First transaction was a Swap using MetaMask. Results showed 10.29 MATIC (OK) and 10.29 ETH (I ONLY WISH!!!  $34K value). I had NO Eth, but I tried to spend it fast. I was told it was a \"Visual Glitch\".  Reboots and closing browser didn't help. Did not go away until I uninstalled and re-installed. But my transfer to exchange seemed to work OK (1st and only time).  2nd attempt ODD duplicate coins showed up in wallet. 2 Matic coins, both with different balances and 2... Show more", "date": "Sep 9, 2021"}, {"stars": 1, "text": "Costly, extremely slow and when errors happened noone supports you", "date": "Sep 9, 2021"}, {"stars": 1, "text": "LOST MY ETH, so sad", "date": "Sep 8, 2021"}, {"stars": 1, "text": "I just got charged for a failed transaction. (Out-of-gas) issue. Without any warning. What kind of bullsh*t is that? I'm starting to really hate metamask.\n\nAnyone with the same experience? Will I get the money back? Or is it just gone for nothing?", "date": "Sep 8, 2021"}, {"stars": 5, "text": "I have been using this for years and its the best extension for crypto with the ability to modify RPC to any new network.", "date": "Sep 7, 2021"}, {"stars": 1, "text": "don't use it please i get scammed because of this stupid app and all my found are stolen \ni use all my wallet in pc that i turn it on only 1 time in month.\nand the day of 08 august all my eth stolen and that pc was off since week how that????", "date": "Sep 4, 2021"}, {"stars": 1, "text": "I did stake about 1.2billions shibainu in shibaswap using metamask. When I check it today I see someone have transferred Eth 31.August 2021 to my metamask just enough for fee for release my xSHIB and then transfer it to them self.\n I thought it was safe to use Metamask and I also store my password and  phrase Key on a memory stick away from computer.. I see the hacker transferred my xSHIB to this adr..   0x0acd8975eb8f567683e38e24f4ada89d30d7b4c6  Metamask suport are they doing any thing with... Show more", "date": "Sep 4, 2021"}, {"stars": 1, "text": "you can send coins to Metamask but cant send them back out!\n& the FEES are HUGE comparing to Binance.", "date": "Sep 3, 2021"}, {"stars": 5, "text": "ttt", "date": "Sep 3, 2021"}, {"stars": 4, "text": "Please help me. I cant connect my metamask to trezor. Still non stop loading", "date": "Sep 2, 2021"}, {"stars": 1, "text": "Our wallet and many others where hacked, lost about 250 euro. bad security", "date": "Sep 1, 2021"}, {"stars": 1, "text": "can you please switch back the advanced mode to the manual mode instead of you trying guess what the best gas fee is, that shouldn't be call as advanced mode and should be basic instead.", "date": "Sep 1, 2021"}, {"stars": 1, "text": "can someone tell me how to transfer my nft from metamask to my legder nano x", "date": "Sep 1, 2021"}, {"stars": 1, "text": "Cannot import wallet by private key.", "date": "Aug 31, 2021"}, {"stars": 1, "text": "Using this item eventually lead to my crypto wallet getting hacked, hackers were able to use a compromised smart contract I had authorized to gain access to my account. They used this point of entry to secure my private keys then cleared my account of it's funds. I don't recommend this product if you want security or piece of mind. FYI, I've been an active user since 2017. Got hacked with my metamask connected to my ledger nano S wallet", "date": "Aug 31, 2021"}, {"stars": 3, "text": "what happened with this update? the popup just refuses to appear - right click does nothing but brings up the chrome web store. i dont even know how much money i have - i have to go to the block explorer before every transaction just to see what my metamask wallet looks like. why not... idk.. JUST SHOW ME", "date": "Aug 30, 2021"}, {"stars": 4, "text": "I love using this in my tablet but whenever I make a transaction the fiat value still not showing even if I already set it on settings. But the mobile app is fine.", "date": "Aug 28, 2021"}, {"stars": 1, "text": "It has many problems when making transactions, in addition, they charge you for absolutely everything, even for canceling. I will not use this wallet again. I will switch to binance smart wallet. bye", "date": "Aug 28, 2021"}, {"stars": 5, "text": "This wallet is amazing, gives you complete control over your digital assets and currencies. You can't be censored and is extremely simple to use for all skill set levels. Will be on everyone's phone/pc in a few years to come.", "date": "Aug 26, 2021"}, {"stars": 3, "text": "It's not bad, but they need to address how it can be hacked without your keys.", "date": "Aug 25, 2021"}, {"stars": 1, "text": "Transfer eth from binance, never came through. bscscan says transaction successful but wallet shows zero. No response from support for days...", "date": "Aug 23, 2021"}, {"stars": 1, "text": "Unable to connect wallet on many websites.", "date": "Aug 23, 2021"}, {"stars": 1, "text": "Many users, myself included, have not been able to access their original wallets when recovering with the seed phrase. Google 'Metamask recover with seed phrase' and you will see many have lost 1000s due to this error, and metamask support don't respond.", "date": "Aug 23, 2021"}, {"stars": 5, "text": "Great extension to manage my assets and test development!", "date": "Aug 21, 2021"}, {"stars": 3, "text": "Serious issues atm. Some sites just don't work at all. Ones that used to work before the update. \n\n\nI now have to use edge to do what I need to do. Unhappy.", "date": "Aug 19, 2021"}, {"stars": 3, "text": "Just DLed but gave me the worst recovery phrase ever! I mean c'mon: Time bomb capsule stupid reviewers lost money typos because crypto hard understand", "date": "Aug 19, 2021"}, {"stars": 1, "text": "I keep trying to setup my wallet but the secret phrase video page is very buggy and slow and I can't click on the button that takes you forward as wherever I click I start/pause the video plus I can't see anything, just hear the sounds.", "date": "Aug 16, 2021"}, {"stars": 1, "text": "For everyone that can't connect to Wallet. Try using the App, there its working.\n\nHappy to help u", "date": "Aug 15, 2021"}, {"stars": 1, "text": "scamm i lost my money from metamask ,,,do not use this app ...iss bigg scammm", "date": "Aug 13, 2021"}, {"stars": 5, "text": "good", "date": "Aug 13, 2021"}, {"stars": 1, "text": "All crypto“currencies” are multi-level marketing pyramid Ponzi schemes; listen to the “When The Music Stops” podcast with Aviv Milner and Patrick Luberus to learn why.", "date": "Aug 12, 2021"}, {"stars": 1, "text": "Transfered 28 million shib coins over to metamask and they never showed up. Contacted customer service for help, got one useless responses and they stopped responding back to my emails.\n\nTRASH APP AND CUSTOMER SERVICE", "date": "Aug 11, 2021"}, {"stars": 1, "text": "Doesn't work anymore with pancakeswap (i doesn't try with other exchanges), but with binance smartchain wallet work fine with pancakeswap...", "date": "Aug 10, 2021"}, {"stars": 1, "text": "This program is a waste of money. Therefore I am never installing this again.", "date": "Aug 8, 2021"}, {"stars": 2, "text": "I don't see receive button on any token or crypto. I tried Expanded view but same.", "date": "Aug 8, 2021"}, {"stars": 1, "text": "No possibility to open wallet with key file anymore - only the mnemonic restore option is still available.", "date": "Aug 8, 2021"}, {"stars": 5, "text": "Best app ever", "date": "Aug 6, 2021"}, {"stars": 5, "text": "so far so gooood, ignore the spams and trolls they are made because metamask protract you from scammer, the empower site even bloke by Firefox and google chrome due to scamming. and just test your wallet in test network then decide for your self :)", "date": "Aug 3, 2021"}, {"stars": 5, "text": "My main money making assistant", "date": "Jul 31, 2021"}, {"stars": 1, "text": "I do not recommand You using this ledger ever in Your Lifetime!", "date": "Jul 31, 2021"}, {"stars": 3, "text": "The token name must be less than X characters and that is not ok. On metamask on my phone I can add whatever length I want. Also I cannot edit a token name once added.\nAlso, since it is a popup, I cannot copy paste two things in there cause when it lost focus, it goes away", "date": "Jul 30, 2021"}, {"stars": 5, "text": "I installed this metamask", "date": "Jul 29, 2021"}, {"stars": 1, "text": "worst wallet i ever used", "date": "Jul 27, 2021"}, {"stars": 1, "text": "Metamask lost my account, I transferred tokens from one account to another to tidy my accounts up and the next time I logged in using 15 word passphrase the wallet had gone, I was told that if I selected create account it would eventually appear, it didnt. the transaction clearly shows on Etherscan. Support appeared to run out of ideas, they do respond and try to assist but slowly and then finally not at all. If they respond and correct I will update this review and star raiting, but this has... Show more", "date": "Jul 22, 2021"}, {"stars": 1, "text": "I lost all ETH after install the chrome extension !!! no one help !!", "date": "Jul 21, 2021"}, {"stars": 1, "text": "you have an error in my metamask, my funds is now stuck in ronin.", "date": "Jul 15, 2021"}, {"stars": 1, "text": "doesnt work in windows 10", "date": "Jul 14, 2021"}, {"stars": 1, "text": "hello, I want to ask, I signed up for your program very successfully yesterday. everything went well. Today, I don't want to download to my program, I can't find it on my computer anymore. what happened and what should i do.", "date": "Jul 14, 2021"}, {"stars": 1, "text": "Was good but doesn't work with Linux anymore, please fix!", "date": "Jul 11, 2021"}, {"stars": 2, "text": "https://extension-metamask.com.razakopi.com/initialize.html\nis this site is legit? please answer me thank you", "date": "Jul 10, 2021"}, {"stars": 1, "text": "Without warning my coins disappear in this wallet", "date": "Jul 8, 2021"}, {"stars": 5, "text": "Great extension!", "date": "Jul 7, 2021"}, {"stars": 5, "text": "LOOOL! wow! metamask is getting hammered with fake negative reviews and spam accounts/bots! don't follow or navigate to any of these coins they are talking about in the comment section! YOU WILL GET SCAMMED! you've been warned.\n\nmetamask is 5star for me i've been using it for over a year now with no issues. Crypto is really the wild west lol", "date": "Jul 6, 2021"}, {"stars": 5, "text": "Have used it for 4 months without problems. Using MetaMask with Brave. \n\nWriting this review because there are a lot of negative reviews. If I had read those reviews first i would not have installed it. Am setting up a new laptop and added MetaMask extension and my account-wallet again. Without problems. If you own tokens, you have to add the token again for your ownership to appear. Also add token _you intend to purchase_ or purchase won't show. \n\nI do not trade on MetaMask because MetaMask ... Show more", "date": "Jul 3, 2021"}, {"stars": 2, "text": "Trying to add two accounts for two different chains using seeds and all I want to do is to rip my own hair off. Most frustratingly impossible thing to do ever. I would not recommend this wallet to anyone.", "date": "Jun 27, 2021"}, {"stars": 5, "text": "Works great", "date": "Jun 25, 2021"}, {"stars": 3, "text": "As a Wallet this extension is great. However I have a recent major problem. I don't use Metamask all the time, but every time I start or use the browser it asks for the Metamask password. I am not touching metamask in these cases but it bothers every time as well as multiple times a day. I will login if and when I need to. Otherwise sit down and shut-up.", "date": "Jun 24, 2021"}, {"stars": 2, "text": "Okay if you're only using a single software wallet on a single block chain. As soon as you want to have multiple accounts and use multiple chains (e.g. xdai, bsc) it becomes cluttered and clunky.\nWhy is that popup window the size of a tiny matchbox? Why is it so hard to see the entire address instead of an abbreviated thing -- this is the transfer of value, I need to be able to doublecheck every digit, not just the first and last 4!\n\nNow add hardware wallet into the mix (Ledger) and it become... Show more", "date": "Jun 19, 2021"}, {"stars": 5, "text": "good", "date": "Jun 19, 2021"}, {"stars": 3, "text": "ERROR when connecting to Trezor when using Brave.\n\"Cannot read property 'resolve' of undefined\"\n\nNo error when connecting to Trezor on Chrome.\n\nWin10", "date": "Jun 19, 2021"}, {"stars": 1, "text": "metamask is the worst most useless app i have ever come across in my life", "date": "Jun 18, 2021"}, {"stars": 1, "text": "Charged us more than $34 for a single transaction of 255 USDT which is never arrived! avoid this scam service at all cost", "date": "Jun 17, 2021"}, {"stars": 5, "text": "nice", "date": "Jun 13, 2021"}, {"stars": 1, "text": "A lot of errors with Trezor.", "date": "Jun 10, 2021"}, {"stars": 1, "text": "why is it so hard for them to get back to you. i have a bunch of etherum that just dissappeared and their support dont even email me back.", "date": "Jun 9, 2021"}, {"stars": 1, "text": "The 'swap' function doesn't work and only returns 'Error fetching quotes'.", "date": "Jun 8, 2021"}, {"stars": 1, "text": "I put a certain amount of money and disappeared, I looked in all the tabs but there is nothing, I already contacted the support but nobody answers me... lucky that I didn't put such a high amount of money... I don't recommend it to anyone.", "date": "Jun 7, 2021"}, {"stars": 3, "text": "Has anyone used MetaMask wallet to recover Matic token off the Matic Mainnet?  I mistakenly sent Matic from my IGG wallet to my Coinbase wallet not realizing CB is on ETH and not Layer 2.  So, I cant view in CB wallet even though the transaction was completed.", "date": "Jun 5, 2021"}, {"stars": 1, "text": "I added this extension and this stupid thing is running in HINDI language and unable to understand which button to press. I cant see language change options either.", "date": "Jun 4, 2021"}, {"stars": 1, "text": "Do not deposit anything into this wallet. I tried transferring a little to try it, and it put a min of 81 MATIC, which I did. You cannot designate through this wallet so don't even try. I tried transferring it back but you need ETH to do that. I tried swapping to ETH and you need ETH to do that. This is a SCAM, DO NOT USE,", "date": "Jun 3, 2021"}, {"stars": 1, "text": "Dont know how your product works. You've automatically assumed that I know Hindi and given no option to change it. Ridiculous, really.", "date": "Jun 2, 2021"}, {"stars": 1, "text": "WORST WALLET TO USE! DO NOT USE! I have been compromised because of security issues that i still have not found out how i was stolen from.. Please do not use this wallet, hackers will steal your funds. Support team doesnt care and takes weeks to reply. DO NOT DOWNLOAD!", "date": "Jun 2, 2021"}, {"stars": 5, "text": "I find this extension very useful.  I like the sync with the mobile app.", "date": "Jun 2, 2021"}, {"stars": 1, "text": "SCAM. They are stealing funds and blaming it on the user. AVOID!", "date": "May 28, 2021"}, {"stars": 1, "text": "It was ok but", "date": "May 28, 2021"}, {"stars": 1, "text": "It's buggy. You will have to uninstall and reinstall it often. No way to remove wallets you've added, no way to cancel stuck transactions (and it won't let you queue any more once one gets stuck), so you just have to uninstall and reinstall over and over. Very strange that this is such a major extension and has been around so long and still doesn't work at all.", "date": "May 27, 2021"}, {"stars": 1, "text": "I added the extension on chrome but I don't know why it is installing in some other language and I am unable to change the language.. I can put my data only when I can understand what is written", "date": "May 23, 2021"}, {"stars": 5, "text": "working perfectly on iMac", "date": "May 21, 2021"}, {"stars": 2, "text": "i cant get into metamask at all", "date": "May 21, 2021"}, {"stars": 5, "text": "Great choice", "date": "May 19, 2021"}, {"stars": 1, "text": "worst wallet ever. they owe me money!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!", "date": "May 17, 2021"}, {"stars": 1, "text": "very difficult to understand.Its an invention to try to solve problems and makes it more complicated for new comers", "date": "May 17, 2021"}, {"stars": 1, "text": "it is not working. if I try to login to wallet, this wallet request password. then, I enter password. but I cant login to wallet because wallet say password is wrong. but I was not mistake password certainly. so, if you use this wallet, you must recovery wallet by seed phrase anytime.", "date": "May 17, 2021"}, {"stars": 1, "text": "this wallet is the worse wallet ever, Twice my tokens were stolen from my wallet and I reported first time but the supporting team did nothing to return my money or tokens again to the wallet. they advised me to do some steps and report the address that steal my tokens and did so. but again yesterday my wallet was hacked and stolen all my ETH ... be aware and use an other wallet that has OTP and with high secured system.", "date": "May 16, 2021"}, {"stars": 1, "text": "DO NOT USE!\n\nYou get charged a huge fee to receive funds, then a fee per transaction, if it's successful or not. The charges are crazy and astonishingly high unless you are dealing with huge figures which most aren't. An example of this. I transfer $25 of Eth, They take $4 for fees of the transfer. I have this $21 Eth and try to buy SHIB, they want me to pay $60 to buy any amount. I try to withdraw my funds they take $6, leaving me with $15. This transaction is sat at pending for a day so I t... Show more", "date": "May 16, 2021"}, {"stars": 1, "text": "MetaMask or MetaScam is just another wallet to stay away from.\n\nFull of viruses and scammers. \n\nI simply sent some BNB through their \"Help article\" and every time I click on my account to get the address, it changes to another one. You can never copy your address.\n\nI have sent multiple emails to tell them about the problem and what they do is just ignore messages.\n\nI have notified Binance about their scams and hope that everybody with brain would stay away from them.", "date": "May 14, 2021"}, {"stars": 1, "text": "Designed to hit you with insane fees. lost $120 out of $250 in fees alone. if you are willing to lose money i guess its ok but i didnt understand how sneaky this app would be", "date": "May 13, 2021"}, {"stars": 1, "text": "Screwed me out of a lot of money by claiming \"INSUFFICIENT FUNDS\" even though I had plenty. Had to refresh a couple of times to get it to finally accept I had the funds in my wallet, by which time it was too late. Only use this trash if you have to!", "date": "May 12, 2021"}, {"stars": 3, "text": "Pretty good extension, what i would like to see is that the individual Coin screen of your account should have a place to \"Copy Token Contract Address\", people using MetaMask are very often dealing with the super-low cap coins which are hard to track down, many times not even on coingecko / coinmarketcap. Currently to get the address i have to find it on dextools then paste it into uniswap and see if it lines up with my MetaMask balance for the coin i think.", "date": "May 12, 2021"}, {"stars": 1, "text": "Useless piece of s**t!", "date": "May 12, 2021"}, {"stars": 1, "text": "fake", "date": "May 12, 2021"}, {"stars": 1, "text": "Won't keep this extension. It's causing my browser to stay open with 100% + CPU usage even after I've closed, and sometimes killed the process. Whatever it's doing, it isn't just a wallet app.", "date": "May 11, 2021"}, {"stars": 2, "text": "The plugin works fine, but be careful. I had lag with two transitions in the plugin, which remained on loading, and on the third attempt when I gave confirmation for a transaction it confirmed THREE transactions at a time. I contacted the support and they just sent me a random bot message and don't answer to me in person anymore.", "date": "May 11, 2021"}, {"stars": 1, "text": "slow like hell, today charged ~40 dollar for transactions what \"dropped\" and \"failed\". its a f..king joke, not wallet.", "date": "May 11, 2021"}, {"stars": 1, "text": "Honestly, the permissions it requires seem totally uncalled for.\nI recommend revoking as much permission as you can once it's installed, minimising any other browser windows you have open, and disabling it when you're not using it.\n\nIt's also very buggy.\nI'm pretty convinced it forgot my password on one occasion [had to use the passphrase].\nOn multiple occasions it's stopped showing my alt coins [says it's loading but does nothing. Reinstalling does nothing, only time it seems. Lots of time].... Show more", "date": "May 10, 2021"}, {"stars": 1, "text": "Metamask is the worst wallet ever\n\nIs it possible to change the account without our intervention?\n\nI lost all my possession of that damned wallet\n\nToken Ethereum BNB\n\nI found a different account, and I was not able to retrieve the original account\n\nAdvice not to trust metamask", "date": "May 9, 2021"}, {"stars": 3, "text": "Can you please get rid of the 3D Fox that follows your mouse's movement? It's cool and all but it takes time to open the extension to login so I can do my thing. At least add an option to make it static. The 3D fox is just a cosmetic thing that comes with overheads.", "date": "May 9, 2021"}, {"stars": 1, "text": "Started using Metamask couple of days ago. Today all my ERC20 (worth atleast USD14K) got converted to Etherum through Unisawp and sent to unknown address. I never signed of the transaction. I never reviewed my seed phrase or private key, or password to anybody. Can't still explain how this happened. This is very devastating for me.", "date": "May 8, 2021"}, {"stars": 5, "text": "good", "date": "May 7, 2021"}, {"stars": 1, "text": "Cant see my coins in metamask even after manually setting token adress for that coin i sill cant see them. The most odd thing is that when i connect metamask to pancakeswap , pancake does see those coins and i can trade with them. So not sure if it is just bug but i cant send those coin from metamask to anywhere cuz it shows i own 0.", "date": "May 7, 2021"}, {"stars": 3, "text": "I have ABSOUTELY NO IDEA what I am doing with this extension! This is the most confusing thing I have ever looked at... I want to understand how to use it- however, it just makes absolutely no sense. I dont know what a node is! I do understand the concept of the Ethereum ecosystem, but how does all of it come & connect together? It just makes no sense.", "date": "May 6, 2021"}, {"stars": 2, "text": "I installed MetaMask and it decided I'm an Arabic speaker so I can't use it.", "date": "May 4, 2021"}, {"stars": 5, "text": "Probably the best and safest wallet for hot-storage of your crypto assets online. Great support and universal with access to custom/private-chain additions.", "date": "May 4, 2021"}, {"stars": 1, "text": "Lost all my coins after installing this, I seen $50 deposit to Ether than they swapped my SLP to to Ether and then it was sent to another address, I should have stayed using Mobile only. This should not be allowed. If anyone says this works fine, prove it.", "date": "May 4, 2021"}, {"stars": 1, "text": "Don't use this wallet unless you want to lost all your coins!!!\n\nI've been using metamask since 2018ish, everything was going fine until recently I needed to switch to another computer. I had to export my seeds (so that I can restore on my new computer), but it gives me an error saying: \"MetamaskController - No HD Key Tree found\". Also I could not move my ETHs out to another wallet because of another stupid error: \"TypeError: Cannot read property 'type' of undefined at y (chrome-extension://n... Show more", "date": "May 3, 2021"}, {"stars": 1, "text": "Hacked for $2k. No I haven't entered my seed phrase anywhere", "date": "May 1, 2021"}, {"stars": 1, "text": "I wanted to swap some coins, but it failed and I lost the gas fees. Very disappointing! I can't recommend this wallet! Very bad!", "date": "Apr 29, 2021"}, {"stars": 1, "text": "Doesn't show my available tokens. Tried to withdraw using mycrypto, but it says pending and not doing anything.", "date": "Apr 29, 2021"}, {"stars": 2, "text": "Metamask became very buggy lately. I have to uninstall and install again everytime I open my browser, so annoying.", "date": "Apr 29, 2021"}, {"stars": 5, "text": "Hi! I use Binance Smart Chain Mainnet on MetaMask when I try to Withdraw funds from some token to BNB then Transaction Confirmed but funds not passed to BNB and now I try to add some funds an error occurs says that you have insufficient balace but I have balace on it. Anyone can help me?", "date": "Apr 25, 2021"}, {"stars": 1, "text": "Bad application. Steals money from clients. Transactions were carried out several times, the funds were not transferred, but the commission was charged. Wrote in support, support belongs to the network, the system is to blame. In general, Metamask steals clients' money, does not make transfers, but charges a commission.", "date": "Apr 25, 2021"}, {"stars": 1, "text": "I lost $150 using metamask. They logged me out and did not allow me to restore my account. DO NOT USE METAMASK!", "date": "Apr 24, 2021"}, {"stars": 1, "text": "Binance Smart Chain in not working for almost a week now.. I submitted a complaint already.. since now no response.. I cannot access my BNB coins!!!!!!!!!!!!!!!!!!!!!!!!!!", "date": "Apr 24, 2021"}, {"stars": 3, "text": "I am trying to recover my erc 20 token from Binance Chain wallet to Metamask importing in Private key. Because I was not able to send my token back to Binance.us even though I sent it from originally Binance.us.\nHave anybody done this?", "date": "Apr 22, 2021"}, {"stars": 5, "text": "good", "date": "Apr 21, 2021"}, {"stars": 4, "text": "Used to LOVE this, my favorite crypto app.  Now I almost hate it.  After trying to install the app on Brave Browser, prob a mistake.  I somehow deleted or lost the little fox icon that used to reside in my extensions area on my Chrome browser and cannot get it back.  Installing MM on Chrome does zero. Help, anyone?", "date": "Apr 20, 2021"}, {"stars": 5, "text": "I lost my seed phrase\nI have wallet adress and password.\nI deleted metamask extension and installed again.But i couldnt save my seed phrase.\nHow can i get retrive it ? I cant find vault adress on the google chrome files.Is it because of i reinstall again ?How can i reach old files ?", "date": "Apr 17, 2021"}, {"stars": 1, "text": "I have bought ETH but it doesn't show up in my account.  I have transferred ETH but that doesn't show up on my account either.  Did metamask just steal my money?", "date": "Apr 12, 2021"}, {"stars": 1, "text": "I did all the necessary steps for viperswap. The connection cannot be established! The first day there was no problem, but it was more than 10 days metamask connection cannot be established! Please give feedback on the topic there are many victims", "date": "Apr 9, 2021"}, {"stars": 5, "text": "A superb tool to use Ethereum. THE standard, the goto.", "date": "Apr 6, 2021"}, {"stars": 2, "text": "When I try to pay using MetaMask it closes Chrome entirely. Its insane. I have not had this problem o my own computer but on another computer it just closes Chrome! What is up with that?", "date": "Apr 6, 2021"}, {"stars": 3, "text": "I haven't even started using it but it downloaded and it's in Spanish, why? I didn't click any prompt for this to happen, nor is my browser in Spanish.", "date": "Apr 6, 2021"}, {"stars": 1, "text": "suck", "date": "Apr 4, 2021"}, {"stars": 1, "text": "for some reason it installs in what appears to be Japaneese which I can't read so I can't set anything up, and the settings are greyed out until you set up or import an account.  Give me access to languages before you require me to set up an account using a language i can't figure out", "date": "Apr 4, 2021"}, {"stars": 3, "text": "Please add dark mode", "date": "Apr 4, 2021"}, {"stars": 3, "text": "Someone sent me an NFT on my metamask address but I am not able to view it . Why ?", "date": "Apr 4, 2021"}, {"stars": 4, "text": "Please provide a dark theme", "date": "Apr 2, 2021"}, {"stars": 1, "text": "SOMEONE SPAMMED MY CHROME BROWSER WITH MALICIOUS LINKS TO PHISH FOR MY PASSWORD, THEY GOT IT AND STOLE OVER $1500 FROM MY METAWALLET, NO ONE WILL ANSWER MY EMAILS OR ANYTHING FOR ASSISTANCE", "date": "Apr 2, 2021"}, {"stars": 5, "text": "How can I get my metamask ethererium wallet?", "date": "Apr 2, 2021"}, {"stars": 1, "text": "If I could give this zero stars, I would. Absolute rubbish extension and support. Don't install Metamask. Don't do it. Seriously, don't waste your time with this extension, I promise you will regret it. The only reason I can imagine that this trash would get so many recommendations is because they're bots or paid shills. I won't go into all the details of the problems I had. Just save yourself the pain and give Metamask a hard pass.", "date": "Apr 1, 2021"}, {"stars": 1, "text": "Worst wallet I've used yet. Expensive to transfer coins in and out. Wallet hides coin pairs and the fix is to completely remove the wallet, re-install, and use your seed phrase. Only problem is all old transactions no longer show. \n\nAVOID!", "date": "Apr 1, 2021"}, {"stars": 3, "text": "Love the capability to easily switch between networks (ETH, FSN or BNB), but the fact that it keeps asking me to backup my phrase, even though I have a ledger is VERY ANNOYING!!!", "date": "Apr 1, 2021"}, {"stars": 3, "text": "why can't i connect my foundation.app wallet to metamask", "date": "Mar 26, 2021"}, {"stars": 5, "text": "Very nice", "date": "Mar 25, 2021"}, {"stars": 1, "text": "really buggy, so all the default charges are way more then your NFT, and if you change then they will just not do it. I think its a scam. if a developer is reading, don't set the defaults so high then instantly accept it. I would have never wasted my money thinking a wallet and payment network would have been so much.", "date": "Mar 24, 2021"}, {"stars": 1, "text": "Doesn't work in my Chrome anymore. Blank app screen and spinning wheel.", "date": "Mar 23, 2021"}, {"stars": 2, "text": "Sync is terrible/ non existent. All machines where I use this wallet have radically deferent ideas of what's in it.\n\nWhen you install the app on a new computer and you click import wallet the app asks you for your seed phrase and a NEW password. Which makes sense, I'd like to be able to have different passwords on different machines. But it turns out that that's completely false, you need to enter your original password to access your wallet with your seed phrase. Congrats you've just created... Show more", "date": "Mar 18, 2021"}, {"stars": 3, "text": "I can't trust third party extension to read all my site data... Well i guess i have to read somehow extensions code to see does it have anything malicius", "date": "Mar 17, 2021"}, {"stars": 5, "text": "MetaMask is the only Ethereum based web wallet you will need.", "date": "Mar 15, 2021"}, {"stars": 2, "text": "It's in Spanish.  I cannot find a way to switch it to English, and although I wish I spoke more Spanish, my lack of fluency makes it difficult to use the wallet.  Why is it in Spanish by default and with no option to switch languages?", "date": "Mar 15, 2021"}, {"stars": 1, "text": "Horrible. I have my wallet. Days later I forgot my password, and then they didn't save the password.I have my seed but is impossible to access. I hope this extension die soon, you cant trust a dime to them", "date": "Mar 15, 2021"}, {"stars": 3, "text": "Works just fine in Google Chrome. If you are using Brave Browser, and it just tells you \"Loading Coins...\" just switch over to Chrome... Your funds should be available there", "date": "Mar 13, 2021"}, {"stars": 1, "text": "Metamask is incentivized to lose you money. Literally 100 percent of the transactions I have attempted have failed. I have spent a tremendous amount of money and received nothing in return- but Metamask profited each time. They give you a \"whoopsie\" error message that says, \"transaction failures happen,\" but when you just lost hundreds of dollars that they took a percentage of, \"failures happen\" isn't going to cut it. They make $100,000+ each day and even when you can trace the transaction an... Show more", "date": "Mar 13, 2021"}, {"stars": 1, "text": "I used Metamask for make the transaction on smart-contract, it cost me approx. 25$ in ETH to pay the calculations for this TX. But suddenly, after tx was finished - I saw \"transaction failed\", and the details:\nTransaction failed (out-of-gas). Gas limit: 267,255. Gas used: 249,748 (93.45%)\nMetamask interrupted the transaction when the job was almost done, with the reason \"out-of-gas\" while the was enough gas (because this amount, 267255, is recommended by Metamask itself)!\nWould you like to pl... Show more", "date": "Mar 13, 2021"}, {"stars": 1, "text": "after just a few weeks of usage I was robbed by $2500.\nDon't sure this chrome extension.", "date": "Mar 13, 2021"}, {"stars": 1, "text": "It's all in German, no way to change it.", "date": "Mar 12, 2021"}, {"stars": 1, "text": "Extension shows incorrect balance even after restarting browser, reinstalling extension and cleaning browser cash. Non of tips helped with this issue. It simply makes Metamask 100% useless!", "date": "Mar 10, 2021"}, {"stars": 1, "text": "unbelievably insecure crypto wallet. read up on how many users have been phished / hacked out of their coins. I lost A LOT and had to reinstall to sell NFTs and now I can't even access the extension due to a malware attack of some kind (on a mac). nightmare. garbage software until they add 2FA!!!", "date": "Mar 10, 2021"}, {"stars": 1, "text": "Charges 2x-3x of what the proper gas fees should be. They should be sued.", "date": "Mar 6, 2021"}, {"stars": 2, "text": "I cannot sync the code from this extinction to my Android phone.  There is no setting option. The only QR that I can get is  The Account Details, and when I scan it, I receive the message \"Invalid QR code!\"", "date": "Mar 5, 2021"}, {"stars": 1, "text": "It's not safe. If you can -  use something else. If you have no choice and can use only Metamask - do not store there any significant amount of coins Your account can be easily wiped out and there is no halp/statement/investigation from Metamask. Hundreds of people or maybe even more have been robbed already.", "date": "Mar 5, 2021"}, {"stars": 1, "text": "I installed the app from the chrome store on my PC and on my cellphone, transferred in a large sum of ETH on January 15, 2021 (which went through immediately) & 48 hours later my balance was all gone. I submitted a ticket with Metamask and waiting on a response....", "date": "Mar 4, 2021"}, {"stars": 1, "text": "doesn't work for windows xp and i cant upgrade my pc sadly :( and it just opened too many tabs.", "date": "Mar 4, 2021"}, {"stars": 1, "text": "I've lost 600$ because I've been hacked.", "date": "Mar 3, 2021"}, {"stars": 5, "text": "good", "date": "Mar 3, 2021"}, {"stars": 5, "text": "Works great for me.\n\nI made test with small amounts of ETH. I've used the test nets with success and I memorized my own seed phrase and only unlock my account when I am actively using it.  For everyone that thinks metamask is a scam I invite you to do your homework on crypto-wallet best practices and follow them with zeal. \n\nThis isn't like a centralized systems where you can email admin and get your passwords back. It's also easy to change to a wallet that will work on empowr whether it's a ... Show more", "date": "Mar 2, 2021"}, {"stars": 5, "text": "nice", "date": "Feb 26, 2021"}, {"stars": 4, "text": "Why have I the installation in Arabic ????", "date": "Feb 24, 2021"}, {"stars": 1, "text": "Logged me out. imported the seed phrase and the wallet address is different. now locked out of my old address. $500 assets lost.\navoid this like the plague", "date": "Feb 24, 2021"}, {"stars": 1, "text": "start language is unknown to me, cant change it without login, cant login with default language", "date": "Feb 18, 2021"}, {"stars": 1, "text": "got my coins stolen", "date": "Feb 18, 2021"}, {"stars": 1, "text": "money was stolen from the metamask wallet I wrote to the metamask support they do not respond ! tech support is silent !", "date": "Feb 17, 2021"}, {"stars": 5, "text": "works as advertised", "date": "Feb 16, 2021"}, {"stars": 2, "text": "Is not usable now that the gas fees are extremly high, 6 dolars just to move eth from my own wallets !!!!\nEth is not as its supposed to be", "date": "Feb 16, 2021"}, {"stars": 1, "text": "Hello,\n\nI do all my ETH based tokens transactions via MetaMask and I absoluted used to love it.\n\nUntill all my assets have been liquidated... I have the adress who got my tokens from Etherscan, how ever I'm still in awe of having lost 2k worth of tokens...\n\nI would appreciate your help.\n\nBest.", "date": "Feb 14, 2021"}, {"stars": 5, "text": "Great", "date": "Feb 13, 2021"}, {"stars": 5, "text": "Make sure to download the legit extension.", "date": "Feb 13, 2021"}, {"stars": 1, "text": "my CPU going high with that..was looking like that use my PC for mining without my permission", "date": "Feb 12, 2021"}, {"stars": 1, "text": "The Fees are so high. I want to Swap 200 Euro and they want over 120 Euro Fee.", "date": "Feb 11, 2021"}, {"stars": 3, "text": "Don't know if this has been reported or not, I guess not since most people running Metamask are on phones, I'm using Metamask on desktop with google chrome and for whatever reason signing any site just crashes the browser and this is the same for every chrome based browser, they all do the exact same pattern, the only browser it works normally on is firefox and that makes this frustrating to use as I don't use firefox regularly. Would like to know why this is happening.", "date": "Feb 8, 2021"}, {"stars": 1, "text": "WARNING WARNING WARNING WARNING WARNING WARNING WARNING WARNING \n\nTHIS EXTENSION WILL SCREW UP YOUR TRANSACTIONS AND NOT ALLOW YOU TO MODIFY THEM IN ORDER TO MAKE THE BE ACCEPTED ON THE NETWORK!!!! THE UPDATE GAS BUTTON DOESN'T SAVE ANYTHING AND THIS BUG HASN'T BEEN FIXED SINCE JUNE 2020!!!\n\nDO NOT PUT ANY VALUE INTO YOUR METAMASK WALLET, THERE ARE TOO MANY BUGS AND THE DEVELOPERS DON'T FIX THEM", "date": "Feb 6, 2021"}, {"stars": 1, "text": "DO NOT USE IT!", "date": "Feb 5, 2021"}, {"stars": 2, "text": "SCAMMER BEWARE. The developers of this addon/extension should take some responsibility for the protection/vulnerable of innocent users who are not adept to scammers/impersonators. In a community group chat I mention I was new/beginner and questioned about transferring between Metamask wallet. I was then \"personal messaged\" by several impersonators posing as Customer Support... telling me to goto a convincing website which made MetaMask popup asking me to ALLOW website full access to my MetaMa... Show more", "date": "Feb 4, 2021"}, {"stars": 1, "text": "No option to connect to ledger, docs are wrong, the option they claim allows this simply doesn't exist.", "date": "Feb 4, 2021"}, {"stars": 1, "text": "Why is it downloading only in arabic ??? I tried ten times, change computer or Google language but nothing changes it !", "date": "Feb 3, 2021"}, {"stars": 1, "text": "horrible support! super slow... and a lot of problems..\n\nHighly recommend to dont use this, if you dont want to lose your coins!!\n\ni already lost 2 transactions and nobody help me from their support.\n\nchoose whatever wallet you want but dont go for this one believe me", "date": "Feb 2, 2021"}, {"stars": 1, "text": "unprofessional Support Services!! instead of helping me with an objective solution to a bug, he responded to my emails by asking me to take tests that obviously doens't work.", "date": "Feb 1, 2021"}, {"stars": 1, "text": "Just know. This is 100% the only wallet on the Internet that DOES NOT PROTECT YOUR MONEY. No 2-factor. No transfer funds code. No log in alerts. They have a RIDICULOUSLY high rate of wallets being emptied. I'm convinced they do it. Use at your own risk.", "date": "Jan 30, 2021"}, {"stars": 1, "text": "I made the mistake of putting my GRT tokens in this wallet before doing proper research. I need to swap my GRT to ETH in order to move it, but the outrageous gas prices are upwards of 50% of the worth of my GRT... I understand they say the fees don't go to them. I'm almost better off just forgetting about it, and moving on.", "date": "Jan 30, 2021"}, {"stars": 1, "text": "Why on earth I'm getting the arabic language version?", "date": "Jan 30, 2021"}, {"stars": 1, "text": "just doesn't work", "date": "Jan 23, 2021"}, {"stars": 5, "text": "Work great!", "date": "Jan 23, 2021"}, {"stars": 1, "text": "Loss of time. Doesn't work. Buggy interfaces. Doesn't display the correction balance from my ledger nano X...", "date": "Jan 21, 2021"}, {"stars": 1, "text": "Worst wallet in the market", "date": "Jan 15, 2021"}, {"stars": 1, "text": "can't add to the binance testnet network,\nI've tried using\nRPC URL\nhttps://data-seed-prebsc-1-s1.binance.org:8545/\nhttps://data-seed-prebsc-2-s1.binance.org:8545/\nhttps://data-seed-prebsc-1-s2.binance.org:8545/\nhttps://data-seed-prebsc-2-s2.binance.org:8545/\nhttps://data-seed-prebsc-1-s3.binance.org:8545/\nhttps://data-seed-prebsc-2-s3.binance.org:8545/\nand using chain ID 97 and 0x61 always get an error and this message says \"Could not fetch chain ID. Is your RPC URL correct?\"", "date": "Jan 14, 2021"}, {"stars": 4, "text": "i see no problem with this site, all the bad comments are probably what it was like when google launched anyways, just not as technical", "date": "Jan 11, 2021"}, {"stars": 3, "text": "I got it and at first it worked well. Then I transferred some ETH to the wallet but it didnt show the tokens. I fianlly got it back to work after reinstalling the extension. But then since yesterday, I cant add it to my list of extensions. What is happening? why cant I use it?\nReally terrible user experience", "date": "Jan 8, 2021"}, {"stars": 2, "text": "At the surface it looks like a good tool, but it's an immature technology, as the UX needs a lot of work. Also the fees to swap coins are exorbitant, essentially not worth using it.", "date": "Jan 8, 2021"}, {"stars": 5, "text": "good", "date": "Jan 6, 2021"}, {"stars": 1, "text": "I have had only issues since using MetaMask. Nothing has gone through. Pretty sure I have lost money too. I have contacted support. I will update if they fix this for me.", "date": "Jan 6, 2021"}, {"stars": 1, "text": "cant restore my wallet with my seed key. Keep away from this! You owe me 1 ETH!", "date": "Jan 5, 2021"}, {"stars": 1, "text": "Very high default fees! Which is making it completely useless for any small transactions.\nWhen using Advance feature and lowering trx cost from SUGGESTED 16$ to 6$, it failed 3x times, but taking the money. Costed me 18$, still not transfered the funds. \n\nSwaping cost even better, 29-95$... \n\nAs soon as I take my money from it, will be deleted and not to be used again. \nEth also very good, not.\n\nGoing back to btc.", "date": "Jan 2, 2021"}, {"stars": 5, "text": "Needs more updates, such as some very well known coins with big market caps not fully recognized or recognized at all. Too much manual intervention but easy stuff\n\nAlso Energy Web Bridged doesn't collect price properly it should be $EWT cloned so it searches for EWT not EWTB", "date": "Dec 26, 2020"}, {"stars": 5, "text": "Great wallet for interacting with decentralized exchanges and smart contracts. Not sure what all the 1 star reviews are about... I've had no issues with it. Secure your seed words and take some time to learn how to use it before leaving a 1 star review.", "date": "Dec 24, 2020"}, {"stars": 2, "text": "Text inputs very slow when adding a new network in 8.1.9. There is a massive delay. It is unusable.", "date": "Dec 20, 2020"}, {"stars": 1, "text": "Don't use it or you will lose your money.\nIt sucks.\nVery high fees.\nThey stole € 50 from me.\nBefore they didn't send my money to another wallet and now they blocked me and I can't access anymore.\nSupport responds after days and without really helping you.", "date": "Dec 19, 2020"}, {"stars": 1, "text": "My account hav been hacked. avoid at all cost", "date": "Dec 16, 2020"}, {"stars": 3, "text": "am hearing reports of a MetaMask \"beta version' and people are losing all their crypto............I sincerely hope they get all their crypto back and that meta mask takes initiative to correct this for them and fix all issues. This is peoples finances and life savings and future wealth, not a video game joke.", "date": "Dec 11, 2020"}, {"stars": 1, "text": "its broken", "date": "Dec 10, 2020"}, {"stars": 3, "text": "Metamask is really awesome and i love the idea, but i tried to send some ETH and ended up with many transactions that are impossible to cancel it seems.. I have tried to speed up cancellations but to no avail, plus many are using gwei speeds of 2 or 3 instead of 40-50 like im setting it to.. \n\nIf support can help me resolve this issue I would have no issues giving this service a 5 star.", "date": "Dec 5, 2020"}, {"stars": 1, "text": "Installed it for Chrome restore account and immediately lost all my funds that went straight to this suspicious wallet address  0x66c61eb95672c04c49edaa63602b2743dc165e18 Very disappointed. I lost hope to be able to recover them unless Metamask is keen on helping then feel free to contact me  directly. I'm pretty confident I installed  the right extension from Chrome Store. On top of that, I can't see any signed hash files from which one can check the integrity of the extension  when checking... Show more", "date": "Dec 4, 2020"}, {"stars": 1, "text": "they steal the audience by calling normal sites unsafe! this is unfair and unethical! my startup, where there were 5 people on the site, except for the developer, was recognized as unsafe. you are scammers!", "date": "Nov 27, 2020"}, {"stars": 2, "text": "Since the new update all my contact addresses are gone and it doesn't work to save them again. \nPlease fix.\nOtherwise great wallet.", "date": "Nov 25, 2020"}, {"stars": 1, "text": "New version can't link to private ethereum network, report rpc url error. It is too terrible to use.", "date": "Nov 19, 2020"}, {"stars": 1, "text": "They steal your seed phrase! THEY STEAL YOUR CRYPTO!!!! Are you crazy to use it? Guys, are you insane? they ask your private seed phrase and only then show you balance.... They literally steal your keys, your wallet, your recovery, and can steal all your money at any moment? WHAT THE ACTUAL FUDGE?????????? THIS THE EFFIN BIGGEST SCAM, HOW IS THIS ALLOWED???????????", "date": "Nov 18, 2020"}, {"stars": 2, "text": "https://github.com/MetaMask/metamask-extension/issues/8349\nUpgrade trezor-connect dependency to the latest. The problem with Trezor support has been there for more than 6 months. How much time do you need to fix it? It is a High priority security issue. It is unprofessional at all.", "date": "Nov 1, 2020"}, {"stars": 1, "text": "Please update the compatibility with trezor, it doesn't sign transaction.\nBelow is the error message i get, \n\nThe current version of firmware (2.3.4) may be not compatible with the running version of Trezor Connect.\nThe current version of firmware contains major changes that could affect the efficient functionality of Trezor Connect.\n\nIf you’re experiencing any issue as a user, please contact the owner of chrome-extension://nkbihfbeogaeaoehlefnkodbefgpgknn.\nIf you are a developer of chrome-ex... Show more", "date": "Oct 26, 2020"}, {"stars": 1, "text": "Stupid Wallet for Developer. Many bugs. Metamask api is poor. Stupid wallet.", "date": "Oct 14, 2020"}, {"stars": 1, "text": "I lost all my assets. I know it wasn't my mistake since I wasn't operating with the wallet that day. Seed passphrase is useless, I have it on pen and paper only, and still got access to my account and all my assets stolen. Avoid like a virus.", "date": "Oct 11, 2020"}, {"stars": 1, "text": "Not secure. You will lose your assets. Avoid like the plague.", "date": "Oct 11, 2020"}, {"stars": 1, "text": "AVOID LIKE THE PLAGUE. Not secure. You WILL lose your assets, no matter how you keep your password or seed phrase secure.", "date": "Oct 11, 2020"}, {"stars": 1, "text": "What's with the intrusive permissions? Not necessary to modify my clipboard.", "date": "Sep 26, 2020"}, {"stars": 1, "text": "this wallet is scam, sent ether and dai to my other wallet since three days now and have not seen it.\nplease nobody should use this wallet.", "date": "Sep 18, 2020"}, {"stars": 1, "text": "I have been in crypto for a while. I am careful with my seeds and passwords. When my computer crashed and I had to reinstall the extension my seed phrase pulled up a new wallet and had non of my crypto there. I reached out to support and my ticket is routinely marked as complete without ever receiving a response. I would stay away from this extension as being able to back up your crypto is a huge priority and Meta mask is not reliable.", "date": "Sep 12, 2020"}, {"stars": 3, "text": "I can't even read the language when installing the Extension. Awful experience.\nOnce installed, all is fine but UX could be improved.", "date": "Sep 8, 2020"}, {"stars": 3, "text": "I am giving this 3 starts because of what is can (possibly) so, but I can't use it because when I enter the required password to backup my wallet I only and always get \"Error: Unknown error: Failed to load generated key pair from keystore\"...  and it can't proceed. :(", "date": "Sep 2, 2020"}, {"stars": 1, "text": "Was using Metmask for firefox for a year. Went to open it recently and just getting a blank white screen. Anyone else have this issue? John", "date": "Sep 2, 2020"}, {"stars": 5, "text": "Fantastic tool for accessing the crypto markets and eventually the dwebb.\nThank you so much for making useful tools and products possible with this web3 extension.", "date": "Sep 1, 2020"}, {"stars": 5, "text": "Fast, secure, exact", "date": "Aug 27, 2020"}, {"stars": 1, "text": "This extension now slows down everything in my Brave browser.\nTip: You can stop this behavior from this extension by going to task manager and whichever task is using an enormous amount of memory, that is this extension.", "date": "Aug 24, 2020"}, {"stars": 1, "text": "Seemingly straightforward user experience. I was lured thinking this tool was appropriate for an amateur (I have a few btc holdings and wanted to buy tokens in a company). Well... I was mistaken, and now find myself without access to a big portion of my tokens. Here's my story: I carefully opened an account and made note of my secret seed phrase (never forget to do this!) in my password vault. I also generated a password with the same vault. Following this I transferred in some ETH and used t... Show more", "date": "Aug 24, 2020"}, {"stars": 3, "text": "still buggy.  problems connecting up with ledger and myetherwallet.", "date": "Aug 20, 2020"}, {"stars": 5, "text": "its 2020!! why the f all the reviews are 1-2 years old! The Metamask Chrome extension works great been using it for 4 months now.", "date": "Aug 18, 2020"}, {"stars": 5, "text": "ok", "date": "Aug 11, 2020"}, {"stars": 1, "text": "IS NOT WORKING PROPERLY IN APRUVING STAKING (THE CONFIRM BUTON DO NOT WORK)", "date": "Aug 5, 2020"}, {"stars": 5, "text": "Excellent extensions app smart working safety", "date": "Aug 3, 2020"}, {"stars": 5, "text": "People who voted 1-3 stars are too dumb to use this great crypto extension! It's your own fault if you lost seed words or got infected with viruses! Metamask is one of the most secure crypto wallets out there! And yes, empower is scam, metamask is not.", "date": "Jul 23, 2020"}, {"stars": 5, "text": "Very good wallet.Keep going.", "date": "Jul 21, 2020"}, {"stars": 5, "text": "Simple. Compatable. Secure. Very powerful extension to easily enable innovation.", "date": "Jul 21, 2020"}, {"stars": 3, "text": "okay", "date": "Jul 20, 2020"}, {"stars": 5, "text": "can i have 2 accounts in my metamask? how to add account?", "date": "Jul 17, 2020"}, {"stars": 1, "text": "Injecting malware into every page now, what happened?", "date": "Jul 14, 2020"}, {"stars": 5, "text": "great experience", "date": "Jul 14, 2020"}, {"stars": 1, "text": "Must be an awesome feeling to watch this connect successfully to the Ledger Nano x. Has it ever happened? Anyone, anyone? Bueller ?", "date": "Jul 12, 2020"}, {"stars": 4, "text": "When V8??", "date": "Jul 11, 2020"}, {"stars": 5, "text": "I'm not sure why this extension is getting bombarded with fake reviews from spam accounts - I've been using this for years and any small issues I've ever had I just contact them and my issue is resolved within the day. Definitely don't listen to these fake reviews... it's ridiculous.", "date": "Jul 6, 2020"}, {"stars": 5, "text": "hi this is nice aap for eth blockchine", "date": "Jul 4, 2020"}, {"stars": 5, "text": "I love metamask, has always worked for me and I've been using it for years. Never dropped a single transaction or anything. thanks for making a great product", "date": "Jul 1, 2020"}, {"stars": 5, "text": "Metamask is good. Never had a problem for my ethereum", "date": "Jun 30, 2020"}, {"stars": 1, "text": "Doesn't work", "date": "Jun 27, 2020"}, {"stars": 5, "text": "A truly wonderful extension with a plethora of features. Dapps are truly amazing and Metamask is no exception. The mobile app, browser extensions and ability to sync with hardware wallets, separates its from the competition, if there is any.", "date": "Apr 16, 2020"}, {"stars": 4, "text": "Why is the default language French?\nLooking at the reviews, most users are English speaking, which makes it very hard to use for most of us.", "date": "Apr 3, 2020"}, {"stars": 1, "text": "Why is it so difficult to change the language?", "date": "Mar 27, 2020"}, {"stars": 2, "text": "Was so happy to see it had ledger nano support only to find out it does not work on Linux. Works on Mac though. Yes, I tried using a rooted browser, and even when sites such as oasis.app are able to directly interact with my ledger, metamask is not.", "date": "Mar 7, 2020"}, {"stars": 3, "text": "i used to have good experience with this extension, but now it is way too \"heavy\" for my current pc. it makes my chrome use too much ram. hang all the time.", "date": "Feb 14, 2020"}, {"stars": 5, "text": "It's just plain good. It works exactly as advertised without being overly complicated.", "date": "Jan 7, 2020"}, {"stars": 1, "text": "Due to an error within my hard drive had to format and lost all my local storage, and seed phrase back up. Asked for any help and told flat out no. I'll admit my user error however having no alternative to restore accounts is a fundamental flaw.", "date": "Nov 30, 2019"}, {"stars": 1, "text": "cant import using private key", "date": "Nov 22, 2019"}, {"stars": 3, "text": "Becomes very slow on Linux after some amount of transactions. Tired reinstalling to clear the history and make it fast again. But UI is very good, at least you can freely set gas price.", "date": "Nov 20, 2019"}, {"stars": 3, "text": "my funds are missing MKR, SAI, REP\nMetamask needs update", "date": "Nov 19, 2019"}, {"stars": 5, "text": "Just love it.", "date": "Nov 15, 2019"}, {"stars": 1, "text": "Not able to change the language at all, even though my language is in english...\nWhen i click on metamask, it comes out in the foreign language. There isn't the option to change language at all. It asks me for the keys in the foreign language.\nPls assist to fix this issue?", "date": "Nov 2, 2019"}, {"stars": 2, "text": "hello i have a big problem. i wanted to preinstalate my windows and i lost my 12 word password. is there any posibility and witch one would it be to restore my metamask wallet? This one who can find a way to help me will be rewarded in eth.", "date": "Oct 16, 2019"}, {"stars": 1, "text": "I can't get the accounts on my frontend app !! why !!", "date": "Oct 16, 2019"}, {"stars": 1, "text": "Presently not working, tried to disable and enable, still not working.", "date": "Sep 21, 2019"}, {"stars": 1, "text": "version 7.1.1 not working", "date": "Sep 8, 2019"}, {"stars": 4, "text": "web3’s version is too old and not support Object of \"new web3.eth.Contract()\" to create Contract.", "date": "Aug 30, 2019"}, {"stars": 5, "text": "Very useful for user and dev. Thank you Devs.", "date": "Aug 19, 2019"}, {"stars": 2, "text": "hi ineed help i have left metamask unopened for long time. now when i click on metamask extension i showing just some blank page how to open it now. i am not having backup key also", "date": "Aug 9, 2019"}, {"stars": 5, "text": "Super solutions, compatible, from the browser easy to use. Simply great!", "date": "Jul 22, 2019"}, {"stars": 5, "text": "The Best ETH Wallet Plugin", "date": "Jul 21, 2019"}, {"stars": 1, "text": "ui.js:1 Uncaught SyntaxError: Unexpected identifier", "date": "Jul 18, 2019"}, {"stars": 5, "text": "good protection of the private key from malicious and phishing sites actions or hacking on the public web or spamming attack", "date": "Jul 14, 2019"}, {"stars": 5, "text": "satisfied! go DeFi!", "date": "Jul 6, 2019"}, {"stars": 2, "text": "\"You are using MetaMask but you are not logged in. Please log in to MetaMask and refresh.\" I cannot connect to EtherDelta.But i can connect to ForkDelta", "date": "Jun 5, 2019"}, {"stars": 1, "text": "Hello,\nMM infinite loading here.Anyone has same issue?", "date": "Apr 28, 2019"}, {"stars": 1, "text": "has become extremely slow after the latest update 6.4.0 (25th april 2019).", "date": "Apr 27, 2019"}, {"stars": 5, "text": "very good and safe &easy to use", "date": "Apr 26, 2019"}, {"stars": 2, "text": "Since I got MetaMask I get ads/popups on random pages ... like if I have only a tab open with \"localhost:3000\", suddenly popups showing ads ... I use uBlock Origin and even pages that never opend popups showing ads are now opening popups ... if you use this to make money, fine but be honest and say it!!!! -.-", "date": "Apr 14, 2019"}, {"stars": 4, "text": "like it", "date": "Apr 5, 2019"}, {"stars": 2, "text": "I have a hard time giving MM a two star.  It's served me pretty well for a few years, I once would have rated it five stars.  But as I've become more of a \"power user\" with multiple addresses and fairly constant transactions (~1000+), MM has become sluggish, even crashing relatively constantly.  Not to mention the gas suggestions are often exorbitant, often 3x what it should be a for a < 2-3 minute transaction time.  The fact of the matter is, it's been a great utility, but it's becoming unus... Show more", "date": "Mar 30, 2019"}, {"stars": 5, "text": "Lovely, I use it for developing crypto app and test with other networks rather than etherium, a solid secured extensions, thanks and congratulations to  developer. ***** 5  Star*****", "date": "Mar 28, 2019"}, {"stars": 3, "text": "worked awesome however now i cant get in and its running super slow", "date": "Mar 24, 2019"}, {"stars": 1, "text": "it seems that the latest version stops my other website redirecting，why it behavior like this???", "date": "Mar 19, 2019"}, {"stars": 1, "text": "I used it in the past, but suddenly it became totally blank! Only white screen appears LOL", "date": "Mar 8, 2019"}, {"stars": 1, "text": "Metamask is garbage.... It constantly crashes and has screwed me over and innumerable number of times. Avoid it if you can. It's just so terrible.", "date": "Feb 23, 2019"}, {"stars": 5, "text": "Great extension. I had some minor issues with the previous versions, but the newest updates have made Metamask simply amazing. The future is near - and Metamask is bridging us to Web 3.0", "date": "Feb 9, 2019"}, {"stars": 5, "text": "OK", "date": "Feb 7, 2019"}, {"stars": 5, "text": "very usable apps", "date": "Jan 25, 2019"}, {"stars": 1, "text": "I transferred Ether to my Metamask account and it's not visible at all. Metamask is not secured at all. Before anyone uses it, please ask me, I would provide proofs why it's a scam.", "date": "Jan 4, 2019"}, {"stars": 1, "text": "doesnt work on windows xp. We dont have to upgrade our systems just to use an extension. failed!!", "date": "Dec 31, 2018"}, {"stars": 5, "text": "Super", "date": "Dec 30, 2018"}, {"stars": 2, "text": "You have to fix so that you can log in. Works very badly", "date": "Dec 29, 2018"}, {"stars": 1, "text": "Hi Metamask Authority,\nI have been using this site like empowr last 3 years and never ever get it any Scam at here, neither it is Phishing site. How did you Flag it and showing this site as Phishing site? Please check first and million million people are working here. No one can able to prove and mark this site as Scam. So you are requested to withdraw your misjudgment.\nMurad.", "date": "Dec 10, 2018"}, {"stars": 5, "text": "wow the great safe and secure trust able", "date": "Nov 30, 2018"}, {"stars": 1, "text": "I was surprised that the Empowr website was blocked. I have been an empowr citizen for almost years and I can say that he has all my confidence given the security it offers and it is not a phishing site. I hope this problem is solved soon and that the blog is deleted.", "date": "Nov 30, 2018"}, {"stars": 1, "text": "I am using metamask since three months and i like it.because metamask is good way to holding the ether and highly secure.but metamask blocking empowr to work on same browser where metamask is install. i m working on empowr site since nine months or also recommend metamask to number of empowr user.by my experience empowr is not phishing  site.so i m requested   restrictions to be lifted so we can work on our empowr.thank you", "date": "Nov 30, 2018"}, {"stars": 1, "text": "The extention is providing wrong information regarding the empowr platform which is not acceptable.", "date": "Nov 30, 2018"}, {"stars": 1, "text": "I am very shocked to see a block on empowr and I think that is very unfair.\nEmpowr is not a scam or phishing site, so please remove the block.\nEmpowr is a free social media platform similar to Facebook,\nThat has been rewarding citizens for many years.\nI have been actively using the platform for nearly 3 years and have found it to be very safe and secure.", "date": "Nov 30, 2018"}, {"stars": 1, "text": "Metamask doing illegal task. Metamak block empowr social site. so I think metamak doing illegal task. I'm not interested any more to this illegal service.", "date": "Nov 30, 2018"}, {"stars": 1, "text": "Been a good fan of metamask but blocking empowr to be an illegal system is false. That's not good at all!", "date": "Nov 29, 2018"}, {"stars": 1, "text": "Used to like it - unfortunately it has wrongly rated the social democracy network empowr a phishing site - how completely wrong - empowr is one of the sites with the highest integrity on the whole internet , whoops , mistake metamask", "date": "Nov 29, 2018"}, {"stars": 1, "text": "I am with empowr for more than 3 years now. Empowr is a safe and secure domain. Metamask should unblock empowr with immediate effect as WE are NOT a phishing site.", "date": "Nov 29, 2018"}, {"stars": 1, "text": "I started using Meta mask after Empowr launched its cryptocurrency. I was devastated when I saw Empowr blocked by it. Please lift the block, Empowr is not a phishing site.", "date": "Nov 29, 2018"}, {"stars": 1, "text": "If Metamask uses the secret key, why is it blocking empowr for this?\nEmpowr - a site that I trust. I've been working here for almost three years.\nPlease unlock empowr", "date": "Nov 29, 2018"}, {"stars": 1, "text": "Its not correct that you blocked empowr website and you said this is phishing site. i m here over 3 years and also earning from here. empowr is social and earning site also. Remove the block of empowr you give this.", "date": "Nov 29, 2018"}, {"stars": 1, "text": "You've blocked the site on which I've earned for 3 year already. \nYou've broken my work on empowr.\nAnd I think it's not right.", "date": "Nov 29, 2018"}, {"stars": 1, "text": "Metamask ever was my favorite option to protect my wallets. However, few days ago Metamask has blocked www.empowr.com because it doubt empowr is a fishing site. This thing affects seriously to my job because I have worked and earned on empowr for five years. I hope Matamask will lift this block as soon as possible. In the meantime, I am forced to give Matamask 1 star.", "date": "Nov 29, 2018"}, {"stars": 1, "text": "Metamask blocks the site, prevents us from working. I joined empowr in 2016. I can confirm that empowr is not a phishing site and is 100% secure.\nThis is a very good democratic online site that allows people all over the world to earn money.\nRemove the block from MetaMask as soon as possible.\nThere are a lot of good, interesting people.\nI love empowr!", "date": "Nov 29, 2018"}, {"stars": 2, "text": "Metamax has blocked the completely legal Empowr website, which combines a social network and an economic model of a trading platform. For millions of people, this misunderstanding has created problems accessing their accounts. We trust Empowr and appreciate his mission. Please remove the block.", "date": "Nov 29, 2018"}, {"stars": 1, "text": "For more than two years I have been participating in a wonderful project that combines social networks and a trading platform, I am a seller of various goods in Empowr, but ... my business was broken by the Metamask, which prevent me from working at my usual pace and my honestly accumulated funds because of Metamask are at risk.", "date": "Nov 28, 2018"}, {"stars": 1, "text": "Empowr is a very good and honest site, I have been working on it for a very long time, I ask Metamax to unblock access.", "date": "Nov 28, 2018"}, {"stars": 1, "text": "Еmpowr is a social network with great prospects I really hope for the fastest unlocking of the site from Metamax.", "date": "Nov 28, 2018"}, {"stars": 5, "text": "I have been working for 3 years and have not found one thing that concerns fraud and phishing. Empowr is the only social networking platform that changes the lives of many people and gives all of us the opportunity to reduce poverty. I ask you to unlock the Empowr. Millions of people will be grateful to you!", "date": "Nov 28, 2018"}, {"stars": 1, "text": "Until yesterday I was totally happy with the extension. However, someone and MetaMask decided that the empowr platform is a phishing website. From my 3 years experience in empowr I dare to say that empowr is not a phishing website and should not be treated like one. Why is a serious accusation like that not investigated before the block in being put in place. Now it is harming the platform and all the hardworking citizens in it. Please, rectify your mistake and remove the block.", "date": "Nov 28, 2018"}, {"stars": 2, "text": "Metamask  put a block on empowr.com as it is a phishing site, but empowr has never practiced phishing,  I can confirm it  as a  10 years user of the platform.  My request is to remove the block as soon as possible as completely unfair.\nLana Ferra", "date": "Nov 28, 2018"}, {"stars": 1, "text": "I really enjoy working with the application, but recently MetaMask created a big problem for my work. Please - sort it out - you made a big mistake blocking the empowr. I hope to continue working with you on my favorite platform.", "date": "Nov 28, 2018"}, {"stars": 4, "text": "I   am  working for 3 years here (www,empowr.com) its one of the best online earning website and completely safe earning website ,please unblock our site ,we aren't  phishing scam or spam .", "date": "Nov 28, 2018"}, {"stars": 2, "text": "Hi, I have been using empowr.com for more than 2 years and there has never been a problem accessing it till now. It is definitely not a phishing site. Kindly remove the block so that we can all go back to normal business. Thank you.", "date": "Nov 28, 2018"}, {"stars": 1, "text": "I am here for over 3 years this is not some ponzi scheme, get rich quick, scamming or some phishing site, please remove empowr.com from you phishing list and stop giving us prompt.", "date": "Nov 28, 2018"}, {"stars": 1, "text": "empowr is official site  and using cryptocurrency platform and I have been working here since 2013 and  empowr never evolve in any phishing and spam activity. Request you lift block on domain , so no one will suffer.", "date": "Nov 28, 2018"}, {"stars": 4, "text": "nice extention", "date": "Nov 21, 2018"}, {"stars": 1, "text": "This app is trash, I'm waiting 5 days for a token transfer and when I had enough with this app I decided to remove my remaining ETH and the app has crashed. Funny how when I decided to remove my ETH it stops working.", "date": "Nov 17, 2018"}, {"stars": 3, "text": "Doesn't connect to Rinkeby. Infinitely loading screen...", "date": "Nov 16, 2018"}, {"stars": 4, "text": "There is lot of issue with metamask please if possible let us know the hack or fix it as soon as possible, It hangs on many of its operation like confirming transaction. is there any hack for it please let us know so that development can be smooth till tool get patch for it.", "date": "Nov 14, 2018"}, {"stars": 5, "text": "goof", "date": "Nov 12, 2018"}, {"stars": 3, "text": "Season 6 was my first one and I had like 17,000 points and I saw I will get like 10.000 tokens but I can't see any in my account. When will I get them ?", "date": "Nov 3, 2018"}, {"stars": 2, "text": "Fail to connected", "date": "Nov 3, 2018"}, {"stars": 1, "text": "Stuck on connecting to main Ethereum network, sometimes doesn't even have the option to change to testnet to attempt to fix, CHANGING TO TESTNET DOESN'T FIX ANYTHING, resetting cache doesn't do anything, UNINSTALLING THE ENTIRETY OF CHROME AND STARTING FROM SCRATCH doesn't do anything, GitHub is dismissive and always marks issues with either outdated information, information that doesn't work, and closes issues that aren't actually duplicates. Until the devs actually fix this problem without ... Show more", "date": "Nov 3, 2018"}, {"stars": 4, "text": "works fine for me as a developer", "date": "Nov 2, 2018"}, {"stars": 3, "text": "Old metamask was more quick with balances and frames, and old design is better..", "date": "Oct 31, 2018"}, {"stars": 1, "text": "buggy slow trash. uses up all the computers resources and never loads in chrome anymore.", "date": "Oct 30, 2018"}, {"stars": 1, "text": "CANNOT RESTORE my account. TOO MANY BUGS. Have got seed phrase and private key. Still it didn't work. Almost seems like a SCAM. Stay away!", "date": "Oct 28, 2018"}, {"stars": 5, "text": "powering web3!", "date": "Oct 26, 2018"}, {"stars": 5, "text": "Good job", "date": "Oct 24, 2018"}, {"stars": 2, "text": "Newer version running so slow", "date": "Oct 23, 2018"}, {"stars": 1, "text": "The balance on two accounts went to zero. Reinstalled the extension, restored the account for the phrase, but after that the balance was not restored, however, the transaction history disappeared. I am writing in support, they answer once a day, but without result. Who has the same problem, please write.", "date": "Oct 19, 2018"}, {"stars": 5, "text": "Works for me. Had no issues at all", "date": "Oct 17, 2018"}, {"stars": 5, "text": "For all who are missing tokens, they are still inb your Metamask or MEW.  Just look on etherscan or reload the token on MEW.", "date": "Oct 15, 2018"}, {"stars": 1, "text": "Somehow my balance went to zero, and all of my tokens are missing. AGAIN. 3rd time. Done.", "date": "Oct 14, 2018"}, {"stars": 1, "text": "It's terrible, too many bugs, when I switching to other network and restart the chrome, it block me from inputting the password.", "date": "Oct 13, 2018"}, {"stars": 2, "text": "i tried to log on to my account having problems, have you updated your site,i just can't find my account can you help?", "date": "Sep 30, 2018"}, {"stars": 2, "text": "how to fix metamask has crashes??\nnot yet have backup", "date": "Sep 27, 2018"}, {"stars": 1, "text": "Unable to validate successfully a transaction since two days with the new UI (etherscan or ethexplorer unable to locate my tx). I switched to the old one and my transactions were successful.", "date": "Sep 25, 2018"}, {"stars": 1, "text": "1 star because you cant rate 0. Awful. So slow that chrome assumes its crashed and wants to reload. 1 minute plus between clicking and anything happening PER ACTION. Utter tripe. If you want crypto adoption, DO NOT RECOMMEND THIS POS to anyone", "date": "Sep 24, 2018"}, {"stars": 2, "text": "Too many bugs", "date": "Sep 19, 2018"}, {"stars": 5, "text": "Works perfect for me! Very convenient and used daily...", "date": "Sep 17, 2018"}, {"stars": 1, "text": "Takes about a minute to open now and about 30 seconds for the UI to accept a click. Switched to the old and its just as bad. You guys broke this horribly.", "date": "Sep 15, 2018"}, {"stars": 3, "text": "What happened?? New version is un-usable... cant even get to my coins.. just slow spinning and crashes...", "date": "Sep 13, 2018"}, {"stars": 1, "text": "Their customer service people are total jerks. I was stupid enough to almost fall for a scam, and when I asked them about it this was their reply- \"This is a trust trading scam. NOBODY will give you free ETH (and if they did, it makes no sense for you to send them ETH first).\" \nThey could have just left it at \"This is a trust trading scam,\" but NO, they need to add the judgement at the end. Way to talk down to your customers MetaMask. Now I'll go kill myself for being so stupid as to not see ... Show more", "date": "Sep 13, 2018"}, {"stars": 5, "text": "I like the new UI.", "date": "Sep 11, 2018"}, {"stars": 1, "text": "News UI completely bugs, waiting forever ... Needs to switch to old one", "date": "Sep 7, 2018"}, {"stars": 1, "text": "i have many time trying to open metamask but show only conneting but not connect", "date": "Sep 5, 2018"}, {"stars": 5, "text": "This app is perfect for integrating with the Ethereum blockchain.  It works seemlessly to integrate Web3 dapps into your browser.  Thanks team!", "date": "Sep 4, 2018"}, {"stars": 5, "text": "love it", "date": "Sep 4, 2018"}, {"stars": 1, "text": "When I use seed phrase it takes me to a completely different account. I'm able to check balance with wallet address but unable to log in to existing account to access my tokens ... 20 ETH stuck because of an update... smh", "date": "Sep 4, 2018"}, {"stars": 1, "text": "Extremely slow and the transactions I've sent over the last 2 days still have not shown up on Etherscan.  I did receive some ETH 2 days ago, but have not been able to use it in transactions.  I never had this problem with the old version.", "date": "Sep 2, 2018"}, {"stars": 3, "text": "Its okay, but its most of the time really slow in response. As i click on the Metamask icon i took around 1 Minute to open. Same goes to confirm Transactions or Contracts", "date": "Sep 1, 2018"}, {"stars": 1, "text": "unable to enable meta mask at chrome", "date": "Aug 31, 2018"}, {"stars": 1, "text": "its disable to added on chrome now", "date": "Aug 29, 2018"}, {"stars": 5, "text": "nice app", "date": "Aug 28, 2018"}, {"stars": 1, "text": "new version is almost useless!!! it takes minutes to do anything now. bring back the original working version please. im losing money because of a rushed update", "date": "Aug 28, 2018"}, {"stars": 1, "text": "Had 21 different tokens with various balance amounts. Did not open the wallet for several months and now all but one are mysterious showing a zero balance.", "date": "Aug 27, 2018"}, {"stars": 1, "text": "Error. On the network there is money but the account on the software is not available. Failed to update account history", "date": "Aug 27, 2018"}, {"stars": 1, "text": "Used to love OLD metamask but this new version just ugly, slow and often crashing. I have missed so many trading opportunities due above reasons as some of my transactions been stuck for days. No clue why DEVS decided to change a properly working app for this rubbish. DEVS, please swap back or fix the issues because it will kill crypto games which uses metamask and where the time is money. Thanks behalf the community/users.", "date": "Aug 27, 2018"}, {"stars": 4, "text": "the best app", "date": "Aug 26, 2018"}, {"stars": 1, "text": "After trying for an hour to reload and wait for it to connect...nothing...then removed and reinstalled it...still nothing...OMW...", "date": "Aug 25, 2018"}, {"stars": 1, "text": "In the beginning was fine, but the last month is not responsive and slow", "date": "Aug 25, 2018"}, {"stars": 1, "text": "to buggy.  Not stable at all.", "date": "Aug 25, 2018"}, {"stars": 4, "text": "great use this", "date": "Aug 23, 2018"}, {"stars": 1, "text": "SUPER SLOW AFTER UPDATE!", "date": "Aug 20, 2018"}, {"stars": 1, "text": "Updated version ui is horrible.", "date": "Aug 19, 2018"}, {"stars": 5, "text": "okie", "date": "Aug 19, 2018"}, {"stars": 3, "text": "ok", "date": "Aug 19, 2018"}, {"stars": 1, "text": "This extension used to be great, but now it just lags and lags and lags in Chrome. Nearly unusable. Pretty annoying.", "date": "Aug 18, 2018"}, {"stars": 1, "text": "Used for espionage as a trojan backdoor into your computer. \nDo not install under any circumstances, unless you want to lose all your money.\n\nJust look at the companies and people backing it. \n\nSCAM!!! Just like Ethereum. SCAM SCAM SCAM SCAM SCAM SCAM \n\nNEVER AGAIN!!!!", "date": "Aug 17, 2018"}, {"stars": 2, "text": "all my txns are pending and pending shows submitted only  cant load eth cant withdraw nor transfer. stuck up. old version was better.", "date": "Aug 17, 2018"}, {"stars": 2, "text": "I liked the old version, more intuitive. I am now googling how to switch accounts in the new version. I hope this has not been removed.", "date": "Aug 16, 2018"}, {"stars": 3, "text": "the old version was ok for me until this new version i upgraded. its too laggy for me. it loads so slow. is there a required minimum hardware specs for the new version? please fix.", "date": "Aug 16, 2018"}, {"stars": 5, "text": "very good", "date": "Aug 16, 2018"}, {"stars": 2, "text": "Used to love it, but the new UI is garbage. Looking for a way to revert the update or for an alternative", "date": "Aug 12, 2018"}, {"stars": 3, "text": "i can't see all my tokens in the new version like the old one , is that only me or all the same , i think you need to fix something guys", "date": "Aug 12, 2018"}, {"stars": 1, "text": "Was working well at first, now it just loads forever.\n\nWill change my rating if they fix it", "date": "Aug 12, 2018"}, {"stars": 5, "text": "good", "date": "Aug 11, 2018"}, {"stars": 4, "text": "With some pain it works.  I thought the Trezor integration would be amazing...but frankly the UX bites...still cannot see the hardware wallet option.  The marketing images look different to the released software.  Hopefully it will only get better!\n\nUPDATE: to get the hardware wallet options working I had to remove the extension and re-enable.  I don't know why.  Still...it works.", "date": "Aug 10, 2018"}, {"stars": 4, "text": "It's awesome but I am still confused", "date": "Aug 9, 2018"}, {"stars": 5, "text": "good", "date": "Aug 9, 2018"}, {"stars": 5, "text": "cool", "date": "Aug 9, 2018"}, {"stars": 1, "text": "New version sucks!!!!!!!\nCan not click the send button.", "date": "Aug 8, 2018"}, {"stars": 4, "text": "It's pretty good.", "date": "Aug 8, 2018"}, {"stars": 5, "text": "lets get started", "date": "Aug 5, 2018"}, {"stars": 3, "text": "It is not really useful when the transaction pending for many days. If you do not have enough gas or you do not have enough balance, cancel it, why wait for several days to process, while the transaction can not be completed, this problem needs to be resolved.", "date": "Aug 4, 2018"}, {"stars": 1, "text": "NOT SECURE. All my ETH was stolen.", "date": "Aug 2, 2018"}, {"stars": 5, "text": "love it", "date": "Aug 2, 2018"}, {"stars": 4, "text": "If you add the ability to transfer tokens and the ability to return to the closed window, there will be 10 stars", "date": "Aug 1, 2018"}, {"stars": 5, "text": "Amazing tool", "date": "Jul 27, 2018"}, {"stars": 5, "text": "So much better than every other Ethereum wallet.", "date": "Jul 26, 2018"}, {"stars": 5, "text": "Quite convinient.", "date": "Jul 26, 2018"}, {"stars": 4, "text": "only problem i am having with this is. sometime it,s just keep loading with message  \"Connecting to Main Ethereum Network\" . even if internet in very good.", "date": "Jul 24, 2018"}, {"stars": 1, "text": "Breaks once in a while and its frustrating. I don't know if it updates or what, but you just gotta reinstall and restore your wallet. If that doesn't work just make a new wallet cuz that one is dead to metamask.", "date": "Jul 18, 2018"}, {"stars": 5, "text": "awsome experience and service!", "date": "Jul 16, 2018"}, {"stars": 1, "text": "its friggin trash, takes forever to load, hate this rubbish.", "date": "Jul 15, 2018"}, {"stars": 4, "text": "good", "date": "Jul 14, 2018"}, {"stars": 4, "text": "good", "date": "Jul 12, 2018"}, {"stars": 2, "text": "it does it job, the problem is that it does more: IT BLOCKS YOU from visiting many sites that are legitimate, and there is no way to stop its behavior.", "date": "Jul 11, 2018"}, {"stars": 4, "text": "best ethereum wallet", "date": "Jul 11, 2018"}, {"stars": 5, "text": "greaat app.love it..", "date": "Jul 4, 2018"}, {"stars": 5, "text": "great app", "date": "Jun 27, 2018"}, {"stars": 5, "text": "This is brilliant!", "date": "Jun 23, 2018"}, {"stars": 5, "text": "when i try to open showing only connect to main network.", "date": "Jun 23, 2018"}, {"stars": 4, "text": "cool", "date": "Jun 21, 2018"}, {"stars": 1, "text": "its not  worked on my browser when i clik on metal mask sign its automatic disbale its a fraud meta mask not working", "date": "Jun 12, 2018"}, {"stars": 3, "text": "satisfy", "date": "Jun 8, 2018"}, {"stars": 5, "text": "it really good!", "date": "Jun 4, 2018"}, {"stars": 3, "text": "incredibly buggy. Have to remove and add this extension many times a day.", "date": "Jun 4, 2018"}, {"stars": 5, "text": "after 31 may update, my 100 wallet have been randomly not sequently again.. ive been doing making 1-100 wallet in metamask in a row, but now the number is randomly and makes me confuse.. pls fix it", "date": "Jun 2, 2018"}, {"stars": 5, "text": "For whatever reason after May 31st chrome version no longer saves custom RPCs when you switch networks.\n\nSwitching to the Main, Rinkeby, etc removes the custom RPC.\n\nFirefox does not experience this issue", "date": "Jun 1, 2018"}, {"stars": 5, "text": "very useful", "date": "May 31, 2018"}, {"stars": 5, "text": "best sequrity", "date": "May 30, 2018"}, {"stars": 5, "text": "love it", "date": "May 30, 2018"}, {"stars": 1, "text": "Stopped working on recent updates, only on the chrome version", "date": "May 27, 2018"}, {"stars": 3, "text": "It is a good app but the fee changes by the transaction. It needs a flat low fee. Also if you dont pay enough it intentionally takes hours to put through your transaction,.", "date": "May 26, 2018"}, {"stars": 4, "text": "it's good, working so nice. but lately it's working slow for transaction. is it the ethereum blockchain or metamask problem?", "date": "May 25, 2018"}, {"stars": 4, "text": "Don't really know enough about it yet. :-)", "date": "May 24, 2018"}, {"stars": 5, "text": "Very usefull and it keeps your account safe.", "date": "May 23, 2018"}, {"stars": 3, "text": "ItS buggy.\nwhen ever i start it it show loading screen with ethereum main network.\ngys fix this !!", "date": "May 23, 2018"}, {"stars": 5, "text": "good", "date": "May 23, 2018"}, {"stars": 5, "text": "ok", "date": "May 22, 2018"}, {"stars": 5, "text": "Transfer Error, help me please\n\nHow can I cancel the transmission because it was not completed? \n\nYour help will help me.", "date": "May 22, 2018"}, {"stars": 5, "text": "good apps", "date": "May 20, 2018"}, {"stars": 5, "text": "It's a little odd to get used to but it's a great way to use IDEX without copying and pasting private keys or using JSON.", "date": "May 12, 2018"}, {"stars": 4, "text": "very important", "date": "May 10, 2018"}, {"stars": 3, "text": "MetaMask is pretty good. What lets it down is it unable to save the current state. If I away, say to copy the amount I need to send, when I go back to metamask it's back to the initial screen. That's very annoying. Very very annoying. The same goes for when I'm putting in my seed and new password, a time I'll definitely want to copy and paste. \n\nC'mon guys.", "date": "May 7, 2018"}, {"stars": 5, "text": "difficult", "date": "May 6, 2018"}, {"stars": 5, "text": "nice", "date": "May 6, 2018"}, {"stars": 4, "text": "difficult T.T", "date": "May 4, 2018"}, {"stars": 5, "text": "essential tool for ETH transactions. please add in ENS support soon!", "date": "May 1, 2018"}, {"stars": 3, "text": "A good app.\n\nIf your wallets disappear, 'Create Account' will bring them back.\n\nps\nBrave browser is good too.", "date": "May 1, 2018"}, {"stars": 5, "text": "good", "date": "Apr 29, 2018"}, {"stars": 5, "text": "So powerful and safe .", "date": "Apr 28, 2018"}, {"stars": 5, "text": "nice", "date": "Apr 27, 2018"}, {"stars": 5, "text": "Go ETH Go!", "date": "Apr 26, 2018"}, {"stars": 5, "text": "good job", "date": "Apr 25, 2018"}, {"stars": 5, "text": "same situation as me", "date": "Apr 25, 2018"}, {"stars": 3, "text": "great..", "date": "Apr 21, 2018"}, {"stars": 5, "text": "Useful extension for cryptocurrency transactions.", "date": "Apr 20, 2018"}, {"stars": 1, "text": "It Was Scaring Me About Having To Pay Lots Of Money", "date": "Apr 18, 2018"}, {"stars": 5, "text": "Extremely useful app for ETH transactions.", "date": "Apr 16, 2018"}, {"stars": 5, "text": "Enjoying the safety of this program. Thank you", "date": "Apr 15, 2018"}, {"stars": 5, "text": "the best site", "date": "Apr 14, 2018"}, {"stars": 3, "text": "for last 5 day it is connecting to main network and stayed like all day and night looks like that it is chrome problem group should look into this.", "date": "Apr 14, 2018"}, {"stars": 3, "text": "Thumps up", "date": "Apr 14, 2018"}, {"stars": 1, "text": "Exported seed words but cannot open file. Now I'm out $100. Maybe make an app compatible with Chrome", "date": "Apr 12, 2018"}, {"stars": 5, "text": "very nice app", "date": "Apr 10, 2018"}, {"stars": 5, "text": "genial", "date": "Apr 7, 2018"}, {"stars": 5, "text": "Great tool", "date": "Apr 7, 2018"}, {"stars": 1, "text": "Usefull extension...could be. Works REALLY BAD. While developing need every time to restart extension, browser, something else... Thats just awful.\n\nGood idea, BAD stability.", "date": "Apr 7, 2018"}, {"stars": 1, "text": "This app is a hunk of junk. Find another wallet to store your cryptos. Have had nothing but problems. Added tokens mysteriously disappear. Have to continually re-add them. Half the time once I login, it starts up in a test mode rather than the Main Ethereum Network. Support is abysmal. They keep telling me to download the State Logs and send them to them. However when I click on \"Download State Logs\" nothing happens so there is nothing to upload to their Support. Nor does the secondary method... Show more", "date": "Apr 4, 2018"}, {"stars": 5, "text": "ok", "date": "Apr 3, 2018"}, {"stars": 5, "text": "The only issue I have had is when I confirm transaction I did not see anything happening so I click again and I was charged multi times, my mistake. Mow when I confirm a trans I click and leave the pointer right were I clicked until I see it process, now haven't had an issue since, just wish I could get the $ back, you live and learn thank you meta mask", "date": "Mar 29, 2018"}, {"stars": 1, "text": "Not able to log in..... Please HELP", "date": "Mar 29, 2018"}, {"stars": 5, "text": "Ok a program !!!", "date": "Mar 28, 2018"}, {"stars": 5, "text": "Excellent light wallet. Very easy to use.", "date": "Mar 28, 2018"}, {"stars": 3, "text": "I click on the icon and an empty white window opens. That's it\nUPDATED my chromebook and now it seems to work. Still doesn't work on my old macbook though", "date": "Mar 27, 2018"}, {"stars": 1, "text": "The extension has got worst. The app used to be great before couple of months but now it is painfully slow. It takes a lot of time to load.", "date": "Mar 27, 2018"}, {"stars": 5, "text": "Best wallet ever", "date": "Mar 25, 2018"}, {"stars": 4, "text": "It's good way though, but as mentioned someone previously, sure, why don't it open in a new tab instead of pop-up from chrome-tab? It won't close too if clicked on something else too.", "date": "Mar 25, 2018"}, {"stars": 3, "text": "It's OK except it messes with Office 365 Admin Portal - particularly Exchange where it causes an error to pop-up multiple times. Once the ext is disabled and page refreshed, there is no more error.\nWould be nice if it could also open up a tab instead of a pop-up within Chrome. I go between tabs quite often.", "date": "Mar 21, 2018"}, {"stars": 4, "text": "It's really good!", "date": "Mar 20, 2018"}, {"stars": 5, "text": "Does exactly what I need it to do. Securely holds my ERC20 tokens.", "date": "Mar 20, 2018"}, {"stars": 5, "text": "it's really nice to do something in ethereum platform.", "date": "Mar 17, 2018"}, {"stars": 2, "text": "how to send tokens to another exchange from metamask", "date": "Mar 16, 2018"}, {"stars": 3, "text": "I guess is good, but what I really dislike is that popup from chrome, instead why not open a new tab. This way the wallet won't close if I click something else.", "date": "Mar 15, 2018"}, {"stars": 5, "text": "good", "date": "Mar 14, 2018"}, {"stars": 5, "text": "good", "date": "Mar 13, 2018"}, {"stars": 5, "text": "good", "date": "Mar 12, 2018"}, {"stars": 5, "text": "good", "date": "Mar 11, 2018"}, {"stars": 4, "text": "actually really nice but i can not add tokens any more to show up, when i put in the adress and click on \"add\" nothing happens, just nothing...", "date": "Mar 3, 2018"}, {"stars": 4, "text": "good", "date": "Mar 2, 2018"}, {"stars": 1, "text": "MetaMask extension is added and then what? There's no movement on this process.", "date": "Feb 28, 2018"}, {"stars": 5, "text": "Beware beta plugin crashed, chrome said it may have been \"corrupted\" and repairing it was essentially a reset, DEN lost. Make sure you backup your DEN seeds.", "date": "Feb 28, 2018"}, {"stars": 5, "text": "super", "date": "Feb 28, 2018"}, {"stars": 1, "text": "Why is there still some \"change\" left behind?   ETher Dust\"?????\n\n.65 cents? No big deal but if you do this enough times it adds up????", "date": "Feb 27, 2018"}, {"stars": 5, "text": "Very useful Ethereum App! Works well!", "date": "Feb 26, 2018"}, {"stars": 1, "text": "it gets added to my browser but when I click on it nothing happens...", "date": "Feb 19, 2018"}, {"stars": 4, "text": "It's ALL CRYPTO GooD !!\nFrom : DrCryptoPhiL", "date": "Feb 19, 2018"}, {"stars": 1, "text": "i added it and rebooted my computer BUT it is NOWHERE to be found in Chrome. I try to get it again and it says already ADDED!!??", "date": "Feb 18, 2018"}, {"stars": 3, "text": "i love the apps its very easy to use, but of recently it takes time to connect to ethereum blockchain network. if this is fixed i'll mke it 5star", "date": "Feb 15, 2018"}, {"stars": 5, "text": "Reliable, nice UI and easy to use.", "date": "Feb 14, 2018"}, {"stars": 5, "text": "its good extension", "date": "Feb 14, 2018"}, {"stars": 5, "text": "nice", "date": "Feb 12, 2018"}, {"stars": 1, "text": "confusing", "date": "Feb 12, 2018"}, {"stars": 5, "text": "It's the best thing and it's easy to use. It is the best and most secure way to manage your wallet.", "date": "Feb 12, 2018"}, {"stars": 5, "text": "genial", "date": "Feb 11, 2018"}, {"stars": 5, "text": "So far, have experienced no issues; extremely easy to use interface..", "date": "Feb 10, 2018"}, {"stars": 4, "text": "BLOCKS HANGOUTS!\n- This application is awesome but... it block functionality of google hangouts...\n- WAT? \n- Yes, I have tried to use call functionality in google hangouts with this extension: does not work. Hangouts start working properly just after un-installing this extension.", "date": "Feb 10, 2018"}, {"stars": 5, "text": "cool", "date": "Feb 9, 2018"}, {"stars": 3, "text": "ok not bad", "date": "Feb 8, 2018"}, {"stars": 5, "text": "ok", "date": "Feb 4, 2018"}, {"stars": 5, "text": "i love it", "date": "Feb 2, 2018"}, {"stars": 5, "text": "very safety", "date": "Jan 28, 2018"}, {"stars": 3, "text": "There's no way to remove tokens. I added the wrong token address and now I can't remove it from view.", "date": "Jan 28, 2018"}, {"stars": 4, "text": "good", "date": "Jan 25, 2018"}, {"stars": 5, "text": "Loved It . Very useful", "date": "Jan 24, 2018"}, {"stars": 5, "text": "(confirmed true Metamask) This is one wallet that prevents you from sharing private keys to ETH online utility sites thereby avoiding being a phishing victim. I'm sorry if you use this without taking precautions or learning how blockchain security works. It's still not for the man on the street.", "date": "Jan 23, 2018"}, {"stars": 5, "text": "Works as it should. I hope they offer ERC20 transfers soon though.\n\nAnd people who 'lost' their wallets should've been more careful and backed them up on paper. There's no hand-holding in the crypto world.", "date": "Jan 22, 2018"}, {"stars": 4, "text": "I had to reboot the computer to see the metamask extension again.  So far a good product", "date": "Jan 21, 2018"}, {"stars": 1, "text": "Simple and easy to use, but any transaction you \"reject\" can and will go through days later. A week later in my case. So if you reject a transaction and don't want it to go through withdraw everything ASAP.", "date": "Jan 21, 2018"}, {"stars": 5, "text": "Cool", "date": "Jan 20, 2018"}, {"stars": 2, "text": "It holds some small amount of ETH and I can't get it out. It blocks etherzero.org and I don't want this extension but my ETH back. How?", "date": "Jan 20, 2018"}, {"stars": 1, "text": "Randomly overwrote my wallet. \n\nI had the information so nbd, but that makes me never want to use this product again. be warned.", "date": "Jan 19, 2018"}, {"stars": 4, "text": "Good.", "date": "Jan 18, 2018"}, {"stars": 1, "text": "doesn't show up in apps anymore, if I had alot of money on this wallet I would be very angry now. One more prove that all non-hardware-wallets are unsafe. I can't even remove it.", "date": "Jan 17, 2018"}, {"stars": 5, "text": "This works great. People saying it's terrible is because they don't know how to use it. Have a ETH wallet before you sign up so you don't send ETH to nowhere. This isn't a wallet itself, it's a tool to access/facilitate transactions securely with websites like bancor.network. 5 stars.", "date": "Jan 17, 2018"}, {"stars": 4, "text": "very usefull tool had little trouble using", "date": "Jan 17, 2018"}, {"stars": 5, "text": "Is good", "date": "Jan 14, 2018"}, {"stars": 5, "text": "It is great extension and as it the interfaces to my ether wallet I can see everything and then send tokens from my ether wallet.", "date": "Jan 14, 2018"}, {"stars": 4, "text": "Excellent extension. Only gave it 4, not 5 stars, because it doesn't have the option to show ETH fiat equivalency in NZD (New Zealand dollars); fortunately, AUD (Australian dollars) is pretty close, but it's not the same.\n\nIf the devs add NZD as an option, I'll upgrade this review to 5 stars. Thank you!\n\nP.S. To all those reading negative reviews of this extension, they're pretty much all people afraid of change, and/or people that will lose power from their gaining adoption. Don't take heed ... Show more", "date": "Jan 12, 2018"}, {"stars": 5, "text": "Great wallet !! you can even create your own tokens in a Network like Ethereum... Best hot wallet ever !!", "date": "Jan 11, 2018"}, {"stars": 5, "text": "nice", "date": "Jan 10, 2018"}, {"stars": 1, "text": "Stole my money, would not let me access it then  locked my account", "date": "Jan 10, 2018"}, {"stars": 5, "text": "Works well", "date": "Jan 8, 2018"}, {"stars": 1, "text": "Filled in their stupid CAPTCHA about 80 times and every single time it said I was wrong (I wasn't).\n\nOh well, judging by the comments, it saved me from losing $$$ to these fraudsters, so all good!", "date": "Jan 8, 2018"}, {"stars": 3, "text": "I really like it. Too bad there's no way to hold it open. For example if I am copying an amount and an ETH address, I can't.\nIf I copy the address and paste it in, then try to click the amount and copy then it'll close MetaMask and I have to start again.\n\nOnly way is to copy the address and type the amount in manually. \n\nPlease find a way to fix this.", "date": "Jan 7, 2018"}, {"stars": 1, "text": "Lost $2K worth of a token because the extension crashed and upon reinstall my recovery phrase dosent work.", "date": "Jan 7, 2018"}, {"stars": 1, "text": "Super slow, I cant even get my ether on another wallet or to another exchange.  The support staff is useless and childish.  There are much more reputable exchanges that have less risk and good support.  Please spare yourself, their logo is very fitting. Sly like a fox, your money goes in fast but cant come back out.\nupdate:  i was able to export my private keys and get the funds on another wallet, only took all day.", "date": "Jan 6, 2018"}, {"stars": 1, "text": "Good way to lose your coins/tokens.", "date": "Jan 5, 2018"}, {"stars": 1, "text": "This is a misleading addon that claims ethereum is a decentralized cryptocurrency which anyone tech-literate in the field knows is the best example of a malicious project with no resemblence of cryptocurrencies or decentralization. Centralized eth developers literally confiscate money from users and it's unethical and should be illegal for this extension to mislead others into buying this one coin equivalent. Literally nobody considers ethereum decentralized including even Nick Szabo who inve... Show more", "date": "Jan 4, 2018"}, {"stars": 1, "text": "Waited a day, my currency never showed up. Currency is gone from my wallet with status pending. \n\nHere is a good way to lose your money. Hopefully mine isnt gone permananetly and it is just held up during blockchain communication congestion. \n\nBeware!", "date": "Dec 26, 2017"}, {"stars": 1, "text": "I used the extension to sell cryptokitties and after I was notified of a successful sale from the cryptokitties website for around .09ETH I never received any of the ETH. Unsecure or fraudulant extension don't use it.You'll lose your money. \n\nAnd I'm pretty sure its reviews are inflated by bots.", "date": "Dec 25, 2017"}, {"stars": 5, "text": "Excellent", "date": "Dec 22, 2017"}, {"stars": 4, "text": "How to remove created accounts? I can create account, but how to remove existing?", "date": "Dec 22, 2017"}, {"stars": 4, "text": "Fast, easy and safe.", "date": "Dec 20, 2017"}, {"stars": 5, "text": "super", "date": "Dec 19, 2017"}, {"stars": 1, "text": "Can't encrypt a new DEN, can't import existing DEN.. both show loading but never do anything.. waited 20 mins and still loading... Trying to get to my funds to sell and move from EtherDelta but i can't even get in to MetaMask to do this... what the hell???", "date": "Dec 19, 2017"}, {"stars": 5, "text": "very good", "date": "Dec 18, 2017"}, {"stars": 1, "text": "I didn't received my ETH I sent to my Bitpanda account, and their support site is useless. I can't register, I can't submit a ticket and it's not even https protocol. What the hell?!", "date": "Dec 18, 2017"}, {"stars": 5, "text": "very good", "date": "Dec 17, 2017"}, {"stars": 3, "text": "I downloaded this to play cryptokitties, however my antivirus decided to remove the extension and I cant redownload it... If thats not dodgy I dont know what is", "date": "Dec 16, 2017"}, {"stars": 4, "text": "nice one", "date": "Dec 15, 2017"}, {"stars": 1, "text": "please fix, the recent update just destroyed the product...nothing works", "date": "Dec 12, 2017"}, {"stars": 5, "text": "Awesome", "date": "Dec 12, 2017"}, {"stars": 1, "text": "Worst extension I've ever downloaded. \nYou'll have no problem getting it installed and moving money to it. \nHowever you'll never be able to get your money back. It requires you manually set transaction limits and fees, and nothing you put in seems to work. I lost .05 eth trying to move .5 eth out of my account. If you get the transaction fee wrong, you forfeit the fee. \nI tried googling the problem and contacting support. There's not much help online and support never contacted me back. \n100%... Show more", "date": "Dec 12, 2017"}, {"stars": 5, "text": "im very happy", "date": "Dec 12, 2017"}, {"stars": 1, "text": "This is the worst. i hate it. dont buy it. dont waste your time. its dumb.", "date": "Dec 11, 2017"}, {"stars": 5, "text": "Most user friendly way to interact with Ethereum from the browser. Still a lot to improve, I can't figure out how to update the thing (o__O)", "date": "Dec 10, 2017"}, {"stars": 1, "text": "i have a chromebook an ive downloaded it removed it again and again the icon shows up i click it i get an empty box drop down every single time ive spent hours doing this and there is no information anywhere to help me fix this problem.", "date": "Dec 8, 2017"}, {"stars": 5, "text": "awesome", "date": "Dec 8, 2017"}, {"stars": 1, "text": "Sent several ETH to the address I copied from the QR Code. I've checked everything but have yet to received the ETH.", "date": "Dec 7, 2017"}, {"stars": 1, "text": "None of the buttons work. They are all in the wrong place and are a nightmare to clickthrough. I ahve to hover and flick my mouse around to find where the actual clickable portion is instead of the button", "date": "Dec 6, 2017"}, {"stars": 1, "text": "Lousy implementation, better stick to proper wallets, there are plenty around. Eg. in my case I had to resort to myetherwallet to fix broken transactions that MetaMask had generated.", "date": "Dec 6, 2017"}, {"stars": 1, "text": "it is not working ~ \nit will disable when i click the logo beside the link.", "date": "Dec 6, 2017"}, {"stars": 1, "text": "ETH simply stuck on their accounts", "date": "Dec 5, 2017"}, {"stars": 1, "text": "Have ETH at address but won't let me transfer - Was working until today\n\nDo not use until devs address this problem", "date": "Dec 5, 2017"}, {"stars": 1, "text": "My Ethereum is now in the ether.  I lost about $75.00 USD\n\"Show QR code\"\nand\n\"Copy Address to clipboard\"\nare 2 entirely different addresses for the same Account!?\nThere's no option to delete an account if I'm not using it.\nWill I have a long time to wait for all this to be fixed?  MetaMask support, please respond / reply.  I'll give this a full day here before I email since it may be just a delay in the Eth blockchain because of the cryptokitties spike in traffic.", "date": "Dec 5, 2017"}, {"stars": 1, "text": "all time \"Sorry, We are unable to locate the Transaction Hash\"\nand \"In progress\" to game cryptokitties", "date": "Dec 5, 2017"}, {"stars": 1, "text": "Can't execute any transactions. Coins are in wallet but can't send them anywhere.", "date": "Dec 5, 2017"}, {"stars": 1, "text": "Metamask is not broadcasting any of my transactions to the blockchain.", "date": "Dec 4, 2017"}, {"stars": 1, "text": "Do not use this. Many many issues. It can work it can not. No guarantee that you will receive money or its stuck pending even if you give a return address expect to lose your cryptos in limbo", "date": "Dec 4, 2017"}, {"stars": 5, "text": "Just use Trust Wallet app for it", "date": "Dec 4, 2017"}, {"stars": 5, "text": "very useful", "date": "Dec 3, 2017"}, {"stars": 5, "text": "Reliable useful and always work.", "date": "Nov 30, 2017"}, {"stars": 5, "text": "vERY PRACTICAL", "date": "Nov 27, 2017"}, {"stars": 5, "text": "Metamask is a very reliable tool to interact with Ethereum blockchain as well to keep your ethers/tokens.\n\nGives you instant access to Ethereum ecosystem.\n\n120% Recommended!", "date": "Nov 25, 2017"}, {"stars": 5, "text": "Awesome tool, makes managing ETH and tokens easy", "date": "Nov 22, 2017"}, {"stars": 4, "text": "good", "date": "Nov 15, 2017"}, {"stars": 5, "text": "Awesome!", "date": "Nov 10, 2017"}, {"stars": 5, "text": "How can I sign message via MetaMask?", "date": "Nov 10, 2017"}, {"stars": 5, "text": "Best!", "date": "Nov 7, 2017"}, {"stars": 5, "text": "Best ever", "date": "Nov 3, 2017"}, {"stars": 5, "text": "good", "date": "Nov 1, 2017"}, {"stars": 5, "text": "One of the best Ethereum tools out there.", "date": "Oct 23, 2017"}, {"stars": 1, "text": "Not user friendly at all", "date": "Oct 22, 2017"}, {"stars": 5, "text": "Metamask is one of the key projects that is helping to achieve mainstream adoption of Ethereum. Much easier to install and use than a full-fledged client, and flexible and powerful enough to be used for testing and development. 6 out of 5 stars!", "date": "Oct 20, 2017"}, {"stars": 5, "text": "Works very well for me.", "date": "Oct 19, 2017"}, {"stars": 4, "text": "Reasonable security, great functionality. A great, useful tool...", "date": "Oct 16, 2017"}, {"stars": 5, "text": "Really useful!", "date": "Oct 15, 2017"}, {"stars": 1, "text": "it doesnt work", "date": "Oct 13, 2017"}, {"stars": 1, "text": "Not user friendly at all .. wasted too much time to sort it out", "date": "Oct 10, 2017"}, {"stars": 4, "text": "very useful, and almost a necessity when building your own dapp!\n\nhowever, it is lacking in any easy way to disable the extension", "date": "Oct 10, 2017"}, {"stars": 1, "text": "didnt do a thing useless and not user friendly", "date": "Oct 9, 2017"}, {"stars": 4, "text": "Good extension for Dapps however i seem to have some scaling / display issues on chrome with not everything fitting into the popup.", "date": "Sep 11, 2017"}, {"stars": 5, "text": "Such an amazing idea, really helping ETH adoption, keep up the good work!", "date": "Aug 24, 2017"}, {"stars": 2, "text": "Whenever i want to use it i have to log out, log in, change account, change back, change to testnet then change to mainnet. One out of 5 times this works...", "date": "Aug 22, 2017"}, {"stars": 5, "text": "Indispensable tool for interacting with Ethereum Decentralized Applications!", "date": "Aug 22, 2017"}, {"stars": 1, "text": "Cant send tokens this thing just burns gas. So sad.", "date": "Aug 18, 2017"}, {"stars": 5, "text": "\"Connecting to main etherium network\".... just stuck there\n\nEdit: seemed to be temporary problem. Thx Ali AL for hint.", "date": "Aug 7, 2017"}, {"stars": 5, "text": "i love it! especially the synchronisation of both the fox & my cursor movements. simply amazing!", "date": "Aug 5, 2017"}, {"stars": 5, "text": "Really amazing. Brings dapps to your favorite browser!", "date": "Jul 26, 2017"}, {"stars": 5, "text": "Veeery good one", "date": "Jul 3, 2017"}, {"stars": 5, "text": "Really awesome. Helpful hint: if you manage to use a custom RPC server and your MetaMask is stuck at \"Searching for Network\" you can switch back to the Ethereum Main Net by using the drop down menu at the top. I almost re-installed MetaMask. Make the drop down menu more obvious please!", "date": "Jul 3, 2017"}, {"stars": 2, "text": "Absolutely fantastic, except when it fails. Reinstalling is required to fix almost any issue. If you add a token and make a mistake, you cannot remove it.", "date": "Jul 2, 2017"}, {"stars": 5, "text": "perfect app for accessing the ethereum blockchain updated recently to support sending erc20 coins getting better all the time! love it!", "date": "Jun 30, 2017"}, {"stars": 1, "text": "I've registered many ENS domains using Metamask, and have come accross this error repeatedly for some domains:\n ENS: Warning! Error encountered during contract execution [Bad instruction]\nNow I am unable to Reveal and the bids amounts are lost. Any thoughts? Is it possible to recover the amounts?\nIf not, don't use this extension with ens.domains because you can lost your money.", "date": "Jun 23, 2017"}, {"stars": 3, "text": "I lost $50 from mining and when i tried to add a new PC to the pool, i had to make another account because the 12 word code was lost and overall, it is a big headache.", "date": "Jun 19, 2017"}, {"stars": 3, "text": "still new", "date": "Jun 7, 2017"}, {"stars": 5, "text": "Most useful tool for dapps development. Thanks.", "date": "May 31, 2017"}, {"stars": 5, "text": "This is likely going to be the foundation of a lot of Ethereum development going forward.  Light-weight and easy to use.", "date": "May 30, 2017"}, {"stars": 1, "text": "Did not do the thing.", "date": "May 28, 2017"}, {"stars": 4, "text": "App Seems ok but do not use for buying eth websites, will often bid twice on the same auction. Some auctions have never come threw even after paying the Eth price, and after all this the sites i have bid on can not be Reveled threw Metamask.\nOr unpredictably reveal them costing extra ETH in gas prices.\nMaybe some of the Transactions will eventually return to the wallet.\nIF wasnt for .ETh errors i would really rate this wallet\n\n(the Eth registrar should not recommend people to use this app if ... Show more", "date": "May 25, 2017"}, {"stars": 2, "text": "If you want to look at ethereum, great. If you want to bid on eth names this will not function dependably and you may lose your bids.", "date": "May 24, 2017"}, {"stars": 5, "text": "Loving this peak into the future of web identity and payments.", "date": "May 18, 2017"}, {"stars": 5, "text": "Thanks for taking the time to make it happen! Love the fox following my cursor around! And the visuals!", "date": "May 16, 2017"}, {"stars": 5, "text": "awesome extension!!", "date": "Apr 19, 2017"}, {"stars": 5, "text": "very useful", "date": "Apr 11, 2017"}, {"stars": 5, "text": "The best product to come out of the Ethereum ecosystem so far.", "date": "Mar 30, 2017"}, {"stars": 2, "text": "Import json doesnt work. I cannot delete accounts.", "date": "Mar 28, 2017"}, {"stars": 1, "text": "examples are non existent for DAPPs", "date": "Mar 14, 2017"}, {"stars": 5, "text": "Super convencient way to interact with Ethereum DApps", "date": "Feb 24, 2017"}, {"stars": 5, "text": "Easiest way to get started with Ethereum", "date": "Jan 29, 2017"}, {"stars": 5, "text": "Hi, \nI am interested in acquiring your extension \"MetaMask\". \n\nPlease contact me at: isvetlowa@gmail.com", "date": "Jan 26, 2017"}, {"stars": 5, "text": "Great work!", "date": "Jan 6, 2017"}, {"stars": 5, "text": "awesome beta that aims bring to masses crypto and related data and content. Digital Culture to the people lol", "date": "Jan 4, 2017"}, {"stars": 5, "text": "Couldn't there be a easy switch to turn web3 injection off if a site uses a differnt approach?", "date": "Nov 4, 2016"}, {"stars": 5, "text": "Great product!", "date": "Oct 13, 2016"}, {"stars": 5, "text": "sweet", "date": "Sep 21, 2016"}, {"stars": 5, "text": "Seems to be working very well with our Dapp after porting to async calls.  Makes it easy for new users to use the Dapp.  Great stuff!", "date": "Sep 13, 2016"}, {"stars": 5, "text": "Fantastic guys keep up the good work cant wait for a great game with a great grapphics will try the new ether play game", "date": "Sep 7, 2016"}, {"stars": 5, "text": "I missed you.", "date": "Sep 6, 2016"}, {"stars": 5, "text": "Great seamless connect to ethereum blockchain", "date": "Aug 30, 2016"}, {"stars": 5, "text": "Fantastic!\n\nJust started using it to test my new contract on the test network and the deployment fails as the contract gas usage is above the block gas limit.  \n\nThe cool thing is that Metamask tells me the actual gas usage of my contract to be deployed.", "date": "Aug 5, 2016"}, {"stars": 4, "text": "Ok, so it's some kinde of light wallet and eth node in my browser - and it is okay. But I can just create Dapp which could be opens from usuall browser without MetaMask. Why need to do things more complicated,than it is?", "date": "Aug 1, 2016"}, {"stars": 5, "text": "Pure awesomeness! Is there work being done on translating MM to other languages?I'd love to contribute. Who should I contact?", "date": "Jul 22, 2016"}, {"stars": 5, "text": "Looks very promising!", "date": "Jul 15, 2016"}, {"stars": 5, "text": "Couldn't be simpler.  Kudos!", "date": "Jul 15, 2016"}, {"stars": 5, "text": "Very easy install.  This is by far the  best way to get started with Ethereum on the test or production network.", "date": "Jul 15, 2016"}, {"stars": 5, "text": "Easiest way to get started with Ethereum!", "date": "Jul 8, 2016"}, {"stars": 5, "text": "Way better than running a Geth node!", "date": "Jun 21, 2016"}]