[{"date": "Feb 29, 2024", "text": "Not free. Account needed. Unclear what data gets exfiltrated.", "stars": 1}, {"date": "Feb 17, 2024", "text": "Requestly Review: Simple UI, Huge Impact\nLoved the intuitive UI for request body modification. Helped in confirming backend security with my senior engineer, even bested Postman Interceptor in some cases.", "stars": 5}, {"date": "Feb 14, 2024", "text": "This works flawlessly!", "stars": 5}, {"date": "Feb 11, 2024", "text": "amazing. I never ever write reviews for extensions. but this one is really good for backend development and complex redirects + prod e2e testing. previously used burp interceptor, but it is too complex and heavy IMO, more of an infosec tool.", "stars": 5}, {"date": "Feb 8, 2024", "text": "it's extremely helpful in developer daily basis, thanks a lot for creating this tool!!!", "stars": 5}, {"date": "Feb 8, 2024", "text": "excellent customer service, fast and effective. I subscribed for a job and it was very useful", "stars": 5}, {"date": "Jan 31, 2024", "text": "A brilliant, reasonably lightweight tool for manipulating network requests, with a great team with great communication behind it.", "stars": 5}, {"date": "Jan 30, 2024", "text": "how did bring back old Requestly?", "stars": 5}, {"date": "Jan 25, 2024", "text": "They force you to create an account. And i don't understand why it redirects to requestly website for session recording, while they say nothing is sent outside your local machine or browser. ", "stars": 1}, {"date": "Jan 24, 2024", "text": "Not really free. Deceptive.", "stars": 1}, {"date": "Jan 22, 2024", "text": "Awesome tool. I use it almost daily for my projects to modify request body, headers, etc. Would recommend it to every frontend developer out there. Thank me later :)", "stars": 5}, {"date": "Jan 12, 2024", "text": "I am not a fan of how this is advertised: Open-source, but \"If you need a free version without the limits, you can build your own from our Github Repo\". This comes in a very sneaky tone that does not deserve my trust.", "stars": 1}, {"date": "Dec 29, 2023", "text": "Easily one of the best tools currently for intercepting and modifying HTTP request and response", "stars": 5}, {"date": "Dec 26, 2023", "text": "Unfortunately, with the recent changes imposing stricter limits on the free tier, the functionality of this Chrome extension has significantly diminished. Previously, the free version provided adequate features to meet basic needs, but now, the limitations render the extension nearly useless for everyday tasks. It's disappointing to see such a shift, as many users relied on this tool for its versatility and convenience. I hope the developers reconsider their approach or provide more reasonabl... Show more", "stars": 1}, {"date": "Dec 20, 2023", "text": "Unfortunately the new limits to the free tier are too low and the extensions becomes almost useless", "stars": 2}, {"date": "Dec 18, 2023", "text": "I used the extension to delay specific backend HTTP requests to analyze the loading behavior, worked like a charm :)", "stars": 5}, {"date": "Dec 17, 2023", "text": "Terrible extension... https://app.requestly.io/ too slow !! doesn't work !", "stars": 1}, {"date": "Dec 14, 2023", "text": "Excellent tool to use for redirecting requests locally, for modifying responses and many more by simply creating a rule!", "stars": 5}, {"date": "Dec 12, 2023", "text": "Amazing!", "stars": 5}, {"date": "Dec 11, 2023", "text": "Why tf do i need to register in some cloud app just to fiddle with some http headers?", "stars": 1}, {"date": "Nov 29, 2023", "text": "Was a nice tool before it became paid", "stars": 2}, {"date": "Nov 26, 2023", "text": "Not free.", "stars": 2}, {"date": "Nov 7, 2023", "text": "We used this to delay API responses and modify params received to see how front end would handle them - this allowed front end to re-create a range of scenarios without wasting any back enders time. Did exactly what we needed it to, would recommend", "stars": 5}, {"date": "Nov 1, 2023", "text": "Was good until they decided to paywall a few free feature with a forced overpriced subscription, immediately uninstalled .", "stars": 1}, {"date": "Oct 29, 2023", "text": "Works as it should, but adds its script to every page even in paused state - I don't like this and so have to manually disable it every time I finish working with it.\n\nUpdate: the script is called \"libs/customElements.js\" and, as I understand it, is part of the \"Session Recording\" option. It's injected into each page when requestly is enabled (paused or not, it doesn't matter), and even if it doesn't do anything, I generally don't want extensions interfering with pages when I disable them.", "stars": 3}, {"date": "Oct 26, 2023", "text": "I was recently introduced to Requestly and used it for verifying libraries created in Adobe Launch without actually publishing them and I must say it performed perfectly. It is super user friendly and offers great ease of use.", "stars": 5}, {"date": "Oct 25, 2023", "text": "While I've only utilized a small subset of the extension, it appears to work great for my needs. The session recorder does have some quirks, such as some elements not being captured and response data being too large to display; however, the development team is aware of these issues. Overall, the development team is highly responsive and readily available to assist with any problems. I hope I can get the rest of my team on board. Keep it up. :)\n\nEdit: The response data was bumped to 100kb by t... Show more", "stars": 5}, {"date": "Oct 18, 2023", "text": "We are using this extension in my current company as frontend developers to modify API responses and it works very very well. Highly recommend it.", "stars": 5}, {"date": "Oct 11, 2023", "text": "epic tool, lets me ban the accounts of pvz gw2 pc players i don't like so cool loving it", "stars": 5}, {"date": "Oct 9, 2023", "text": "Requestly's browser extension is remarkably easy to use. As a full-stack developer, I often need to test data-intensive UI for edge cases and performance. Using Requestly I can do it very easily by mocking network requests, without needing code changes or database seeding.", "stars": 5}, {"date": "Oct 6, 2023", "text": "Very useful extension. Thanks a lot!!", "stars": 5}, {"date": "Sep 22, 2023", "text": "I can't redirect/block twitter no matter what rule I apply", "stars": 3}, {"date": "Sep 19, 2023", "text": "When got Developer tools so annoying. I just want to set a request header and it asks for a Google account.", "stars": 2}, {"date": "Aug 13, 2023", "text": "This is a great extension to have in my toolbelt", "stars": 5}, {"date": "Aug 10, 2023", "text": "love it. works perfectly, great support.", "stars": 5}, {"date": "Jul 28, 2023", "text": "I use this to rewrite new Reddit (which is slow, unintuitive, frustrating and crashes all the time) URLs to old using a regular expression. The extension is super simple to use", "stars": 5}, {"date": "Jul 24, 2023", "text": "Requestly has been a great asset for instantly creating client demos. I love their script injection feature which allows me to inject our code into any website and really impress our clients as they see our product on their website during demos :). It's probably one of the best developer extensions out there. Great job Sachin and the team! 👏👏", "stars": 5}, {"date": "Jul 13, 2023", "text": "This is by far the best tool for managing request headers! Plus the developers are very active meaning you'll get help if you're ever stuck or need help solving a problem. I use it daily and couldn't be happier.", "stars": 5}, {"date": "Jul 4, 2023", "text": "Very helpful! We use it every time to test experiments", "stars": 5}, {"date": "Jun 30, 2023", "text": "Not work offline", "stars": 3}, {"date": "Jun 2, 2023", "text": "Thanks a lot for developing this, It saves a lot of time!", "stars": 5}, {"date": "May 25, 2023", "text": "Great Tech!! Easy to use, Very Handy options. Saves a lot of time!!.\nLove their tutorials too!!🙌🏻", "stars": 5}, {"date": "May 20, 2023", "text": "not working", "stars": 1}, {"date": "May 18, 2023", "text": "Absolutely insane level of customisation and flexibility.\nUsed this on a number of different use cases and love it.\nWorks great and I found the UX fantastic. Nice job!", "stars": 5}, {"date": "May 16, 2023", "text": "I have been using Requestly for a few weeks now, what an amazing tool. So many rich features, great tutorials and the support is brilliant too.", "stars": 5}, {"date": "May 12, 2023", "text": "Only works opening in new tab or after refreshing page, not instant", "stars": 3}, {"date": "Apr 27, 2023", "text": "Great tool with nice and responsible support!", "stars": 5}, {"date": "Apr 18, 2023", "text": "This is a great tool, would recommend to anyone. Makes our team's lives a lot easier being able to mock what we need. Sachin and his team are always super helpful.", "stars": 5}, {"date": "Apr 18, 2023", "text": "Been using this extension for a few years now, it has completely transformed the way I approach web development. It allows me to intercept and modify HTTPS requests with ease, and it has saved me countless hours of troubleshooting.\n\nIt is incredibly useful to test different scenarios or simulate different user behaviors.\nIt also gives me a lot of flexibility when it comes to testing and debugging. 5 stars :)", "stars": 5}, {"date": "Apr 18, 2023", "text": "Very useful extension as a developer. As a frontend dev I use it to modify my api response during testing and it makes my work much easier.", "stars": 5}, {"date": "Apr 16, 2023", "text": "It doesn't work. All I needed it to do was redirect one part of a URL string to another. You can test it, but there's no obvious way to save the rule and apply it. It's worthless.", "stars": 1}, {"date": "Apr 12, 2023", "text": "This tools is great for doing developer work and proof of concepts on the fly. Would Highly recommend!", "stars": 5}, {"date": "Mar 31, 2023", "text": "I highly recommend this extension, I work with software development and it helps me a lot in the tests I have to perform on the endpoints", "stars": 5}, {"date": "Mar 29, 2023", "text": "Excellent extension! At most I wish there was a way to logically only replace the values under certain rules!", "stars": 5}, {"date": "Mar 13, 2023", "text": "Excellent for developement use", "stars": 5}, {"date": "Mar 13, 2023", "text": "Does what it says and does it well.", "stars": 5}, {"date": "Mar 2, 2023", "text": "This works great the people that run it are really nice and awesome!", "stars": 5}, {"date": "Feb 28, 2023", "text": "Great!\nOnly issue is the absence of request param based URL redirection", "stars": 4}, {"date": "Feb 22, 2023", "text": "I was searching for something like Safari built in local overrides.\nThis tool is perfect for any situation, mock html/js/css files. Mock API responses etc etc\n\nPerfect for testing changes on production environments or in other envs where you have no access to the server to update files", "stars": 5}, {"date": "Feb 21, 2023", "text": "Great tool for frontend developers and QA tester for API response, redirects, mock data and much more. Requestly removes the dependency on waiting for backend API's. Really useful to have in your frontend development environment.", "stars": 5}, {"date": "Feb 20, 2023", "text": "App works as expected! Ran into some small issues while creating the rules but the support team was able to help and overcome those", "stars": 5}, {"date": "Feb 20, 2023", "text": "Nice tool for modifing responses on the go without mock servers and so on. An simple tool for smart modifing with JS or stubbing requests", "stars": 5}, {"date": "Feb 15, 2023", "text": "very good!!!!!", "stars": 5}, {"date": "Feb 10, 2023", "text": "Great functionality and amazing support.  I ran into a problem with the Addin and the engineering team reached out to figure out a solution.  They took the time to replicate the issue as well as provide alternative workarounds.", "stars": 5}, {"date": "Feb 6, 2023", "text": "Great tool, great service, great helpdesk. 10/10 tool, everyone should use.", "stars": 5}, {"date": "Jan 25, 2023", "text": "Really powerful. Been incredibly helpful in development and testing", "stars": 5}, {"date": "Jan 12, 2023", "text": "Irreplaceable solution for our testing and debugging. Requestly team is highly responsive and collaborative", "stars": 5}, {"date": "Jan 12, 2023", "text": "A great tool for debugging web applications. Very useful for finding tough bugs.", "stars": 5}, {"date": "Jan 12, 2023", "text": "I needed to change the API response to test how a specific value will be processed by frontend code\nI watched 4 minute video and it was enough to complete the task\nI google before that and all solutions involved a lot of coding, which I didn't want to do because it would be time consuming, and with requestly I saved quite a but of a time", "stars": 5}, {"date": "Jan 3, 2023", "text": "Saves me tons of time in development, testing, and diagnostics.  I'm not sure how I'd do my work efficiently without it.", "stars": 5}, {"date": "Jan 3, 2023", "text": "Been using it for 1y+ and my experience is very good.", "stars": 5}, {"date": "Dec 29, 2022", "text": "Really helpful extension. Easy to use yet powerful.", "stars": 5}, {"date": "Dec 28, 2022", "text": "Nice to work", "stars": 4}, {"date": "Dec 27, 2022", "text": "Awesome Extension. Helps me a lot daily in testing.", "stars": 5}, {"date": "Dec 23, 2022", "text": "Requestly comes as savior whenever adobe platform debugger shows a glitch in launch library override. I used Requestly for redirect and mockup file server and it really helped me in dev and debugging. The interface is easy to use and creating a rule one one machine and accessing it from different machine makes it awesome.", "stars": 5}, {"date": "Dec 23, 2022", "text": "Very helpful for development!", "stars": 5}, {"date": "Dec 22, 2022", "text": "Requestly is user-friendly, brilliant and easy-to-use. I use it on an daily basis and it makes my work easier. After using other tools like Charles - Requestly is a nice new breath of air that I highly vouch for. Apart from the tool being amazing - the support from the Requestly team is phenomenal with them always going above and beyond for their clients.", "stars": 5}, {"date": "Dec 22, 2022", "text": "Have used this tool at 2 different companies now -\n\nAt the first, we used it to be able to inject our local bundles on third part websites.\nRecently, I tried using Postman mock servers but couldn't get it to work ( super confusing UX and lots of CORS issues). I thought I would give requestly mock servers a try since I'd used it before - to my delight the mock servers were so simple to set up and use I got it working within 2 minutes. Highly recommend requestly to all companies looking to mock... Show more", "stars": 5}, {"date": "Dec 20, 2022", "text": "This tool has been instrumental in delivering our code to production on time.  The ease of use has allowed us to develop the frontend application against an API concurrently with the backend work.  It has also saved testing time by allowing the frontend to process edge cases very easily.  Highly recommended!", "stars": 5}, {"date": "Dec 15, 2022", "text": "This is a great tool that our team use to preview ads for our clients.  Will recommend this product~", "stars": 5}, {"date": "Dec 8, 2022", "text": "Extremely powerful and practical utility! Very easy to use.", "stars": 5}, {"date": "Dec 7, 2022", "text": "Fantastic tool. Its very useful for all aspects of frontend infrastructure!", "stars": 5}, {"date": "Dec 7, 2022", "text": "An essential tool that's well done. Great team delivering A-level support.\nI couldn't recommend this product more.", "stars": 5}, {"date": "Dec 1, 2022", "text": "why open “only in the desktop app” again? I don't want to download the desktop app,this will open a  global proxy.I have another proxy and It is more necessary.This plug-in is less and less concise.", "stars": 1}, {"date": "Nov 19, 2022", "text": "Damn, this is just one amazing extension! Been using it since a few weeks and I wanted to know if it was possible to redirect URLs and it can too! The discord support was excellent! Glad to have this extension and thank you Sachin for making/developing this extension!", "stars": 5}, {"date": "Nov 17, 2022", "text": "Just amazing!", "stars": 5}, {"date": "Nov 15, 2022", "text": "This product will make life much easier when testing and prototyping", "stars": 5}, {"date": "Nov 11, 2022", "text": "Love it, Greate Tool", "stars": 5}, {"date": "Nov 9, 2022", "text": "I don't know what the problem is but I'm trying to redirect a page and it does to endless refresh loop between mobile and the desktop versions of the page.", "stars": 3}, {"date": "Nov 7, 2022", "text": "Powerful tool with awesome and fast support. Clear and userfriendly UI with a lot of functionality.", "stars": 5}, {"date": "Nov 4, 2022", "text": "Requestly is an amazing tool to get your development work less hassle. The product itself has evolved so much since day-1 and the company is really serious on helping their customer solves their problems. We had this nice session where they shared Requestly features and we were very impressed on its potential. A truly 5-star worthy.", "stars": 5}, {"date": "Nov 2, 2022", "text": "Requestly is awesome. I used to use Charles proxy in my day to day work but it always messed with my wifi. I haven't had any issues with Requestly. Requestly's UI is amazing too and great to work in", "stars": 5}, {"date": "Oct 20, 2022", "text": "This tool is very easy to use and makes our testing a lot easier! Great work Dev team!", "stars": 5}, {"date": "Oct 19, 2022", "text": "Very helpful for testing plugin on websites.", "stars": 5}, {"date": "Oct 19, 2022", "text": "I love it!", "stars": 5}, {"date": "Oct 12, 2022", "text": "Really useful. Thank you.", "stars": 5}, {"date": "Sep 23, 2022", "text": "It's a really helpful tool. it help me to debug things on production sites easily. During FrontEnd side development, It facilitates the way to easily work on development sites without thinking for locally backend setup to run the complete environment. and that also helps in slow down the resource and processing consumption of the machine.\nIt also offering the session recording feature to easily track the steps and data for any bugs faced by someone.\nThe sharing options of requestly rules help... Show more", "stars": 5}, {"date": "Sep 22, 2022", "text": "Very useful tool for web dev and test", "stars": 5}, {"date": "Sep 22, 2022", "text": "Excellent product, and incredible support!\nAs a marketing person, I'm pretty illiterate with code - my use case required some custom script, and Sachin jumped on it straight away. He was incredible helpful and a really nice guy at the same time.\n\nThanks again - wishing you huge success with Requestly!", "stars": 5}, {"date": "Sep 20, 2022", "text": "Requestly is so smart and easy to use. \nI use it while developing for lots of cases.\nThe replace string and mocks are so powerful and easy to use,\nand the UI is so simple and easy to understand.", "stars": 5}, {"date": "Sep 16, 2022", "text": "I love this tool, i use it everyday for debugging", "stars": 5}, {"date": "Sep 8, 2022", "text": "Great Product! Easy to use and very helpful for network analysis.", "stars": 5}, {"date": "Sep 7, 2022", "text": "First, Let me say. The support for this is simply amazing. They went way above and beyond the call of duty. Ok, let me explain. \n\nI run a small private school for a therapeutic boarding school in Texas called Resolution Ranch Academy. I have an unlimited number of Microsoft 365 Accounts. Unfortunately, I could not hand these out to my students due to a huge security risk. I had no way to keep the students from logging on to Microsoft 365 accounts that do not belong to our school.\n\nAccording t... Show more", "stars": 5}, {"date": "Sep 7, 2022", "text": "Really useful extension - we use it anytime we need to test something with a mix of local/staging/prod environments. It's very easy to reroute requests anywhere you like. Thoroughly recommend!", "stars": 5}, {"date": "Sep 1, 2022", "text": "Requestly is a must-have extension for anyone that works on front-end web.  Requestly has totally replaced Charles Proxy, Fiddler, etc. for me due to the ease of use & better interface.  10/10 would recommend!", "stars": 5}, {"date": "Sep 1, 2022", "text": "This is truly a great tool! It help solve all of my needs and the support is amazing.", "stars": 5}, {"date": "Aug 28, 2022", "text": "Requestly is truly an awesome tool! I use it both at work and for personal projects. They are constantly making updates and prioritizing customers. Sachin is great as well!", "stars": 5}, {"date": "Aug 25, 2022", "text": "Functional and easy to use.", "stars": 5}, {"date": "Aug 12, 2022", "text": "Excellent tool!", "stars": 5}, {"date": "Aug 10, 2022", "text": "It is very nice to use. I loved it! And the support was really good out of what I didn't expect", "stars": 5}, {"date": "Aug 8, 2022", "text": "Great tool, helpful for my work, but the most important is the support - there is always someone to tolke to , and they work fast to solve issues", "stars": 5}, {"date": "Aug 7, 2022", "text": "Except of get, Do the redirection support post method?", "stars": 3}, {"date": "Aug 6, 2022", "text": "Very usefull for modifying HTTP requests.", "stars": 5}, {"date": "Aug 5, 2022", "text": "Excellent product and stellar support. I recommend the product 100%.", "stars": 5}, {"date": "Aug 4, 2022", "text": "cannot delete rules(hang), very slow (become normal after I disabled it), have to sign in everytime", "stars": 1}, {"date": "Aug 3, 2022", "text": "Great support and product! It made our testing process so smooth.", "stars": 5}, {"date": "Aug 3, 2022", "text": "amazing tool for front-end developers. makes it very easy for me to work in parallel of our back-end team without relying on them to update code to staging environments. instead i can now easily intercept and mock network requests to match our specs and continue my work. thank you!", "stars": 5}, {"date": "Aug 1, 2022", "text": "An extensive and powerful solution for tweaking requests. Loved it!", "stars": 5}, {"date": "Jul 28, 2022", "text": "Love the simplicity of the interface - this fit my use case perfectly!", "stars": 5}, {"date": "Jul 26, 2022", "text": "There is no better, easier and quicker way to mock network inside your browser than this! Requestly has come in so handy a lot of times while debugging and developing stuff. Can't recommend enough - this should be on everyone's browser!", "stars": 5}, {"date": "Jun 23, 2022", "text": "I have dreamed for extension like this for many years! Impressive UI and UX, very easy to use and very powerful in the same time. Thanks to all people who created it!", "stars": 5}, {"date": "May 19, 2022", "text": "nice mans", "stars": 5}, {"date": "Apr 19, 2022", "text": "I've been using Requestly for a long time and its the number one extension for this kind of thing. There's nothing that comes close to its features and reliability.", "stars": 5}, {"date": "Apr 7, 2022", "text": "very customizable , great extension. i liked test screen a lot. one developer did help me via chat realtime as if i paid money. i have installed 5-6 extension but i wasn't happy . after i  discoverd  this extension i took away anothers . thank best to developers. i don't like be tracked, profllized  by redirect urls", "stars": 5}, {"date": "Apr 6, 2022", "text": "It works well, but recent changes completely ruin it with only 3 free rules limit. $20/month price for unlimited rules is insane.", "stars": 2}, {"date": "Mar 18, 2022", "text": "Free version loses feature after feature ...", "stars": 1}, {"date": "Mar 8, 2022", "text": "Unfortunately, the requestly.io site is down, so the extension isn't working.", "stars": 2}, {"date": "Feb 24, 2022", "text": "Great extension, really handy", "stars": 5}, {"date": "Feb 16, 2022", "text": "I was trying to swap the Adobe Launch environments on one of our client's website and Requestly made it very easy. Thorough support from the very responsive team :)", "stars": 5}, {"date": "Feb 16, 2022", "text": "Works well to change requests. After having a lot of frustrations about previous capability on the free tier being removed, they reached out and helped us solve the issue.", "stars": 4}, {"date": "Feb 11, 2022", "text": "Very Nice", "stars": 5}, {"date": "Feb 9, 2022", "text": "This is the best tool to modify request / response. Very user friendly. Much easy than Charles.", "stars": 5}, {"date": "Feb 5, 2022", "text": "This is a quite useful tool. Team as nice and supportive. Time saver.", "stars": 5}, {"date": "Feb 3, 2022", "text": "Was a decent app until it became an overly greedy paid app... Extremely over priced for what the app delivers which is really not much. The 3 rule limitation is absolutely ridiculous for free and shows the ill intent of forcing users into a paid subscription. It's one thing to limit active rules it's another to limit creating rules altogether. A subscription model into such a basic app is absolutely absurd. Shame on the developers and shame on who ever owns this. They saw an opportunity to pr... Show more", "stars": 1}, {"date": "Jan 25, 2022", "text": "I've just tried this product for the first time to modify a response to an AJAX call. I had a question about it not working as I expected. When I asked the on-line help, I got assistance within 2 minutes and the help I received had me up and running within another 2 minutes. Seems to be a good product and so far, great support!", "stars": 5}, {"date": "Jan 25, 2022", "text": "Really helpful, it does exactly what I need !\nAnd the support is just wonderful. They helped me really quickly to fix my issue.\nI recommend this extension !\nIt works like a charm !", "stars": 5}, {"date": "Jan 25, 2022", "text": "One of the most intuitive extension to experiment with network calls. Lots of impressive features. Should be a first hand go-to tool for front-end folks", "stars": 5}, {"date": "Jan 24, 2022", "text": "Requestly has been great and easy to use!", "stars": 5}, {"date": "Jan 20, 2022", "text": "Great online support.", "stars": 5}, {"date": "Jan 19, 2022", "text": "Last week I needed a quick proxy solution to interact with a buggy website.  The website's HTML bug prevent me from access it fully.  I searched for a Windows-based proxy solution, found Requestly, and installed it.  The website provided a chat option, which I happily used.\n\nFrom this point onwards, it was an excellent experience.  The customer support person introduced himself as Sagar, and we had a good text chat where I explained my predicament and Sagar tried to help me.  When things got ... Show more", "stars": 5}, {"date": "Jan 18, 2022", "text": "It´s a good tool for development, and the technical service it´s fast and helpful. I recommend it.", "stars": 5}, {"date": "Jan 17, 2022", "text": "Was looking for an extension that could redirect/modify header requests, this was the first thing that popped up. I'm not an expert in web dev, and was having a slight issue getting started. Luckily there is a chat feature for assistance, and it turns out the CEO gave me a helping hand to get exactly what I needed!\n\nSo far this is one of the best extensions I've seen in a long time!", "stars": 5}, {"date": "Jan 14, 2022", "text": "really nice interface, easy to use", "stars": 5}, {"date": "Jan 11, 2022", "text": "Slick UI. Useful features. Responsive community and fast dev support. This tool is truly a trailblazer", "stars": 5}, {"date": "Jan 6, 2022", "text": "A very handy extension to fix some troublesome URL's (in my use cases). While I don't know very well how to use it, the tech support is always willing to help, 10/10", "stars": 5}, {"date": "Dec 31, 2021", "text": "it's good, but the redirect url of post method is not ok, maybe/", "stars": 4}, {"date": "Dec 26, 2021", "text": "Awesome 5-Star product for Web developers. Our team uses it everyday. Covers all aspects of frontend development from development to testing to debugging. We use Sessions for PR reviews apart from reporting & debugging issues.", "stars": 5}, {"date": "Dec 25, 2021", "text": "Wont work", "stars": 1}, {"date": "Dec 17, 2021", "text": "Wonderfully useful tool. Just what I needed!", "stars": 5}, {"date": "Dec 14, 2021", "text": "Must have for advanced internet users", "stars": 5}, {"date": "Dec 10, 2021", "text": "Very good extension, easy to use, working properly and with great support!!!", "stars": 5}, {"date": "Dec 10, 2021", "text": "This is a great tool. I use it for debugging my google tag manager configurations.\nI had a problem with the tool , so I contacted  customer support.\nThey were very reactive and they resolved the problem quickly.", "stars": 5}, {"date": "Dec 2, 2021", "text": "I love the extended help and support from the team, this is so great. Thank you !!!", "stars": 5}, {"date": "Oct 28, 2021", "text": "Office work is much faster. I colleagues create rules and then share with each other.", "stars": 5}, {"date": "Oct 26, 2021", "text": "An amazing extension and brilliant support when I ran into trouble setting up a rule. Would highly recommend!!", "stars": 5}, {"date": "Oct 14, 2021", "text": "After adding 3 pairs, it wants me to upgrade to premium. Silly. I would pay to give it negative rating.", "stars": 1}, {"date": "Oct 12, 2021", "text": "This extension is not configurable when a computer is connected to a closed network with no access to the Internet.", "stars": 2}, {"date": "Oct 8, 2021", "text": "I used it to redirect a preroll on a website and worked like a charm.", "stars": 5}, {"date": "Sep 30, 2021", "text": "Requesty started out as an MIT licensed browser extension, and was exceptionally easy to use, but has become something entirely different as a result of it's popularity.  The problem is that its become locked down and essentially useless without an account.", "stars": 1}, {"date": "Sep 13, 2021", "text": "The removed 1 star is for the Subscription fee that must be paid to enjoy the full features . PLZ Consider STUDENT USING THIS EXTENTION.\nI actually Don't want to rate it before But they give me a free premium for a certain time, and its a Good extension and does it job better than other alternative extensions.", "stars": 4}, {"date": "Aug 6, 2021", "text": "its nice", "stars": 5}, {"date": "Aug 3, 2021", "text": "nice best", "stars": 5}, {"date": "Aug 2, 2021", "text": "best", "stars": 5}, {"date": "Jul 30, 2021", "text": "nice", "stars": 5}, {"date": "Jul 7, 2021", "text": "Truly great extension. We use it extensively at work to test our website in different conditions already, but I myself use all it's features such as mocking, blocking requests and so on.\n\nVery much recommended!", "stars": 5}, {"date": "Jul 6, 2021", "text": "Tough to use. Could not add a simple header to my request.", "stars": 1}, {"date": "Jun 25, 2021", "text": "Changing Requestly to a free competitor. \n\nWas using Requestly for years. It had a paywall within reason but now the rules changed making the app unusable for me. \n\nI would understand a limit for the number of created and activated rules but limiting the pairs inside the rules is something that I can't work with - now I can't create even a single pair inside rules because I have more than the limit inside one. \n\nBye, bye.", "stars": 2}, {"date": "Jun 12, 2021", "text": "Expensive premium plan for such a basic extension, it's not even a service to pay for it as a subscription", "stars": 2}, {"date": "Jun 11, 2021", "text": "This is an amazing plugin. I also use the desktop application on my mac to modify headers for traffic that comes from Safari or other applications. Works like a charm! I don't know of other tools with the same capability, better than Charles Proxy!", "stars": 5}, {"date": "Jun 8, 2021", "text": "One of the best extensions for modifying headers. Plus, it allows a lot of control of the request with the ability to replace hosts, insert scripts, modify query params.\n\nThe only issue I found is that it doesn't sync between browsers, even if I'm logged in to https://app.requestly.io/rules/. So I have to manually create my rules in each browser on each computer. If it sync'd across devices it would be a 5 star.", "stars": 3}, {"date": "May 7, 2021", "text": "Nice Extension", "stars": 5}, {"date": "Apr 27, 2021", "text": "didnt work for me", "stars": 3}, {"date": "Mar 26, 2021", "text": "Really helpful and crusial bug fixes this make them a really good product in market.", "stars": 5}, {"date": "Mar 24, 2021", "text": "When the plugin first came out, it was everything I needed. The plugin has since moved to a \"webapp\" format, and is now limited to 3 free active rules. I understand that it's a business decision, but I will be removing the plugin. It's sad to see a hero fall to villainy...", "stars": 2}, {"date": "Mar 23, 2021", "text": "very good", "stars": 5}, {"date": "Mar 10, 2021", "text": "perfect", "stars": 5}, {"date": "Mar 9, 2021", "text": "So good! I can work on my files and much more! like texture packs!! Top 1 extension", "stars": 5}, {"date": "Mar 7, 2021", "text": "it worked amazingly well", "stars": 4}, {"date": "Mar 6, 2021", "text": "Seen good... still testing", "stars": 5}, {"date": "Mar 4, 2021", "text": "i LIKE IT", "stars": 5}, {"date": "Mar 1, 2021", "text": "Clean interface, easy to use, problem solver!", "stars": 5}, {"date": "Feb 24, 2021", "text": "Clear, easy-to-understand UI.  Excellent, timely product support. The Requestly team provided me with an alternative to their former \"Block Twitter\" Sample rule which did not work on Chrome due to Service Workers on the Twitter site.   I use Chrome mostly, but this extension works OK on Firefox.", "stars": 4}, {"date": "Feb 22, 2021", "text": "Super useful extension", "stars": 5}, {"date": "Feb 17, 2021", "text": "Works great! This helps me work around a number of website bugs that have plagued me for years!", "stars": 5}, {"date": "Feb 12, 2021", "text": "this is the best! i use it for moomoo io", "stars": 5}, {"date": "Feb 10, 2021", "text": "this was such a good extension with so much different awesome stuff you can do with it! But, i was very sad when i found out that you can only have 3 rules on at a time. I know im being picky but 100% worth to download it IF you are doing something basic! but all in all its a amazing extension!", "stars": 4}, {"date": "Feb 4, 2021", "text": "very useful!", "stars": 5}, {"date": "Feb 1, 2021", "text": "Nice forced authentication flow", "stars": 1}, {"date": "Jan 25, 2021", "text": "i give this app five stars mega pro extension helps a lot go rate 5 stars!", "stars": 5}, {"date": "Jan 15, 2021", "text": "for textures!", "stars": 5}, {"date": "Jan 13, 2021", "text": "gg", "stars": 5}, {"date": "Jan 9, 2021", "text": "very good apps for texturepackshelp", "stars": 5}, {"date": "Jan 9, 2021", "text": "hard to use", "stars": 3}, {"date": "Jan 8, 2021", "text": "nice", "stars": 5}, {"date": "Jan 7, 2021", "text": "GOOD", "stars": 5}, {"date": "Dec 28, 2020", "text": "Very helpful", "stars": 5}, {"date": "Dec 24, 2020", "text": "I found this extension through the chrome web store. It was not at all clear to me how to use it to begin with, and I had to look around in the reviews to understand I'd have to use https://app.requestly.io/rules/ to do anything at all. Maybe the developers can add an explanation in the extension description or even a link to these settings in the local browser app options.\n\nIf I don't update this review, assume I'm unable to and there are other further issues with this extension.", "stars": 3}, {"date": "Dec 23, 2020", "text": "Very GOODD", "stars": 5}, {"date": "Dec 23, 2020", "text": "i sometimes cant get a texture pack :(", "stars": 4}, {"date": "Dec 12, 2020", "text": "fire", "stars": 5}, {"date": "Dec 12, 2020", "text": "still trying to figure out how it works", "stars": 5}, {"date": "Dec 10, 2020", "text": "cool", "stars": 5}, {"date": "Dec 10, 2020", "text": "Top and very useful!", "stars": 5}, {"date": "Dec 8, 2020", "text": "amazing c:", "stars": 5}, {"date": "Dec 7, 2020", "text": "Seems to work.", "stars": 4}, {"date": "Dec 6, 2020", "text": "It was my favourate app for web developmemnt or advanced web usage.\n\nHowever, since its update a while ago, more free features are now paid. I have to look for other apps.", "stars": 3}, {"date": "Dec 5, 2020", "text": "nice", "stars": 5}, {"date": "Dec 3, 2020", "text": "Intuitive, practical, needed.", "stars": 5}, {"date": "Dec 1, 2020", "text": "Fantastic extension!\nI love using it to block some websites and search terms I find to be very distracting. Plus, I love the wide amount of features available to optimize the experience for increased productivity.", "stars": 5}, {"date": "Nov 30, 2020", "text": "I like it, but Plans need to be removed.", "stars": 5}, {"date": "Nov 28, 2020", "text": "ok", "stars": 5}, {"date": "Nov 27, 2020", "text": "Helpful", "stars": 5}, {"date": "Nov 26, 2020", "text": "Since the import function is behind a paywall, I won't use it anymore. Before that it was a great app\nedit:\nchanged it to 4 stars.\nafter contact with Requestly the import functionality is back for non-paying users, however you still need to sign in with a google account to have it working, which is always a downside if non optional.", "stars": 4}, {"date": "Nov 26, 2020", "text": "would be better if the feature for import is still for free ;)", "stars": 4}, {"date": "Nov 25, 2020", "text": "Best extension", "stars": 5}, {"date": "Nov 25, 2020", "text": "they require premium access", "stars": 3}, {"date": "Nov 25, 2020", "text": "Useful", "stars": 5}, {"date": "Nov 24, 2020", "text": "Require premium to import rules now :(", "stars": 1}, {"date": "Nov 20, 2020", "text": "Great extension", "stars": 5}, {"date": "Nov 19, 2020", "text": "Massive thanks to the creator of this. Easy to use, quick to set up, near flawless.", "stars": 5}, {"date": "Nov 11, 2020", "text": "most useful for me,now", "stars": 5}, {"date": "Nov 3, 2020", "text": "Super tool for my Job, excelent", "stars": 5}, {"date": "Oct 26, 2020", "text": "awesome\nyou can change textures in games now", "stars": 5}, {"date": "Oct 21, 2020", "text": "So good to back to old facebook layout.", "stars": 5}, {"date": "Oct 17, 2020", "text": "big brain xd", "stars": 5}, {"date": "Oct 17, 2020", "text": "I was unable to login to several websites after installing this plugin. E.g. \nhttps://account.shopware.com/portal and https://go2.beezup.com/index.html#!/external/login?userName=", "stars": 1}, {"date": "Oct 13, 2020", "text": "Great for forcing WordPress.com back to using the Classic Editor instead of that horrible Block Editor they've tried to foist on everyone.", "stars": 5}, {"date": "Oct 13, 2020", "text": "Very helpful tool. I use it to visualize hidden information in the Gurushots website. I like that I am able to use jquery too not just plain javascript :)", "stars": 5}, {"date": "Oct 12, 2020", "text": "Not working idk why?", "stars": 3}, {"date": "Oct 9, 2020", "text": "it's pretty useful for anything, but you all goanimators (or vyonders, idk) are using it for the wrong purpose.", "stars": 3}, {"date": "Oct 7, 2020", "text": "Must Have!", "stars": 5}, {"date": "Sep 30, 2020", "text": "10usd is little expensive", "stars": 4}, {"date": "Sep 27, 2020", "text": "used to be free (all the reviews you see are from back when it was free) but now it's paid subscription at $10 a month.  Are you kidding me?  I like to support developers, but that is just pathetic.  Extension removed.  Bye.", "stars": 1}, {"date": "Sep 16, 2020", "text": "Web Developer's Best Friend!", "stars": 5}, {"date": "Sep 15, 2020", "text": "Ran into an issue where I couldn't add Rules, support helped me switch from their .in domain to the .io domain. Not sure how I ended up there but good to know for anyone else experiencing this issue.", "stars": 5}, {"date": "Sep 15, 2020", "text": "Noice tool", "stars": 5}, {"date": "Sep 5, 2020", "text": "This extension is very expensive, 10€ per month is an abuse.", "stars": 1}, {"date": "Aug 25, 2020", "text": "Great tool! And on above that great service. I ran into small problem and the owner of extenstion replied within minutes and fixed it!\nLooking forward for more nice feature to this tool!", "stars": 5}, {"date": "Aug 17, 2020", "text": "It's awesome", "stars": 5}, {"date": "Aug 16, 2020", "text": "wonderful", "stars": 5}, {"date": "Aug 11, 2020", "text": "fantastic", "stars": 5}, {"date": "Aug 11, 2020", "text": "great job", "stars": 5}, {"date": "Aug 10, 2020", "text": "I'm a big fan of Requestly, and use it on a daily basis as a QA Engineer. It removes the need to use Charles pretty often, which is always nice. Not that Charles wouldn't do the job, it's just super convenient to not need to open a separate application to do the same things -- instead I can just use Requestly directly in Chrome", "stars": 4}, {"date": "Aug 5, 2020", "text": "I've been using Requestly to get some unruly sites to behave better by changing request headers for them. This worked pretty well for a while, but for some time now, header modifications don't seem to work anymore.", "stars": 3}, {"date": "Aug 3, 2020", "text": "Amzing extension", "stars": 5}, {"date": "Aug 2, 2020", "text": "really great app", "stars": 5}, {"date": "Aug 1, 2020", "text": "Great App", "stars": 5}, {"date": "Jul 28, 2020", "text": "Extra", "stars": 5}, {"date": "Jul 26, 2020", "text": "You need to signup to use the extension.", "stars": 1}, {"date": "Jul 22, 2020", "text": "Requestly helped me a lot with my work and stuff. I give it a five-star rating.", "stars": 5}, {"date": "Jul 18, 2020", "text": "best textaure pack ever", "stars": 5}, {"date": "Jul 14, 2020", "text": "its an really awesome extension!", "stars": 5}, {"date": "Jul 14, 2020", "text": "nice", "stars": 5}, {"date": "Jul 13, 2020", "text": "useful", "stars": 5}, {"date": "Jul 12, 2020", "text": "The Wiggles", "stars": 5}, {"date": "Jul 6, 2020", "text": "The requestly extension is very nice and very useful. Moreover the support we get from their team is praiseworthy. Thanks a lot Sachin Jain for your support and timely help.", "stars": 5}, {"date": "Jun 30, 2020", "text": "It's good", "stars": 5}, {"date": "Jun 29, 2020", "text": "FANTASTIC", "stars": 5}, {"date": "Jun 28, 2020", "text": "I have one rule for ' Udemy 'only and since last update for requstly it's stop to be effective and working anymore ,I don't know why? but it's not working anymore\nI am sorry , just hope to know if buying subscription is the key to solive this problem ?", "stars": 2}, {"date": "Apr 11, 2020", "text": "so good", "stars": 5}, {"date": "Apr 5, 2020", "text": "Top i play the game web moomoo.io official with top skins thx :D", "stars": 4}, {"date": "Apr 1, 2020", "text": "Best extension", "stars": 5}, {"date": "Mar 27, 2020", "text": "Awesome extension for patching some dev problems)", "stars": 5}, {"date": "Mar 26, 2020", "text": "Exactly what I need, remove Urchin Tracking Module (UTM) parameters on redirect", "stars": 5}, {"date": "Mar 13, 2020", "text": "i love this so much!", "stars": 5}, {"date": "Mar 11, 2020", "text": "chek", "stars": 5}, {"date": "Mar 2, 2020", "text": "awesome!", "stars": 5}, {"date": "Mar 1, 2020", "text": "This is an extension I have been looking for.  Great to prevent fake sites and so much more.", "stars": 5}, {"date": "Feb 26, 2020", "text": "very good application but very very good", "stars": 4}, {"date": "Feb 26, 2020", "text": "Cool extension. The limit on the script size on the free plan is a little limiting.", "stars": 4}, {"date": "Feb 24, 2020", "text": "nice", "stars": 5}, {"date": "Feb 20, 2020", "text": "Awesome plugin. Please increase the rule from 10 to 25 for free users.", "stars": 5}, {"date": "Feb 15, 2020", "text": "Errors are groggy, the extension can redirect basic full URLs but not parts of URLs in URL paths. Extension complicated to use.", "stars": 1}, {"date": "Feb 13, 2020", "text": "Excellent chrome extension and very helpful staff, I 100% recommend it!", "stars": 5}, {"date": "Feb 12, 2020", "text": "cool", "stars": 5}, {"date": "Feb 8, 2020", "text": "Sweet - super helpful - thanks for free trial!", "stars": 5}, {"date": "Feb 6, 2020", "text": "Amazing", "stars": 5}, {"date": "Feb 1, 2020", "text": "this good", "stars": 3}, {"date": "Jan 28, 2020", "text": "Nice", "stars": 5}, {"date": "Jan 1, 2020", "text": "I liked it when it was free. But it's still awesome, though", "stars": 4}, {"date": "Dec 31, 2019", "text": "Works, unlike other redirector extensions. Sadly, the developers think this is worth charging for - let me tell you right now, there is no reason whatsoever to pay a subscription fee for a f**king chrome extension to redirect URLs. You can do this manually on your computer outside your browser and have a more effective result.\n\nThe free version of this, if you have one or two very pesky redirects and are too lazy to manually redirect them, is great, if muddled by senseless ads.\n\nWould have be... Show more", "stars": 2}, {"date": "Dec 30, 2019", "text": "useful", "stars": 4}, {"date": "Dec 17, 2019", "text": "I get to use it for Comedy world", "stars": 5}, {"date": "Dec 16, 2019", "text": "You can do it for free with other extensions what this one can do if you pay to remove the limits.", "stars": 1}, {"date": "Dec 16, 2019", "text": "GREAT EXTENSION! SO FAR IT HAS BEEN VERY HELPFUL!", "stars": 5}, {"date": "Dec 9, 2019", "text": "Super useful extension. Easy to setup and use.", "stars": 5}, {"date": "Dec 9, 2019", "text": "dd", "stars": 5}, {"date": "Dec 5, 2019", "text": "Good script run", "stars": 5}, {"date": "Dec 4, 2019", "text": "Cool, but not stable:\n$ curl -vvv https://app.requestly.in/rules/\n* timeout on name lookup is not supported\n*   Trying 151.101.65.195...\n  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current\n                                 Dload  Upload   Total   Spent    Left  Speed\n  0     0    0     0    0     0      0      0 --:--:-- --:--:-- --:--:--     0\n* connect to 151.101.65.195 port 443 failed: Connection refused\n*   Trying 151.101.1.195...\n  0     0    0     0    0     0... Show more", "stars": 3}, {"date": "Nov 29, 2019", "text": "wow", "stars": 5}, {"date": "Nov 20, 2019", "text": "its cool", "stars": 5}, {"date": "Nov 18, 2019", "text": "Very good work. But now for some reason my screen is white when im going on the requestly tab. Can you tell me a solution for this?", "stars": 5}, {"date": "Nov 16, 2019", "text": "Love the tools as developer test", "stars": 5}, {"date": "Nov 15, 2019", "text": "An helpful extension that easily can help us change pages content and run scripts without much effort", "stars": 4}, {"date": "Nov 15, 2019", "text": "good", "stars": 5}, {"date": "Nov 13, 2019", "text": "Very helpful tool!", "stars": 5}, {"date": "Nov 10, 2019", "text": "Good", "stars": 5}, {"date": "Nov 7, 2019", "text": "Awesome extension, and Sachin (the founder) replied to my support request pretty quickly... which is not usual for extensions to even offer support, let along reply that fast. The extension is prefect for those needing to add JS code to a web page for running tasks.", "stars": 5}, {"date": "Nov 4, 2019", "text": "Good extension", "stars": 5}, {"date": "Nov 4, 2019", "text": "amazed", "stars": 5}, {"date": "Nov 2, 2019", "text": "why me only see white board ;w;\nplz help me ;w;", "stars": 3}, {"date": "Oct 27, 2019", "text": "Just purchased Requestly Premium to setup remote rules. Helped my team collaborate testing. Very useful indeed.", "stars": 5}, {"date": "Oct 23, 2019", "text": "Fantastic tool. Quick, easy to use and good documentation.", "stars": 5}, {"date": "Oct 23, 2019", "text": "works fine but i use it for texture packs", "stars": 3}, {"date": "Oct 23, 2019", "text": "Great little extension!", "stars": 5}, {"date": "Oct 22, 2019", "text": "WOW", "stars": 5}, {"date": "Oct 19, 2019", "text": "needs to google account , untrusted.", "stars": 1}, {"date": "Oct 18, 2019", "text": "Fantastic!!", "stars": 5}, {"date": "Oct 18, 2019", "text": "Works pretty good", "stars": 5}, {"date": "Oct 15, 2019", "text": "A very helpful tool in my daily work!", "stars": 5}, {"date": "Oct 14, 2019", "text": "Now i can make my vyond videos with the old themes, but i am sad that the legacy video maker is retiring in 6 days...", "stars": 5}, {"date": "Oct 14, 2019", "text": "Its AWESOME!", "stars": 5}, {"date": "Oct 13, 2019", "text": "Very Good", "stars": 5}, {"date": "Oct 11, 2019", "text": "nice but charge fee", "stars": 5}, {"date": "Oct 11, 2019", "text": "Nothing but the best for the GA community. Thank you for making this.", "stars": 5}, {"date": "Oct 10, 2019", "text": "Got the goanimate styles", "stars": 5}, {"date": "Oct 9, 2019", "text": "Very useful and easy to use!", "stars": 5}, {"date": "Oct 6, 2019", "text": "I liked when It makes it bring back Vyond themes Because It's definetly cool though.", "stars": 5}, {"date": "Oct 5, 2019", "text": "useful", "stars": 5}, {"date": "Oct 5, 2019", "text": "I want to get premium accounts!!!", "stars": 5}, {"date": "Sep 24, 2019", "text": "WHEN it works, it's great. When it breaks, it causes hell and chaos. That said, I tried to sign up for an account, thinking \"maybe the pro version is better\" but then I discovered the only way to get an account is to connect it to a google account. I have a corporate email, it's not google, so I guess I don't get an account. Shame.", "stars": 1}, {"date": "Sep 22, 2019", "text": "vv", "stars": 5}, {"date": "Sep 20, 2019", "text": "Too good )", "stars": 5}, {"date": "Sep 18, 2019", "text": "it was good", "stars": 5}, {"date": "Sep 17, 2019", "text": "Great Tool", "stars": 4}, {"date": "Sep 16, 2019", "text": "awesome app", "stars": 5}, {"date": "Sep 16, 2019", "text": "nice", "stars": 5}, {"date": "Sep 14, 2019", "text": "Best extension, PERIOD. It can basically restore anything without any problems. No more questions, BEST, EXTENSION, EVER!", "stars": 5}, {"date": "Sep 13, 2019", "text": "Better extension ever, I just can insert my js code to another page or site, excellent", "stars": 5}, {"date": "Sep 11, 2019", "text": "awsome loved it. but in bronze plan at least give 5 rule as a developer wee need to check more and more", "stars": 5}, {"date": "Sep 10, 2019", "text": "Hello!\nThank you for your amazing work!\nDoes this extension allows modifying POST requests payload body values?", "stars": 5}, {"date": "Sep 10, 2019", "text": "Great chrome app I really like", "stars": 5}, {"date": "Sep 8, 2019", "text": "Make doing goanimate good.", "stars": 5}, {"date": "Sep 5, 2019", "text": "Worked great but not anymore and dev are not responding 1/10", "stars": 1}, {"date": "Sep 4, 2019", "text": "This extension can also be used for making boring things in games to something cool like hats in moomoo.io and skins in other games etc. Really now my hats look better in moomoo.io", "stars": 5}, {"date": "Sep 3, 2019", "text": "Best extension Ever", "stars": 5}, {"date": "Sep 1, 2019", "text": "it/was/AWESOMEEE", "stars": 5}, {"date": "Aug 25, 2019", "text": "Love it", "stars": 5}, {"date": "Aug 24, 2019", "text": "Can't seem to get it to work with twitter. I tried first creating a rule to redirect twitter home to a custom twitter list. When that didn't work I tried blocking social media, it only blocked facebook and not twitter.Tested a redirect with reddit and it works there as well.", "stars": 3}, {"date": "Aug 24, 2019", "text": "great", "stars": 5}, {"date": "Aug 23, 2019", "text": "very good.", "stars": 5}, {"date": "Aug 21, 2019", "text": "Great extension, very powerful once you learn how to use it. \n\nHaving tried lots of extensions there's nothing which even comes close (flexible rules and hooks, regexp support, inject javascript etc). Support is excellent, and devs are very responsive. \n\nI use Requestly for quite a few different things now, including redirecting local domains to development so I don't have to mess about managing endless dns entries.\n\nIf I'm honest I don't like the material design UI. I find it cluttered and u... Show more", "stars": 5}, {"date": "Aug 21, 2019", "text": "good", "stars": 5}, {"date": "Aug 20, 2019", "text": "A time saver, with great support.\nThanks, Sachin!", "stars": 5}, {"date": "Aug 19, 2019", "text": "it good, i like", "stars": 5}, {"date": "Aug 19, 2019", "text": "This is the ultimate tool for GoAnimators.", "stars": 5}, {"date": "Aug 19, 2019", "text": "It's great...!", "stars": 5}, {"date": "Aug 18, 2019", "text": "This extension helped me on getting the old themes back! thank you requestly!", "stars": 5}, {"date": "Aug 16, 2019", "text": "This extensions exactly what ive been looking for and exceeded my expectations", "stars": 5}, {"date": "Aug 13, 2019", "text": "It's the best ever", "stars": 5}, {"date": "Aug 13, 2019", "text": "awsome", "stars": 5}, {"date": "Aug 12, 2019", "text": "wow", "stars": 5}, {"date": "Aug 11, 2019", "text": "very good", "stars": 5}, {"date": "Aug 11, 2019", "text": "I pretty much use it for goanimate stuff, its overall good.", "stars": 5}, {"date": "Aug 7, 2019", "text": "Great.", "stars": 5}, {"date": "Aug 7, 2019", "text": "it is a good extension for GoAnimating, modifying websites etc.  but i think it should have at least 15 codes on free plan. Other than that, its really good as it helps me make really awesome videos for my channel.", "stars": 4}, {"date": "Aug 7, 2019", "text": "The most useful chrome extension ever.", "stars": 5}, {"date": "Aug 1, 2019", "text": "It says that the custom code cannot have more than 500 characters, it has 425 and don't let me save it.", "stars": 2}, {"date": "Jul 26, 2019", "text": "Great app, so many options! \nAnd great support as well!", "stars": 5}, {"date": "Jul 26, 2019", "text": "A way to get Comedy World back. but can you please be unpaid because it's going to make people who love Comedy World on Vyond leave.", "stars": 5}, {"date": "Jul 24, 2019", "text": "Very cool extension. Easy to use.", "stars": 5}, {"date": "Jul 18, 2019", "text": "It used to be useful addon. But now it asks you to pay for such a simple task. I understand that developers need to make money (I am developer myself). But, it does not make sense to make it free at first and then ask for money after you got users. Asking for donation or showing ad is more acceptable.", "stars": 1}, {"date": "Jul 15, 2019", "text": "Requestly - perfect professional tool. Works really great and super simple to use it! Thanks", "stars": 5}, {"date": "Jul 12, 2019", "text": "It's the best redirect tool by far, offering much functionality and flexibility above the alternatives. If you use it a lot and could make use of a large number of rules, I'd say it's well worth buying a licence.", "stars": 4}, {"date": "Jul 7, 2019", "text": "One of the best ever created plugins! I discovered it randomly and I really regret that I didn't find it earlier. Thanks to the developers!", "stars": 5}, {"date": "Jun 23, 2019", "text": "I love this extension! You can redirect/replace small sections of links, which is exactly what I needed. I use it to redirect things like normal Amazon links to the \"smile.amazon\" version.", "stars": 5}, {"date": "Jun 17, 2019", "text": "With free plan you can create just 10 rules at max. This extension is not for me. I uninstalled it quickly. Thank you developer!", "stars": 1}, {"date": "Jun 9, 2019", "text": "It's really awesome!", "stars": 5}, {"date": "Jun 8, 2019", "text": "great for redirecting blocked sites to unblocked domains. like wikipedia.org to wikizero.com or imgur.com to imgurp.com.", "stars": 5}, {"date": "Jun 8, 2019", "text": "I'm a web dev and thus needed to be able to redirect script calls when in development mode using vue. Had it up and running in seconds. This saved me tonnes of time. Great plugin.", "stars": 5}, {"date": "May 31, 2019", "text": "Thank you so much for providing a glorious tool to help retrieve things back in GoAnimate/Vyond, and thanks for replying to my message a few months ago. 5 stars for you! ;-)", "stars": 5}, {"date": "May 28, 2019", "text": "great tool", "stars": 4}, {"date": "May 21, 2019", "text": "Great product to update links on a page. In my case I want to change a web link to an app link to open links in a specific app and not web and this works great. Also I received some support for what I want and the support was great, fast and really helped me.", "stars": 5}, {"date": "May 15, 2019", "text": "Requestly is truly a wonderful tool. \nIt worked marvelously on replacing URLs!", "stars": 5}, {"date": "May 9, 2019", "text": "Excellent extension! the only one I found that does exactly what I needed, it's extremely helpful to manage multiple google suite and personnal accounts and saves me tons of time. Also, the support was super helpful when I had some questions initially.", "stars": 5}, {"date": "May 4, 2019", "text": "Updates made it worse. Removing querys doesnt work now.", "stars": 2}, {"date": "May 2, 2019", "text": "Fantastic, versatile and endlessly useful. I don't know what I'd do without it.", "stars": 5}, {"date": "Apr 24, 2019", "text": "Excellent extension , easy to use converts all my URLS from one website  to another", "stars": 5}, {"date": "Apr 23, 2019", "text": "I used to like it, BUT THEY UPDATED IT AND NOW I CAN ONLY HAVE 3 RULES ENABLED! I CAN'T EVEN DO WHAT I GOT REQUESTLY FOR! I HAVE NO MONEY, SO I CANT PAY FOR PREMIUM! WHY WOULD YOU DO THIS TO ME?", "stars": 1}, {"date": "Apr 12, 2019", "text": "Awesome extension. Great job. Thanks.", "stars": 5}, {"date": "Apr 11, 2019", "text": "Great plugin. Recently, they had to install payment plans and that severely lowered the usability of this product in my day to day. I am part of a company though so we are currently trying other options. The founder reached out though and explained he did this because he is working on this full time now and it can't be a free tool any longer. Totally understand. Still a very good product.", "stars": 5}, {"date": "Apr 10, 2019", "text": "Although it used to be amazing for modifying io game sprites and creating custom skins after this recent update you can only do 10 rules . i know this inst this extensions original perpous but many people use it for this and its a shame that they are making it so difficult for people like me . I understand they need to make money , its just good business to have payed for features but all ime saying is that it was better before when there were unlimited rules so we could create custom skin pa... Show more", "stars": 4}, {"date": "Apr 9, 2019", "text": "Amazing customer service :)", "stars": 5}, {"date": "Apr 3, 2019", "text": "This is so cool, i will get 300 subs on youtube, butt why is it a paid software now?", "stars": 5}, {"date": "Apr 2, 2019", "text": "I love it! It's simple, elegant, and does exactly what it's supposed to.\nMissing a primary backup feature, but sharing feature is more than enough to suffice for now.\n\nNote: I'm primarily using this extension on Mozilla Firefox.", "stars": 5}, {"date": "Apr 1, 2019", "text": "I already installed requestly in my browser, but manager rules page still show [Get Started\nPlease install requestly extension to setup rules to modify network requests. Learn More..], and can't sign in,  sign in dialog automatically disappeared", "stars": 4}, {"date": "Mar 29, 2019", "text": "Hi Sachin,  great extension I've been using it a long time.   Recently (like the last release) I've had a hard time with CPU usage on the latest Chrome.    It's been working great but wondering if you've been tracking some items around that.    I will look forward to what 2019 has in store.     \ngreat work", "stars": 5}, {"date": "Mar 28, 2019", "text": "Helped my channel gain 10k subscribers!\n\nThanks to the creator of this. I'm definitely going to buy the gold subscription. I actually helped Brent Holze use requestly when I first met him.", "stars": 5}, {"date": "Mar 26, 2019", "text": "I used to be an evangelist and this review used to be 5 stars, and this used to be my favorite chrome extension.... \n\nEdit: And once again it is, my review 5 stars and I am once again evangelizing requeslty. \n\nSachin, the developer fixed the memory leak issue I raised in my last review quickly and since then this has been running without issues.  He also reached out to me when I had a question about generating a replacement rule with a random string.  He has been gracious and is more than hel... Show more", "stars": 5}, {"date": "Mar 26, 2019", "text": "I encounter serious performance problems after updating to the latest version.", "stars": 3}, {"date": "Mar 23, 2019", "text": "do it work on macos ? can i use it on moomoo.io i just want have texture pack on moomoo,io", "stars": 3}, {"date": "Mar 20, 2019", "text": "Really good, working and convenient extension to use. Loved it. Liked the prompt support of the developer when required.", "stars": 5}, {"date": "Mar 14, 2019", "text": "Loved this. I am frequently using it to inject js in my website to test  certain things. It reduced the load to maintain a local host server. :)", "stars": 5}, {"date": "Mar 11, 2019", "text": "For me, it is difficult to use. I have to access the website, create rules. \n\nJust want when ever I turn it on, every to-be-sent request will be displayed, and user can view, or edit the header info before sending.", "stars": 3}, {"date": "Feb 26, 2019", "text": "great app! way better than setting up Charles proxy and creating a bunch of mumbo jumbo. Totally recommend it!", "stars": 5}, {"date": "Feb 24, 2019", "text": "I really enjoy using this extension! Us GoAnimators used this to get back the old themes on Vyond. Another thing I use this extension for is to block virus pop-ups with the cancel request tool. Keep up the good work!", "stars": 5}, {"date": "Feb 21, 2019", "text": "After clearing cache & cookies it prompts me to install the extension to use rules, even though it is installed.", "stars": 4}, {"date": "Feb 18, 2019", "text": "Horrible extension with too many ads.", "stars": 1}, {"date": "Feb 11, 2019", "text": "Requestly chrome extension works very well, you can set up any custom rules that will help to change/trick your requests in a way you need.\nAlso very good customer support.", "stars": 5}, {"date": "Feb 6, 2019", "text": "Great tool. I was able to get gmail unblocked until chrome browser introduced a bug. I contacted the Requestly team and they were very responsive and looked into the issue to find what exactly was going on. Here's hoping that the chrome team will resolve this bug quickly.", "stars": 5}, {"date": "Feb 5, 2019", "text": "Very useful tool!", "stars": 5}, {"date": "Jan 30, 2019", "text": "Amazing...", "stars": 5}, {"date": "Jan 29, 2019", "text": "Hi there! Is there a way yet that I can replace POST body params (i.e., not query params)? Doesn't seem to be. Thank you though for a good tool.", "stars": 4}, {"date": "Jan 26, 2019", "text": "It was good and nice so I liked it", "stars": 4}, {"date": "Jan 21, 2019", "text": "I unblocked Reddit, Imgur and Wikipedia in my country. A really excellent add-on.", "stars": 5}, {"date": "Jan 7, 2019", "text": "Its great if it was in Android!", "stars": 5}, {"date": "Jan 5, 2019", "text": "I've only lightly used the plugin, but I've got to say, their customer service is awesome. I had a somewhat odd use case involving multiple gmail accounts and the need to use one for youtube and the other for everything else, and their support rep gave me great advice about how to address it. I am very impressed at the depth of knowledge they had about the google ecosystem.", "stars": 5}, {"date": "Dec 24, 2018", "text": "A really handy tool. Searching bookmarks for frequently visited websites is really tedious. Amazing work.", "stars": 5}, {"date": "Dec 21, 2018", "text": "it can bring back the non business themes on vyond legacy video maker", "stars": 5}, {"date": "Dec 18, 2018", "text": "Really nice extension! Easy to use with a active support", "stars": 5}, {"date": "Dec 18, 2018", "text": "Straight forward easy to use. Developer helped me in minutes of me installing the app. Might have been good timing, but it was very helpful.", "stars": 5}, {"date": "Dec 14, 2018", "text": "Very useful tool for my development and testing tasks - Thanks :-)", "stars": 5}, {"date": "Dec 11, 2018", "text": "This extension is the reason I have 30k subs on YouTube. Massive thanks to the creator of this. Easy to use, quick to set up, near flawless.", "stars": 5}, {"date": "Dec 11, 2018", "text": "Super useful and sleek tool. Would recommend everyone to try this.", "stars": 5}, {"date": "Dec 4, 2018", "text": "Very slick and modern UI that also supports keyboard shortcuts. What's not to love there? I have only used it to make sure I am always giving a forum I support it's Amazon referral link even if I visit Amazon without going through that forum. The \"Modify query parameters\" rule allowed me to do that quite easily.\n\nNow I need to try and figure out how to make sure I always go to smile.amazon.com whenever I go to their site. I know I need to use the \"Replace host\" rule but I'm not terribly famil... Show more", "stars": 5}, {"date": "Nov 26, 2018", "text": "This is going to save me so much time at work! thank you so much :)", "stars": 5}, {"date": "Nov 23, 2018", "text": "Everything I needed. Ability to create advanced rules is great. Also, the UI is clear and simple. I'd recommend this extension to everyone.", "stars": 5}, {"date": "Nov 18, 2018", "text": "super", "stars": 4}, {"date": "Nov 13, 2018", "text": "Worked perfectly to append \"oldIssueView=true\" to a JIRA URL to avoid JIRA's new, poorly redesigned interface.", "stars": 5}, {"date": "Nov 13, 2018", "text": "I use Requestly to seamlessly remove UTM parameters to minimize tracking and more easily avoid duplicates for read-it-later apps like Pocket. Very easy to set up and support is incredibly responsive!", "stars": 5}, {"date": "Nov 11, 2018", "text": "i love it when i log in", "stars": 5}, {"date": "Nov 9, 2018", "text": "helpful", "stars": 5}, {"date": "Nov 8, 2018", "text": "Does everything it says it does!", "stars": 5}, {"date": "Oct 31, 2018", "text": "Really nice extension for redirecting URLs when debugging. Best Halloween treat ever!", "stars": 5}, {"date": "Oct 31, 2018", "text": "I'm surprised how straightforward this extension is - it did exactly what i need (in my case, adding a url parameter to a specific host), and without any hitches or issues.", "stars": 5}, {"date": "Oct 29, 2018", "text": "Nice for developers to test and check implementations.", "stars": 4}, {"date": "Oct 22, 2018", "text": "Really nice extension. Easy to redirect URLs when debugging. By the way, nice support from the development team when needed.", "stars": 5}, {"date": "Oct 20, 2018", "text": "I really Love It So So Much Wow Thanks For Who Make It's (:", "stars": 5}, {"date": "Oct 5, 2018", "text": "Best extension", "stars": 5}, {"date": "Oct 4, 2018", "text": "It's awesome!", "stars": 5}, {"date": "Sep 16, 2018", "text": "Very Hard To Use", "stars": 1}, {"date": "Sep 8, 2018", "text": "Best!", "stars": 5}, {"date": "Sep 6, 2018", "text": "Perfect for every purpose.", "stars": 5}, {"date": "Sep 3, 2018", "text": "It sucks won't let me to replace url except all urls!", "stars": 5}, {"date": "Aug 28, 2018", "text": "I Love Requestly", "stars": 5}, {"date": "Aug 24, 2018", "text": "Did exactly what I was looking for: changing a Box URL to match our company's internal Box site URL.", "stars": 5}, {"date": "Aug 20, 2018", "text": "great extension", "stars": 5}, {"date": "Aug 17, 2018", "text": "Really helpful with a simple UI.", "stars": 5}, {"date": "Aug 14, 2018", "text": "saves my day today ... everyday.. just love it!\nthanks for this wonderful addon!", "stars": 5}, {"date": "Aug 14, 2018", "text": "A must have, you can for example very easily enable / disable scripts for testing, setup cache buster especially when you have multiple caching solutions, swap to minify file to beauty files automatically... and I have just started to use the tool. Sachin is very helpful if you any issue.", "stars": 5}, {"date": "Aug 2, 2018", "text": "If you have to do development for a SiteMinder SSO app, this is invaluable.  You can set a rule like add header SM_USER <your id> to localhost:8080/* and you are good to go.", "stars": 5}, {"date": "Jul 22, 2018", "text": "Doesn't do anything. Want from user.imgur to imugr/all... nothing happens, ever", "stars": 1}, {"date": "Jul 18, 2018", "text": "Works great to get rid of ERR_BLOCKED_BY_XSS_AUDITOR errors from Sharepoint editor. See https://www.softlanding.ca/about-Softlanding/resources/blog/working-past-script-editor-webpart-error-sharepoint-google-chrome for settings.", "stars": 5}, {"date": "Jul 15, 2018", "text": "Thank you", "stars": 5}, {"date": "Jun 21, 2018", "text": "Perfect when you need a simple solution for OAuth2 implementations which allow only a single redirect uri.", "stars": 5}, {"date": "Jun 17, 2018", "text": "i love", "stars": 5}, {"date": "Jun 12, 2018", "text": "Works well, except that rules essm to be case-sensitive. If a site uses capitals in its URL, Reuqestly needs to match.", "stars": 4}, {"date": "Jun 11, 2018", "text": "Functionally speaking, this app is great and accomplishes what I need. However it is a little buggy:\n\n(1) for some reason Command+S only saves a substring of each parameter whereas clicking the save button fully saves it\n\n(2) toggling rules on or off only works on the main page, not the edit page", "stars": 4}, {"date": "Jun 5, 2018", "text": "I wish I could only replace a specific part of the url not all of it. For instance: youtube.com/sdfsdf --> youtube.com/ggg/sdfsdf", "stars": 3}, {"date": "May 24, 2018", "text": "Hello, I really like comedy world, because it looks better, and people look a lot better. Also I really enjoy many other things too.", "stars": 5}, {"date": "May 11, 2018", "text": "Works out of the box and makes my life easy. Thanks for this awesome plugin!", "stars": 5}, {"date": "May 8, 2018", "text": "I just used it to get comedy world (I have done it at my own RISK)\nEDIT: The Planning Are A RIP-OFF Like £40 For A Year Memership", "stars": 1}, {"date": "May 7, 2018", "text": "we got comendy world back i love this!!", "stars": 5}, {"date": "May 5, 2018", "text": "best, love it!", "stars": 5}, {"date": "May 1, 2018", "text": "for goanimate", "stars": 5}, {"date": "Apr 21, 2018", "text": "is epic", "stars": 5}, {"date": "Apr 16, 2018", "text": "Very good!", "stars": 5}, {"date": "Apr 13, 2018", "text": "got comedy world back with this, very helpful", "stars": 5}, {"date": "Apr 9, 2018", "text": "great!", "stars": 5}, {"date": "Apr 5, 2018", "text": "can you help for GoAnimate?", "stars": 5}, {"date": "Mar 29, 2018", "text": "Was able to change parts of the URL easily. Did what I wanted. Thanks", "stars": 5}, {"date": "Mar 26, 2018", "text": "love it", "stars": 5}, {"date": "Mar 23, 2018", "text": "Great job!! You've saved my day. Thank you so much.", "stars": 5}, {"date": "Mar 19, 2018", "text": "for goanimate!", "stars": 5}, {"date": "Mar 19, 2018", "text": "Nice extension! Thx!", "stars": 5}, {"date": "Mar 11, 2018", "text": "It won't let me access it\n(Is working)", "stars": 5}, {"date": "Jan 30, 2018", "text": "Liked", "stars": 5}, {"date": "Jan 17, 2018", "text": "look good future need  be  download  , thank you so much", "stars": 5}, {"date": "Jan 15, 2018", "text": "Good, I will researching more feature in this extension", "stars": 5}, {"date": "Jan 12, 2018", "text": "Always though it's a great extension, until I found out that half of my rules don't work. It only supports 3 active rules and anything beyond that silently stops working with no indication whatsoever.\nThis actually is an artificial limit only mentioned on extension website. The idea is that a few people would pay to get rid of the limits. I can't fathom who would pay such ridiculous price for such a small product, but that's up to you, I don't really care. What I don't like though is artifici... Show more", "stars": 3}, {"date": "Jan 9, 2018", "text": "No matter what regular expression matching rule I provided, it claimed it was invalid.  Even the most basic possible expressions were considered invalid.", "stars": 1}, {"date": "Jan 7, 2018", "text": "it's more slowly than other redirector addons.\nAnd deep need the url encode/decode function in redirect request.", "stars": 4}, {"date": "Dec 29, 2017", "text": "Its Not Letting Me Bring Back The Goanimate text to speech voices back", "stars": 1}, {"date": "Dec 27, 2017", "text": "Works!", "stars": 5}, {"date": "Dec 21, 2017", "text": "awesome", "stars": 5}, {"date": "Dec 17, 2017", "text": "Only works when I open a new tab or reload the page. Clicking on a link doesn't do anything.\n\nE.g. I create a rule to redirect a specific link youtube.com to my subscription page. If I right click the youtube button and open new tab, the extension works. However, if I just click on the link normally (doesn't open new tab) then the extension doesn't do anything.\n\nOtherwise, this is a great extension, plenty of options and has everything I need.", "stars": 4}, {"date": "Nov 17, 2017", "text": "I LOVE THIS EXTENSIONS!", "stars": 5}, {"date": "Nov 16, 2017", "text": "Great extension for what it does. Also author is very cool, he helped me on twitter to setup a rule.", "stars": 5}, {"date": "Nov 12, 2017", "text": "Awesome it only need a better desine to make tabs looks more clear for viewer at first i didnt notice \"rule name\" tab its too small lel great extention thx alot", "stars": 5}, {"date": "Nov 8, 2017", "text": "i cant download", "stars": 5}, {"date": "Nov 7, 2017", "text": "This is very simple and intuitive", "stars": 5}, {"date": "Nov 5, 2017", "text": "When ever i put something in it says error replace field cannot be empty", "stars": 3}, {"date": "Oct 22, 2017", "text": "i love this site google if you notice i'm using a video maker.", "stars": 5}, {"date": "Oct 18, 2017", "text": "Whenever I switch networks this extension blocks all my requests so I need to hard-quit Chrome to be able to browse again (or wait a really long time). Disabling this extension was the best choice I could have made, I can't even remember why I installed it in the first place.", "stars": 2}, {"date": "Oct 1, 2017", "text": "Requires an external configuration page @ requestly.in. Slow to load that page. Wish it was built-in to extension.", "stars": 1}, {"date": "Sep 18, 2017", "text": "is not work for me i try comedy world in go animate and is not working i hated it requestly!!!", "stars": 1}, {"date": "Sep 9, 2017", "text": "word", "stars": 5}, {"date": "Sep 3, 2017", "text": "perfect if you want modify the URL, host etc of requests done by chrome browser.", "stars": 5}, {"date": "Aug 22, 2017", "text": "Very useful for my use of redirecting requests to external JS resources.", "stars": 5}, {"date": "Aug 18, 2017", "text": "I simply love it! doing many great thing with this add on, it's a pleasure to be able to control things to this level...", "stars": 5}, {"date": "Aug 4, 2017", "text": "it worked before now it doesnt with goanimate for me i don't know why, but everytime i type in the links for replace and with, it deletes it when i go back to requestly, and its SOOOO annoying. i dont know if its just my computer, or if its supposed to do that, but pls try to fix", "stars": 4}, {"date": "Aug 2, 2017", "text": "Good for GoAnimate Users, Bad for link modifier.", "stars": 5}, {"date": "Jul 13, 2017", "text": "NOW IT CAN BRING US BACK THE NON-BUSINESS THEMES (Sorry for all caps)", "stars": 5}, {"date": "Jul 3, 2017", "text": "Very good Extension with a lot of options to set!", "stars": 5}, {"date": "May 27, 2017", "text": "It helped me get the old voices, comey world, and old music! ;D", "stars": 5}, {"date": "May 18, 2017", "text": "Tried to add a header, doesn't seem to be working, the header name never gets saved at all.", "stars": 2}, {"date": "May 10, 2017", "text": "i like!", "stars": 5}, {"date": "May 5, 2017", "text": "WHERE IS THE TOOLBAR YOU ARENT BEING SPECIFIC WHEN YOU ARE SAYING \"Get Started\nPlease click on Add Icon in the toolbar to setup rules to modify network requests\"!!! PLEASE HELP ME FIND THE ICON AND TOOLBAR AND \"SHOW ICON\" AND ALSO MY REQUESTLY ICON ON THE CHROME EXTENSION TOOLBAR IS ALREADY SHOWING BUT YOU DIDNT NOTICE", "stars": 3}, {"date": "May 4, 2017", "text": "Works great!", "stars": 5}, {"date": "Apr 20, 2017", "text": "Very good technical support from admin. Thanks!", "stars": 5}, {"date": "Apr 18, 2017", "text": "It's the best ever! It helped me return to Vyond in 2017! I don't want it to be a paid software.", "stars": 5}, {"date": "Apr 7, 2017", "text": "It used to work, but seems to load your setting from their server.  Currently I cannot change any of my settings because their server has over a 60 second load time on the base config URL and never stops loading after that.\n\nI would recommend another tool the architecture of this one is not only shady (why do I need to talk to their website for my settings) but can lock you out from changing your own settings.", "stars": 1}, {"date": "Apr 7, 2017", "text": "Doesn't actually work.  You try to add a request header and nothing happens; if you inspect the request, the header is never added. -- This add-in is bogus.", "stars": 1}, {"date": "Mar 29, 2017", "text": "404 There isn't a GitHub Pages site here.", "stars": 1}, {"date": "Mar 28, 2017", "text": "because i just told you", "stars": 2}, {"date": "Mar 28, 2017", "text": "For some reason, the site is not working right now! I am getting a 404 error! Will rate 4/5 once it gets fixed!", "stars": 3}, {"date": "Mar 28, 2017", "text": "Works pretty well until their website goes down, then it breaks because the configuration page seems to be run from their actual site, which seems kind of sketchy, to me.", "stars": 3}, {"date": "Mar 27, 2017", "text": "Links don't save when I try to replace whiteboard with comedy world. WTF THEY PATCHED MY COMPUTER! WILL PROXY'S WORK?", "stars": 1}, {"date": "Mar 14, 2017", "text": "I like this", "stars": 3}, {"date": "Mar 4, 2017", "text": "you saved me", "stars": 5}, {"date": "Mar 2, 2017", "text": "It is so FREECKING USELES Reaquestly is as horrible as a PC!!!", "stars": 1}, {"date": "Mar 1, 2017", "text": "Everytime I type in the link of getting voices back on Goanimate. I won't bring them back. I'm typing them right but nothing happens. 8l", "stars": 3}, {"date": "Feb 23, 2017", "text": "When I click \"MATCHES REGEX\" all the text deletes itself without doing nothing .-.", "stars": 1}, {"date": "Feb 18, 2017", "text": "It did not let me add it to chorme", "stars": 1}, {"date": "Feb 16, 2017", "text": "i can get comedy world back \n\nit did the job", "stars": 5}, {"date": "Feb 9, 2017", "text": "Did the job, no questions asked!", "stars": 4}, {"date": "Feb 8, 2017", "text": "Stopped working... Rules are added, extension is on, I'm not in private mode - still not working.", "stars": 2}, {"date": "Jan 31, 2017", "text": "Nice extension. Does this transfer the cookies as well?", "stars": 4}, {"date": "Jan 31, 2017", "text": "I really love the program! But since i  used it for goanimate, i recently heard it got patched. So i'd love a update to get this un-patched! But i also like to use it for other programs and edit hosts and links. Amazing add-on!", "stars": 5}, {"date": "Jan 30, 2017", "text": "Man, How Will I Be Able To Get Comedy World Back?", "stars": 5}, {"date": "Jan 21, 2017", "text": "love it!", "stars": 5}, {"date": "Jan 19, 2017", "text": "Very sad a little Browser \"Extension\" is payware now...\nGoogle should prevent this!", "stars": 1}, {"date": "Jan 17, 2017", "text": "keeps saving my day at work! Love this extension!!", "stars": 5}, {"date": "Dec 28, 2016", "text": "I like ut", "stars": 3}, {"date": "Dec 27, 2016", "text": "Comedy World", "stars": 5}, {"date": "Dec 25, 2016", "text": "How to debug if matching rules and substitutions are working or not? How does one debug and test? Don't see any documentation. Am I missing anything.", "stars": 2}, {"date": "Dec 16, 2016", "text": "works well. But I can't see any way to remove the icon from the Google Chrome settings drop-down. Would like this removed", "stars": 4}, {"date": "Dec 16, 2016", "text": "Rules:\n. Replace Host", "stars": 3}, {"date": "Dec 14, 2016", "text": "This works perfectly!", "stars": 5}, {"date": "Dec 6, 2016", "text": "Much better than other very limited redirect extensions, actually allows to specify url vs host vs containing or replacing etc. etc. Good stuff.", "stars": 5}, {"date": "Nov 21, 2016", "text": "finally got the true power of a goanimater again. i give this a 1000000000/10", "stars": 5}, {"date": "Nov 9, 2016", "text": "Replacement is super fast and awesome!\nCan we have an extra checkbox for Auto replacement while taking the replacement pairs? So that we can have a manual replacement by clicking on the icon, if there is any matching rule.\nMy use case is for changing the host to localhost for bug fixing, but there can be other uses as well.", "stars": 5}, {"date": "Nov 2, 2016", "text": "Works nicely. Would be better without ads but that's life eh.", "stars": 4}, {"date": "Oct 27, 2016", "text": "I used this to get the nonbusiness themes back on GoAnimate4Schools after HTML5! I love this! Thanks!", "stars": 5}, {"date": "Oct 25, 2016", "text": "Tried Replacing some part of a URL and it worked like a charm.. Brilliant. Good Work.", "stars": 5}, {"date": "Oct 21, 2016", "text": "Its a great extension. However since this morning it has not been working.", "stars": 5}, {"date": "Sep 29, 2016", "text": "Got it installed configured in less than 5 minutes.\n\nWe have a production environment where the load balancer injects info into the header on each requests. To test those, we need to inject the same data from the browser (we do not run LB locally !). \n\nAfter testing it, I was able to extract the settings and distribute them to the whole team. \n\nI could not ask for anything better for my use.", "stars": 5}, {"date": "Sep 29, 2016", "text": "Love it!", "stars": 5}, {"date": "Sep 11, 2016", "text": "It's completely useless. It won't even load the rules page, saying I need to disable my ad blocker. Yeah, no.", "stars": 1}, {"date": "Aug 31, 2016", "text": "I use a 4K display with Windows dpi set to 200%. Although many websites use a url based server side scaling model, few of them cater for high DPI desktop displays, so I usually see blurry images everywhere. With this tool I can manually correct those websites to improve my experience. Thanks!", "stars": 5}, {"date": "Aug 18, 2016", "text": "I came, I saw and it did what I had to. Great!!!", "stars": 5}, {"date": "Aug 17, 2016", "text": "Succeeded to intercept a request and modify its target where other extensions failed.\nGiving the response itself instead of another URL to fetch would be a plus.", "stars": 4}, {"date": "Jun 13, 2016", "text": "Redirect feature is excellent! Helps me avoid distracting web pages.", "stars": 5}, {"date": "May 31, 2016", "text": "Does what it says!\n\nWas hoping to see how other people use this extension to improve their browser experience. Is there some place I can do this?", "stars": 5}, {"date": "May 14, 2016", "text": "very good! i wanted this!", "stars": 5}, {"date": "May 12, 2016", "text": "I just want to add a header Content-Type: application/json for localhost url but it doesn't work", "stars": 2}, {"date": "Apr 27, 2016", "text": "Love it , As Youtube is blocked in my University so I replaced Youtube.com with Youtube-nocookie.com and watch?v= with embed/ . More I can also watch playlists etc...", "stars": 5}, {"date": "Apr 19, 2016", "text": "I use this app to keep me focused when going to YouTube or Facebook by redirecting each to a specific page on that domain. For example, on YouTube, I redirect to a specific channel and on Facebook I redirect to my business page. Other extensions will loop if you are redirecting to the same domain but this one doesn't. That makes it much better than the 5 other extensions I've tried for this purpose. Thanks!!", "stars": 5}, {"date": "Apr 13, 2016", "text": "Super. It work wonderful!", "stars": 5}, {"date": "Mar 9, 2016", "text": "Great, redirects Prod CSS/JS to Local, without installing Charles.  Works great.", "stars": 5}, {"date": "Mar 8, 2016", "text": "It does it's job pretty good.\nI used it for reducing my image quality with rsz.io to save bandwidth.", "stars": 5}, {"date": "Feb 19, 2016", "text": "Loved it for the \"Replace part of the URL\" feature. Neatly developed. Thanks.", "stars": 5}, {"date": "Feb 16, 2016", "text": "This handy extension allowed us to solve a tricky problem with an iPrism Web Filter. We needed the https youtube links to be changed to http (non-ssl) links for the proxy server to filter and log this traffic in our corporate environment.\n\nSome documentation would be a great addition to the extension, but I was eventually able to figure it out through trial-and-error testing.", "stars": 5}, {"date": "Feb 16, 2016", "text": "Does exactly what's expected.", "stars": 5}, {"date": "Feb 10, 2016", "text": "good plugin", "stars": 5}, {"date": "Dec 15, 2015", "text": "Got rid of those annoying youtube video recommendations effectively.\n\nUrl Matches: /^https?:\\/\\/www\\.youtube\\.com(\\/feed\\/trending)?\\/?$/g\nDestination: https://www.youtube.com/feed/subscriptions", "stars": 5}, {"date": "Dec 14, 2015", "text": "Perfect. I use a replace host rule to redirect youtube.com/watch?v= links to gaming.youtube.com/watch?v=", "stars": 5}, {"date": "Dec 2, 2015", "text": "Very useful and works perfectly. Would recommend.", "stars": 5}, {"date": "Oct 27, 2015", "text": "Wonderful tool. It would have been excellent, if it would have allowed using \"file:\" protocol for url-redirection :)", "stars": 5}, {"date": "Oct 24, 2015", "text": "Works great! Did exactly what I needed. Thank you dev for making an excellent tool.", "stars": 5}, {"date": "Oct 22, 2015", "text": "super awesome plugin.. like the simplicity", "stars": 5}, {"date": "Oct 1, 2015", "text": "Saved me from running Fiddler all the time. Great useful extension.\n\nSome examples on the matching rules could be good though.", "stars": 5}, {"date": "Oct 1, 2015", "text": "Great. With RegEx support that gives you a lot of possibilities. Greatly recommended.", "stars": 5}, {"date": "Sep 6, 2015", "text": "The regex is not supported. Gives me error: \"example\" is not a valid regular expression", "stars": 2}, {"date": "Sep 4, 2015", "text": "Absolutely beautiful -- well thought-out, just the right options, not too much.  Easy to use.  Dude, you really did a good job with this one.  Many thanks!!", "stars": 5}, {"date": "Aug 17, 2015", "text": "Great tool with responsive developer. Can be set up for power users with regex request and header modification, but also very easy to use for beginners with a very friendly user interface.", "stars": 5}, {"date": "Aug 13, 2015", "text": "Easy to use; does exactly what I needed it to do without a bunch of unnecessary hoops.", "stars": 5}, {"date": "Jul 15, 2015", "text": "very cool", "stars": 5}, {"date": "Jul 8, 2015", "text": "Pretty simple and straight forward  to use", "stars": 5}, {"date": "Jun 19, 2015", "text": "Awesome tool, it is being used by my whole team. 'Export rules' feature is great !!", "stars": 5}, {"date": "May 27, 2015", "text": "Not supported to regex", "stars": 2}, {"date": "Apr 30, 2015", "text": "Awesome Tool. Works every time", "stars": 5}, {"date": "Apr 28, 2015", "text": "Seems like everyone loves Requestly for redirecting from bad websites to good websites :)\n\nAlso, I've just used it to \"fix\" the version of PostgreSQL documentation to always be \"9.4\"", "stars": 5}, {"date": "Mar 31, 2015", "text": "Did exactly what I needed when I couldn't find another to do it. Namely, redirecting requests.", "stars": 5}, {"date": "Feb 13, 2015", "text": "This does barely work for modifying headers, and doesn' allow modification of request method. Plus, seriously, would have killed you to provide one line of explanation ? Rubbish", "stars": 1}, {"date": "Dec 5, 2014", "text": "Would be good if you could have a bunch of redirect requests in a single entry.\n\nPerhaps this could be done by having the website prefix as a constant and have the remaining sections of the url as the filters", "stars": 3}, {"date": "Nov 29, 2014", "text": "Does exactly what I needed it to: cancel a redirect to a certain domain. (among other things)", "stars": 5}, {"date": "Nov 11, 2014", "text": "As a web developer, this is the most useful Chrome plugin I've found so far\n\nThanks a lot! : ]", "stars": 5}, {"date": "Aug 11, 2014", "text": "Easy setup and redirecting my facebook to something more productive.", "stars": 5}, {"date": "Aug 8, 2014", "text": "Thanks, tried several this was great easy to use and love the contains/regex feature.\n\nWould love to see a export rules as i use several chrome profiles but greap app", "stars": 5}, {"date": "Jul 5, 2014", "text": "Cool app, but we already have fiddler and may other apps that do the same work, with a much simpler UI. Instead if this app could provide other features such as just replacing hostname for the request, or alter some particular parameters in the request, it would be quite nice.", "stars": 3}]