[{"date": "Mar 7, 2024", "text": "Delete function no longer work directly from the icon bar.  When you click on it, you see the hourglass working as usual but the message remain.   Need to open the whole Gmail to delete.", "stars": 5}, {"date": "Jan 26, 2024", "text": "Does not allow me to click links in the email preview, making this extension worthless", "stars": 3}, {"date": "Dec 4, 2023", "text": "after the last update works fine again.", "stars": 5}, {"date": "Nov 30, 2023", "text": "Slowly stopped working completely (was buggy previously, but perfect till recent times) over last month, I assume because of new google policies of reading google sites data, and because of adblock drama\n\nused it for several years", "stars": 1}, {"date": "Nov 29, 2023", "text": "Great plugin. Used it on Win 10. Just 2 Suggestions.\n\n1. Plugin should allow disabling notifications for individual accounts. For example, I may have 5 gmail accounts logged in but I might need notifications for only 2 of those.\n\n2. The taskbar notification on email arrival does not show which account received that email. This is very much required.\n\nI will uninstall it till then. Hopefully you will implement these. Thanks.", "stars": 4}, {"date": "Nov 28, 2023", "text": "Used to be great but stopped working a couple of days ago. I've even tried removing it and re-adding, but it still doesn't work at all. And that's a pity because it used to be so good and helpful.", "stars": 3}, {"date": "Nov 27, 2023", "text": "Works really well but how do I change the inbox that the plugin is using to a different account.", "stars": 4}, {"date": "Nov 26, 2023", "text": "This extension usually works well, however it's been giving me issues for the last few days. It'll display when you have a new message, but an error prevents you from doing anything with it. You just receive a cryptic \"core.js -> at\" error notification and the action fails.\n\nThis extension is a 5/5 when it works, but this issue as well as the issues I've experienced in the past make it a 3/5.", "stars": 3}, {"date": "Nov 26, 2023", "text": "works for what it did but wont let me do nothing now", "stars": 3}, {"date": "Nov 25, 2023", "text": "Doesn't work during couple last weeks\n\n\"core.js -> at\" message", "stars": 1}, {"date": "Nov 24, 2023", "text": "doesn't work correct in chrome 119 - notification sent, but can't mark as read and not showed letter body", "stars": 1}, {"date": "Nov 23, 2023", "text": "after install the new version. it does not show the unread email number.", "stars": 5}, {"date": "Nov 22, 2023", "text": "last 3 days its not working.", "stars": 1}, {"date": "Nov 22, 2023", "text": "I removed my previous version and installed the new one and now everything works just fine.", "stars": 5}, {"date": "Nov 21, 2023", "text": "The newest version of the Gmail Notifier now works, go to chrome://extensions/ and click update to get the latest version. https://github.com/inbasic/ignotifier/issues/618", "stars": 5}, {"date": "Nov 21, 2023", "text": "was great until it recently stopped working;  please fix as this was the best gmail notifier; anyone know what the issue is", "stars": 5}, {"date": "Nov 21, 2023", "text": "Is there a bug for the newest version? The mark as read button seems not work anymore.", "stars": 5}, {"date": "Nov 20, 2023", "text": "It stopped working recently, please fix it.", "stars": 5}, {"date": "Nov 20, 2023", "text": "Great extension, but stopped working recently", "stars": 5}, {"date": "Nov 20, 2023", "text": "Stopped working recently but would still recommend it when it get fixed, i've been using it for years without fail until now\n\nEdit: it got fixed and works again", "stars": 5}, {"date": "Nov 19, 2023", "text": "As soon as I started cleaning my pc using antivirus I had this blank page and couldn't mark messages as read.. this wasn't the first time it happens.. so I'm so shocked it has never been my fault! I love this addon but please fix this annoying bug!", "stars": 5}, {"date": "Nov 19, 2023", "text": "I have used this extension for a long time now and have been very satisfied with it until recently when all of a sudden all I get is a blank page when I try to open new messages. Since I find that no other notifiers are as great as this one usually is I would be so happy if you could fix whatever´s wrong with it", "stars": 4}, {"date": "Nov 19, 2023", "text": "can't mark messages as read, trash, archive etc since last update, please fix!\nthank you for the fix!", "stars": 5}, {"date": "Nov 19, 2023", "text": "One of the best chrome extension there is, unfortunately doesn't work anymore as of a couple of days, making it really inconvenient, please fix it!", "stars": 2}, {"date": "Nov 13, 2023", "text": "Best app literally ever. Been using this for like 10 years, or whenever it released. Does exactly as promised. I have like 10,000 emails, and I'm logged into like 6 gmail accounts, and I have never ever missed an email. I only use this for my primary email.\nMy Samsung phone takes like 2 hours to push me gmail notifications, but this desktop extension for Chrome literally notifies me in like 1-2 seconds from an email being received. It's insane. I couldn't live without it.\n\nI've also tried a b... Show more", "stars": 5}, {"date": "Nov 7, 2023", "text": "nice", "stars": 5}, {"date": "Oct 13, 2023", "text": "Myriad of issues with this extension. Doesn't always mark as unread and often takes a few seconds to register when it does, counter tends to be inaccurate, previously marked as read emails randomly come back to life, etc. Just doesn't work well for me.", "stars": 2}, {"date": "Sep 13, 2023", "text": "It was good but know it wont show details of the email anymore. Now all it does is open gmail which is a useless feature!", "stars": 2}, {"date": "Aug 25, 2023", "text": "good", "stars": 5}, {"date": "Aug 17, 2023", "text": "For me it's perfect. Bravo!", "stars": 5}, {"date": "May 31, 2023", "text": "This extension has been a life saver for me! My university's gsuite email usually doesn't sync well with any client but I needed notifications real bad because it is the only way to get important announcements. Default Gmail notification has been a hit or miss but this one works great even if I don't have mail.google.com open! Kudos to the Developer.", "stars": 5}, {"date": "May 25, 2023", "text": "Good", "stars": 5}, {"date": "Apr 8, 2023", "text": "I LOVE THIS!!!!! very useful! it helps ALOT!!!! it's sooooo convenient! i give it an 11/10 rating!!!! 😉😃", "stars": 5}, {"date": "Dec 14, 2022", "text": "Loved the app. using to since last 2-3 its helps a lot to put the attention on imp. mails. Gonna use it till I retire.", "stars": 5}, {"date": "Oct 12, 2022", "text": "Works very well and is extremely useful, thus the 5 stars, although I do have two issues:\n1) It will sometimes refresh your main gmail tab and automatically switch to it (happens about once a month)\n2) By default, only 4 accounts are used. The workaround is to manually add the further ones in the feed in the options.", "stars": 5}, {"date": "Aug 26, 2022", "text": "Does a simple job and does it well! Being able to set a custom notification sound (among some other presets) is a nice addition for customization, along with every other option that's available!", "stars": 5}, {"date": "Aug 17, 2022", "text": "Needs a dark mode...", "stars": 3}, {"date": "Aug 3, 2022", "text": "This was SUCH A GREAT CHOICE to get this as an extention, it works so well, i dont even have to open gmail and I can delete it, mark it as read, or just read it and decide if I want to go to my email to look closer. GREAT EXTENTION!! anyone who gets a single email should get this", "stars": 5}, {"date": "Jul 29, 2022", "text": "Gets the job done.", "stars": 5}, {"date": "Jul 22, 2022", "text": "Not once have I ever gotten a notification from this extension.", "stars": 1}, {"date": "Mar 3, 2022", "text": "It works efficiently and truly safe.\nThank you who works on this project you are amazing.", "stars": 5}, {"date": "Feb 23, 2022", "text": "Easy access to my gmail, nice!", "stars": 5}, {"date": "Feb 22, 2022", "text": "Great extension. I have 5 gmail accounts added to my gmail but the extension is showing only 4 in logged-in accounts but all are logged in, opened and connected to gmail. Can you give me a hint please. Thanks in advance", "stars": 5}, {"date": "Feb 13, 2022", "text": "Best ever ilove it it really works on all mail notifiecations . Great work!!!", "stars": 5}, {"date": "Feb 6, 2022", "text": "Great extension", "stars": 5}, {"date": "Jan 26, 2022", "text": "Best Gmail notifier I've tried so far", "stars": 5}, {"date": "Jan 15, 2022", "text": "Hey Dev, Can you please add a \"Mark all as read\" option in the toolbar button when right clicked? We already have \"Disable all notifications\", \"Enable notifications\", compose email, refresh etc...in between them if we can add mark read it would be great...", "stars": 5}, {"date": "Jan 4, 2022", "text": "Absoloutly fantastic software for getting notified i work at a company where i want to recieve for new emails and notify management about that this software works as charm thumbs up to you guys hope you will in future not let us down. Keep up the good work.", "stars": 5}, {"date": "Dec 23, 2021", "text": ":D", "stars": 5}, {"date": "Nov 20, 2021", "text": "super######", "stars": 5}, {"date": "Nov 20, 2021", "text": "the most useful button does nothing: trash.  if that would work this extension would  be brilliant.", "stars": 2}, {"date": "Oct 13, 2021", "text": "Keep getting \"gmail notifier cannot get \"at\" base page\" , when I try to mark as read from the app in chrome and win10..what is the problem ?.", "stars": 3}, {"date": "Oct 12, 2021", "text": "Used this for years and was great, but as of recently the controls no longer work (delete, archive, report spam, etc)", "stars": 3}, {"date": "Oct 12, 2021", "text": "This extensions is very good. However, it has error since today. Please fix it", "stars": 5}, {"date": "Oct 3, 2021", "text": "Sadly, it gives an empty form isntead of a proper prewiev window. Then it gets back to normal after calling prewiev one more time.", "stars": 3}, {"date": "Sep 14, 2021", "text": "Super))", "stars": 5}, {"date": "Sep 7, 2021", "text": "Is it possible to have a sound play when an email from only one specific site is received and no sound for other sites?", "stars": 5}, {"date": "Sep 5, 2021", "text": "Been using it for years , although its changed abit since its start years ago its been darn handy and convenient . Older versions were a bit better , but I would not be without it for the most part . Thx Google!", "stars": 4}, {"date": "Aug 15, 2021", "text": "Finally, an extension which is up to the task and doesn’t require any weird permissions like full access to my browser history!", "stars": 4}, {"date": "Jul 30, 2021", "text": "very effective", "stars": 5}, {"date": "Jul 29, 2021", "text": "I've been using this app for years, and it has made my life so much easier. It's a small thing to be able to access your email via notifications, but it makes a huge difference.", "stars": 5}, {"date": "Jun 7, 2021", "text": "Getting [quoted text hidden] on twitch notifications", "stars": 3}, {"date": "May 29, 2021", "text": "After the update on May 28 2021. the Mark all as read button gone. Please fix this", "stars": 4}, {"date": "May 27, 2021", "text": "Happy I got it!!  Google finally got something right again.", "stars": 4}, {"date": "May 27, 2021", "text": "It works and helps me for many years without any problem. I am very thankful for that.", "stars": 5}, {"date": "May 27, 2021", "text": "This is an awesome app.", "stars": 5}, {"date": "May 27, 2021", "text": "I think this is a must have extension for Gmail users.\nReceive notifications and quickly view, archive, star or delete up to the first 20 emails them without having to open up the Gmail website. Once you delete or archive an email you can then progress to the next email in the list past 20.\n\nThis latest update fixed the missing [label] and [star] issue.", "stars": 5}, {"date": "May 27, 2021", "text": "Very nice", "stars": 5}, {"date": "May 27, 2021", "text": "Super little tool. Makes my life much easier, since I know eaxactly what's going on in my personal account while working for my employer... Perfect. Thank you, Devs!!!", "stars": 5}, {"date": "May 20, 2021", "text": "Great! Better than the official extension because it is open source and has many settings available.", "stars": 5}, {"date": "May 13, 2021", "text": "Nice. 5 Stars", "stars": 5}, {"date": "May 1, 2021", "text": "It seems to be allergic to Twitter's DIrect Messages and mail it thinks as important but aren't labeled as much, I can't mark them as Read or delete them through the extension. Any ideas?", "stars": 5}, {"date": "Mar 4, 2021", "text": "Worked perfectly on Windows 7. Upgraded my system to Win10 last year, doesn't work since then. The icon is always gray, I can open my accounts with it, but there are no badges on it, it doesn't show any new emails. I didn't change anything in the settings. How can I fix it?", "stars": 1}, {"date": "Dec 18, 2020", "text": "this is the best luckyly i dont have to go on the rugular gmail", "stars": 5}, {"date": "Dec 15, 2020", "text": "Works great! Few suggestions:\n\nWould love it if the number badge was a different, more prominent color like red. grey is prone to be forgotten in the background! \n\nAlso, I am signed in three separate gmail accounts but don't want to see emails from all of them. I don't seem to be able to choose which ones I want to be notified for.", "stars": 4}, {"date": "Nov 16, 2020", "text": "PERFECT!\nbest email notification addon for chrome.", "stars": 5}, {"date": "Nov 9, 2020", "text": "Epic...", "stars": 5}, {"date": "Oct 23, 2020", "text": "Not updated in over a year, can't handle >5 accounts…", "stars": 2}, {"date": "Sep 6, 2020", "text": "Detected only four (4) out of the nine (9) Gmail accounts already logged in.\n\nThis is a great app, but can be better with more accessibility to each individual account that is logged in like 'Checker Plus for Gmail' without having to right click.", "stars": 3}, {"date": "Sep 1, 2020", "text": "good", "stars": 5}, {"date": "Aug 20, 2020", "text": "Doesn't seem to work at all. Can't even get it to show in the extensions toolbar. Am I doing something wrong?", "stars": 1}, {"date": "Aug 14, 2020", "text": "it simple, it works, 5 stars", "stars": 5}, {"date": "Aug 5, 2020", "text": "I tend to keep four email accounts open but I only want Notifier to tell me about new emails from two of them.  I can't see how to do this, so I'm bombarded by emails from all of them, so now I'm missing important emails.  This is an obvious problem that the developer should have spotted in the first place.", "stars": 3}, {"date": "Apr 16, 2020", "text": "for some reason when i click on notification to open or on mark as read, my nvidia geforce experience overlay opens (it's binded to open on ALT+SHIFT+Z)", "stars": 4}, {"date": "Apr 6, 2020", "text": "The interface seems to have a lot of features, but when I click open inbox then nothing happens. Fix this please.", "stars": 3}, {"date": "Apr 3, 2020", "text": "Terrible at being consistent on notifications. It will be fine one day, then go a week without notifications. When I click on the icon and go to my mail, I find several messages waiting for me. Also, some mail will not delete through the notifier. It is useful as a shortcut to launch my mail, though.", "stars": 2}, {"date": "Mar 18, 2020", "text": "The different customization options are very cool! However, this extension is not compatible for (at least some) Chromebook devices. The extension requires you to sign out and sign back in to receive notifications, and Chromebooks can only do this by sign out of your account on the device. Signing back in doesn't do anything for the extension. Really wish it would work...", "stars": 2}, {"date": "Mar 10, 2020", "text": "great just what I was looking for", "stars": 5}, {"date": "Feb 4, 2020", "text": "I ove it, changed my life and made everything so simple and faster as it should be on the first place", "stars": 5}, {"date": "Jan 31, 2020", "text": "Very practical !", "stars": 5}, {"date": "Jan 17, 2020", "text": "Very helpful and amazing ext.", "stars": 5}, {"date": "Nov 10, 2019", "text": "It's only checking 3 of my gmail accounts. I have 5 other gmail accounts that it's not notifying me of new emails.", "stars": 2}, {"date": "Oct 27, 2019", "text": "Very nice get this you will not be disappointed.", "stars": 5}, {"date": "Oct 17, 2019", "text": "very good thing 10 stars !", "stars": 5}, {"date": "Aug 15, 2019", "text": "Does what it says it does, very useful and time saving.", "stars": 5}, {"date": "Jul 23, 2019", "text": "i want to get notification of one gmail not all, i can't find this option", "stars": 2}, {"date": "Feb 5, 2019", "text": "Open source & secure. There are many options for customization if you want to drill down into the settings. Works great! Thank you!", "stars": 5}, {"date": "Jan 24, 2019", "text": "it is great with out hackers", "stars": 5}, {"date": "Jan 23, 2019", "text": "Great to track the spam folder of multiple inboxes. \n\nCheers! :-)", "stars": 5}, {"date": "Jan 6, 2019", "text": "No sure how to make it show in the system tray like the screenshot shows it can be", "stars": 3}, {"date": "Dec 7, 2018", "text": "Very, very necessary - option\n\"Mark as read\"\nwhen opening the letter!\n* then there will be a rating of 5", "stars": 3}, {"date": "Dec 6, 2018", "text": "After deleting the Gmail Checker 4.40 in that it was 'not working' after many years, I tried Gmail notifier 0.9.5. The same traits are exhibited as the icon is 'grayed out'. This occurred after updating to the latest chrome version: 71.0.3578.80. Any assistance is appreciated.", "stars": 2}, {"date": "Nov 27, 2018", "text": "Super!!!", "stars": 5}, {"date": "Nov 26, 2018", "text": "ok yes", "stars": 5}, {"date": "Nov 11, 2018", "text": "good", "stars": 5}, {"date": "Nov 9, 2018", "text": "Doesn't show if there are mails anymore, only shows the 'no unread mails' icon even if there are multiple unread ones.", "stars": 3}, {"date": "Nov 8, 2018", "text": "The last version on Chrome opens \"all mails\" instead of inbox when there are new mails. this was not the case in the previous versions. Looks like a bug to me, and it's quite annoying because when you archive a mail from the \"all mail\" view, you're not redirected anywhere, and still see the archived mail by default. Notifier v0.9.4, Chrome  70.0.3538.77 (Official Build) (64-bit), Windows 7. Hope it will be fixed soon", "stars": 3}, {"date": "Nov 4, 2018", "text": "Pretty solid - Only thing I need to make it 5star is a dark mode, this is only extension that burns my eyes", "stars": 4}, {"date": "Nov 3, 2018", "text": "Have used it for ages and it's faultless and extremely useful.", "stars": 5}, {"date": "Nov 3, 2018", "text": "Best notifier, great features. I can't live without it!", "stars": 5}, {"date": "Nov 1, 2018", "text": "Great Good job. It is working fine", "stars": 5}, {"date": "Oct 23, 2018", "text": "It's amazing. It lets me get on top of emails quickly, lets me know at a glance how many unreads I have, has a convenient little popup instead of loading full Gmail, lets me use multiple accounts, ... I absolutely love it, would recommend it to anyone who uses Gmail.", "stars": 5}, {"date": "Oct 18, 2018", "text": "The best", "stars": 5}, {"date": "Oct 15, 2018", "text": "It is perfectly doing what it intend to do.", "stars": 5}, {"date": "Sep 8, 2018", "text": "The best one out the bunch being using it for 3 years straight, LOVE the Notification sound. 5 Stars for sure.", "stars": 5}, {"date": "Aug 28, 2018", "text": "good", "stars": 5}, {"date": "Aug 23, 2018", "text": "Excelent!!! Thank u for a good mood*****", "stars": 5}, {"date": "Aug 21, 2018", "text": "It'd  be nice to be able to use this in bottom task bar instead of having to keep windows browser open all of the time other then that I think I'll be using this for now Less I find one for task bar", "stars": 5}, {"date": "Aug 17, 2018", "text": "i like the way it tells you the number of email' one has and i like the application itself, it is easy to use and has been around for some time.", "stars": 5}, {"date": "Aug 10, 2018", "text": "Don't work with new native Windows 10 notifications.", "stars": 1}, {"date": "Jul 12, 2018", "text": "Great, monitors 4 accounts, no problems.", "stars": 5}, {"date": "Jul 11, 2018", "text": "ok!", "stars": 5}, {"date": "Jul 4, 2018", "text": "I have just one question. Why does it need access to my search history??", "stars": 4}, {"date": "Jun 24, 2018", "text": "thank you", "stars": 5}, {"date": "Jun 22, 2018", "text": "I was skeptical when I installed it, I wasn't sure if it really works or it is even secure,\nbut after analyzing its code I was amazed!\nIt works efficiently and truly safe.\nThank you who works on this project you are amazing.", "stars": 5}, {"date": "Jun 21, 2018", "text": "Love it.\n\nWould you please add an option in notification to delete instead of archive? or both?", "stars": 5}, {"date": "Jun 19, 2018", "text": "It was the best. It remains the best.", "stars": 5}, {"date": "May 29, 2018", "text": "So nice", "stars": 5}, {"date": "May 27, 2018", "text": "It is so fantastic to me.", "stars": 5}, {"date": "May 18, 2018", "text": "Good one...notifications are quite looks good, easy and in better way of right-bottom corner.", "stars": 5}, {"date": "Apr 18, 2018", "text": "love it...", "stars": 5}, {"date": "Apr 14, 2018", "text": "its perfect plugin for crome!!!", "stars": 5}, {"date": "Apr 9, 2018", "text": "I looked at multiple apps for OSX that could help me manage 3 gmail accounts. Shift, Kiwi, Mia. \n\nWell turns out I was looking in the wrong place, this chrome extension is excellent and has barely any screen or resource footprint.\n\nGreat job!", "stars": 5}, {"date": "Mar 14, 2018", "text": "Saved me from owing money to the library. LOL", "stars": 5}, {"date": "Mar 13, 2018", "text": "good", "stars": 4}, {"date": "Mar 8, 2018", "text": "Notification sound doesn't work.", "stars": 1}, {"date": "Mar 2, 2018", "text": "IT IS THE BEST GET IT VERY HELPFUL IF YOU USE GAMIL A LOT LIKE ME USE IT!! =)", "stars": 5}, {"date": "Jan 19, 2018", "text": "The best for Gmail", "stars": 5}, {"date": "Jan 17, 2018", "text": "Great for multitasking. Best Gmail notifier I used.", "stars": 5}, {"date": "Dec 22, 2017", "text": "Very functional, great job!", "stars": 5}, {"date": "Dec 8, 2017", "text": "Classic view doesn't work :(", "stars": 1}, {"date": "Dec 2, 2017", "text": "Best gmail notifier ever. You guys did a great job. Thanks :)", "stars": 5}, {"date": "Nov 22, 2017", "text": "Bravo. Its work", "stars": 5}, {"date": "Nov 16, 2017", "text": "simple and perfect, thanks", "stars": 5}, {"date": "Nov 5, 2017", "text": "This is my favourite one.", "stars": 5}, {"date": "Sep 30, 2017", "text": "There is no 'do not disturb' feature and it's very difficult to uninstall! Very disappointed--checker plus is much more user friendly.", "stars": 1}, {"date": "Sep 18, 2017", "text": "The best one. Really !", "stars": 5}, {"date": "Aug 14, 2017", "text": "Just does not work!!", "stars": 1}, {"date": "Jun 7, 2017", "text": "The old version was great, why did you spoil the nice application?", "stars": 1}, {"date": "May 25, 2017", "text": "Fine to me!", "stars": 5}, {"date": "May 19, 2017", "text": "STOP opening a preview when I click on the icon!!! What the ...!!! I want to open gmail in a tab and now its 50 50, 50 tab - 50 preview. I did not install it to gamble and try my luck..", "stars": 1}, {"date": "Apr 27, 2017", "text": "from 2 days ago it works for a limited amount of time, and after that gmail just don't load anymore, and is opening a new window asking me to login.\n\nif i reset computer, works again for a limited amount of time. disabling and enabling extension does not fix it.", "stars": 3}, {"date": "Apr 21, 2017", "text": "It hasn't been working recently.", "stars": 2}, {"date": "Apr 19, 2017", "text": "omg dis is good", "stars": 5}, {"date": "Apr 11, 2017", "text": "Most usefull addon for Gmail in all browsers.", "stars": 5}, {"date": "Apr 5, 2017", "text": "ok", "stars": 5}, {"date": "Mar 31, 2017", "text": "soooo good more than 1 year", "stars": 5}, {"date": "Mar 29, 2017", "text": "Much better than Google official one.", "stars": 5}, {"date": "Mar 21, 2017", "text": "Buttons never active whenever I opened it to review inbox.", "stars": 1}, {"date": "Mar 18, 2017", "text": "It just works", "stars": 5}, {"date": "Mar 14, 2017", "text": "Very nice", "stars": 5}, {"date": "Mar 10, 2017", "text": "very good", "stars": 5}, {"date": "Feb 18, 2017", "text": "AMAZING! It works awesome, I use it all the time... I notice I haven't visited gmail.com in 2 months because of this... lol!", "stars": 5}, {"date": "Feb 15, 2017", "text": "I’ve used this extension for years, and I love it. It works like a charm.\n\nThe only issue I have with it is that sometimes, marking an e-mail message as read doesn’t work. Other than that, this is a fantastic extension! I also wish that it marked e-mail messages as read more quickly, though.", "stars": 4}, {"date": "Jan 30, 2017", "text": "Great extension, love it! \nIt'd be great if you could enable keyboard arrow keys ( <-- and --> ) for going through the email list. I don't mind clicking the arrow in popup, just saying that using keyboard is faster :-)\n\nThanks!", "stars": 5}, {"date": "Jan 28, 2017", "text": "Lightweight and simple. Also has nice emails previews and desktop notifications.", "stars": 5}, {"date": "Jan 23, 2017", "text": "works well for me", "stars": 5}, {"date": "Jan 14, 2017", "text": "Gmail Notifier is highly recommended.", "stars": 5}, {"date": "Jan 13, 2017", "text": "Misses notifications.", "stars": 2}, {"date": "Jan 6, 2017", "text": "Makes life easier a lot. Great app.", "stars": 5}, {"date": "Jan 4, 2017", "text": "Really good and it's fast! I like that images are displayed by default.", "stars": 5}, {"date": "Dec 18, 2016", "text": "Very convenient.", "stars": 5}, {"date": "Dec 16, 2016", "text": "Works pretty great so far, lets me skim over my mail quickly, and leave mail unread for later without much fuss. It's very helpful for me that it lets me manage all my e-mail accounts in a very compact size, with very straightforward buttons (reply, mark as read, delete, spam, etc).", "stars": 5}, {"date": "Dec 11, 2016", "text": "love it", "stars": 5}, {"date": "Dec 11, 2016", "text": "most wanted", "stars": 5}, {"date": "Dec 8, 2016", "text": "Not bad. I'm happy to use it", "stars": 5}, {"date": "Dec 6, 2016", "text": "I used to like it when you clicked it and it immediately opened Gmail. Now when you click it opens a preview window and I have to hunt for a G and then click that in order to get directly to my email. Once was good, now I am going to have to delete it", "stars": 1}, {"date": "Nov 30, 2016", "text": "I don't like that it has auto-detect features. I want to manually add the accounts I want it to keep tabs on.", "stars": 1}, {"date": "Nov 10, 2016", "text": "Best gmail notifier I have tried. I'm glad that it's available for all my browsers.", "stars": 5}, {"date": "Oct 21, 2016", "text": "I don't like it", "stars": 1}, {"date": "Sep 18, 2016", "text": "Hi!  They updated this extension and since then I can not open the inbox from  clicking om the G to go inbox does nor respond anymore,please fix this bug! http://prntscr.com/cjf3m1\n\n@InBasic Co : Thanks!  the new update  0.6.7 fixed this issue ! Now it works to go to Inbox (G) ! Awesome!", "stars": 4}, {"date": "Sep 3, 2016", "text": "Good.", "stars": 4}, {"date": "Aug 25, 2016", "text": "i liked this notifier other than related extensions. works like charm.", "stars": 5}, {"date": "Aug 20, 2016", "text": "I've been using this awesome extension for a year but recently it started showing sometimes just from: from: from: from: fields, though \"Notification format\" is set up correctly.", "stars": 3}, {"date": "Aug 11, 2016", "text": "The most useful", "stars": 5}, {"date": "Aug 8, 2016", "text": "Deserve to have a better score than G Hangouts and Gtalk.", "stars": 5}, {"date": "Jul 12, 2016", "text": "Best app", "stars": 5}, {"date": "Jul 9, 2016", "text": "I may be missing something here and if so, I apologize, but I can't seem to find where someone can \"Reply\" to emails. Gmail Notifier, or some previous iteration of it that I had in the past, would let you reply to the email without having to navigate away from what you're doing and go about your merry way. Now you have to open a separate tab to go into your inbox and reply there, which is half the reason for getting this. Again maybe this is a pro feature or something but if that's the case t... Show more", "stars": 2}, {"date": "Jun 19, 2016", "text": "This is awesome.  Promptly displays new mail when it comes in, even on multiple accounts, previews are handly, actions without having to even open Gmail are even more handy!  Love it!", "stars": 5}, {"date": "Jun 4, 2016", "text": "If default zoom page = 150%, if click expand mail, then ext. is useless. I can't extend this window in ext. options", "stars": 1}, {"date": "May 31, 2016", "text": "WAS good. Having to many issues with Chrome OS. Incoming notifications can literally cause a screen freeze if running another app. It's been this way for months.", "stars": 1}, {"date": "May 27, 2016", "text": "marks readed is not working", "stars": 2}, {"date": "May 19, 2016", "text": "Good job on this", "stars": 5}, {"date": "Apr 25, 2016", "text": "awesome extention :)", "stars": 5}, {"date": "Apr 21, 2016", "text": "Fantastic! Does more than i expected. Satisfies all my needs and easy to use!!!", "stars": 5}, {"date": "Apr 9, 2016", "text": "Needs an update, trash doesn't work\n\nStop the inbox redirect and it will start working again.", "stars": 5}, {"date": "Apr 7, 2016", "text": "Simple, fast, reliable... Thanks", "stars": 5}, {"date": "Mar 31, 2016", "text": "Good Idea", "stars": 5}, {"date": "Mar 18, 2016", "text": "can i open inbox instead gmail?", "stars": 5}, {"date": "Feb 25, 2016", "text": "Top!", "stars": 5}, {"date": "Feb 9, 2016", "text": "Overall simple to use, but one behavior of the extension really bugs me: when I click on an email subject to go to that email in GMail, the 'All Mail' label (non-label really) is opened instead of the 'Inbox' label. This is annoying if you delete the email, for instance and GMail warns about permanent deletion, or you archive the email and find yourself looking at all the other emails you've archived instead of your trimmed-down Inbox.", "stars": 4}, {"date": "Feb 7, 2016", "text": "Very good, nice extension", "stars": 5}, {"date": "Feb 6, 2016", "text": "Excellent! I recommend! Very useful function „Mark as read” . Save time. Open your email only if necessary.", "stars": 5}, {"date": "Jan 24, 2016", "text": "very convenient,thanks.", "stars": 5}, {"date": "Jan 19, 2016", "text": "Always come back to this extension, it's super simple and non-intrusive while working like a charm.", "stars": 5}, {"date": "Jan 12, 2016", "text": "ok", "stars": 3}, {"date": "Jan 1, 2016", "text": "super...", "stars": 4}, {"date": "Dec 18, 2015", "text": "Amazing. I noticed that you can't open attachments. Tried a .docx file.", "stars": 5}, {"date": "Dec 13, 2015", "text": "Awesome helped me a lot.Thanks", "stars": 5}, {"date": "Nov 22, 2015", "text": "azizi1aba2@gmail.com\nyes", "stars": 5}, {"date": "Oct 26, 2015", "text": "do not work", "stars": 1}, {"date": "Oct 19, 2015", "text": "I haven't written a review before but I feel compelled -- having downloaded every gmail extension on the planet I am thrilled to have finally found one that works with multiple accounts using a simple interface. I can monitor 3 gmail addresses and respond in the small pop-up window if I choose. Great extension!!!!!", "stars": 5}, {"date": "Oct 16, 2015", "text": "totally realtime !! And it does exactly what it says on the tin", "stars": 5}, {"date": "Oct 8, 2015", "text": "This extension is awesome\n\nOr, make this extensions theme material...", "stars": 5}, {"date": "Sep 27, 2015", "text": "The best checker ever!", "stars": 5}, {"date": "Sep 16, 2015", "text": "The best gmail notifier for me, first came across it on firefox.", "stars": 5}, {"date": "Sep 14, 2015", "text": "WOW! GREAT!\n\n...except for the dev not explaining the permission to read browser history. Would have given it 5/5 without that permission.", "stars": 1}, {"date": "Sep 10, 2015", "text": "Love this extension 98% of the time. Dislike that when updates happen my settings get reset to default. also when a secondary account's login expires there is no notification and sometimes it defaults to locating/opening a gmail tab.\n\nTHE QUESTIONS ABOUT THE PERMISSIONS ARE ANSWERED ON HIS GITHUB ISSUES PAGE.", "stars": 4}, {"date": "Aug 24, 2015", "text": "I loved this extension until new permissions were requested - change your data and read your browse history?! Too much.", "stars": 1}, {"date": "Aug 23, 2015", "text": "Was pretty good until the new permissions. I dont see any reason for this accessing browser history.", "stars": 1}, {"date": "Aug 19, 2015", "text": "Newest version can read and change your email and read your browsing history.\nNo thanks", "stars": 1}, {"date": "Aug 18, 2015", "text": "As everyone else said, knowing why the additional permissions would be required would be a minimum.\nLatest code on Github is for version 0.5.1, so we can't know what changes were made since then.\nDisabling until we know.", "stars": 1}, {"date": "Aug 15, 2015", "text": "Removed. I dont alow read browsing history", "stars": 1}, {"date": "Aug 12, 2015", "text": "Gave it three stars due to functionality but the new permissions it's requesting makes me uncomfortable and I believe are a mistake on the developer's part (find another way or do not include the \"feature\" that requires this).\nThe current version 0.5.7.1  also keeps forcing Gmail to flip to the Primary tab, which is very annoying.  I need to look for another add-on with similar functionality.", "stars": 3}, {"date": "Aug 11, 2015", "text": "Have used this and like it for quite a while, but not giving it permission to modify my data. Have removed it.", "stars": 1}, {"date": "Aug 9, 2015", "text": "Newest version can read and change your email and read your browsing history - don't care how convenient this app may be, how can anyone be comfortable with that?", "stars": 1}, {"date": "Aug 6, 2015", "text": "So now Chrome disabled it due to Gmail Notifier being able to, \"Read and change all your data on the websites you visit\".\nWhat the hell? why the permissions change?", "stars": 3}, {"date": "Jul 31, 2015", "text": "Very very useful, and does its job well. All it needs is more customization options and it'll be perfect.", "stars": 5}, {"date": "Jul 13, 2015", "text": "Does what it says, but I would like to be able to place it in the task bar, instead of the browser, so that I don't have to open the browser window to check for new emails. Also, popups with a preview would be nice. Just like the original notifier pro.", "stars": 3}, {"date": "Jun 28, 2015", "text": "convenient, will never miss very important mails anymore.just as i hope and expect it to be.", "stars": 4}, {"date": "Jun 24, 2015", "text": "excellent!", "stars": 5}, {"date": "Jun 18, 2015", "text": "Perfect extension!!!!", "stars": 5}, {"date": "Jun 7, 2015", "text": "Awesome!", "stars": 5}, {"date": "May 29, 2015", "text": "One feature I felt was missing was with the desktop notifications.\n\nWould really like the ability to click a notification and open it up in the main inbox or, like gmails built in notifications, opens the email in a new window.\n\nOverall, really happy with the extension, my main attraction to it was receiving notifications even without a chrome window open.", "stars": 4}, {"date": "May 23, 2015", "text": "Save me a lot of time.", "stars": 5}, {"date": "Apr 25, 2015", "text": "Very helpful", "stars": 5}, {"date": "Apr 17, 2015", "text": "just want a simple pop up", "stars": 1}, {"date": "Apr 3, 2015", "text": "Simply it is incredible :)", "stars": 5}, {"date": "Mar 31, 2015", "text": "Really love it, because it notifies me when i have new mail. Its a great app", "stars": 5}, {"date": "Mar 25, 2015", "text": "This app is great!  Really helps me keep up with incoming emails!", "stars": 5}, {"date": "Mar 18, 2015", "text": "gut", "stars": 4}, {"date": "Feb 9, 2015", "text": "Perfect my need!!!\nThanks alot.", "stars": 5}, {"date": "Feb 9, 2015", "text": "I want notification icon HERE: \nControl Panel\\\nAll Control Panel Items\\\nNotification Area Icons\npls pls pls pls ! :)", "stars": 5}, {"date": "Jan 14, 2015", "text": "I love the concept and it generally works great but I took a star off for it's occasional unresponsiveness.", "stars": 4}, {"date": "Jan 13, 2015", "text": "this app is lovely, i really like it, because its really working well on my system", "stars": 4}, {"date": "Jan 8, 2015", "text": "Exelent!", "stars": 5}, {"date": "Dec 21, 2014", "text": "Great App", "stars": 4}, {"date": "Dec 11, 2014", "text": "You can't directly reply to emails in one-click, but I found it very useful and it notifies in real time.", "stars": 5}, {"date": "Dec 10, 2014", "text": "Really good, just needs one button - ability to MOVE mail to selected folder without opening Gmail. It would be perfect.", "stars": 4}, {"date": "Oct 31, 2014", "text": "It would be so much better if it would let us REPLY to an email.", "stars": 3}, {"date": "Oct 25, 2014", "text": "good, but the latest update wont let me ad extra gmail accounts like it did before", "stars": 4}, {"date": "Oct 8, 2014", "text": "Not bad. Doesn't format emails very well in the preview - no text or line breaks.\n\nDoesn't have any options on the pop up notifications, so you can't archive. Only open up the gmail tab which is time consuming just to get rid of junk email.", "stars": 3}, {"date": "Oct 7, 2014", "text": "Have tried other Gmail notifiers that only worked sporatically and weren't that helpful. This one works perfectly. A simple tool to monitor and manage your new Gmails no matter what web page you're on. It is free but I would pay for this one!", "stars": 5}, {"date": "Oct 5, 2014", "text": "the old mail checker rocked but it quit working correctly, this one works right so it's awesome", "stars": 5}, {"date": "Sep 27, 2014", "text": "AWESOME!\n Reasons:\n\n  -Allows readable Gmail\n   in extension\n\n  -Perfect for business", "stars": 5}, {"date": "Sep 18, 2014", "text": "It usually stops working and the extension button don't respond upon clicking!\n\nBecause I love this extension, I have to constantly remove and add it to keep going!", "stars": 3}, {"date": "Sep 14, 2014", "text": "Awesome notifier for new emails, and for quick actions.", "stars": 5}, {"date": "Aug 18, 2014", "text": "Stable, lightweight and featureful extension", "stars": 5}, {"date": "Aug 13, 2014", "text": "Worked for one account. Adding an account supposedly ads to this extension, but mine was already added. I clicked on my already added secondary account so both email pages were up on two tabs in Chrome. Closed them. Clicking the extension icon just brought up my primary email. No options when clicking it to see what accounts are added. No option to create a new email from either account.  Not as useful as it could be even if it did work.", "stars": 2}, {"date": "Aug 4, 2014", "text": "Does not support HTML in mail preview :(", "stars": 4}, {"date": "Jul 24, 2014", "text": "My favorite GMail notifier", "stars": 5}, {"date": "Jul 23, 2014", "text": "It doesn't work with my primary e-mail, which is the reason I added it to Chrome!", "stars": 1}, {"date": "Jul 23, 2014", "text": "Works great. I use it every minute of everyday. I know on my desktop computer, within 1 minute of any email arriving in my inbox. No longer do I find out 1 hour later that I have an email reply awaiting my response. It's made me more productive to be more responsive.", "stars": 5}, {"date": "Jul 15, 2014", "text": "Best notifier out there.", "stars": 5}, {"date": "Jul 10, 2014", "text": "awesome.", "stars": 5}, {"date": "Jul 1, 2014", "text": "Not ideal yet, but still the best extension of its kind.", "stars": 5}, {"date": "Jun 28, 2014", "text": "Used to work great, but lately it's been flakey and not working 100% of the time. Email notification sound also is hit or miss, was never a problem a few months ago. Forced to look for something else now.", "stars": 3}, {"date": "Jun 18, 2014", "text": "Best email handling extension for gmail.", "stars": 5}, {"date": "Jun 3, 2014", "text": "Didn't work for me :(", "stars": 1}, {"date": "May 29, 2014", "text": "To date this and other Notifiers are useless and  simply fail to notify at all. Yes its install, yes reboot, yes the sound on ...restart browser..tried using four  browsers including chrome. One should NOT have to good to such length at all and still fail. How many more Notifier must one try for success?", "stars": 1}, {"date": "May 28, 2014", "text": "Very nice and much better than the over-complicated (and occasional Chrome crashing) \"Checker Plus for Gmail™\" extension. A little harder to configure, though, but the much less bloat is still better.\n\nIt just needs quick reply ability in the popup to be 5-star superior to the other.", "stars": 4}, {"date": "Apr 11, 2014", "text": "Finally a good notifier for Chrome...", "stars": 5}, {"date": "Apr 10, 2014", "text": "Wonderful app for G-mail notifications....I love it...", "stars": 5}, {"date": "Mar 3, 2014", "text": "Better than checker plus. Checker plus is a crap.", "stars": 5}, {"date": "Feb 5, 2014", "text": "Great extension! \nIt works perfectly, it will be very useful for my work. \nMany thanks to the developer ... I hope that my English is not so bad!", "stars": 5}, {"date": "Jan 14, 2014", "text": "Pls, add a buttons:\n1. email_body font-size\n2. Send page link", "stars": 4}, {"date": "Jan 6, 2014", "text": "Excellent.  I've tried many Gmail Notifiers all were lacking or over complicated.  This one is perfect.", "stars": 5}, {"date": "Jan 2, 2014", "text": "I like it, it so clean and simple.", "stars": 5}, {"date": "Dec 8, 2013", "text": "Won't notify me of incoming mail", "stars": 1}, {"date": "Nov 26, 2013", "text": "Like it a lot. Slicker and less obtrusive than the others I use. Only thing I personally miss from other extensions that do the same thing... is the ability to mark mail as Read WHEN the archive button is pressed.", "stars": 4}, {"date": "Nov 8, 2013", "text": "Great Tool in the Chrome and especially in the Fox Browser too, but when in Opera15.x (new Generation) installed, it works in Parts incorrectly.\n\nCan it possibly be repaired, to get full 5 Stars from the Opera Users? ...", "stars": 4}, {"date": "Oct 15, 2013", "text": "Excellent, just could have different notifier sounds, but let you add by yourself.", "stars": 5}, {"date": "Sep 15, 2013", "text": "Better than you expect.", "stars": 5}, {"date": "Sep 2, 2013", "text": "Quick and to the point as it does what it needs to!", "stars": 5}, {"date": "Aug 19, 2013", "text": "Perfect!", "stars": 5}, {"date": "Aug 15, 2013", "text": "perfecto, just perfect", "stars": 5}, {"date": "Aug 3, 2013", "text": "A brilliant extension for me.", "stars": 5}, {"date": "Jul 9, 2013", "text": "Fantastic!!!!!", "stars": 5}, {"date": "Jun 26, 2013", "text": "working but needs some time to use it, not such clear", "stars": 4}, {"date": "Jun 24, 2013", "text": "I love this little addon. It is easy to customize, and gives me a nice preview of an email, allowing me to delete right from my toolbar (simply click on the toolbar icon when you have an email), so I don't ever log in to my Gmail to delete emails I didn't really need to read.", "stars": 5}, {"date": "Jun 17, 2013", "text": "Loved the label specific notification.\n\nNice job", "stars": 5}, {"date": "Jun 15, 2013", "text": "very good, simple and easy as I wanted it to be....", "stars": 5}]