[{"text": "It's nice, but outdated and abandoned.\nIf you want something more powerful, try SuperDev Pro.", "stars": 3, "date": "Dec 17, 2023"}, {"text": "Great work by developer. Much needed App", "stars": 5, "date": "Nov 28, 2023"}, {"text": "great tool but how can I make the fontsize of popup box a little bigger?", "stars": 4, "date": "Sep 7, 2023"}, {"text": "Pretty helpful, to copy you need to click F to freeze the screen then copy it.", "stars": 5, "date": "Feb 18, 2023"}, {"text": "It'a all great, but the modal is to close to an inspected object, so sometimes you can see well", "stars": 4, "date": "Dec 4, 2022"}, {"text": "gooood", "stars": 5, "date": "Jun 15, 2022"}, {"text": "The fonts for the css values are (yellow color) on my (white background page), this makes it imposible to see the details.", "stars": 1, "date": "Jun 3, 2022"}, {"text": "I use this all the time when creating websites. Extremely useful. Thank you so much. God Bless. :)", "stars": 5, "date": "Nov 24, 2021"}, {"text": "Very useful CSS viewing tool with the ability to copy the structured CSS. Very interactive and easy to use.", "stars": 5, "date": "May 9, 2021"}, {"text": "how do i make the pop up box stay still so i can copy one of the items?", "stars": 3, "date": "Mar 8, 2021"}, {"text": "Awesome extension!  It really saves me from having to \"inspect\" objects.  Everyone in my office now has it installed.  If you really need something to do, let us modify the page CSS from your CSS popup :)  Helps test CSS changes in-place.", "stars": 5, "date": "Jul 6, 2020"}, {"text": "Best free alternatie for Hover  and CSS Inspector. Great Job", "stars": 5, "date": "Jun 24, 2020"}, {"text": "It won't work if the web elements are inside the frame ?", "stars": 4, "date": "Apr 26, 2019"}, {"text": "This is my first time I logged in to leave a review. Thank you for making this program. \nIt is very useful and helpful when I'm studying. <3", "stars": 5, "date": "Dec 24, 2018"}, {"text": "Great tool....\n\nWould be great if there were a way to invoke it with a keyboard shortcut", "stars": 4, "date": "May 25, 2018"}, {"text": "Very understandable, code is well written!", "stars": 5, "date": "May 17, 2018"}, {"text": "Excellent!", "stars": 5, "date": "Nov 4, 2017"}, {"text": "Great Extension. Useful for front end developers.", "stars": 5, "date": "Nov 1, 2017"}, {"text": "Awesome app! Great for use as a quick and easy resource. I recommend giving it a try.", "stars": 5, "date": "Oct 25, 2017"}, {"text": "Does exactly what you expect it to.", "stars": 5, "date": "Sep 12, 2017"}, {"text": "The Bomb!", "stars": 5, "date": "Aug 17, 2017"}, {"text": "I like it", "stars": 5, "date": "Aug 17, 2017"}, {"text": "best extension...option to copy element and sub element name to clipboard should be given", "stars": 5, "date": "Aug 16, 2017"}, {"text": "good", "stars": 5, "date": "Jan 15, 2017"}, {"text": "it is good for webdesigners", "stars": 4, "date": "Dec 19, 2016"}, {"text": "Really cool", "stars": 5, "date": "Aug 28, 2016"}, {"text": "Good for a quick snapshot of an element, but could be great with these features :\n- show inheritance and override (I'm looking at you !important)\n- on element click, freeze infos popup and limit its height (on a small screen and with a lot of css properties, we can't read whats below our screen ;) ).", "stars": 3, "date": "Jun 27, 2016"}, {"text": "Fantastic. It has a few bugs in display when the page changes however it was the first tool taht i was able to see what class was on a div within a panel that disappeared whenever it lost focus (IE when I opened dev tools, it was removed from the dom)", "stars": 5, "date": "Mar 22, 2016"}, {"text": "not bad", "stars": 4, "date": "Mar 21, 2016"}, {"text": "Whether the future will increase the replication?", "stars": 5, "date": "Jan 18, 2016"}, {"text": "Its works good though it dosen't display most of the properties unless you reload the page and it works only on  http and https pages, the others it dosen't support.", "stars": 4, "date": "Nov 9, 2015"}, {"text": "Work fine, but when CSS Styles has a lot of properties don't display completly, I tryed right clic and option of extension but just display the uncomplete css.", "stars": 3, "date": "Oct 29, 2015"}, {"text": "Excellent and most useful tool!", "stars": 5, "date": "Sep 9, 2015"}, {"text": "like", "stars": 5, "date": "Feb 13, 2015"}, {"text": "good", "stars": 5, "date": "Jan 21, 2015"}, {"text": "ok", "stars": 5, "date": "Dec 20, 2014"}, {"text": "Ain't working. Was looking good, but ...\nAfter reinstall was working nice. But still need a few updates!", "stars": 3, "date": "Oct 29, 2014"}, {"text": "This was really Good tool. Today it has stopped completely :( Hope the developer update the app soon.", "stars": 1, "date": "Oct 13, 2014"}, {"text": "I like how the properties are organized, but it's a little bit frustrating that sometimes the pop-up is bigger than the screen and you can't see all the properties.", "stars": 4, "date": "Sep 28, 2014"}, {"text": "Good CSS Plugin", "stars": 5, "date": "Sep 5, 2014"}, {"text": "Great Extension, but some case it position is not correct... getting hidden by the browser menu", "stars": 5, "date": "Sep 2, 2014"}, {"text": "Really helpful", "stars": 5, "date": "Sep 2, 2014"}, {"text": "I cann't see the text clearly. also it is not showing css format", "stars": 4, "date": "Jun 24, 2014"}, {"text": "Appriciate... Nice addon but not working on popups..\nI thought it is hidden behind the popup please fix thanks in advance", "stars": 3, "date": "Jun 10, 2014"}, {"text": "rally great tool awesome !!!!!!!!!!!!!!!!!", "stars": 5, "date": "Mar 25, 2014"}, {"text": "so helpful :)", "stars": 5, "date": "Mar 12, 2014"}, {"text": "Nice addon.. Really helpful for me.\nGreat work developers (Y)", "stars": 5, "date": "Oct 22, 2013"}, {"text": "Good extebsions the most of the time, but if you want to check something on the top of the screen : it is impossible because the info is displayed under the window (needs to be in modal !)", "stars": 3, "date": "Oct 19, 2013"}, {"text": "hi", "stars": 3, "date": "Oct 3, 2013"}, {"text": "Amazing!", "stars": 5, "date": "Jul 23, 2013"}, {"text": "Nice application, but it would be nice if you could copy the CSS!", "stars": 4, "date": "Jun 2, 2013"}, {"text": "Nice try (this IS essentially a ~3 year old app), but DevTools does the same thing, and that without obscuring the outlines of the very things it's outlining. One irritating thing: this popout just follows your cursor around the page, there's no way to freeze it so you can go do something based on the info from where you froze it. I'd think this should be an obvious feature; a given.", "stars": 3, "date": "Jun 2, 2013"}, {"text": "It's nice but I can't see on which line the css code is.\n\nIf the css line would be shown too this would be a very nice app!!\n\nan app the be loved :D\n\nso please add this feature! :)", "stars": 4, "date": "Jun 2, 2013"}, {"text": "Very useful extension.\nCheers", "stars": 5, "date": "Apr 14, 2013"}, {"text": "So Good,quite useful", "stars": 5, "date": "Apr 11, 2013"}, {"text": "Works great - but without ability to copy it is not very helpful.", "stars": 3, "date": "Feb 20, 2013"}, {"text": "Highly Recommended for noob designer like me! 5 Stars! Thank you!", "stars": 5, "date": "Feb 17, 2013"}, {"text": "Simple, but brilliant!", "stars": 5, "date": "Sep 10, 2012"}, {"text": "I LOVE THIS ADD-ONS!", "stars": 5, "date": "Apr 19, 2012"}, {"text": "Great!", "stars": 5, "date": "Mar 24, 2012"}, {"text": "Great! I've found it very useful, but it'd be neat if you could make the box surrounding the info change size depending on how much info there is to display/ Otherwise, very solid app!", "stars": 5, "date": "Mar 10, 2012"}, {"text": "Thank you so much for porting this over!", "stars": 5, "date": "Feb 27, 2012"}, {"text": "I can see the web css,But I don't know how can i save it.", "stars": 3, "date": "Feb 23, 2012"}, {"text": "I love this extension and wish I could continue to use it, but I really have an issue with what I read in the details section:\n\nThis extension can access:\nYour data on all websites\n\nThis item can read every page that you visit -- your bank, your web email, your Facebook page, and so on. Often, this kind of item needs to see all pages so that it can perform a limited task such as looking for RSS feeds that you might want to subscribe to.\n\nCaution: Besides seeing all your pages, this item could... Show more", "stars": 4, "date": "Oct 26, 2011"}]