[{"text": "Works like a charm! Thank you!\n\nPlease add Blacklisting as well so we can use it with specific sites.\n\nUpdate: 8/2/2024\nUnfortunately the extension stopped working altogether.\n\nUpdate 10/3/2024\nDeveloper has fixed the issues, now working well again.", "stars": 5, "date": "Jan 15, 2024"}, {"text": "It is amazing I was having trouble on twitch and it worked filtered it all thank you so so much", "stars": 5, "date": "Dec 28, 2023"}, {"text": "Nice", "stars": 5, "date": "Nov 19, 2023"}, {"text": "Damn nice job you did here, can you make it work on videos ?", "stars": 5, "date": "Oct 17, 2023"}, {"text": "It don't work on twitter", "stars": 4, "date": "Jun 21, 2023"}, {"text": "I tried this filter out by just using the keyword p*rn, and it does block a good amount of the images fairly well, but a lot of pictures get past the filter. If you're trying to block everything, I wouldn't suggest this extension. Also it doesn't censor videos at all, so I would look elsewhere.", "stars": 1, "date": "Jun 5, 2023"}, {"text": "I just wrote porn like in the thumbnail to see if it works and I now need bleach! I have been scarred for my life.", "stars": 1, "date": "Jun 3, 2023"}, {"text": "It's nice. I use this extension and vRate at the same time to cover the most range. \n\nFeature suggestion: this should also work on mobile on the Kiwi browser.", "stars": 4, "date": "May 7, 2023"}, {"text": "It screws with Etsy product pages, it shows the images on the right side of the page, covering all the details on the listing.", "stars": 3, "date": "Mar 23, 2023"}, {"text": "I love it as it censors all my stuff as I'm already caged up and feeling horny as my mistress told me to get it and I obeyed her as I've now got parent lock and censored content on my devices now.\n\nJust wish it censored discord pics as well but hopefully see that in future <3", "stars": 5, "date": "Mar 19, 2023"}, {"text": "awesome extension!!!", "stars": 5, "date": "Jan 8, 2023"}, {"text": "I have found several add-ons with the same feature, but I think it is the best of them. I hope more development for this add-on _ and thank you very much for this add-on and for this excellent work:\nPositives :\nThe add-on is completely free\n_Artificial intelligence in blocking photos\n_ speed in blocking\n_Ability to adjust the strength of the ban\n_ Respect for the privacy that the add-on enjoys, as the developer mentioned (knowing that the extension displays the banned number, I don't know if ... Show more", "stars": 5, "date": "Jul 30, 2022"}, {"text": "Honestly, it really does work, very well. No other filters compare fairly. It doesnt block every single picture but it really blocks so much more than other filters, anyway. I'm sure with this, i dont have to worry about inappropriate surprises. Thanks for this!", "stars": 5, "date": "May 5, 2022"}, {"text": "Best extension on the store", "stars": 5, "date": "Apr 30, 2022"}, {"text": "Misses so many images. There must be an option for making the nudity detection stronger (way stronger, it almost filters 20 percent of the explicit results, Maybe).", "stars": 2, "date": "Oct 27, 2021"}, {"text": "Working very well so far but there are a lot of false positives being hidden. Could also be because of the 100% strictness but I want to make sure to remove/hide as much as possible. I've also noticed some visual glitches when having more than one browser instance open with one playing a twitch-livestream but nothing major. (I'm using Chrome) I hope there will be more tweaks/updates in the future to make it more accurate with better trained AI.", "stars": 4, "date": "Sep 28, 2021"}, {"text": "Nothing works as I expect. It blocks many images as false-positive and also can't block many images containing full nudity.", "stars": 1, "date": "Jun 26, 2021"}, {"text": "thxs ,very good", "stars": 5, "date": "Jun 20, 2021"}, {"text": "it did filter most of the nsfw images but it didn't block all even when I turned the extension's filter strictness to max", "stars": 3, "date": "Apr 26, 2021"}, {"text": "Okish, doesn't particularly work. It blocks \"live action\" NSFW content well enough, but the AI has a hard time detecting animated/cartoony NSFW content. Until that gets fixed, I think I'll go with a different blocker extension.", "stars": 3, "date": "Mar 27, 2021"}, {"text": "Ohhh!!! great work @Navendu", "stars": 5, "date": "Mar 19, 2021"}, {"text": "If it hides 10 images, 5 are SFW male faces, 4 are SFW female faces, and 1 can be correct work. I think you should correct the AI engine.", "stars": 2, "date": "Jan 26, 2021"}, {"text": "It did filtered some NSFW, but not all.", "stars": 3, "date": "Jan 11, 2021"}, {"text": "idk which websites it's supposed to work on but i've literally searched the images tagged as porn (on a non-google search engine) to check if it works and apparantely it doesn't", "stars": 1, "date": "Dec 30, 2020"}, {"text": "Doesn't work", "stars": 1, "date": "Dec 9, 2020"}, {"text": "doesnt block reddit nsfw", "stars": 2, "date": "Dec 8, 2020"}, {"text": "This is helping me a lot thank you bro for making this", "stars": 5, "date": "Nov 5, 2020"}, {"text": "So far very good. However, I have a question. 100 is the highest filter strictness right? Or is it the lowest strictness?", "stars": 5, "date": "Nov 1, 2020"}, {"text": "Nice", "stars": 5, "date": "Oct 21, 2020"}, {"text": "Yeah it's great from now :D", "stars": 5, "date": "Oct 2, 2020"}, {"text": "great", "stars": 5, "date": "Sep 4, 2020"}, {"text": "Really awesome! Works really well", "stars": 5, "date": "Sep 2, 2020"}, {"text": "I'm developer of this extension, obviously, its awesome :D", "stars": 5, "date": "Sep 2, 2020"}, {"text": "Nice application. Sometimes it blocks non-NSFW images but overall okay. Thank the team for the extension!", "stars": 5, "date": "Aug 31, 2020"}, {"text": "Not perfect, but does the work.", "stars": 4, "date": "Aug 25, 2020"}, {"text": "it should check recursive images, such as in facebook comments threads.\nit seemed like it didn't work on the image thumb till I opened it, would be better if it can classify even the thumbnails. and it has some issues with reshowing the images sometimes, ps. facebook pfps (sfw ones).\nother than that, I can't be grateful enough.", "stars": 4, "date": "Aug 24, 2020"}]