[{"text": "It doesn't work on kiwi Android browser", "stars": 4, "date": "Jan 17, 2024"}, {"text": "It's a very good start. I'm looking forward to seeing where this project goes. For people like me who use Ungoogled Chromium, this is a must-have!", "stars": 5, "date": "Nov 24, 2023"}, {"text": "Hello, is there a solution to the error I get when using Edge browser?\n\n\"Couldn't get bookmark properties URL is invalid or webpage data could", "stars": 4, "date": "Nov 18, 2023"}, {"text": "its work but i disable it and when i enable it is delete my bookmarks", "stars": 2, "date": "Oct 1, 2023"}, {"text": "Only works on old Android phones. I have a Galaxy Note 20, three years old and its not old enough. Uninstalling. Useless.", "stars": 1, "date": "Jul 14, 2023"}, {"text": "Best browser synchronisation tool!", "stars": 5, "date": "Jun 2, 2023"}, {"text": "I strongly recommend adding a Chinese version. Thanks.", "stars": 4, "date": "Apr 7, 2023"}, {"text": "Everytime i want to add anything to bookmark i get sync error. I lost half a year of bookmarks by that.", "stars": 1, "date": "Apr 6, 2023"}, {"text": "Read all your bookmarks by DEFAULT. Which means sync replaces ALL of them. So if you want a link to appear in your another browser you MUST have all other bookmarks the same!! \nOtherwise, sync will replace all the bookmarks with the ones you first install the app\nMy bookmarks are gone now, thank you!", "stars": 1, "date": "Mar 27, 2023"}, {"text": "Best part about it is that is encrypted and can be selfhosted.", "stars": 5, "date": "Mar 6, 2023"}, {"text": "This is excellent but you do need to understand what you're doing before going ahead. It does give warnings. I've used it for years and not lost anything so far. Thanks.", "stars": 5, "date": "Feb 1, 2023"}, {"text": "CHROME >>> EDGE sync worked flawlessly despite not being officially supported, caveats to follow:\n1. ALWAYS BACKUP your stuff before installing any extension...duh!\n2. WARNING: reading other reviews it seems people think it will merge the new bookmarks into the old bookmarks and this is NOT the case you are copying from your first installed instance Thats this browser right here you are about to install on and create your sync ID. To whatever target you want to move your bookmarks to then you... Show more", "stars": 5, "date": "Nov 30, 2022"}, {"text": "You lose data. A big no no!.  You lose data in a way backup can't really help. Sometimes you just lose a few links sometime entire folders. You don't even know you lost it until after several days when you look for that link. Even if you take regular backups. It is too cumbersome to figure out which got lost where and trying to do a recovery. It shouldn't be hard to design something that will not lose data. If in doubt, dont sync and throw a warning and let the user decide.", "stars": 2, "date": "Nov 12, 2022"}, {"text": "I'm hoping for something that I can add a few bookmarks to, not something that automatically reads all my junk.", "stars": 2, "date": "Oct 17, 2022"}, {"text": "syncs all my bookmarks across all me devices and web browsers (I use more than a few). I especially like how it integrates with the bookmarks bar and works as per normal. I used my main browser first to sync then turn of browser sync so it only syncs through app, after this I install extension on all web browsers and mobile app, it just works. well done to all people involved in this project.", "stars": 5, "date": "Oct 15, 2022"}, {"text": "Great synce browser in market, but there is BUG it's duplicate bookmark many time got a lot of same bookmark in toolsbar\n\nPlease solve it.\n\nTHANKS.", "stars": 1, "date": "Oct 3, 2022"}, {"text": "Ditched the extension as it currently only supports bookmarks sync.\nSo no sync for opened tabs or tab groups. Also no support for Opera browser.\nI will come back eventually if these features have been added.", "stars": 2, "date": "Aug 19, 2022"}, {"text": "Fails to sync regularly on Mac Chrome. Then the Windows chrome machine ends up with duplicate links in favourites bar. Just gave up in the end.", "stars": 2, "date": "Jun 23, 2022"}, {"text": "Nice plug-in，But you need a Chinese language", "stars": 4, "date": "Jun 19, 2022"}, {"text": "I've been wanting something like this but had no idea it already existed ❤️\n\nHard to use Edge all the time and then use my phone with Chrome and not have the same stuff.\n\nI hope more things get added like tabs, history, site data, etc.", "stars": 5, "date": "Jun 1, 2022"}, {"text": "How to sync? I'm so confused rn", "stars": 2, "date": "May 19, 2022"}, {"text": "It was a great alternative to the now defunct Xmarks, but it has begun to cause a lot of trouble syncing between Chrome and Firefox, at least on Linux; removing duplicate bookmarks with other extensions makes xBrowserSync overwrite the cleaned-up local bookmarks with the \"dirty\" online bookmarks.\nThis process becomes unavoidable, memory-consuming (to the point of OOM, crashing both browsers), and has rendered the extension unusable for me, at the risk of losing previous bookmarks.\n\nIt was wel... Show more", "stars": 3, "date": "May 9, 2022"}, {"text": "This extension isn't worth the time it took to write this review.", "stars": 1, "date": "Apr 5, 2022"}, {"text": "Sure you can find other ones that will take your data and all along with them. This is only one that is open source, no identifying info or anything. Just encryption key and sync chain", "stars": 5, "date": "Mar 29, 2022"}, {"text": "STAY FAR AWAY FROM THIS EXTENSION IF YOUR BOOKMARKS MEAN ANYTHING TO YOU. This extension utterly and completely destroyed my bookmarks in vivaldi. I DID NOT EVEN HAVE TIME to backup before it deleted everything and replaced it with a tiny fraction of what it used to be. I have been collecting tens of thousands of bookmarks over the past decade. WHERE ARE MY BOOKMARKS. If you do not help me restore them there will be some serious problems for you and your company. Now I have to waste my entire... Show more", "stars": 1, "date": "Feb 25, 2022"}, {"text": "The sync worked fantastic and is very fast. Thanks for this extension. The only thing: the order of my bookmarks in the folders changed, so it took me a while to rearrange them but overall a great extension. Thank you for providing it!", "stars": 5, "date": "Feb 10, 2022"}, {"text": "Couldn't find the same extension for Edge browse, which is what I wanted to sync to from Chrome.", "stars": 1, "date": "Dec 12, 2021"}, {"text": "Yes! This is the one! Finally after all these years I can sync painlessly and without fear between browsers and platforms. Big thanks to the team.", "stars": 5, "date": "Nov 11, 2021"}, {"text": "On first inspection it seems to work fine, you don't find out that it's actually a buggy mess until later on when entire folders of bookmarks disappear.  Try and put a bookmark into a folder in Chrome or Edge ?  SYNC ERROR.  OVER AND OVER.  Jump over to firefox and do the same thing ?  No problem.  Jump back to Chrome/Edge and BOOM SYNC ERROR and the entire folder disappears.  These SYNC ERRORS have been happening in various circumstances for YEARS.  There are OPEN ISSUES going back to 2019 a... Show more", "stars": 1, "date": "Oct 4, 2021"}, {"text": "The best bookmarks sync application on phone and pc browser. It saves me a lot of time. Thank you! 🤗🤗🤗", "stars": 5, "date": "Sep 29, 2021"}, {"text": "I am using it for only few weeks in Chrome, Edge and Firefox. Sometimes when I add new bookmark it duplicates all the bookmarks. Probaly because more than 1 Chrome is running on the PC. This happened already four time during these few weeks. I have to remove it. It brings me total mess in my bookmarks instead of synchronization :-(", "stars": 2, "date": "Sep 12, 2021"}, {"text": "This extension this great! \n\nUnfortunately, according to their FAQ, Apple is being \"pissy\" with their iOS requirements. As a result, I can't use this extension on my iPhone. I've had bad luck, previously, with Android phones. That is why i now use an iPhone. I've never had good luck with Android tablets, so that's not an option either. At least the extension works on my Linux laptop.\n\nI really wish Apple would get off their \"holier than thou\" high horse.", "stars": 4, "date": "Aug 28, 2021"}, {"text": "It's a great extension!  I use it with Chrome.  I can find any bookmark I've saved.  Thank you to the author for all the time it must have taken to development this extension.", "stars": 5, "date": "Jul 29, 2021"}, {"text": "One of the two plugins I install on all of my systems (the other one being lastpass :)). It's a bit problematic recently (06/2021) 'too many connections' error? But works eventually and I can't imagine a day's work without it.", "stars": 5, "date": "Jun 21, 2021"}, {"text": "The best bookmark sync. Waiting some options in managment side.", "stars": 5, "date": "Apr 20, 2021"}, {"text": "Works perfectly", "stars": 5, "date": "Mar 30, 2021"}, {"text": "Awesome !!", "stars": 5, "date": "Mar 14, 2021"}, {"text": "I wanted to like this, but the fact that the Update Sync button is disabled (preventing a manual sync) in both Edge and Chrome, and the sync does not happen at 15 minutes or when a browser is closed, leads me elsewhere.", "stars": 3, "date": "Mar 9, 2021"}, {"text": "Best thing on browser for linux, now I only need something to sync my passwords, cuz google won't let open source browsers use their api.", "stars": 5, "date": "Mar 6, 2021"}, {"text": "Absolutely brilliant. Installed into Chrome and Edge on my Windows PC, followed up on my Android phone and synced perfectly. Far easier and better than any others I've used.", "stars": 5, "date": "Feb 27, 2021"}, {"text": "Thank you for developing this. I've been looking for something like this for a long time (coming from delicious and xmarks - rest in peace)", "stars": 5, "date": "Feb 6, 2021"}, {"text": "The easy way to test it is to a run Bookmark Cleanup on it. Test if removing duplicates bookmarks and folders in the browser, also deleted them on XBrowserSync. In my case the duplicates regularly came back due to XBrowserSync, sync failed. Yandex Browser, json backup available for testing.", "stars": 1, "date": "Feb 2, 2021"}, {"text": "I really like this extension, but I have one question. Brave Browser also has a similar sync feature, how is this different from Brave in privacy apart from file hosting? because I want to know if this has an advantage over Brave in security and privacy. Thanks!", "stars": 5, "date": "Dec 7, 2020"}, {"text": "So far so good I will donate for such a good free solution", "stars": 5, "date": "Nov 4, 2020"}, {"text": "really good", "stars": 5, "date": "Nov 4, 2020"}, {"text": "Love that it's open-source, and privacy conscious. Works great! Appreciate all the work!", "stars": 5, "date": "Sep 30, 2020"}, {"text": "Very useful", "stars": 5, "date": "Jul 29, 2020"}, {"text": "spectacular extension!\neasy and intuitive to use!\n\nThanks for your great work!", "stars": 5, "date": "Jul 19, 2020"}, {"text": "I was searching like this for years.", "stars": 5, "date": "Jun 29, 2020"}, {"text": "Deleting bookmarks and folders for no reason! Too bad it looked like a nice add-on but I can't risk losing my previous 2,000 bookmarks", "stars": 2, "date": "Mar 11, 2020"}, {"text": "This extension is awesome, but it enters the endless sync loop on my Chromebook. I'm using the Chrome browser obviously so I don't know why this is happening.\n\nEDIT: I've been using this extension / service for a while now and it works really well. There are others like it but this one is for sure the most presentable.", "stars": 5, "date": "Mar 6, 2020"}, {"text": "Works on Firefox and Chromium but I can't get it to work on Brave browser. It synced my bookmarks at first but not it's saying I might have a corrupt profile. I deleted the profile along with all the config folders in my home directory but it still won't work.", "stars": 3, "date": "Feb 27, 2020"}, {"text": "Doesnt work on Brave broswer, giving error \"broken bookmark structure\"", "stars": 4, "date": "Feb 24, 2020"}, {"text": "Great Extension, easy to use! Keep your Sync ID in a password manager to ensure you don't lose it. This program is quick and very impressive! The expansion of installers for different device's and OS' was promised and delivered, again very impressive. Again Highly Recommended.", "stars": 5, "date": "Feb 22, 2020"}, {"text": "Amazing concept!", "stars": 5, "date": "Feb 12, 2020"}, {"text": "30 Minutes of effort, no results - Garbage!  Couldn't get it to work with Brave.", "stars": 1, "date": "Feb 1, 2020"}, {"text": "xBS has a potential if the developer listens to users. It clearly lacks two powerful features, which have been requested repeatedly — (1) merging bookmarks between devices/browsers instead of overwriting them and (2) command-based syncronisation when a user can download and upload bookmarks from/to the sync server (two separate buttons maybe?). Thanks!", "stars": 3, "date": "Dec 14, 2019"}, {"text": "please make \"Already got a sync ID\" bigger, great ext", "stars": 5, "date": "Nov 22, 2019"}, {"text": "Great! Keep going!", "stars": 5, "date": "Nov 20, 2019"}, {"text": "Thanks a lot for this Service!,\nit's very sad that sharing bookmarks does not work.\nFor example, we expect to\n1) select all bookmarks which are tagged by a keyword\n2) and then share it to someone (e.g. by E-Mail) or to another xBrowserSync User", "stars": 3, "date": "Nov 13, 2019"}, {"text": "Very unstable. I'm running my own server (via Docker) and every few weeks there is sync issue where part of the bookmarks is missing and I'm forced to create a new sync account otherwise I cannot upload what I'm restoring from the backup.", "stars": 2, "date": "Oct 30, 2019"}, {"text": "Since xBoolmarks sync project was stopped, I was searching for a similar tool to sync my bookmarks without having logged in into browsers' built-in systems. This is (almost) exactly what I wanted. Anonymous, simple, lightweight. Would like just a little more compatibility with old versions of Chromium (65, for instance), where it tries to start syncing whithout any result. Other browsers (newer Chromium, Firefox) work just fine.", "stars": 4, "date": "Oct 13, 2019"}, {"text": "Since chrome bookmark doesn't have a \"Bookmarks Menu\" item, I think it's better to map \"[xbs] Menu\" to chrome's \"Other bookmarks\" because they are both displayed in the first class of the browser menu, and make the \"Other Bookmarks\" of firefox as a subfolder like \"[xbs] Other\" of the \"Other bookmarks\" in Chrome.", "stars": 5, "date": "Aug 3, 2019"}, {"text": "Wow! The latest update (v1.5) just made this a 5 star extension for me. Syncs between different browsers are now fast and smooth. Thank you", "stars": 5, "date": "Aug 1, 2019"}, {"text": "I'm sure the developer did his best, but syncing from one device's Chrome to another, I may get all the changes, or I may not. Add 6 bookmarks? Might see 6, might see 2. Uninstalled and reinstalled, tried different sync IDs...and of course I usually don't know if it's one of the random times I'm getting stuff dropped, since it usually seems to work fine and I don't check, so any losses then just get synced back to the other machine and I've lost them forever. I finally switched to a competito... Show more", "stars": 2, "date": "Jul 31, 2019"}, {"text": "killer for different type of Chromium browser", "stars": 5, "date": "Jul 30, 2019"}, {"text": "Excellent. Easy to use. Work smoothly.", "stars": 5, "date": "Jul 12, 2019"}, {"text": "The first versions of this extension were a disaster, I lost several bookmarks and had others completely scrambled... The developers did a great job and starting from version 1.5 the product was working as intended. The last version is almost perfect and does a great job synchronizing between different platforms! I highly recommend this. Thank you!", "stars": 5, "date": "May 23, 2019"}, {"text": "This thing is KILLER! Thanks for making it :)", "stars": 5, "date": "Feb 24, 2019"}, {"text": "if you want to loose your bookmarks use this extension", "stars": 1, "date": "Jan 14, 2019"}, {"text": "When I installed this months ago, xBrowserSync only supported Chrome. Now that issue is not only fixed, the app has Firefox support! It's a great open-source solution.", "stars": 5, "date": "Dec 19, 2018"}, {"text": "Use it to sync between firefox and chrome. Sometimes it becomes unrespondable and sync something that was deleted before. Also miss Force sync option and continuous sync (like push in email services) immediately after changes was made somewhere", "stars": 4, "date": "Nov 26, 2018"}, {"text": "The best alternative to Xmarks. Easy to use and works well.", "stars": 5, "date": "Nov 9, 2018"}, {"text": "I am very impressed with this quality solution for a challenging problem. xBrowserSync is now one of my \"must-have\" tools as it helps keep all of my bookmarks organized and synchronized across a high number of different browsers and devices. Big thanks and appreciation to the author for making this available. Great work!", "stars": 5, "date": "Nov 4, 2018"}, {"text": "very good！", "stars": 4, "date": "Oct 30, 2018"}, {"text": "Stupid app deleted ALL of my bookmarks on Chrome!!! Can't freaking believe it!", "stars": 1, "date": "Jul 31, 2018"}, {"text": "I liked the concept.  The main issue is that you can't browse your bookmarks in the organized folders that are currently set up in the browser.  I have to type in the bookmark name to browse it, it makes this extension useless for me. When I have hundreds of bookmarks organized by folders.", "stars": 2, "date": "Jul 28, 2018"}, {"text": "Just want to say big thank you to the author.\nLooking forward to Firefox extension.\nAlso, this golang server is easy way to run private API  for those interested - github.com/ishani/xSyn", "stars": 5, "date": "Apr 26, 2018"}, {"text": "Refused to sync. Seems I have too many bookmarks. Waste of time. Where is the clear statement HOW MANY bookmarks you are \"allowed\".", "stars": 1, "date": "Apr 12, 2018"}, {"text": "Excellent. Easy to setup. Secure. Cool features. Looking forward to Firefox version!", "stars": 5, "date": "Apr 2, 2018"}, {"text": "Works great. Simple.", "stars": 5, "date": "Apr 2, 2018"}, {"text": "This is an awesome extension so far, thanks for making it!", "stars": 5, "date": "Sep 23, 2016"}]