[{"text": "I understand that development has been basically ceased since developers have moved on. However, I really wished that the disable night mode for specific subreddits feature had gotten more attention and completed beforehand. Nevertheless, res still works extremely well as it has before and keeps the old reddit usable to me even to this very date!", "stars": 5, "date": "Feb 13, 2024"}, {"text": "bring back the button that inserts the RES link smh. [Reddit Enhancement Suite](httр꞉⫽redditenhancementsuite․ϲοm) [Reddit Enhancement Suite](httр꞉⫽redditenhancementsuite․ϲοm) [Reddit Enhancement Suite](httр꞉⫽redditenhancementsuite․ϲοm) [Reddit Enhancement Suite](httр꞉⫽redditenhancementsuite․ϲοm)", "stars": 5, "date": "Jan 11, 2024"}, {"text": "Still works after the the awful changes at Reddit thankfully. Cut my Reddit time by 90% after the API changes and RIF  had to go down, so when I do occasionally check Reddit, this app is the only way. Thanks for all the hard work after all this time!", "stars": 5, "date": "Dec 20, 2023"}, {"text": "Please add option to disable ALL subreddit styles. They are very annoying and waste of time. I was forced to make an account for such a basic thing.", "stars": 4, "date": "Dec 13, 2023"}, {"text": "I actually forgot ive been using this for close to 7 yeears. Thanks for the hard work <3 u get my 5 stars.", "stars": 5, "date": "Nov 18, 2023"}, {"text": "The only thing that makes browsing Reddit bearable.", "stars": 5, "date": "Aug 15, 2023"}, {"text": "The best Reddit extension since forever ★ ★ ★ ★ ★", "stars": 5, "date": "Jun 21, 2023"}, {"text": "only used it to delete my comments before deleting my account. reddit was nice while it lasted", "stars": 1, "date": "Jun 9, 2023"}, {"text": "I don't mind the new redesign. I mind that it means I can't use RES.\n\nRES is incredibly user-friendly, feels so good to use. It integrates into old.reddit so naturally sometimes I go to change my settings and realise what I thought were official reddit features are actually RES ones, further cementing that I will never want to leave it behind.", "stars": 5, "date": "Jun 1, 2023"}, {"text": "What's even the point if it only works with the old reddit? So now you either have to manually change the URL every time you end up on reddit, or you need to implement some other workaround like another extension to automatically forward you to old reddit every time.", "stars": 1, "date": "Feb 8, 2023"}, {"text": "how to change the post's upvotes color? i can't find it, the default color is horrible, it is grey-white while the background is white, change to night mode make it a bit better but still bad\nhow to make the posts more center-aligned instead of the default left-aligned", "stars": 2, "date": "Jan 11, 2023"}, {"text": "For people considering this extension, note that it only works with OLD reddit. It says so in the extension's description.\n\nI recommend using the \"reddit redirect\" extension in conjunction with this one. Even though you can disable new reddit in your profile settings, the redirect extension makes it so that even if you click a new reddit link, or a /r/....  styled link, you'll get the old reddit layout.\n\nWhy old reddit? One of many reasons: just try loading 20+ old vs new reddit pages on a le... Show more", "stars": 5, "date": "Jan 9, 2023"}, {"text": "FALSE ALARM. Back to 5 star.", "stars": 5, "date": "Dec 21, 2022"}, {"text": "Stopped working. Used to work great but it just straight up doesn't function properly anymore.", "stars": 1, "date": "Dec 21, 2022"}, {"text": "I was hoping to use it to filter out annoying posts just to find out they only work with the old layout, and the plugin is essentially abandonware.\n\n\"\"Support for \"new\" reddit has not gained much traction/interest from developers, so without additional contributions, RES development will be mostly infrequent / in life support mode.\"", "stars": 1, "date": "Dec 20, 2022"}, {"text": "Amazing. Automatic day/night mode based on geolocation for old Reddit.", "stars": 5, "date": "Nov 3, 2022"}, {"text": "A required extension for me.", "stars": 5, "date": "Oct 10, 2022"}, {"text": "It works excellent! But I didn't find posts and comments batch removing feature like Nuke Reddit.", "stars": 5, "date": "Aug 20, 2022"}, {"text": "great privacy practices!", "stars": 5, "date": "Jul 13, 2022"}, {"text": "New reddit, AKA IPO reddit is gross and broken. Can always count on RES to save the day.", "stars": 5, "date": "Jul 2, 2022"}, {"text": "I found this extension several years ago when looking for a way to do simple regular expression searches. It did everything I wanted and more (the filters are my fav feature). I still haven't gotten around to investigating ALL of the options and capabilities in this extension.\nIs there something like this for Android?", "stars": 5, "date": "Jun 19, 2022"}, {"text": "Didn't work. Doesn't hide child/nested replies.", "stars": 1, "date": "Apr 1, 2022"}, {"text": "Filters don't work, useless", "stars": 1, "date": "Feb 19, 2022"}, {"text": "Tried to use to filter posts from spam subreddits, but the filters did nothing and I continued to see garbage spam posts. Useless", "stars": 1, "date": "Dec 23, 2021"}, {"text": "Since this morning the Home button disappeared when using RES. I've already checked the settings and it is enabled there. I can revert my rating once this is fixed.", "stars": 1, "date": "Dec 9, 2021"}, {"text": "Can't use Reddit on desktop without this addon!", "stars": 5, "date": "Nov 30, 2021"}, {"text": "It's great, i don't have to open 300 tabs when i see someone hyperlinking an image anymore.", "stars": 5, "date": "Nov 27, 2021"}, {"text": "love it, it works", "stars": 5, "date": "Oct 24, 2021"}, {"text": "It's greatly useful for the old Reddit design, but doesn't seem compatible with the new one.", "stars": 3, "date": "Sep 12, 2021"}, {"text": "Doesn't do anything.", "stars": 1, "date": "Jun 18, 2021"}, {"text": "Really a great extension. Works really well with old reddit.", "stars": 5, "date": "May 22, 2021"}, {"text": "This app unfortuantly does not filter out posts due to the New Redesign and this app has yet to be updated to be compatable with the new redesign. Why haven't you guys updated this app yet? This App is Useless now! Fix this app now!", "stars": 2, "date": "May 13, 2021"}, {"text": "A must have for reddit browsing. I will say that I knocked 2 stars off because of the way it interferes with reddit videos. I constantly have to clear browsing data to get the videos to actually play when I open a post.", "stars": 3, "date": "Mar 14, 2021"}, {"text": "It's been great until now, the account switcher doesn't show up most the time and that's the main reason i use it", "stars": 3, "date": "Mar 12, 2021"}, {"text": "I've been using this since its release, and my opinion of it has not changed much.\n\nI use this only for its filtering capabilities. Being able to hide subs, users, comments, post titles, and submissions based on flair, is the ultimate thing that makes that hellscape of a website usable.\n\nI do feel RES suffers from feature bloat, and a cumbersome interface. Filtering things isn't as intuitive as you might think. Several useful things that I've seen many users request over the years still only ... Show more", "stars": 4, "date": "Mar 6, 2021"}, {"text": "It's broken. Shows my text behind the text and button on the comment bar.  https://duckers.pcmr.rocks/chrome_K07l8Qfu9W.png", "stars": 2, "date": "Feb 23, 2021"}, {"text": "Garbage not working, dont waste your time. GTARP still showing", "stars": 1, "date": "Feb 16, 2021"}, {"text": "Can't filter out stupid dumb* subreddits", "stars": 1, "date": "Feb 15, 2021"}, {"text": "I love this extension. My primary goal is to focus my time and attention on deep, thoughtful reading experiences, but I still do love exploring meme-world sometimes too. Reddit Enhancement Suite and another extension called Readup have become totally essential to my online experience. I hope the updates keep coming. Long live the internet being fun!", "stars": 5, "date": "Jan 30, 2021"}, {"text": "It was great, but the only important feature - hiding subreddits is no longer working.\nEven in r/all everything still shows up.", "stars": 2, "date": "Jan 18, 2021"}, {"text": "I installed this for the Username Hider. Great idea, but it doesn't work :/", "stars": 1, "date": "Nov 20, 2020"}, {"text": "Dark mode is nice but it slows down other things. All I want is dark mode, can you make a lite version?", "stars": 3, "date": "Nov 16, 2020"}, {"text": "It has good features but it's slower than the new design. I might just stick with that", "stars": 3, "date": "Nov 14, 2020"}, {"text": "Really helpful, but are there any plans to make the account switcher functionable with accounts made thru Google accounts directly? Every time I try to use the account switcher to go to that account in particular it always comes back saying it can't sign in after trying to set it up in the account switcher tab.", "stars": 4, "date": "Nov 11, 2020"}, {"text": "Multitude of features, navigating it could use some improvement.", "stars": 4, "date": "Oct 5, 2020"}, {"text": "All redditlinks are broken after last update", "stars": 1, "date": "Oct 3, 2020"}, {"text": "Useless turd of an extension. Fails supremely at what I'd imagine most people use it for, blocking obnoxious subreddits on r/all. If it worked, it'd get five stars. Got my hopes up, then brought them down lower than the quality of posts on some quite frankly disgusting subreddits.  For shame.", "stars": 1, "date": "Sep 29, 2020"}, {"text": "They've updated it, and now all Google search links go through some proxy called \"sr.gdprvalidate.de\" seems very very very sketchy\n\nUpdate: Yeah I've seen other posts on reddit with this similar issue, this extension is redirecting Google Search links from places like Best Buy and Asus, redirecting them through some weird link-ad-revenue proxies, then sending you to the site.\n\nI've gotten rid of all my extensions and have tested it numerous times and this is definitely the extension that is c... Show more", "stars": 1, "date": "Sep 23, 2020"}, {"text": "Does not work. Probably a mining extension, as it drain CPU power and do noting else.", "stars": 1, "date": "Sep 12, 2020"}, {"text": "It's highly customizable, but it's also slow and buggy at times.", "stars": 3, "date": "Sep 5, 2020"}, {"text": "Essential.", "stars": 5, "date": "Sep 3, 2020"}, {"text": "Currently causing an issue where when google searching I get \"Ads by RoyalAds\". Not cool.", "stars": 1, "date": "Sep 3, 2020"}, {"text": "Works great but hope to see support for the new reddit!", "stars": 5, "date": "Aug 30, 2020"}, {"text": "Completely useless in the redesign", "stars": 1, "date": "Aug 15, 2020"}, {"text": "So many options! Maybe too many options...still figuring it all out. But I like the level of customizability. Intense.", "stars": 5, "date": "Jul 23, 2020"}, {"text": "FOR EVERYONE STRUGGLING TO HAVE IT WORKING OR SAYING IT'S MAKING REDDIT UNUSABLE:\n\n\nI am using the Brave Browser, which is based off of Chrome. I assume it'll be similar for you. \n(This worked for me)\n\n\nClick on the extension while it's on your bar.  (Should give you the drop down of options)\n\nClick \"Manage extensions\"\n\nLook through the page until you see:\n\"Site access\nThis extension can read and change your data on sites. You can control which sites the extension can access.\nAutomatically al... Show more", "stars": 5, "date": "Jul 22, 2020"}, {"text": "RES Breaks Reddit for me currently though this extension has been great over the years. I'm not sure if it's an issue with the new Reddit site design but posts won't load and it can't log me in even though RES shows me as logged in.", "stars": 2, "date": "Jun 25, 2020"}, {"text": "You had 1 job, RES\n\nFilter out keywords. And you simply don't do it.", "stars": 1, "date": "Mar 23, 2020"}, {"text": "I accidentally clicked Hide in Chrome Menu on the toolbar icon, now I can't unhide this extension on the toolbar!", "stars": 5, "date": "Feb 23, 2020"}, {"text": "It makes reddit post easier to read.", "stars": 4, "date": "Feb 19, 2020"}, {"text": "RES is mandatory", "stars": 5, "date": "Dec 28, 2019"}, {"text": "username hider doesnt work", "stars": 2, "date": "Dec 19, 2019"}, {"text": "I mainly got this ext for its \"neverending Reddit\" feature, that USED to work. Doesn't work anymore and getting support is frikken impossible.", "stars": 2, "date": "Sep 6, 2019"}, {"text": "Not sure what has happened. Chrome version 76 updated. After that, Google Sheets started to behave badly. I did a Power Wash. That fixed the Google Sheets problem, however, Reddit and RES fell apart. This only happens on my Acer Chromebook. My Acer Chromebox is unaffected. When I go to Reddit and click on a comment a new window opens, but the comment text is so small it cannot be read. When I click on Preferences a new window opens but it is completely blank. I have also eliminated all extens... Show more", "stars": 1, "date": "Sep 1, 2019"}, {"text": "Just a great extension", "stars": 5, "date": "Aug 5, 2019"}, {"text": "They removed the 'view images' button, so it's pointless now.", "stars": 1, "date": "Aug 5, 2019"}, {"text": "Kinda useless, defaults to new reddit format which is garbage. To be honest I don't really understand the point of this plugin.", "stars": 3, "date": "Jun 15, 2019"}, {"text": "Best feature was ability to 'subscribe' to a post and then get notified when there was new activity, but that is now gone.  Too bad.", "stars": 3, "date": "May 5, 2019"}, {"text": "has more than i need, great stuff :)", "stars": 5, "date": "Apr 14, 2019"}, {"text": "Night mode is broken or what?", "stars": 2, "date": "Apr 8, 2019"}, {"text": "real a fantastic extension", "stars": 5, "date": "Apr 4, 2019"}, {"text": "Works like a dream, as long as you aren't using reddit's new design. I wish people would stop rating 1 star because the reddit redesign broke integration.", "stars": 5, "date": "Apr 4, 2019"}, {"text": "Very High CPU usage. It started happening when I was watching a live video on Youtube. Please do something about it. The extension is really great.", "stars": 1, "date": "Apr 3, 2019"}, {"text": "Very Cool!!!!", "stars": 5, "date": "Apr 2, 2019"}, {"text": "This is breaking several Hover Zoom extensions.", "stars": 2, "date": "Mar 21, 2019"}, {"text": "still doesn't work with redesign", "stars": 3, "date": "Mar 2, 2019"}, {"text": "Currently  it interferes with Paypal and Amazon logins.  Logs me out automatically after logging in.  Very suspicious behavior since it doesn't happen with other sites.", "stars": 1, "date": "Feb 14, 2019"}, {"text": "I've used for years, but over the past 90 days I've had to frequently remove to make reddit usable. Currently, it only loads the first page and then stops.  FIX PLZ.", "stars": 2, "date": "Feb 1, 2019"}, {"text": "A must have for reddit users. But it would be even better if it had a setting that always send you to old.reddit.com.", "stars": 5, "date": "Jan 8, 2019"}, {"text": "Great!", "stars": 5, "date": "Dec 1, 2018"}, {"text": "Now even with this we're forced to use the awful new design.", "stars": 2, "date": "Nov 28, 2018"}, {"text": "RES is awesome it makes reddit so much better.", "stars": 5, "date": "Nov 11, 2018"}, {"text": "Trash. Night mode completely destroys the look of a ton of subs.", "stars": 1, "date": "Nov 10, 2018"}, {"text": "After installing this extension, I couldn’t go back to regular Reddit. Easily a must-have if you frequent Reddit.", "stars": 5, "date": "Nov 7, 2018"}, {"text": "This used to be amazing, with the reddit redesign it's lost the best function, opening images in the same window and allowing resize. Unless I'm missing something, in which case please let me know, this needs to be fixed ASAP. That feature is the primary reason I was using this plugin.", "stars": 5, "date": "Oct 7, 2018"}, {"text": "please make it hide child comments in reddit's new redesign", "stars": 2, "date": "Oct 6, 2018"}, {"text": "amazing", "stars": 5, "date": "Sep 27, 2018"}, {"text": "I accidentally hid 423 posts in one click and I couldn't undo it. Really slowed down reddit aswell.", "stars": 1, "date": "Sep 24, 2018"}, {"text": "Reddit is not usable without this.", "stars": 5, "date": "Sep 22, 2018"}, {"text": "Subreddit hiding is no longer working.", "stars": 3, "date": "Sep 14, 2018"}, {"text": "Absolutely essential.\nReddit without RES is so much worse in so many ways I can't event begin to list them.", "stars": 5, "date": "Aug 30, 2018"}, {"text": "Sadly broken with the new theme. Still works if you switch back to old one though.", "stars": 3, "date": "Aug 25, 2018"}, {"text": "Love this extension. What I would like to see is an option to force using the old layout.", "stars": 5, "date": "Aug 16, 2018"}, {"text": "Awesome and essential until the new update. Make Reddit great again!", "stars": 1, "date": "Aug 7, 2018"}, {"text": "With this, I can shitpost with higher efficency. Thanks OP!", "stars": 5, "date": "Aug 4, 2018"}, {"text": "best ever", "stars": 5, "date": "Jul 30, 2018"}, {"text": "Please fix it\nReddit is incredibly bad without it", "stars": 5, "date": "Jul 30, 2018"}, {"text": "Broke with the Reddit update. Hope you update quickly, Reddit is really awkawrd without it.", "stars": 1, "date": "Jul 30, 2018"}, {"text": "Broken I used to use it all the time but without it Reddit just feels off. Mostly I used it for the formatting preview feature. I really hope it gets fixed but even if it doesn't It was great while it lasted.", "stars": 1, "date": "Jul 28, 2018"}, {"text": "Unfortunately, the new Reddit theme is not compatible with this extension.", "stars": 2, "date": "Jul 27, 2018"}, {"text": "It used to be Completely and utterly necessary to get the most out of the Reddit experience, but since Reddit decided to change where everything is with their new theme, it seems to have broken EACH AND EVERY SINGLE FEATURE of this extension, so it's just dead code and a potential source of bugs for now.", "stars": 2, "date": "Jul 25, 2018"}, {"text": "Use to work fine.\n\nReddit updated and now this is also broken", "stars": 1, "date": "Jul 19, 2018"}, {"text": "Why will this not work with \"old\" reddit.  The new theme is trash.", "stars": 1, "date": "Jul 11, 2018"}, {"text": "Fix it.", "stars": 1, "date": "Jul 10, 2018"}, {"text": "Loved this until recent Reddit theme change. Its broken now :(\n\nPlease fix", "stars": 3, "date": "Jul 9, 2018"}, {"text": "Does not work with the new theme", "stars": 1, "date": "Jul 1, 2018"}, {"text": "I used to LOVE the \"show images\" button, but now I can't use it since New Reddit. It's activated in the options but still isn't showing. How can I make it appear again?", "stars": 3, "date": "Jun 28, 2018"}, {"text": "Not works with the new reddit theme. please fix.", "stars": 1, "date": "Jun 25, 2018"}, {"text": "The best way to view Reddit.", "stars": 5, "date": "Jun 22, 2018"}, {"text": "Amazing. A must add to Reddit for me.", "stars": 5, "date": "Jun 12, 2018"}, {"text": "good one.\nreddit have a new UI, can RES also match with it?", "stars": 4, "date": "Jun 5, 2018"}, {"text": "RES is the only way that I will view reddit in browser.  I use the account switcher, the post filtering, comment macros, large comment editor, and more.  there are too many nice enhancements to mention.", "stars": 5, "date": "May 31, 2018"}, {"text": "Good stuff.", "stars": 5, "date": "May 29, 2018"}, {"text": "Hopefully you'll create another great extension for some other website when reddit inevitably fails.", "stars": 5, "date": "May 18, 2018"}, {"text": "Thank you for keeping it with the original Reddit theme. I actually had to re-enable this on my new laptop and hadn't realized Reddit has changed so much. Thank you for keeping it this way and keeping Reddit usable.", "stars": 5, "date": "May 16, 2018"}, {"text": "Can you work on updating it so that I can use RES in the redesigned reddit?\n\nI don't want to revert to old reddit just to have RES back.\nThanks!", "stars": 1, "date": "May 14, 2018"}, {"text": "Works great, turn off the reddit redesign for maximum use potential.", "stars": 5, "date": "May 9, 2018"}, {"text": "It worked great, but two days ago it just stopped working whenever I signed into my account. If I'm not signed in or if I sign into an alternate account, it still works. But when I sign into my main account it doesn't work anymore..", "stars": 3, "date": "May 7, 2018"}, {"text": "Recently the expando feature just stopped functioning, so now it doesn't do a single thing at all.", "stars": 1, "date": "May 7, 2018"}, {"text": "Excellent added features.", "stars": 5, "date": "May 2, 2018"}, {"text": "\"Night\" mode doesnt work anymore.", "stars": 3, "date": "May 1, 2018"}, {"text": "New reddit compatibility, please...", "stars": 5, "date": "May 1, 2018"}, {"text": "Please fix for the new reddit version. I need this extension!", "stars": 5, "date": "May 1, 2018"}, {"text": "An update to the new Reddit would be great. Can't live without this extension 5/5", "stars": 5, "date": "Apr 26, 2018"}, {"text": "Filters are not working. Excluded topics with snapchat, instagram, etc - still see them.\nEDIT: Cannot rearrange shortcuts in Vivaldi browser.", "stars": 1, "date": "Apr 24, 2018"}, {"text": "Must have!", "stars": 5, "date": "Apr 21, 2018"}, {"text": "Cant live without this for browsing reddit, a must have extension. Just be sure to back up your settings often as updates happen a lot and anythiung you have blocked is no longer blocked.", "stars": 5, "date": "Apr 7, 2018"}, {"text": "I never even need to touch my mouse anymore, if I don't feel like it.", "stars": 5, "date": "Apr 6, 2018"}, {"text": "I only enable some settings here and there but the differences are there.", "stars": 5, "date": "Mar 26, 2018"}, {"text": "Does what it says. Makes my use of Reddit much better.", "stars": 5, "date": "Mar 26, 2018"}, {"text": "I can't use reddit without this, and I am 24/7 on reddit. Must have", "stars": 5, "date": "Mar 24, 2018"}, {"text": "Can't use Reddit without it!", "stars": 5, "date": "Mar 19, 2018"}, {"text": "Need it. Daily use.", "stars": 5, "date": "Mar 19, 2018"}, {"text": "Love it!!!", "stars": 5, "date": "Mar 18, 2018"}, {"text": "Wow! The experience is superb!", "stars": 5, "date": "Mar 10, 2018"}, {"text": "Don't know how I managed without this for so long.", "stars": 5, "date": "Mar 10, 2018"}, {"text": "No complaints, well made", "stars": 5, "date": "Mar 6, 2018"}, {"text": "Good but when i'm opening twitch clips its playing the clips twice at the same time", "stars": 4, "date": "Mar 2, 2018"}, {"text": "Can't live without it.", "stars": 5, "date": "Mar 1, 2018"}, {"text": "Nice.", "stars": 5, "date": "Feb 20, 2018"}, {"text": "Can't do no Reddit without it", "stars": 5, "date": "Feb 11, 2018"}, {"text": "best extension", "stars": 5, "date": "Feb 2, 2018"}, {"text": "Wow! The experience is superb!", "stars": 5, "date": "Jan 31, 2018"}, {"text": "Reddit just isn't as good without this extension.", "stars": 5, "date": "Jan 28, 2018"}, {"text": "Awesome tool. Must have for any regular user of Reddit. Makes it much more fun and adds bunch of other options.", "stars": 5, "date": "Jan 27, 2018"}, {"text": "Pretty much have to use it, the experience is just better", "stars": 5, "date": "Jan 23, 2018"}, {"text": "Can't imagine using Reddit without RES", "stars": 5, "date": "Jan 21, 2018"}, {"text": "Must have!", "stars": 5, "date": "Jan 12, 2018"}, {"text": "The best.", "stars": 5, "date": "Jan 11, 2018"}, {"text": "Lots and lots of problems which I'm too lazy to write  down here", "stars": 1, "date": "Dec 27, 2017"}, {"text": "Works most of the time but i've had to uninstall and reinstall it a few times now. it seems to pick and choose when it loads", "stars": 4, "date": "Dec 17, 2017"}, {"text": "I am so used to it I don't like using reddit without this extension.", "stars": 5, "date": "Dec 16, 2017"}, {"text": "RES is a great app and honestly it changed how much I use Reddit. Missing it sorely whenever it doesn't work (usually on a different pc)\nGreat for scrolling and general interface needs.", "stars": 4, "date": "Dec 4, 2017"}, {"text": "Amazing functionality, works flawlessly every time, a must have for Reddit users!", "stars": 5, "date": "Nov 16, 2017"}, {"text": "Great, a must have!", "stars": 5, "date": "Nov 3, 2017"}, {"text": "Best thing  since reddit", "stars": 5, "date": "Oct 27, 2017"}, {"text": "It's not working for some reason...", "stars": 3, "date": "Oct 17, 2017"}, {"text": "The welcome wagon will not stop popping up no matter what I do. Ruining what is otherwise a good extension.", "stars": 3, "date": "Oct 12, 2017"}, {"text": "Great", "stars": 5, "date": "Oct 11, 2017"}, {"text": "don't reddit without it", "stars": 5, "date": "Sep 28, 2017"}, {"text": "there is bug that makes it unusable mostly - the auto load/infinite scroll thing is broken and after a couple of pages it will break and load nothing.", "stars": 2, "date": "Sep 23, 2017"}, {"text": "There's no volume slider on streamable videos embedded into reddit via your app. I've since gone deaf. \n\nI hope the devs see this because I don't want to create a reddit account to report a bug.", "stars": 5, "date": "Sep 22, 2017"}, {"text": "I can no longer browse Reddit without this any longer. It's a staple. A must-have!", "stars": 5, "date": "Sep 15, 2017"}, {"text": "reddit will be dead on pc without this", "stars": 5, "date": "Aug 22, 2017"}, {"text": "Garbage because it doesn't remember the crappy subreddits you filter out. Every couple of months, I have to restart blocking stupid ones. Why don't they even have presets (sports, tv, gaming).", "stars": 1, "date": "Aug 13, 2017"}, {"text": "I've been using it since the days that it had to be run with adobe air. It's a very nice piece of work. I wish I could code...", "stars": 5, "date": "Aug 10, 2017"}, {"text": "Really easy to use and makes reddit browsing so much easier. It should honestly just be a part of reddit itself and not an add on...", "stars": 5, "date": "Aug 6, 2017"}, {"text": "Makes reddit easier to use plain and simple.", "stars": 5, "date": "Jul 25, 2017"}, {"text": "This is 100% essential for browsing reddit. It's just a collection of things that should already be built in to reddit.", "stars": 5, "date": "Jul 18, 2017"}, {"text": "Very useful if you visit reddit occasionally or more often.", "stars": 5, "date": "Jul 15, 2017"}, {"text": "Awesome addon. Cannot fault.", "stars": 5, "date": "Jul 10, 2017"}, {"text": "Extremely useful, not a single complaint. I don't review things often but I was so impressed by this plugin I had to leave a five star rating. Thanks to the devs for helping me a ton with this plugin!", "stars": 5, "date": "Jul 1, 2017"}, {"text": "Excellent", "stars": 5, "date": "Jun 8, 2017"}, {"text": "I can't believe I used to browse Reddit without this. As another user states, it really adds to the Reddit experience.", "stars": 5, "date": "Jun 1, 2017"}, {"text": "awesome for customization and overall adds to the Reddit experience!", "stars": 5, "date": "May 31, 2017"}, {"text": "This makes the Reddit experience so much better, a must have.", "stars": 5, "date": "May 26, 2017"}, {"text": "MINE'S NOT WORKING", "stars": 3, "date": "May 7, 2017"}, {"text": "awesome", "stars": 5, "date": "May 4, 2017"}, {"text": "Good but please stop with the useless tips they're extremely annoying.", "stars": 4, "date": "Apr 28, 2017"}, {"text": "Been only using it for a couple days but so far it has been amazing! It adds so much functionality to reddit that I never knew I needed! Will update my review if anything comes up.", "stars": 5, "date": "Apr 23, 2017"}, {"text": "configured subreddits order at top bar with it", "stars": 5, "date": "Apr 23, 2017"}, {"text": "It's nice, but it breaks way too often. Make some kind of settings sync option at the very least.\n\nEDIT: it broke again.\nEDIT: it broke again.", "stars": 1, "date": "Apr 21, 2017"}, {"text": "I've been using it for years but had to remove it this evening.  It was requesting permissions to interact with various Steam domains.  I understand why and that there is no malicious intent, but Steam is such a magnet for scammers and malware creators that RES could become a potential vector for nefarious types looking for a way in.  So, I'm out.  I just wish there was an alternative.  I've got a feeling I will use Reddit less actually because RES otherwise added so much.", "stars": 4, "date": "Apr 13, 2017"}, {"text": "It's almost perfect, but there are some subreddits that removes the option of show all images with their subreddit style, is it possible to change that?", "stars": 4, "date": "Apr 5, 2017"}, {"text": "My comments replies never load. The only good thing that I like is that I can hide comments from the parent comment, which makes browsing easier. Will be deleting this until it gets fixed.", "stars": 2, "date": "Apr 1, 2017"}, {"text": "Fantastic! Customize everything, navigate easily... I don't think there is one thing they didn't think of. I don't usually rave about extensions, but this is great.", "stars": 5, "date": "Mar 25, 2017"}, {"text": "Works very well, improves user experience and is always receiving updates. Everyone who uses reddit needs to get this!", "stars": 5, "date": "Mar 24, 2017"}, {"text": "Must get extension for the optimal Reddit experience.", "stars": 5, "date": "Mar 9, 2017"}, {"text": "I came across this extension accidentally & it makes Reddit 100 times better!", "stars": 5, "date": "Mar 6, 2017"}, {"text": "Not only are the features excellent, but the maintainers make it easy to submit features as code.", "stars": 5, "date": "Feb 25, 2017"}, {"text": "wut why is this so good, somebody should make something like this for youtube", "stars": 5, "date": "Feb 20, 2017"}, {"text": "bloody hell, amazing", "stars": 5, "date": "Feb 18, 2017"}, {"text": "life saver", "stars": 5, "date": "Feb 17, 2017"}, {"text": "Best extension in the history of mankind. It adds so many amazing features to Reddit, 90% of which I will never even take advantage of!\n\nYou don’t even have to pay anything. This seems like something I’d have to pay for. Honestly, I’d pay for this if I had to.\n\nI highly recommend this extension to anyone who browses Reddit for hours a day.\n\nFun fact: I used to never use RES. I didn’t think that I needed it. Then, one day, I decided to install it, and now I can’t use Reddit without it.", "stars": 5, "date": "Feb 11, 2017"}, {"text": "Is nice blyad", "stars": 5, "date": "Feb 3, 2017"}, {"text": "Settings are a bit daunting, but if that's the worst thing I can say, that would be a win in my book!", "stars": 4, "date": "Jan 28, 2017"}, {"text": "A great extension and a must have for Reddit, however since latest Chrome Update it's no longer functioning", "stars": 2, "date": "Jan 25, 2017"}, {"text": "amazing", "stars": 5, "date": "Jan 23, 2017"}, {"text": "Just Awesome", "stars": 5, "date": "Jan 19, 2017"}, {"text": "RES is the only way to browse reddit.  It's the entire reason why I still browse on my PC instead of my phone.", "stars": 5, "date": "Jan 18, 2017"}, {"text": "nice", "stars": 5, "date": "Jan 14, 2017"}, {"text": "Makes reddit 100% better", "stars": 5, "date": "Jan 12, 2017"}, {"text": "Incredible extension that adds a huge amount of features.", "stars": 5, "date": "Jan 1, 2017"}, {"text": "Works great!", "stars": 5, "date": "Dec 26, 2016"}, {"text": "I could never go back to using reddit without RES. How has reddit not incorporated these features already?", "stars": 5, "date": "Dec 25, 2016"}, {"text": "The reddit saviour of extensions.", "stars": 5, "date": "Dec 6, 2016"}, {"text": "Appears in the list of Chromebook extensions, but once it says \"installed\" it is not on the menu of extensions from the Chromebook start menu and cannot be found anywhere. A Whoops or what?", "stars": 1, "date": "Nov 22, 2016"}, {"text": "It really makes the website easy to navigate. It does so in an intuitive fashion that I hate to go without.", "stars": 5, "date": "Nov 14, 2016"}, {"text": "I love how it's under the 'Productivity' section.", "stars": 5, "date": "Nov 12, 2016"}, {"text": "I used this extension for a couple of years, but lately I've noticed that my CPU and memory are being maxed out while I have a reddit tab open. Once I got rid of this extension the issue was gone.", "stars": 1, "date": "Nov 8, 2016"}, {"text": "If you use reddit, this is a must have!", "stars": 5, "date": "Nov 3, 2016"}, {"text": "Usually, I love it. However, never ending reddit is not working.\n\n8/10/18: It's all good again!", "stars": 5, "date": "Oct 31, 2016"}, {"text": "Since trying this extension I won't browse Reddit without it.", "stars": 5, "date": "Oct 28, 2016"}, {"text": "If you love reddit get it", "stars": 5, "date": "Oct 23, 2016"}, {"text": "Wow", "stars": 1, "date": "Oct 21, 2016"}, {"text": "Adds so many features that really should be in Reddit by default.", "stars": 5, "date": "Oct 20, 2016"}, {"text": "I wouldn't have touched reddit if not for this extension", "stars": 5, "date": "Oct 14, 2016"}, {"text": "Awesome", "stars": 5, "date": "Oct 13, 2016"}, {"text": "It was the best thing ever until a recent Chrome update. It's there, but not functioning. Not even a little.", "stars": 1, "date": "Sep 27, 2016"}, {"text": "Recent update made RES incompatible with my browser, Torch. So, it's no longer even usable for me.", "stars": 1, "date": "Sep 21, 2016"}, {"text": "If I could rate it six stars, I would.", "stars": 5, "date": "Sep 16, 2016"}, {"text": "Absolute must if you are an active user on Reddit. Recent update took away seeing the number of new notifications next to the red mail, tiffed about that", "stars": 5, "date": "Sep 15, 2016"}, {"text": "Recent update caused a lot of features to stop working. Never ending reddit is borderline gone.", "stars": 3, "date": "Sep 12, 2016"}, {"text": "best extension", "stars": 5, "date": "Sep 12, 2016"}, {"text": "Was working fantastically but the last update seemed to break a lot for me.", "stars": 4, "date": "Sep 12, 2016"}, {"text": "It's really great. But it stopped working after a recent update. I am on Chrome 53", "stars": 4, "date": "Sep 5, 2016"}, {"text": "Just makes Reddit better.", "stars": 5, "date": "Sep 4, 2016"}, {"text": "Continous scrolling got really slow after the update", "stars": 1, "date": "Sep 3, 2016"}, {"text": "Best extension.", "stars": 5, "date": "Sep 2, 2016"}, {"text": "RES is love, RES is life.", "stars": 5, "date": "Aug 31, 2016"}, {"text": "This is infinitely times better than having Gold... and it's free.", "stars": 5, "date": "Aug 29, 2016"}, {"text": "Only install but already really like night mode and all subreddits at \"my subreddits\"!", "stars": 5, "date": "Aug 14, 2016"}, {"text": "Can't hide votes. If I could hide the votes I would have a better experience. Reddit's kryptonite is its (unfair) voting system. I can understand why 4chan dislikes them so much.", "stars": 1, "date": "Aug 11, 2016"}, {"text": "Absolutely amazing the amount of customization!", "stars": 5, "date": "Aug 9, 2016"}, {"text": "Legendary. Must have for Reddit users.", "stars": 5, "date": "Aug 7, 2016"}, {"text": "Great extension. Enhanced my reddit experience.", "stars": 5, "date": "Jul 30, 2016"}, {"text": "Works flawlessly, enhances Reddit.", "stars": 5, "date": "Jul 25, 2016"}, {"text": "Works great", "stars": 5, "date": "Jul 23, 2016"}, {"text": "I'm loving it!", "stars": 5, "date": "Jul 22, 2016"}, {"text": "A very great extension as it gives you full control over your desired preferences.", "stars": 5, "date": "Jul 16, 2016"}, {"text": "The correct way to browse Reddit", "stars": 5, "date": "Jul 11, 2016"}, {"text": "This should just be how Reddit is. I can't browse Reddit without this .", "stars": 5, "date": "Jul 7, 2016"}, {"text": "10/10 with rice.", "stars": 5, "date": "Jul 5, 2016"}, {"text": "Makes browsing experience much more convenient.", "stars": 5, "date": "Jul 3, 2016"}, {"text": "Where have you been for all of my life?", "stars": 5, "date": "Jun 25, 2016"}, {"text": "Can't believe there is a time in my life when i Reddit without this", "stars": 5, "date": "Jun 20, 2016"}, {"text": "Great addition to your Reddit browsing experience. I can't go back to Vanilla anymore; that'd be my only \"complaint\" with this.", "stars": 5, "date": "Jun 17, 2016"}, {"text": "A necessity for anyone who visits reddit regularly.", "stars": 5, "date": "May 24, 2016"}, {"text": "This is the way Reddit is meant to be reddited.", "stars": 5, "date": "May 23, 2016"}, {"text": "I no longer know how to reddit without it. Seriously a must-have.", "stars": 5, "date": "May 23, 2016"}, {"text": "RES has been a seamlessly integral part of my reddit experience for the past year and a half! It feels absolutely necessary and official.", "stars": 5, "date": "Apr 30, 2016"}, {"text": "GREAT ADDITION TO REDDIT.", "stars": 5, "date": "Apr 16, 2016"}, {"text": "Boosted my reddit experience to the max level!", "stars": 5, "date": "Apr 12, 2016"}, {"text": "RES improved my life.", "stars": 5, "date": "Apr 10, 2016"}, {"text": "Required for comfortable Reddit browsing!", "stars": 5, "date": "Apr 7, 2016"}, {"text": "One of my favorite extensions.", "stars": 5, "date": "Mar 21, 2016"}, {"text": "They're the best AROOOOOOOUND!!!! NO ONES EVER GONNA BRING THEM DOWN!\n\nSerialously being drunk browsing reddit and going BACK to the comments I've already read and having them remember what comment trees I had collapsed is the nicests thing any software developer has ever done. Except Bill Gates of course but I don't talk about that anymore. Thanks for real. Reddit any other way is absurd. =D", "stars": 5, "date": "Mar 14, 2016"}, {"text": "Amazing", "stars": 5, "date": "Feb 27, 2016"}, {"text": "A+", "stars": 5, "date": "Feb 27, 2016"}, {"text": "It´s very nice :) To simple :D", "stars": 5, "date": "Feb 26, 2016"}, {"text": "neh", "stars": 3, "date": "Feb 26, 2016"}, {"text": "Makes reddit even more amazing", "stars": 5, "date": "Feb 24, 2016"}, {"text": "Been using for over a year now. It makes reddit easier and quicker to use. Highly recommend.", "stars": 5, "date": "Feb 22, 2016"}, {"text": "If you use reddit from website and don't use RES, go die.", "stars": 5, "date": "Feb 21, 2016"}, {"text": "Never ending Reddit and Night View is the best!", "stars": 5, "date": "Feb 9, 2016"}, {"text": "This is an awesome extension!", "stars": 5, "date": "Jan 27, 2016"}, {"text": "Classic case of great software being slowly ruined by the creators. Losing functionality/intuitiveness and gaining \"donate\" requests by the week. If you're new, not worth jumping on at this point.", "stars": 2, "date": "Jan 22, 2016"}, {"text": "fantastic.Dont think i could use Reddit without it", "stars": 5, "date": "Jan 17, 2016"}, {"text": "Developers are awful. Change core features without consulting the community and refuse to change them back. Used to be good.", "stars": 1, "date": "Jan 12, 2016"}, {"text": "If you browse reddit, there is no excuse not to have this. do yourself a favor, and other cliches", "stars": 5, "date": "Jan 7, 2016"}, {"text": "Great, just stopped working for me though with a bunch of other extensions.", "stars": 4, "date": "Jan 6, 2016"}, {"text": "I have been using it for a day and I must say it is awesome. It is a must for any Reddit user.", "stars": 5, "date": "Jan 4, 2016"}, {"text": "not working anymore", "stars": 4, "date": "Dec 30, 2015"}, {"text": "I use this extension on both safari and chrome. It works flawlessly.", "stars": 5, "date": "Dec 20, 2015"}, {"text": "Sometimes the continues page thing messes up when you're really far along and you have to start over :(", "stars": 4, "date": "Dec 9, 2015"}, {"text": "I installed it, and after a day, I found that I lost most of my subscribed subreddits. I went from 106 subscribed to 26, and I couldn't hate this app more for it.", "stars": 1, "date": "Dec 7, 2015"}, {"text": "Reddit is almost useless without it", "stars": 5, "date": "Nov 26, 2015"}, {"text": "Tons of great features. Theres also alot of keyboard controls but I'm not sure what they are. If they made that easier to find that would fantastic", "stars": 5, "date": "Nov 19, 2015"}, {"text": "can't use reddit without it", "stars": 5, "date": "Nov 18, 2015"}, {"text": "Lots of great features. Pop in images and re-sizing on the fly is probably my favorites.\n\nDoesn't work well with subreddit styles enabled. Completely breaks live posts from functioning as they should.", "stars": 5, "date": "Nov 14, 2015"}, {"text": "Didn't know it existed. Found it and now I can't live with out it. 5/5", "stars": 5, "date": "Nov 1, 2015"}, {"text": "A++", "stars": 5, "date": "Oct 31, 2015"}, {"text": "I can't imagine reddit without this", "stars": 4, "date": "Oct 28, 2015"}, {"text": "Adds many essential features that make the interface more manageable for a new user.", "stars": 5, "date": "Oct 28, 2015"}, {"text": "Excellent extension, because\n- night theme\n- easily swtich reddit accounts/\n- keyboard shortcut to upvote/downvote\n- expand all images inline", "stars": 5, "date": "Oct 21, 2015"}, {"text": "Reddit is nigh unusable without RES. No brainer.", "stars": 5, "date": "Oct 12, 2015"}, {"text": "5/5 would enhance again.", "stars": 5, "date": "Oct 4, 2015"}, {"text": "send help", "stars": 5, "date": "Oct 3, 2015"}, {"text": "Love it the dashboard , the multisub menu on the left. \n\nThe dashboard help me keep track of whats going on on all the subreddits o my multisub-subreddit", "stars": 5, "date": "Oct 2, 2015"}, {"text": "If you dont know, this makes Redditing much faster.", "stars": 5, "date": "Sep 26, 2015"}, {"text": "The past few days none of the images, gifs are loading. I know imgur is having problems, but when I turn the extension off, images load fine in the browser. Come on guys!", "stars": 2, "date": "Sep 23, 2015"}, {"text": "AMAZING", "stars": 5, "date": "Sep 15, 2015"}, {"text": "Fantastic", "stars": 5, "date": "Sep 14, 2015"}, {"text": "make reddit much better", "stars": 5, "date": "Sep 11, 2015"}, {"text": "Certainly the best way to brows reddit", "stars": 4, "date": "Sep 6, 2015"}, {"text": "Great, can't browse reddit without it", "stars": 5, "date": "Sep 1, 2015"}, {"text": "Makes my no-life even easier", "stars": 5, "date": "Aug 31, 2015"}, {"text": "Thank God I tried this. This is awesome.\n\nedit: Minutes into tweaking my reddit. IM. INLOVE.", "stars": 5, "date": "Aug 23, 2015"}, {"text": "Makes a great site even better. Improvements are introduced all the time.", "stars": 5, "date": "Aug 22, 2015"}, {"text": "Absolutely essential. At this point, I can't use reddit without it.", "stars": 5, "date": "Aug 20, 2015"}, {"text": "g", "stars": 5, "date": "Aug 18, 2015"}, {"text": "BEST", "stars": 5, "date": "Aug 13, 2015"}, {"text": "Love it! Absolutely essential", "stars": 5, "date": "Aug 7, 2015"}, {"text": "Fantastic.", "stars": 5, "date": "Aug 6, 2015"}, {"text": "If you use Reddit on Chrome. You need this.", "stars": 5, "date": "Aug 1, 2015"}, {"text": "Crashes tab occasionally, but other than that, awesome!", "stars": 4, "date": "Jul 31, 2015"}, {"text": "nsfw tags dont show in night mode.  i cant unsee some of this stuff.", "stars": 1, "date": "Jul 30, 2015"}, {"text": "Don't use reddit without it.  Makes your browsing experience so much easier.  These features should probably be native to the site, but until they are (if they ever are) this is a must have app for any redditor.", "stars": 5, "date": "Jul 26, 2015"}, {"text": "BEST KARMA GIVER HACK", "stars": 5, "date": "Jul 14, 2015"}, {"text": "There is no Reddit without RES. Piece of work.", "stars": 5, "date": "Jul 14, 2015"}, {"text": "Must have tool for anyone who browses reddit. So many usefull features.", "stars": 5, "date": "Jul 10, 2015"}, {"text": "Adds loads of improvements to browsing reddit. It only helps, no hindering.", "stars": 5, "date": "Jul 9, 2015"}, {"text": "I installed it only because I wanted night mode for Reddit, but when I look at any picture, the picsite would have white background. I'd rather just look at white all the time than have the screen flicker like that. It's a redditdisco. Couldn't find anything on the options for it so I gotta delete it now. Thanks anyway.", "stars": 2, "date": "Jul 8, 2015"}, {"text": "Essential", "stars": 5, "date": "Jul 6, 2015"}, {"text": "This is not working any more....", "stars": 1, "date": "Jul 4, 2015"}, {"text": "This addon actually brings Reddit out of the '90s. It doesn't remove all the antiquated styles, but it does a great job of enhancing and hiding a lot of it.", "stars": 5, "date": "Jun 28, 2015"}, {"text": "Extends and enhances the reddit experience so naturally, that getting on reddit without it just feels wrong. It feels almost like getting on something terrible, like 9GAG.", "stars": 5, "date": "Jun 25, 2015"}, {"text": "works great", "stars": 5, "date": "Jun 16, 2015"}, {"text": "Exceptional in quality; innovative in productivity", "stars": 5, "date": "Jun 15, 2015"}, {"text": "Best reddit experience ever", "stars": 5, "date": "Jun 12, 2015"}, {"text": "Forget using reddit without this. You can't. This is essential for a good reddit experience.", "stars": 5, "date": "Jun 8, 2015"}, {"text": "Makes life easier :)", "stars": 5, "date": "May 28, 2015"}, {"text": "amazing to read at night", "stars": 5, "date": "May 27, 2015"}, {"text": "10/10 would add again.", "stars": 5, "date": "May 25, 2015"}, {"text": "Reddit without this isn't as good", "stars": 5, "date": "May 23, 2015"}, {"text": "Wouldn't browse Reddit any other way. Makes everything so much easier from viewing new links without having to open a new tab, highlighting tabs you have already opened, to never having to click to go to the next page. Get it and you wont be disappointed!", "stars": 5, "date": "May 20, 2015"}, {"text": "awesome", "stars": 5, "date": "May 17, 2015"}, {"text": "This is the only way that I am able to use reddit. Makes the website way more user friendly.", "stars": 5, "date": "May 16, 2015"}, {"text": "Makes reddit much more enjoyable", "stars": 5, "date": "May 15, 2015"}, {"text": "just perfect", "stars": 5, "date": "May 5, 2015"}, {"text": "The best.", "stars": 5, "date": "May 2, 2015"}, {"text": "Mandatory enhancement to Reddit! The improvement to your experience is analogous to installing a radio in your car.", "stars": 5, "date": "Apr 27, 2015"}, {"text": "Pretty sweet! Like it", "stars": 5, "date": "Apr 27, 2015"}, {"text": "Never works.", "stars": 1, "date": "Apr 13, 2015"}, {"text": "IT CHANGED MY LIFE", "stars": 5, "date": "Apr 2, 2015"}, {"text": "Ha, it's under \"Productivity\" category, nice.", "stars": 5, "date": "Mar 29, 2015"}, {"text": "Impossible to use Reddit without this extension", "stars": 5, "date": "Mar 24, 2015"}, {"text": "good", "stars": 5, "date": "Mar 21, 2015"}, {"text": "Really makes reddit more life-absorbing...Perfect!", "stars": 5, "date": "Mar 15, 2015"}, {"text": "So awesome. Feature Packed. So many features it make reddit 10000 times better.", "stars": 5, "date": "Mar 4, 2015"}, {"text": "Occasionally doesn't work - other than that it's great.", "stars": 4, "date": "Mar 2, 2015"}, {"text": "best thing ever", "stars": 5, "date": "Mar 2, 2015"}, {"text": "Reddit is unusable without it. \n\nNew bug of switching to first pic of album if the page is scrolled, but not noticeably annoying.", "stars": 5, "date": "Feb 23, 2015"}, {"text": "AMAZEBALLS", "stars": 5, "date": "Feb 16, 2015"}, {"text": "I've been using RES for about 1,5 years without any problem, however the last month it stopped working. No endless scrolling, no \"expand image\" buttons, meh. Uninstalling & installing it again doesn't really help.", "stars": 4, "date": "Feb 11, 2015"}, {"text": "I like it... but it completely crashes threads with a ton of comments. I mean kills the browser tab, can't scroll can't do anything. Therefore I've had to disable it to use reddit. Bummed out because I love a bunch of the enhancements.", "stars": 2, "date": "Feb 9, 2015"}, {"text": "GREAT for reddit!", "stars": 5, "date": "Feb 5, 2015"}, {"text": "YEAH!", "stars": 5, "date": "Feb 5, 2015"}, {"text": "amazing", "stars": 5, "date": "Feb 3, 2015"}, {"text": "This one is essential, for some reason it stopped working a few days ago. I want it back!", "stars": 4, "date": "Feb 2, 2015"}, {"text": "love it", "stars": 5, "date": "Jan 23, 2015"}, {"text": "I feel naked if I Reddit on a browser without RES enabled.", "stars": 5, "date": "Jan 13, 2015"}, {"text": "Nothing wrong with it, it literally only makes reddit better.", "stars": 5, "date": "Jan 13, 2015"}, {"text": "This extension is not working", "stars": 1, "date": "Jan 12, 2015"}, {"text": "Essential!", "stars": 5, "date": "Jan 11, 2015"}, {"text": "Never ending reddit never works, along with a lot of other items this extension is supposed to bring :(", "stars": 2, "date": "Jan 9, 2015"}, {"text": "I would like it, if it didn't cease working every three days.", "stars": 1, "date": "Jan 4, 2015"}, {"text": "Made reddit so much easier to use", "stars": 5, "date": "Jan 4, 2015"}, {"text": "Great Extension", "stars": 5, "date": "Jan 1, 2015"}, {"text": "Now I don't have to open imgur every single link at a time", "stars": 5, "date": "Dec 26, 2014"}, {"text": "This has made my viewing experience SO much better", "stars": 5, "date": "Dec 25, 2014"}, {"text": "If you browse reddit and you don't use RES your wrong. Every redditor must have it. Once you go RES you'll never go back.", "stars": 5, "date": "Dec 20, 2014"}, {"text": "Transforms reddit from Weed To Heroin. Super intuitive and useful. 10/10", "stars": 5, "date": "Dec 19, 2014"}, {"text": "Seemless", "stars": 5, "date": "Dec 17, 2014"}, {"text": "great", "stars": 5, "date": "Dec 16, 2014"}, {"text": "Absolute must have for anyone that uses Reddit", "stars": 5, "date": "Dec 7, 2014"}, {"text": "a must have for any  redditor", "stars": 5, "date": "Dec 2, 2014"}, {"text": "I used it for about 10 minutes and absolutely loved it! I can't believe that once I've been using reddit without this extension...", "stars": 5, "date": "Nov 20, 2014"}, {"text": "It's such a Cromulent extension which embiggens my experience.", "stars": 5, "date": "Nov 19, 2014"}, {"text": "I wouldn't use Reddit without this extension!", "stars": 5, "date": "Nov 17, 2014"}, {"text": "A+++", "stars": 5, "date": "Nov 12, 2014"}, {"text": "Used to work great -- now  expanded images change back to the first image in the gallery when I scroll.", "stars": 5, "date": "Nov 12, 2014"}, {"text": "Great!", "stars": 5, "date": "Nov 2, 2014"}, {"text": "Ruined my life...\n\n11/10", "stars": 5, "date": "Nov 2, 2014"}, {"text": "Life on reddit without this extension would be drab, but I need one more feature--post are links and opened, there needs to be a bar that links to upvote/downvote and comments, instead of going back to reddit and rating the post.", "stars": 4, "date": "Nov 2, 2014"}, {"text": "great.", "stars": 5, "date": "Nov 1, 2014"}, {"text": "Best.", "stars": 5, "date": "Oct 31, 2014"}, {"text": "No matter what I did, I could not get it to expand twitter links after accidentally hitting deny once. Why is there no simple option in the settings to enable this again?\n\nThere was only one potential fix I could see which involved editing the RES.user js file but the line for twitter was nowhere in that file...", "stars": 2, "date": "Oct 25, 2014"}, {"text": "Everyone who use Reddit should use this extension", "stars": 5, "date": "Oct 24, 2014"}, {"text": "Fantastic extension, the only thing I don't like is the \"Never Ending Reddit\" part, but with how easy it is to turn off I'm not even going to knock any stars off!", "stars": 5, "date": "Oct 20, 2014"}, {"text": "I approve!", "stars": 5, "date": "Oct 18, 2014"}, {"text": "Awesomtacular!", "stars": 5, "date": "Oct 15, 2014"}, {"text": "A must have when browsing Reddit.", "stars": 5, "date": "Oct 6, 2014"}, {"text": "Reddit is unusable for me without this extension.", "stars": 5, "date": "Oct 5, 2014"}, {"text": "Good'O", "stars": 5, "date": "Oct 3, 2014"}, {"text": "Does exactly what I downloaded it to do. Improves every improvable aspect of reddit.", "stars": 5, "date": "Sep 29, 2014"}, {"text": "So much more convenient :)\n\nAnd Dean-Ryan Stone - That was something that REDDIT did, not the extension, it was talk like a pirate day, its over with stop being a crybaby :)", "stars": 5, "date": "Sep 28, 2014"}, {"text": "Fantastic!", "stars": 5, "date": "Sep 22, 2014"}, {"text": "makes an awesome website better", "stars": 5, "date": "Sep 18, 2014"}, {"text": "I feel spoiled. So. Good.", "stars": 5, "date": "Sep 17, 2014"}, {"text": "update makes near perfection even nearer...", "stars": 5, "date": "Sep 15, 2014"}, {"text": "Only problem is every time it updates I lose my bookmarks....dunno why!", "stars": 4, "date": "Sep 12, 2014"}, {"text": "OMG YES.", "stars": 5, "date": "Sep 7, 2014"}, {"text": "It's A Must Have For Redditers", "stars": 5, "date": "Sep 7, 2014"}, {"text": "2000th rate!!! and RES is awesome!", "stars": 5, "date": "Sep 7, 2014"}, {"text": "Makes reddit incredibly more user friendly and easier to use. I could not recommend more.", "stars": 5, "date": "Aug 20, 2014"}, {"text": "When I hover over a link to expand a photo, then move the cursor off the link, the whole page and all of it's links move up or down, making them hard to click.", "stars": 3, "date": "Aug 19, 2014"}, {"text": "This is an essential extension for any redditor.  If you get on reddit, get this!", "stars": 5, "date": "Aug 12, 2014"}, {"text": "great", "stars": 5, "date": "Aug 6, 2014"}, {"text": "Love it", "stars": 5, "date": "Aug 5, 2014"}, {"text": "A Must Have Extension for  making Reddit even better!", "stars": 5, "date": "Aug 3, 2014"}, {"text": "I can't believe I used to Reddit without this.", "stars": 5, "date": "Jul 30, 2014"}, {"text": "Every single day, my fedora is tipped. Thanks to Reddit Enhancement Suite, I have reached the maximum amount of euphoria, and it isn't for some phony God's blessing, it's because I have been enlightened by my own intelligence and Reddit Enhancement Suite. Good night, sweet prince...\n\nEDIT: OMG THANK U 4 DA GOLD KIND STRANGER\n\nEDIT 2: WOW FRONT PAGE HI MOM I LIKE MEN", "stars": 4, "date": "Jul 29, 2014"}, {"text": "Can't use reddit without it.", "stars": 5, "date": "Jul 28, 2014"}, {"text": "Excellent! Clicking images makes new tabs, you can drag and resize the images and it's got some nice customization options. I would say it's a must have for Redditors!", "stars": 5, "date": "Jul 24, 2014"}, {"text": "AMAZING", "stars": 5, "date": "Jul 21, 2014"}, {"text": "The only way to reddit.", "stars": 5, "date": "Jul 18, 2014"}, {"text": "Super useful.", "stars": 5, "date": "Jul 16, 2014"}, {"text": "LOVE THOSE EXPANDOS!!!", "stars": 5, "date": "Jul 15, 2014"}, {"text": "1 star for forcing this stupid \"pirate talk\" into the interface. I didn't configure that and I don't want it. It makes the entire site unusable. You get five stars back once the code which does this is confirmed to *completely* be removed from RES. So incredibly annoying.", "stars": 1, "date": "Jul 8, 2014"}, {"text": "Worked great for me as well UNTIL last update. Viewing reddit on Chrome is almost impossible. Image viewing breaks site. Thanks for quick resolution.......please?", "stars": 2, "date": "Jul 6, 2014"}, {"text": "If you expand images to much the screen will jump around. This happens to me on 2 different computers", "stars": 1, "date": "Jul 6, 2014"}, {"text": "was great untill last update", "stars": 1, "date": "Jul 3, 2014"}, {"text": "Its great until this last update, completely broke it non of the subreddits are useable", "stars": 4, "date": "Jul 3, 2014"}, {"text": "I LOVED RES until this latest update.  Now it isn't working at all.", "stars": 3, "date": "Jul 3, 2014"}, {"text": "Latest update completely breaks Reddit for me on Chrome.", "stars": 1, "date": "Jul 3, 2014"}, {"text": "If you don't use RES, you are redditing like a caveman", "stars": 5, "date": "Jun 21, 2014"}, {"text": "Now that half the things I used it for got nerfed or taken out what's the point?", "stars": 1, "date": "Jun 20, 2014"}, {"text": "Great extension but a recent update has broken the vote counters.", "stars": 5, "date": "Jun 19, 2014"}, {"text": "Needs update, they just changed something on reddit and now I cannot see votes.", "stars": 5, "date": "Jun 18, 2014"}, {"text": "Reddit mods just broke it :(", "stars": 5, "date": "Jun 18, 2014"}, {"text": "Adds a lot of features but it also is super bloated.", "stars": 3, "date": "Jun 15, 2014"}, {"text": "If you weren't addicted to Reddit before RES, you will be after. Makes redditing a super easy for the lazy. I don't know if that's a good thing or not yet.", "stars": 5, "date": "Jun 13, 2014"}, {"text": "\"Productivity\"", "stars": 5, "date": "Jun 13, 2014"}, {"text": "A must have for anyone that uses the site", "stars": 5, "date": "Jun 10, 2014"}, {"text": "Only reason that makes it better than the mobile version.", "stars": 5, "date": "Jun 3, 2014"}, {"text": "This is a must have for browsing reddit.\n\n3 things I would like added though. First, a easier way to up/down vote a post, like a large button that you click once for a up vote, twice for a down vote and click again to undo voting. Then, a way to view flikr (etc.) photos in reddit, like how regular text/photo/video items work. And finally a tool-bar, one that floats on the screen or one you can minimise and expand, move around the screen (etc.)\n\nEverything else is great, and it makes reddit ju... Show more", "stars": 5, "date": "Jun 1, 2014"}, {"text": "I only used it for the subreddit filter and now that doesn't even work.", "stars": 3, "date": "May 31, 2014"}, {"text": "This extension really was the catalyst to getting hooked on Reddit. With this you will be able to go through 3-5 times the content in half the time, but don't think for one second this means you can now stop viewing Reddit sooner. You are really lying to yourself and should be ashamed of yourself. \n\nI love night mode.", "stars": 5, "date": "May 28, 2014"}, {"text": "I can not imagine going back to reddit without this beautiful piece of work", "stars": 5, "date": "May 27, 2014"}, {"text": "Perfect! Idle time has increased 500%!", "stars": 5, "date": "May 22, 2014"}, {"text": "It's hard to use Reddit without it.", "stars": 5, "date": "May 15, 2014"}, {"text": "Can't browse reddit without it anymore!", "stars": 5, "date": "May 12, 2014"}, {"text": "Supercharges Reddit. Couldn't live without it.", "stars": 5, "date": "May 10, 2014"}, {"text": "It's amazing! I can't use Reddit without it! GET IT NOW!", "stars": 5, "date": "May 7, 2014"}, {"text": "Amazing!  Essential even for people who rarely use reddit.", "stars": 5, "date": "May 6, 2014"}, {"text": "Awesome! I just wish it has message notifications for the chrome toolbar :)", "stars": 5, "date": "May 3, 2014"}, {"text": "GREAT!!!", "stars": 5, "date": "May 2, 2014"}, {"text": "awesome", "stars": 3, "date": "May 1, 2014"}, {"text": "Surprised some features aren't on Reddit by default", "stars": 5, "date": "Apr 28, 2014"}, {"text": "This helped seal the deal, on my move from Opera to Chrome.", "stars": 5, "date": "Apr 25, 2014"}, {"text": "Love it", "stars": 5, "date": "Apr 24, 2014"}, {"text": "Seriously couldn't be on Reddit w/o the Enhancement Suite! My only gripe is that my Link Karma stopped counting. My sweet sweet Karma is going unnoticed.", "stars": 4, "date": "Apr 23, 2014"}, {"text": "Reddit <3", "stars": 5, "date": "Apr 19, 2014"}, {"text": "Very usefull!", "stars": 5, "date": "Apr 14, 2014"}, {"text": "I hope someone reads this. My only gripe is the fact if chrome crashes and I have to reload reddit. On the RES suite, awesome sends me back to my page I was up to. Problem arises when I use the \"view all images\" button, I have to scroll all the way back up to open all the images up... Some kind of floating toolbar would be awesome! \n\nThanks for the good work! Only problem I find. I love the RES suite!", "stars": 5, "date": "Apr 14, 2014"}, {"text": "Like alien blue for PC", "stars": 5, "date": "Apr 7, 2014"}, {"text": "I remember seeing a comment about this a short while after creating an account and selling my soul to reddit. I honestly can't remember browsing reddit without this extension. Highly recommended.", "stars": 5, "date": "Apr 4, 2014"}, {"text": "It enhances reddit and is pretty suite.", "stars": 5, "date": "Apr 4, 2014"}, {"text": "I have had no problems with this extension and would recommend it  to all redditors. I don't even remember using reddit with out it.", "stars": 5, "date": "Apr 4, 2014"}, {"text": "llloooovveee itttt", "stars": 5, "date": "Apr 4, 2014"}, {"text": "Hands down the most user friendly reddit companion extention.", "stars": 5, "date": "Mar 21, 2014"}, {"text": "Amazing! I mainly use it for the never ending page but I'm aware that there are tons of other great features too.", "stars": 5, "date": "Mar 19, 2014"}, {"text": "You can scroll down to a new page...Godmode", "stars": 5, "date": "Mar 16, 2014"}, {"text": "If you don't use RES you are not a true redditor!", "stars": 5, "date": "Mar 12, 2014"}, {"text": "Great, does everything i need it to. I hate that hoverview bullshit,", "stars": 5, "date": "Mar 1, 2014"}, {"text": "Completely Amazing.", "stars": 5, "date": "Feb 26, 2014"}, {"text": "Amazing, keep up the good work.", "stars": 5, "date": "Feb 23, 2014"}, {"text": "Invaluable!", "stars": 5, "date": "Feb 14, 2014"}, {"text": "Who wouldn't want RES? Had it for a year (or more), works excellent and VERY helpful", "stars": 5, "date": "Feb 13, 2014"}, {"text": "great extension. makes reddit so much nicer to use", "stars": 5, "date": "Feb 11, 2014"}, {"text": "Whoever wrote this extension is a saint, as he's made my hollow shell of a life a million times better. \n\nI'd donate! But I can't because I don't have a job... because I'm on reddit all the time...", "stars": 5, "date": "Feb 10, 2014"}, {"text": "Makes reddit even more enjoyable.  Recommended for all.  Easy to use.", "stars": 5, "date": "Feb 9, 2014"}, {"text": "Makes reddit more awesome", "stars": 5, "date": "Feb 9, 2014"}, {"text": "It's much better than viewing reddit alone.  However it's a bit quirky.  I've just lost all of my shortcuts and my list of throwaway accounts, so that's not good.", "stars": 3, "date": "Feb 6, 2014"}, {"text": "Hell yeah makes Reddit awesome!", "stars": 5, "date": "Feb 4, 2014"}, {"text": "Hell yeah niggaaaaaaa.", "stars": 5, "date": "Jan 26, 2014"}, {"text": "Necessary extension. A+", "stars": 5, "date": "Jan 24, 2014"}, {"text": "the best", "stars": 5, "date": "Jan 22, 2014"}, {"text": "Some really cool extensions. Like what it does a lot.\n \nBut it slows my internet down!!! Takes up a lot of my computers power! Sorry to say but I've had to delete it twice (reinstalled once hoping it would be better) to get my internet back.", "stars": 2, "date": "Jan 21, 2014"}, {"text": "Can't live without it.", "stars": 5, "date": "Jan 19, 2014"}, {"text": "Amazing. Everyone that uses Reddit should get this. It makes your experience so much easier and more fun", "stars": 5, "date": "Jan 18, 2014"}, {"text": "Absolutely necessary!", "stars": 5, "date": "Jan 15, 2014"}, {"text": "Great.", "stars": 5, "date": "Jan 8, 2014"}, {"text": "RES is so useful that its hard to go back to browsing Reddit without it.", "stars": 5, "date": "Jan 7, 2014"}, {"text": "Good.. but it seems to slow the site down.. anyone else?", "stars": 5, "date": "Jan 7, 2014"}, {"text": "This is a must for any and every reddit user who browse it often (like me). I still haven't explored all the features but so far whatever I have seen it, it looks perfect", "stars": 5, "date": "Jan 5, 2014"}, {"text": "a better reddit. time-wasting nearly 90% more efficiently post-install.", "stars": 5, "date": "Jan 2, 2014"}, {"text": "10/10 would not use reddit without it.", "stars": 5, "date": "Jan 1, 2014"}, {"text": "Le good", "stars": 5, "date": "Jan 1, 2014"}, {"text": "Excellent", "stars": 5, "date": "Dec 27, 2013"}, {"text": "Amazing extension, happily donated because it is that great.", "stars": 5, "date": "Dec 20, 2013"}, {"text": "RES is good, but there are definitely some things that annoy me. Why does it need to number the links in a post? That's just annoying! It also pops in every time I load a page. It only takes half a second, but it's very noticeable and annoying. \n\nI do use RES when I'm going to make a selfpost, so I can get the preview. But I turn it off most of the rest of the time.", "stars": 4, "date": "Dec 19, 2013"}, {"text": "Anyone else having ads automatically download when clicking on a video?", "stars": 3, "date": "Dec 17, 2013"}, {"text": "This extension is AMAZING! 10/10", "stars": 5, "date": "Dec 17, 2013"}, {"text": "Works great!  Very usefull", "stars": 5, "date": "Dec 12, 2013"}, {"text": "Perfection.", "stars": 5, "date": "Dec 8, 2013"}, {"text": "this makes reddit great. removing the fuss of opening multiple links is incredible.", "stars": 5, "date": "Dec 8, 2013"}, {"text": "5/5 its that good", "stars": 5, "date": "Dec 5, 2013"}, {"text": "I'm Commander Shepard, and this is my favorite extension on the Citadel.", "stars": 5, "date": "Dec 5, 2013"}, {"text": "10/10 would use again.", "stars": 5, "date": "Dec 4, 2013"}, {"text": "Great extension, I don't browse Reddit without it nowadays", "stars": 5, "date": "Dec 2, 2013"}, {"text": "Amazing", "stars": 4, "date": "Dec 1, 2013"}, {"text": "10/10 It was okay I guess.", "stars": 5, "date": "Nov 30, 2013"}, {"text": "The only reddit extension I would have.  I also donated to their site so that they can continue to develop a top notch extension.", "stars": 5, "date": "Nov 28, 2013"}, {"text": "Great tool", "stars": 5, "date": "Nov 19, 2013"}, {"text": "Helps immensely. Easily the best reddit extension.", "stars": 5, "date": "Nov 18, 2013"}, {"text": "Love it, makes reddit easier to do and better. It's like the makers understand webdesign better than google.", "stars": 5, "date": "Nov 17, 2013"}, {"text": "By far the best way to browse reddit.", "stars": 5, "date": "Nov 15, 2013"}, {"text": "Simply great", "stars": 5, "date": "Nov 8, 2013"}, {"text": "Been using this since I started using reddit. I cant even remember reddit without this!", "stars": 5, "date": "Nov 5, 2013"}, {"text": "Boom. You need this.", "stars": 5, "date": "Nov 1, 2013"}, {"text": "Should be built into reddit", "stars": 5, "date": "Oct 31, 2013"}, {"text": "I don't Reddit without it.  Great app.", "stars": 5, "date": "Oct 30, 2013"}, {"text": "Class.", "stars": 5, "date": "Oct 30, 2013"}, {"text": "Reddit is painful. This is the only way to browse it.", "stars": 5, "date": "Oct 30, 2013"}, {"text": "Awesome!", "stars": 5, "date": "Oct 30, 2013"}, {"text": "Absolutely wonderful. Don't know how I did without it before!", "stars": 5, "date": "Oct 18, 2013"}, {"text": "Fantastic Extension. Only problem is that it keeps me on Reddit longer!", "stars": 5, "date": "Oct 15, 2013"}, {"text": "This is a must for using reddit to its fullest potential.", "stars": 5, "date": "Oct 11, 2013"}, {"text": "xoxo", "stars": 5, "date": "Oct 11, 2013"}, {"text": "Once you start using RES to view Reddit, you will refuse to browse reddit any other way.", "stars": 5, "date": "Oct 4, 2013"}, {"text": "Reddit the way it should be by default. Adds features and brings existing settings into a very useful interface. Can't stand to use Reddit without it anymore.", "stars": 5, "date": "Oct 3, 2013"}, {"text": "awesome", "stars": 5, "date": "Oct 2, 2013"}, {"text": "Excellent plugin.", "stars": 5, "date": "Oct 1, 2013"}, {"text": "I love this suite. It makes browsing reddit so easy and so easy on the eyes, thanks to dark mode, that it should just be called the \"reddit life crippler enhancement suite.\"", "stars": 5, "date": "Sep 28, 2013"}, {"text": "perfect", "stars": 5, "date": "Sep 26, 2013"}, {"text": "I don't use reddit without it.", "stars": 5, "date": "Sep 25, 2013"}, {"text": "best way to browse reddit!", "stars": 5, "date": "Sep 21, 2013"}, {"text": "Love it, it's by far the best way to read reddit. Ignore the idiots who don't understand the permissions.", "stars": 5, "date": "Sep 20, 2013"}, {"text": "I would give this five stars if it wasn't under productivity. It has been anything but productive to me...", "stars": 4, "date": "Sep 20, 2013"}, {"text": "Just stopped working, can't access any feature... Disabled all other plugins and reinstalled still not working again...", "stars": 2, "date": "Sep 19, 2013"}, {"text": "best way to reddit, thank you developer!", "stars": 5, "date": "Sep 18, 2013"}, {"text": "Its amazing!", "stars": 5, "date": "Sep 16, 2013"}, {"text": "Easiest way to reddit.", "stars": 5, "date": "Sep 14, 2013"}, {"text": "Reddit isn't as nice without this!", "stars": 5, "date": "Sep 10, 2013"}, {"text": "Its awesome. You can not reddit without RES.", "stars": 5, "date": "Sep 9, 2013"}, {"text": "says its installed but I cant access any of the features, ie: filter settings.", "stars": 2, "date": "Sep 9, 2013"}, {"text": "Have read the extensions creators comments regarding privacy.\n\nReinstalled for now.", "stars": 3, "date": "Sep 8, 2013"}, {"text": "Reddit is not complete without this extension.  It takes customization of the page to a new level.", "stars": 5, "date": "Sep 6, 2013"}, {"text": "Perfect, essential for browsing Reddit.", "stars": 5, "date": "Sep 6, 2013"}, {"text": "Excellent addon! Permissions required are in line with what are necessary to provide the functionality the app provides. The extension is open source on Github if you're truly paranoid.\n\nA++ Would install again!", "stars": 5, "date": "Sep 6, 2013"}, {"text": "Great app.", "stars": 5, "date": "Sep 5, 2013"}, {"text": "a really excellent extension. reddit wouldn't be the same without it!", "stars": 5, "date": "Sep 5, 2013"}, {"text": "Helpful, I have nothing to hide but stealing data is irritating.  Still, helpful", "stars": 5, "date": "Aug 31, 2013"}, {"text": "doesn't work for me", "stars": 1, "date": "Aug 30, 2013"}, {"text": "Probably wouldn't use reddit anymore if this wasn't an option", "stars": 5, "date": "Aug 19, 2013"}, {"text": "I really like it, but recently they starting gathering your data for sale. No privacy with this add on.", "stars": 3, "date": "Aug 18, 2013"}, {"text": "Continuously crashes Chrome.", "stars": 1, "date": "Aug 16, 2013"}, {"text": "this is the shiznit! :D all day erry day!!!!!!!", "stars": 5, "date": "Aug 15, 2013"}, {"text": "very useful", "stars": 5, "date": "Aug 8, 2013"}, {"text": "I have no idea why everyone hear hates it, it's really good and doesn't have anything to do with privacy. To all the people who don't like the new permissions: it's  SO THAT THE APP CAN WORK NORMALLY. Accessing your data on other sites is so that it can show you the images/videos from them ON REDDIT. browsing history is to show you x new posts when seeing something you've already seen.Be warned, you may have to disable certain potions in conflicting plugins, but it wont affect your computer i... Show more", "stars": 5, "date": "Aug 7, 2013"}, {"text": "Have to turn off/on about monthly or every two months to start it up again.", "stars": 4, "date": "Aug 7, 2013"}, {"text": "Was a five star extension but I'm going to remove it until a version is released that doesn't ask me to give up absolutely every bit of my privacy.", "stars": 3, "date": "Aug 7, 2013"}, {"text": "This extension was great until the last update required absurd privileges.", "stars": 1, "date": "Aug 7, 2013"}, {"text": "Would have been five, but why hell does it need access to my browsing history and 15 social media sites? No thanks.", "stars": 1, "date": "Aug 6, 2013"}, {"text": "For people getting scared about access rights; Chrome's message is a little bit OTT; it notified that it CAN access those sites, 'cos it uses their APIs to pull in images, tweets, etc.  Be security wise, not security panicked, guys!\n\nNOTE: Chrome's description of permissions is a little bit scarier sounding that it probably should be. When it says \"RES can access your data on [sites]\", what it means is that RES can make requests to those sites. RES uses API calls to sites like flickr, imgur, ... Show more", "stars": 5, "date": "Aug 6, 2013"}, {"text": "Loved this addon. But why the hell do you need to have access every single thing I do. That's some quality bullshit. Removed this addon the minute you changed your stupid permissions.", "stars": 1, "date": "Aug 6, 2013"}, {"text": "It was a good extension, but is now requesting permissions to access my data on flickr, and many other sites, as well as my browsing history and what tabs I have open. There is no need for it to have those permissions, it's just invasive now.", "stars": 1, "date": "Aug 6, 2013"}, {"text": "meh", "stars": 3, "date": "Aug 6, 2013"}, {"text": "Awesome job Reddit - took far too long for me to get this and it's so worth it", "stars": 5, "date": "Aug 5, 2013"}, {"text": "Been using it for over a year now, absolutely love it.", "stars": 5, "date": "Aug 2, 2013"}, {"text": "I find this essential for reddit.", "stars": 5, "date": "Aug 2, 2013"}, {"text": "Great extension.  Reddit sucks without it. :)", "stars": 5, "date": "Jul 23, 2013"}, {"text": "best thing on the internet", "stars": 5, "date": "Jul 21, 2013"}, {"text": "I liked it quite a bit, but I prefer it old fashion style at this point.", "stars": 4, "date": "Jul 19, 2013"}, {"text": "what can I say? its the go to or browsing reddit!", "stars": 5, "date": "Jul 19, 2013"}, {"text": "Needs some bug fixes, for example I cant load the 'My Subreddits' in the top left corner with this extension enabled", "stars": 3, "date": "Jul 18, 2013"}, {"text": "groovy", "stars": 5, "date": "Jul 16, 2013"}, {"text": "Very nice functionality, but for some reason it keeps dissapearing. I have to reinstall it 3-4 times a week.", "stars": 3, "date": "Jul 13, 2013"}, {"text": "The only way to browse reddit", "stars": 5, "date": "Jul 12, 2013"}, {"text": "Excellent extension. Highly recommended for anyone who uses reddit.", "stars": 5, "date": "Jul 1, 2013"}, {"text": "Its super useful for lurkers like myself i just hit view all images and just scroll down.", "stars": 5, "date": "Jun 29, 2013"}, {"text": "love it", "stars": 5, "date": "Jun 28, 2013"}, {"text": "Must have for redditors", "stars": 5, "date": "Jun 28, 2013"}, {"text": "Excellent add-on to make viewing pictures, videos, managing sub-reddits a breeze.", "stars": 5, "date": "Jun 25, 2013"}, {"text": "perfect", "stars": 5, "date": "Jun 18, 2013"}, {"text": "It's so good", "stars": 5, "date": "Jun 7, 2013"}, {"text": "Absolutely essential app if you browse Reddit.", "stars": 5, "date": "Jun 3, 2013"}, {"text": "Best part about Reddit oh and Hover Zoom.", "stars": 5, "date": "May 31, 2013"}, {"text": "Couldn't live a day without it.", "stars": 5, "date": "May 30, 2013"}, {"text": "Can't decide which feature I like more:\n\n1) When it forgets which page you're on previously and reverts to the top of page one. Really handy when you're 7 or 8 pages deep.\n\n2) When it loses (flat out loses) pages of content.\n\nLooking forward to the next update when it will begin force closing Chrome.\n\nUninstalled.", "stars": 2, "date": "May 27, 2013"}, {"text": "Can't reddit without it", "stars": 5, "date": "May 26, 2013"}, {"text": "I would never browse reddit without this extension again.", "stars": 5, "date": "May 24, 2013"}, {"text": "Still can't access imgur pictures at work. But that's not what it's designed for, so overall I think it's a killer add-on", "stars": 5, "date": "May 21, 2013"}, {"text": "Extension crashes a lot.  While it's very customizable, I find that it's not worth getting used to my customizations since it will crash often.", "stars": 3, "date": "May 20, 2013"}, {"text": "Really makes things easier for managing and browsing - thanks alot!!", "stars": 5, "date": "May 18, 2013"}, {"text": "Can't reddit without it", "stars": 5, "date": "May 15, 2013"}, {"text": "This is a great extension Great job !", "stars": 5, "date": "May 15, 2013"}, {"text": "Awesome.", "stars": 5, "date": "May 12, 2013"}, {"text": "One of my favorite reddit extensions. I've been using it for about a year, with no problems what soever(minus the account switcher, but I hardly ever use that anyways.)", "stars": 5, "date": "May 10, 2013"}, {"text": "Great tool!", "stars": 5, "date": "May 9, 2013"}, {"text": "It was explosive!", "stars": 5, "date": "May 8, 2013"}, {"text": "If you are going to Reddit, the Enhancement Suite is the only way to do it.", "stars": 5, "date": "May 8, 2013"}, {"text": "I LOVE REDDIT", "stars": 5, "date": "Apr 26, 2013"}, {"text": "This extension is awesome. I added it shortly before I dove into reddit as a total noob. I had no idea how to use half the features (or that some of the features I liked most about Reddit actually came from RES), yet it was easy to use and helped me to enjoy the reddit experience. I've looked over the tutorials and FAQs now and have a great handle on how to use the extra features. It was easy to learn. Even if you are new to reddit, RES is a must-get extension!", "stars": 5, "date": "Apr 13, 2013"}, {"text": "I love this extension, I can now waste less time on Reddit but see the same amount of stuff!", "stars": 5, "date": "Apr 12, 2013"}, {"text": "Awesome, Awesome! However, I think the category \"Productivity\" is far fetched!", "stars": 5, "date": "Apr 12, 2013"}, {"text": "Really nice.", "stars": 5, "date": "Apr 9, 2013"}, {"text": "Great extension. Can't reddit without it.", "stars": 5, "date": "Apr 8, 2013"}, {"text": "Very useful extension for regular redditors.  Some (most) of its functionality should be implemented in reddit itself; ease of use is the name of this extension.", "stars": 5, "date": "Apr 5, 2013"}, {"text": "awesome saves allot of time and cats", "stars": 4, "date": "Mar 30, 2013"}, {"text": "You hate me don't you? You made an already addictive site even more addicting.", "stars": 5, "date": "Mar 30, 2013"}, {"text": "Must have for any Redditor!!", "stars": 5, "date": "Mar 28, 2013"}, {"text": "I install this extension on every computer I view Reddit with.  If you spend even a moderate amount of time on Reddit, you would be a FOOL to not download RES.", "stars": 5, "date": "Mar 26, 2013"}, {"text": "Amazing app. Makes Reddit amazing.", "stars": 5, "date": "Mar 21, 2013"}, {"text": "So useful! Only a little annoying when you accidentally click on a link but overall, no reason not to get this.", "stars": 5, "date": "Mar 20, 2013"}, {"text": "this is the only way to view reddit. until they make an upgrade...", "stars": 5, "date": "Mar 14, 2013"}, {"text": "LOL... \"Productivity\"", "stars": 5, "date": "Mar 2, 2013"}, {"text": "Having issues with the account switcher. When trying to switch accounts , I get the pop-up message that \"reddit is under heavy load.\"", "stars": 3, "date": "Feb 23, 2013"}, {"text": "I absolutely love this extension. I had to give it 5 stars because it does not work on iTunes.", "stars": 5, "date": "Feb 18, 2013"}, {"text": "I can't reddit without this!! Plus get hover zoom!!", "stars": 5, "date": "Feb 16, 2013"}, {"text": "It's great when it works, but it's broken on the more recent Chrome builds.", "stars": 4, "date": "Feb 15, 2013"}, {"text": "Mandatory app for a Redditor", "stars": 5, "date": "Feb 14, 2013"}, {"text": "Blocked? I had to go to some shady sites to get this app running since the installation itself from the chrome store didnt work at all.\n\nHow's this?", "stars": 3, "date": "Feb 12, 2013"}, {"text": "NICE", "stars": 5, "date": "Feb 11, 2013"}, {"text": "tooooooooot", "stars": 5, "date": "Feb 11, 2013"}, {"text": "Many options do not work and give error messages.", "stars": 1, "date": "Feb 6, 2013"}, {"text": "This is an awesome extension! It bacons all the narwhals...!", "stars": 5, "date": "Jan 29, 2013"}, {"text": "won't browse reddit without it. Only complaint is that its under the category of \"productivity\"....this kills productivity.", "stars": 5, "date": "Jan 22, 2013"}, {"text": "Only plugin you'll ever need for Reddit.", "stars": 5, "date": "Jan 18, 2013"}, {"text": "I very much like this app but it however breaks some sub-reddits my prime example being r/planetside it breaks the up and down-vote buttons and makes them both appear as default up-vote buttons", "stars": 4, "date": "Jan 15, 2013"}, {"text": "Love it!", "stars": 5, "date": "Jan 14, 2013"}, {"text": "Excellent!", "stars": 5, "date": "Jan 7, 2013"}, {"text": "Category: productivity o_O?", "stars": 5, "date": "Jan 5, 2013"}, {"text": "Absolutely love it...", "stars": 5, "date": "Dec 29, 2012"}, {"text": "It's the best extension for Reddit, if you are a Redditor you should have this  this extension", "stars": 5, "date": "Dec 25, 2012"}, {"text": "Why does this need to be able to view and MODIFY my browser history? \nUPDATE: I see a feature called nsfwhistory will remove NSFW links from your history. So it's a good reason I now believe.", "stars": 4, "date": "Dec 23, 2012"}, {"text": "I really love this extension, but the Never Ending Reddit doesn't return to the previous page when I use the back button, even though it's turned on.  Losing my place when I'm 100+ entries into my front page really sucks and almost made me uninstall RES by itself.", "stars": 2, "date": "Dec 14, 2012"}, {"text": "I can't believe I went three years on Reddit without using this.  I should be ashamed of myself.  It's essentially a collection of all of the things I wish Reddit did by default that it does not.", "stars": 5, "date": "Dec 10, 2012"}, {"text": "really handy", "stars": 5, "date": "Nov 30, 2012"}, {"text": "Don't reddit without it.", "stars": 5, "date": "Nov 28, 2012"}, {"text": "This is GOLD!\nWorks very well and is customizable in almost every way.\nReally great AddOn!", "stars": 5, "date": "Nov 26, 2012"}, {"text": "Very useful, making Reddit that much easier to navigate.", "stars": 5, "date": "Nov 26, 2012"}, {"text": "Can't browse reddit without it.", "stars": 5, "date": "Nov 24, 2012"}, {"text": "This is what the Reddit website SHOULD be like.", "stars": 5, "date": "Nov 22, 2012"}, {"text": "Definitely the only way to browse Reddit.", "stars": 5, "date": "Nov 21, 2012"}, {"text": "Pure awesome.", "stars": 5, "date": "Nov 20, 2012"}, {"text": "Must have for every Redditor", "stars": 5, "date": "Nov 13, 2012"}, {"text": "The latest updated broke RES. \nReinstalled RES, Reinstalled Chrome.\n\nDoes not work. The settings are not saved.", "stars": 4, "date": "Nov 13, 2012"}, {"text": "Is great. Needs to be built into reddit.", "stars": 5, "date": "Nov 8, 2012"}, {"text": "Great", "stars": 5, "date": "Nov 1, 2012"}, {"text": "Seeing as I never browse without it, logging in on a friends computer who doesn't have RES installed is almost not worth the time it takes.", "stars": 4, "date": "Oct 24, 2012"}, {"text": "An absolute necessity.", "stars": 5, "date": "Oct 24, 2012"}, {"text": "Awesome, everyone should use it.", "stars": 5, "date": "Oct 23, 2012"}, {"text": "What can be said? Its RES... every redditor knows this is the best thing since sliced bread!", "stars": 5, "date": "Oct 22, 2012"}, {"text": "RES turns Reddit into a whole new and better experience", "stars": 5, "date": "Oct 21, 2012"}, {"text": "Installed it but it didn't do anything.", "stars": 1, "date": "Oct 17, 2012"}, {"text": "AWESOME PRODUCT. MIND BLOWING HOW SICK THIS WAS!!! whooaaaa", "stars": 5, "date": "Oct 14, 2012"}, {"text": "Can't live without it.", "stars": 5, "date": "Oct 10, 2012"}, {"text": "Who in the name of all that is holy categorised this under \"Productivity\"?!", "stars": 5, "date": "Oct 9, 2012"}, {"text": "This extension is amazing... You can't browse reddit without it.", "stars": 5, "date": "Oct 9, 2012"}, {"text": "Reddit Enhancement Suite changed my life.  It's the best thing to happen since sliced bread and toilet seats.", "stars": 5, "date": "Oct 7, 2012"}, {"text": "Browsing Reddit without RES is like a broken pencil: pointless. A must-have extension for any serious redditor. Bravo to honestbleeps for a thoroughly fantastic product!", "stars": 5, "date": "Oct 7, 2012"}, {"text": "Yes", "stars": 5, "date": "Oct 4, 2012"}, {"text": "Best part: it's listed under \"productivity.\"", "stars": 5, "date": "Oct 2, 2012"}, {"text": "This extension makes navigating reddit fluid and dynamic. Allows unparalleled  customization and control. I hope everyone enjoys this as much as I do?", "stars": 5, "date": "Sep 27, 2012"}, {"text": "Love RES, makes Reddit EVEN better (and that`s saying something)", "stars": 5, "date": "Sep 24, 2012"}, {"text": "Best thing ever.", "stars": 5, "date": "Sep 21, 2012"}, {"text": "AMAZING", "stars": 5, "date": "Sep 19, 2012"}, {"text": "Incredible extension.  A must have for reddit users.", "stars": 5, "date": "Sep 18, 2012"}, {"text": "Should be built into Reddit.", "stars": 5, "date": "Sep 18, 2012"}, {"text": "its da bomb", "stars": 5, "date": "Sep 11, 2012"}, {"text": "Watermelon Fried Chicken Grape Drank", "stars": 5, "date": "Sep 4, 2012"}, {"text": "Hey it's dan- the guy who did the UI designs for the big 4.0 release of RES (I am no longer working on the project). If you're like me, you rely on RES every day to make browsing reddit better. Make sure to show your appreciation and throw a couple of bucks in honestbleep's direction for creating such an amazing extension!", "stars": 5, "date": "Aug 28, 2012"}, {"text": "Can't say anything bad about it.", "stars": 5, "date": "Aug 27, 2012"}, {"text": "Should be built into Reddit. Basically, you get certain handy shortcuts and other features like a button next to pictures that opens it right on the page, continuous pages (loads next page right under the current one when you scroll down far  enough sort of like Facebook) and things of that nature.", "stars": 5, "date": "Aug 25, 2012"}, {"text": "This is truly amazing. I only use it for a few things though.", "stars": 5, "date": "Aug 23, 2012"}, {"text": "Perfect! This is super duper awesome, only one suggestion, add a feature that allows us to either add a comment or view the top few comments of a post without leaving the page. I would love that!!! Thanks :) Highly recommended exteension, can't use reddit without this", "stars": 5, "date": "Aug 23, 2012"}, {"text": "This will change your life.", "stars": 5, "date": "Aug 21, 2012"}, {"text": "perfect.", "stars": 5, "date": "Aug 16, 2012"}, {"text": "An even more reddity version of reddit.", "stars": 5, "date": "Aug 11, 2012"}, {"text": "The real deal, finally in the Chrome store.", "stars": 5, "date": "Aug 11, 2012"}, {"text": "If you use reddit, you need this plugin.", "stars": 5, "date": "Aug 10, 2012"}, {"text": "Can't live without it.", "stars": 5, "date": "Aug 10, 2012"}, {"text": "Been using RES for 2 years and it makes Reddit actually usable. Inline image viewing makes it so you don't have to open a million tabs to look at different pictures. \n\nHighly recommend.", "stars": 5, "date": "Aug 10, 2012"}, {"text": "really the only 'must have' for me.", "stars": 5, "date": "Aug 9, 2012"}, {"text": "I wouldn't browse Reddit nearly as much without this extension. It's terrible for my productivity, but still awesome!", "stars": 5, "date": "Aug 9, 2012"}, {"text": "The best for reddit", "stars": 5, "date": "Aug 9, 2012"}, {"text": "Best way to browse reddit is best!", "stars": 5, "date": "Aug 9, 2012"}, {"text": "Makes browsing Reddit so much more convenient. If you use Reddit at all, you should download this.", "stars": 5, "date": "Aug 9, 2012"}, {"text": "Woot! I was wondering when this was going to happen :) Thanks, gents!", "stars": 5, "date": "Aug 9, 2012"}, {"text": "Essential if you regularly browse Reddit.", "stars": 5, "date": "Aug 8, 2012"}, {"text": "One of my favorite extensions for Chrome.", "stars": 5, "date": "Aug 8, 2012"}, {"text": "Great!", "stars": 5, "date": "Aug 8, 2012"}, {"text": "If you use reddit, you need this.", "stars": 5, "date": "Aug 8, 2012"}, {"text": "Makes the viewing experience of reddit even better!  Once you get it you won't go back!", "stars": 5, "date": "Aug 8, 2012"}, {"text": "This is probably the best extension I've ever used. A must have for any Redditor.", "stars": 5, "date": "Aug 8, 2012"}, {"text": "A must have for anyone that browses Reddit.", "stars": 5, "date": "Aug 8, 2012"}, {"text": "I couldn't go back to reddit without this.  I love it.", "stars": 5, "date": "Aug 8, 2012"}, {"text": "An absolute must for any Redditor. Allows you to more easily navigate the site.", "stars": 5, "date": "Aug 8, 2012"}, {"text": "Adds much needed features to Reddit.  The dev is always at hand (as well as the helpers) to answer any questions and is helpful even with repeat questions.  Deals with issues promptly and helps with workarounds.\n\nThis guy is all around class!", "stars": 5, "date": "Aug 8, 2012"}, {"text": "Really makes a difference to the Reddit experience!", "stars": 5, "date": "Aug 8, 2012"}, {"text": "Brilliant. Don't do Reddit without RES :)", "stars": 5, "date": "Aug 8, 2012"}, {"text": "Thanks for all the work you've put into this!", "stars": 5, "date": "Aug 8, 2012"}, {"text": "Awesome as usual!", "stars": 5, "date": "Aug 8, 2012"}, {"text": "The image expansion buttons alone are super-helpful.", "stars": 5, "date": "Aug 8, 2012"}, {"text": "I don't understand how I reddited without it.  Brilliant, brilliant, BRILLIANT extension!", "stars": 5, "date": "Aug 8, 2012"}, {"text": "If you plan on lurking Reddit for any feasible amount of time, install this.", "stars": 5, "date": "Aug 8, 2012"}, {"text": "This has definitely enhanced my reddit experience. I'd probably still use reddit if RES didn't exist but I don't like to even imagine such a world.", "stars": 5, "date": "Aug 8, 2012"}, {"text": "An absolute necessity to really enjoy Reddit to it's fullest. Would download again...", "stars": 5, "date": "Aug 8, 2012"}, {"text": "This extension adds a plethora of usability-focused features to reddit, and deep levels of customization.  A must-have for reddit users!\n\nThe default settings might be a little heavyweight for old computers, so if it runs slowly, try adjusting the settings!", "stars": 5, "date": "Aug 8, 2012"}, {"text": "I've been using this for well over a year, and it's been excellent from the start!  I love being able to view photos and videos without leaving the page, and the way you can resize with a click and drag is really slick!", "stars": 5, "date": "Aug 8, 2012"}, {"text": "I use this daily and love it.  Great great great.\n\nReddit cannot be used without it.", "stars": 5, "date": "Aug 8, 2012"}, {"text": "Incredible set of useful additions to reddit.", "stars": 5, "date": "Aug 8, 2012"}, {"text": "Makes reddit more enjoyable!", "stars": 5, "date": "Aug 8, 2012"}, {"text": "This is the best thing you can use to improve your Redditing Experience. Seriously, this should be the Reddit default.", "stars": 5, "date": "Aug 8, 2012"}, {"text": "Fantastic experience.  Download it and enjoy!", "stars": 5, "date": "Aug 8, 2012"}, {"text": "I can't browse reddit without it. A MUST HAVE!", "stars": 5, "date": "Aug 8, 2012"}, {"text": "Love it!", "stars": 5, "date": "Aug 8, 2012"}, {"text": "Essential for Reddit.", "stars": 5, "date": "Aug 8, 2012"}, {"text": "This extension is a core part of my browser experience. Thrilled to finally see it listed in the official Chrome Web Store :)", "stars": 5, "date": "Aug 8, 2012"}, {"text": "It's amazing and can't imagine reddit without it.", "stars": 5, "date": "Aug 8, 2012"}, {"text": "Amazing software", "stars": 5, "date": "Aug 8, 2012"}, {"text": "really useful extension, I couldn't use reddit without it :)", "stars": 5, "date": "Aug 8, 2012"}, {"text": "The first and only extension you need to install for Google Chrome! Makes the rich reddit content explode out of the page.", "stars": 5, "date": "Aug 8, 2012"}, {"text": "If you love reddit or just browse casually, this extension will greatly improve your experience.  From inline image viewing to multi-user account handling, this extension has it all.", "stars": 5, "date": "Aug 8, 2012"}, {"text": "With all the features in RES, it makes browsing Reddit so much easier. With tagging, image expansion and a bunch of other features, you'll wonder how you ever browsed Reddit without it.", "stars": 5, "date": "Aug 8, 2012"}, {"text": "RES allowed my Reddit habbit to consume even more of my browsing life. It is the only CRITICAL extension for my browser, and I am grateful I don't have to manually load it any more.  If you're new to RES, and unfamiliar with Reddit.com altogether, then let me just say it's a great site for crunching numbers and providing extensive analysis on geological surveys, and nothing else, ever. You probably wouldn't be into it.", "stars": 5, "date": "Aug 8, 2012"}, {"text": "Reddit without RES is unthinkable. I don't think I'd use reddit without this", "stars": 5, "date": "Aug 8, 2012"}, {"text": "Tonnes of useful features, providing even more ways to decrease productivity.", "stars": 5, "date": "Aug 8, 2012"}, {"text": "I've been using Reddit Enhancement suite for years, and it's great. Reddit is unbearable to navigate without it.", "stars": 5, "date": "Aug 8, 2012"}, {"text": "Best thing for any Redditor.\n\nHopefully Google won't hassle you too much honestbleeps.\n\nThanks.", "stars": 5, "date": "Aug 7, 2012"}, {"text": "A+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++", "stars": 5, "date": "Aug 7, 2012"}, {"text": "This extension makes reddit far better!", "stars": 5, "date": "Aug 7, 2012"}, {"text": "Amazing. Must have for reddit users!", "stars": 5, "date": "Aug 7, 2012"}, {"text": "A most excellent extension!", "stars": 5, "date": "Aug 7, 2012"}, {"text": "Best thing that ever happened to reddit!", "stars": 5, "date": "Aug 7, 2012"}, {"text": "RES ?", "stars": 5, "date": "Aug 7, 2012"}, {"text": "The best way to browse reddit on a computer", "stars": 5, "date": "Aug 7, 2012"}, {"text": "One of the best extensions I have ever used.", "stars": 5, "date": "Aug 7, 2012"}, {"text": "A must have if you want to reddit like it's done.", "stars": 5, "date": "Aug 7, 2012"}, {"text": "This is a must get extension! Best extension to hit Reddit. You don't need anything else except RES to have the best Reddit experience possible with constant updates to make it even better! If you don't get this extension you're missing out big time.", "stars": 5, "date": "Aug 7, 2012"}, {"text": "I use RES exclusively when I'm browsing Reddit.  Once I can set them to sync with my work and home PC, even a paid version, this will change to 5 stars", "stars": 4, "date": "Aug 7, 2012"}, {"text": "Great extension. Adds so many useful features. Makes browsing image laden sub-reddits a lot easier! Many thanks.", "stars": 5, "date": "Aug 7, 2012"}, {"text": "The most amazing thing since sliced bread.  Thanks for putting it on here though, honestbleeps, now it'll actually stay when i start a new browser. ;)", "stars": 5, "date": "Aug 7, 2012"}, {"text": "When I use Reddit without RES, I feel naked.", "stars": 5, "date": "Aug 7, 2012"}, {"text": "You can use reddit without this extension, but you'd be missing out.\n\nRES adds so much more to reddit, and I hate to use the site without it now.\n\nGreat extension, a must have.", "stars": 5, "date": "Aug 7, 2012"}, {"text": "Quite nice.", "stars": 5, "date": "Aug 7, 2012"}]