[{"date": "Mar 9, 2024", "text": "Really exceptional", "stars": 5}, {"date": "Mar 8, 2024", "text": "Nice work to updated with the current world tech and giants", "stars": 4}, {"date": "Mar 8, 2024", "text": "This is really useful.", "stars": 5}, {"date": "Mar 7, 2024", "text": "Developer news is great things.", "stars": 5}, {"date": "Mar 5, 2024", "text": "Truly, an extension that every developer must have", "stars": 5}, {"date": "Mar 3, 2024", "text": "Awesome Extension for Devs", "stars": 5}, {"date": "Mar 3, 2024", "text": "must have for devs", "stars": 5}, {"date": "Mar 1, 2024", "text": "Simply, lovely and incredibly useful feature.", "stars": 5}, {"date": "Mar 1, 2024", "text": "Its Amazing and knowledgeable, not just sharing what's happening on the web, I learned a lot and shared with my peers in a snap.", "stars": 5}, {"date": "Feb 26, 2024", "text": "Magnificent experience. Especially for someone always trying to get smarter every single day with tech.", "stars": 5}, {"date": "Feb 24, 2024", "text": "The best day-to-day Tech news platform. Hands Off to the Team", "stars": 5}, {"date": "Feb 22, 2024", "text": "great idea", "stars": 5}, {"date": "Feb 22, 2024", "text": "Simply one of the best dev blog aggregator I ever seen, it keeps me up to date on whats going on in the tech world.", "stars": 5}, {"date": "Feb 22, 2024", "text": "Harnessing the Daily Dev Chrome plugin is akin to clutching a luxurious, high-gloss magazine that never runs out of pages. It transforms the arduous task of staying abreast with the ever-evolving tech sphere into a delightful escapade. My general IT acumen has skyrocketed, traversing beyond my immediate purview into realms I'm ostensibly not required to master—yet here I am, navigating the tempestuous seas of AI, low-code revolutions, and the weekly unfurling of new frameworks with the ease o... Show more", "stars": 5}, {"date": "Feb 22, 2024", "text": "Use this everyday", "stars": 5}, {"date": "Feb 22, 2024", "text": "it is really good for developer to update", "stars": 5}, {"date": "Feb 22, 2024", "text": "It is very useful to get delivered the technical trends and news.\nIt gives the feeling that I am with the progress of the development of technologies.", "stars": 5}, {"date": "Feb 21, 2024", "text": "Great way to explore new things in day to day life with the best titles and short description!!\nHighly recommended!", "stars": 5}, {"date": "Feb 20, 2024", "text": "A great one source feed that helps software developers a lot in keeping updated with timely, relevant and valuable news and technical information.", "stars": 5}, {"date": "Feb 20, 2024", "text": "Great extension!", "stars": 5}, {"date": "Feb 19, 2024", "text": "Highly recomanded for SEs.", "stars": 5}, {"date": "Feb 19, 2024", "text": "Only one word. Excellent!", "stars": 5}, {"date": "Feb 18, 2024", "text": "It's great app, using from a while and in love with it.", "stars": 5}, {"date": "Feb 18, 2024", "text": "Amazing. been using this extension for some time now and the great thing about it is that it's constantly improving! Keep up the great work.", "stars": 5}, {"date": "Feb 17, 2024", "text": "This really my life easy to get updated with the new stuff in Programming.", "stars": 5}, {"date": "Feb 17, 2024", "text": "Love it", "stars": 5}, {"date": "Feb 17, 2024", "text": "Love this extension", "stars": 5}, {"date": "Feb 14, 2024", "text": "Great Application for developer", "stars": 5}, {"date": "Feb 13, 2024", "text": "Great Extension", "stars": 5}, {"date": "Feb 12, 2024", "text": "I have a issue for sign up or sign in, Before I have been using but right now I don't know what happen, the website not loading completely please help I love this extention :(", "stars": 5}, {"date": "Feb 12, 2024", "text": "it really keeps you up to date but it needs more resources to collect data from", "stars": 5}, {"date": "Feb 12, 2024", "text": "Its very good. I like the \"no noise\" display of info. Its there, either look at it or ignore it. No need to click any button to skip the content.  Also, you have decent list of domains to chose.", "stars": 4}, {"date": "Feb 12, 2024", "text": "this awesome", "stars": 5}, {"date": "Feb 11, 2024", "text": "Its so goood", "stars": 4}, {"date": "Feb 10, 2024", "text": "Last week I tested Arc browser, it was very good and I loved it. but after using it for a few days there was something missing and it was the the new tab with daily dev articles that I used to to look for new articles and read it every time I opened a new tab.", "stars": 5}, {"date": "Feb 10, 2024", "text": "Damn good", "stars": 5}, {"date": "Feb 9, 2024", "text": "awesome extension if you want to read more about tech", "stars": 5}, {"date": "Feb 5, 2024", "text": "Its goood extension . It help  me alot to increase my productivity as a developer  .It recommends alot of good article which help me to be a good developer", "stars": 5}, {"date": "Feb 1, 2024", "text": "Awesome! help me catchup everyday!", "stars": 5}, {"date": "Jan 30, 2024", "text": "I am happy to see always changing tech news around. Learning new things on every tab addition :).", "stars": 5}, {"date": "Jan 30, 2024", "text": "Its a very instructive extension, I am happy to have come accross it. Incredible and skilled professional daily write articles on up  to date practices, i really appreciate their contents, and mindset of sharing nkowledge.", "stars": 4}, {"date": "Jan 30, 2024", "text": "just awesome and superb helpful", "stars": 5}, {"date": "Jan 30, 2024", "text": "a Newspaper for developer", "stars": 5}, {"date": "Jan 26, 2024", "text": "It's amazing", "stars": 5}, {"date": "Jan 25, 2024", "text": "I love it. It keeps me abreast without being overbearing. 50% of the time, I discover a new tech trend here. I recommend it for techies.", "stars": 5}, {"date": "Jan 25, 2024", "text": "Loved It. It helps me a lot to keep in touch with the tech world. I recommend it to everyone.", "stars": 5}, {"date": "Jan 25, 2024", "text": "Great source of info and is not bothersome in your day-to-day browsing", "stars": 5}, {"date": "Jan 22, 2024", "text": "how to configure the daily.dev extension on Opera browser?", "stars": 3}, {"date": "Jan 22, 2024", "text": "One of the best extensions I have installed.", "stars": 5}, {"date": "Jan 19, 2024", "text": "Very helpful.", "stars": 5}, {"date": "Jan 19, 2024", "text": "Very nice", "stars": 5}, {"date": "Jan 16, 2024", "text": "Very nice", "stars": 5}, {"date": "Jan 16, 2024", "text": "Vip", "stars": 5}, {"date": "Jan 16, 2024", "text": "Very nice", "stars": 5}, {"date": "Jan 11, 2024", "text": "If u are in IT, you must have this extension in your browser :)", "stars": 5}, {"date": "Jan 11, 2024", "text": "Great extension for dev", "stars": 5}, {"date": "Jan 5, 2024", "text": "Nice", "stars": 5}, {"date": "Dec 29, 2023", "text": "exactly what i was looking for!", "stars": 5}, {"date": "Dec 26, 2023", "text": "#1 and must have extension for me.", "stars": 5}, {"date": "Dec 26, 2023", "text": "good for me", "stars": 5}, {"date": "Dec 25, 2023", "text": "I love this extension, it helps me a lot to keep up-to-date with tech", "stars": 5}, {"date": "Dec 20, 2023", "text": "Best extension for a philomath.", "stars": 5}, {"date": "Dec 12, 2023", "text": "Is it possible to open daily.dev when clicking on the pinned extension? Whenever I open a new tab in Chome, it's daily.dev . This is really annoying. Other users already made the same complaint since last year but it won't change. So I deleted my account and uninstalled the extension.", "stars": 1}, {"date": "Dec 9, 2023", "text": "The best chrome extension for developers. Thank you for sharing knowledge.", "stars": 5}, {"date": "Dec 8, 2023", "text": "100% would recommend to everyone!", "stars": 5}, {"date": "Dec 6, 2023", "text": "In a world where JS frameworks get announced every other week - daily.dev is a friend in need.", "stars": 5}, {"date": "Nov 24, 2023", "text": "Pleasing to the eye, loads of great things on this extension. I super love it! I learn something every single day.", "stars": 5}, {"date": "Nov 23, 2023", "text": "I have been using this extension for a couple of years and never get tired of it. There's always something new to learn, and my new discoveries are consistently in my new tabs. :)", "stars": 5}, {"date": "Nov 3, 2023", "text": "This is my goto tab when I want to take a break from coding. I really appreciate it.", "stars": 5}, {"date": "Oct 10, 2023", "text": "It's a very good and helpful extension for developers to stay tuned into the latest news.", "stars": 5}, {"date": "Oct 4, 2023", "text": "daily.dev is sound greate. We can learn and research a lot in this. But the prorblem for me is when I found an article or topic with my tartget point exactly, it will not be reached because many interesting topics and articles in daily.dev. I have to focus on the exact point and that coud be a good helpful to me. I believe many of developers never stop the learning paths of new trending technologies and tools.", "stars": 4}, {"date": "Sep 30, 2023", "text": "very amazing thing that i have seen in my entire life", "stars": 5}, {"date": "Sep 14, 2023", "text": "very informative and resourceful", "stars": 5}, {"date": "Sep 11, 2023", "text": "Very intrusive new login flow added recently, just more data hoarding to sell to the new investors I guess. Business model notwhitstanding, the user experience has been degraded, the auth does not work properly and I find myself logging in again every once in a while, multiple times a day, when I open a new tab. I can't even search something quickly on the address bar that it gets replaced by daily.dev login URL.", "stars": 1}, {"date": "Sep 8, 2023", "text": "It's good for developer to get new or useful information", "stars": 5}, {"date": "Sep 5, 2023", "text": "I've been a user of daily.dev for some time, and I like the _service_ great, if rating the service, 5 stars.  My problem is with the extension.\n\nI understand the recent change to require permissions to update javascript on all websites so that you can put your little sidebar on sites after following a link from a news article, keeps the conversation thread flowing, that _would_ be fine... except that it doesn't work and it breaks other sites.\n\nWith that permission on, many other sites hang, e... Show more", "stars": 3}, {"date": "Aug 31, 2023", "text": "Great extension for a developer, but now I'm logged out and can't login or register. :/", "stars": 3}, {"date": "Aug 30, 2023", "text": "Great extension getting some curated content keeping me in the loop of all things dev.", "stars": 5}, {"date": "Aug 21, 2023", "text": "Like the name itself its a daily dose for every dev out there. Great work team!", "stars": 5}, {"date": "Aug 18, 2023", "text": "perfect", "stars": 5}, {"date": "Aug 15, 2023", "text": "I've had this as my new tab page for a while now and I've found a handful of interesting articles in that time. However today it seems that my time with this app is over since I've now been loginwalled from the front page. If Hacker News or Reddit aren't forcing logins, why should this app have to? It's not like the content is any different.", "stars": 3}, {"date": "Aug 15, 2023", "text": "It's start to force users to create account/login to easier to track them.\nI don't want to create account so I removed it", "stars": 1}, {"date": "Aug 14, 2023", "text": "Hi , i want soon you will have this feature . every 3days, weeks, month, year , it will list top 3 most view , most comment so user can fillter stuff they want", "stars": 4}, {"date": "Aug 9, 2023", "text": "very helpful extension, learned a lot of stuff through the articles", "stars": 5}, {"date": "Aug 9, 2023", "text": "Love it", "stars": 5}, {"date": "Aug 4, 2023", "text": "nice <3 love it", "stars": 5}, {"date": "Jul 24, 2023", "text": "- Great extension", "stars": 5}, {"date": "Jul 24, 2023", "text": "love so much!", "stars": 5}, {"date": "Jul 24, 2023", "text": "I needed an upgrade from the weird chrome homepage and daily.dev is AWESOME!", "stars": 5}, {"date": "Jul 22, 2023", "text": "I loved this extension and still using it because of its rich content, but as of now I will uninstall it and rate it 1 star for a permission that requested to \"Read and Change all of my data on all website\" there's no reason to ask for such permission and you guys don't have the right to ask for a such one!", "stars": 1}, {"date": "Jul 21, 2023", "text": "fall in love with this", "stars": 5}, {"date": "Jul 20, 2023", "text": "Amazing extension <3", "stars": 5}, {"date": "Jul 4, 2023", "text": "I have been using it almost a week after it's inception and I'm writing the review only now because the quality hasn't been compromised with additional handy features being added. 5 mins every morning and evening does the job.\nThank you team Daily.Dev :)", "stars": 5}, {"date": "Jun 29, 2023", "text": "great way to be in loop with what's happening around in web", "stars": 5}, {"date": "Jun 28, 2023", "text": "number one extension ever!", "stars": 5}, {"date": "Jun 27, 2023", "text": "Great Product!", "stars": 5}, {"date": "Jun 26, 2023", "text": "nice", "stars": 5}, {"date": "Jun 21, 2023", "text": "reallly useful, just keep improving", "stars": 5}, {"date": "Jun 13, 2023", "text": "I ❤ it", "stars": 5}, {"date": "Jun 10, 2023", "text": "I'm so glad you update me every day, I feel like I'm part of a huge group! :)", "stars": 5}, {"date": "Jun 2, 2023", "text": "I think it's a great extension! I've been using the Daily Dev extension to learn and expand my knowledge, and I must say, its recommendation algorithm is very impressive.", "stars": 5}, {"date": "Jun 1, 2023", "text": "Exceptionally top-notch", "stars": 5}, {"date": "Jun 1, 2023", "text": "I love it. its a great extension for developers", "stars": 5}, {"date": "May 28, 2023", "text": "good", "stars": 5}, {"date": "May 27, 2023", "text": "Very useful", "stars": 5}, {"date": "May 26, 2023", "text": "It keeps me updated with latest new features and update in programming world. Love it, Glad I found this extension.", "stars": 5}, {"date": "May 22, 2023", "text": "great view.", "stars": 5}, {"date": "May 22, 2023", "text": "The meme used to be 'use internet Explorer to download another browser', now it is 'use another browser to download daily.dev'. This is a great resource, plenty of great articles to read, plenty of new ideas to learn, This is a must have extension.", "stars": 5}, {"date": "May 19, 2023", "text": "It was awesome.", "stars": 5}, {"date": "May 19, 2023", "text": "I really like it. I always find something interesting to read.", "stars": 5}, {"date": "May 17, 2023", "text": "I really like it. I always find something interesting to read.", "stars": 5}, {"date": "May 17, 2023", "text": "Love it", "stars": 5}, {"date": "May 16, 2023", "text": "good", "stars": 5}, {"date": "May 12, 2023", "text": "great extension for developer that need some article for read.", "stars": 5}, {"date": "May 11, 2023", "text": "It is really nice and helpful", "stars": 5}, {"date": "May 9, 2023", "text": "helpful!", "stars": 5}, {"date": "May 7, 2023", "text": "good source of knowlegde", "stars": 5}, {"date": "Apr 26, 2023", "text": "Awesome Extension, Thank you creating this awesome product.", "stars": 5}, {"date": "Apr 26, 2023", "text": "Great Extension!", "stars": 5}, {"date": "Apr 24, 2023", "text": "I love it!", "stars": 5}, {"date": "Apr 20, 2023", "text": "Nice articles", "stars": 5}, {"date": "Apr 18, 2023", "text": "I use Daily.dev daily and multiple times throughout the day ! keeps me mostly up to date without the need to run around every dev/tech blog or news site out there !", "stars": 5}, {"date": "Apr 18, 2023", "text": "the number one must have for every developer", "stars": 5}, {"date": "Apr 14, 2023", "text": "yeh just great", "stars": 5}, {"date": "Apr 5, 2023", "text": "It is very informative.", "stars": 5}, {"date": "Apr 5, 2023", "text": "Daily.dev is really cool. It brings super relavant news and topics and i'm really helped everyday.", "stars": 5}, {"date": "Mar 30, 2023", "text": "This extension is perfect", "stars": 5}, {"date": "Mar 23, 2023", "text": "Keeps me updated on tech news..Like it!", "stars": 5}, {"date": "Mar 21, 2023", "text": "Amazing source of inspiration when opening a new tab on how to center a div", "stars": 5}, {"date": "Mar 19, 2023", "text": "Daily.dev is the perfect hub for tech and dev news updates. Get your daily boost of information in one place.", "stars": 5}, {"date": "Mar 18, 2023", "text": "Great Extension!! Helping developers to be regular and gain knowledge.", "stars": 4}, {"date": "Mar 17, 2023", "text": "Gaining alot of knowhow thanks to this extension. Love it.", "stars": 5}, {"date": "Mar 16, 2023", "text": "Great extension! I love the fact it can be configured to open as \"New Tab\". The design of the app is fluid and easy on the eye. Nice to use. Thank you for making accessible all these articles in such a nice way.", "stars": 5}, {"date": "Mar 12, 2023", "text": "very amazing.... I think u should add more news from different source about programming", "stars": 5}, {"date": "Mar 7, 2023", "text": "Lately It's become indispensable.", "stars": 5}, {"date": "Mar 7, 2023", "text": "Great way to stay up to date and learn new stuff", "stars": 5}, {"date": "Mar 5, 2023", "text": "very good", "stars": 5}, {"date": "Mar 4, 2023", "text": "Very useful. Nice little tool.", "stars": 5}, {"date": "Mar 1, 2023", "text": "I like how I can easily access some interesting news everyday. Keep going with the good content", "stars": 5}, {"date": "Mar 1, 2023", "text": "Great resource of knowledge!", "stars": 5}, {"date": "Feb 26, 2023", "text": "Awesome!", "stars": 5}, {"date": "Feb 24, 2023", "text": "it's awesome extension that I was always seeking.", "stars": 5}, {"date": "Feb 24, 2023", "text": "Very helpful for developer. sometime just browsing through and find something new or refreshing your memory", "stars": 5}, {"date": "Feb 23, 2023", "text": "Awesome homepage addon! Really interesting news and accurate feed tuning. Thanks a lot!", "stars": 5}, {"date": "Feb 22, 2023", "text": "This ext makes you feel like a pro developer, good job daily.dev", "stars": 5}, {"date": "Feb 22, 2023", "text": "Best thing ever created to stay up to date with the tech news", "stars": 5}, {"date": "Feb 22, 2023", "text": "Best tailored sources that keep me up to date. Amazing plugin every developer should have.", "stars": 5}, {"date": "Feb 21, 2023", "text": "Very polished, well managed and clean extension. Great job! 10/10.", "stars": 5}, {"date": "Feb 20, 2023", "text": "Recommended for every developer out there! Very Useful", "stars": 5}, {"date": "Feb 17, 2023", "text": "Recommended for every developer out there!", "stars": 5}, {"date": "Feb 16, 2023", "text": "I use this every day. It's super convenient to have a lot of personalized articles by just opening a tab.", "stars": 5}, {"date": "Feb 14, 2023", "text": "Nice", "stars": 5}, {"date": "Feb 13, 2023", "text": "Such an excelent extension!", "stars": 5}, {"date": "Feb 12, 2023", "text": "Thanks for creating such an amazing extension. It was so much needed!", "stars": 5}, {"date": "Feb 8, 2023", "text": "It's a really useful extension. I like to read a lot of article about tech and this extension has helped to find them more a way easier", "stars": 5}, {"date": "Feb 8, 2023", "text": "Firstly, I would like to thank you. From start using daily.dev, I feel like I'm not in the ocean alone as before.", "stars": 5}, {"date": "Feb 6, 2023", "text": "Great hub to stay up-to-day on software development", "stars": 5}, {"date": "Feb 5, 2023", "text": "Yeah its awesome.", "stars": 4}, {"date": "Feb 2, 2023", "text": "opening a new tab just got exciting", "stars": 5}, {"date": "Jan 28, 2023", "text": "Overall very good but has a bug:  If for whatever reason the feed has no results, your home links aren't shown.  Sometimes I just open a new tab to click on one of those, and for some time I could not get to them because the feed was returning no results.", "stars": 4}, {"date": "Jan 28, 2023", "text": "Thank you daily.dev...loved it", "stars": 5}, {"date": "Jan 27, 2023", "text": "top !", "stars": 5}, {"date": "Jan 26, 2023", "text": "An easy way to learn something every day", "stars": 5}, {"date": "Jan 22, 2023", "text": "Great extension for developers, improved a lot since I started using", "stars": 5}, {"date": "Jan 20, 2023", "text": "Awesome extension!\nI read through the homepage every morning to stay up-to-date with the newest tech trends.\nReally hope the community grows even more!!!", "stars": 5}, {"date": "Jan 20, 2023", "text": "Very good extension. We could learn a lot from the articles and this tool shows the good articles for us.", "stars": 5}, {"date": "Jan 18, 2023", "text": "A game changer ! More than an extension", "stars": 5}, {"date": "Jan 16, 2023", "text": "Great extension for developers!!!", "stars": 5}, {"date": "Jan 15, 2023", "text": "Best extension to get tech news", "stars": 5}, {"date": "Jan 15, 2023", "text": "Simply awesome - This is the easiest quickest way I've found to stay up to date.", "stars": 5}, {"date": "Jan 11, 2023", "text": "I don't get all the great reviews, it shows the same posts for a week and only a couple of them I find its title interesting but then once I visit the link none of them are useful and are mostly clickbait or self promotion articles.", "stars": 1}, {"date": "Jan 11, 2023", "text": "This extension is very helpful for developer. You must have this if you want to keep aware about latest trends! Mind Blowing.", "stars": 5}, {"date": "Jan 9, 2023", "text": "The extension shines bright when it comes to assisting in  finding relevant and new technologies regarding sever areas of interest, specified by the user. The best thing about it is that it replaces a bleak home page with something both interesting and useful.", "stars": 5}, {"date": "Jan 9, 2023", "text": "It's very pratice!", "stars": 5}, {"date": "Jan 9, 2023", "text": "Very helpful extension.", "stars": 5}, {"date": "Jan 8, 2023", "text": "Helpful and informative extension, lot of good articles.", "stars": 5}, {"date": "Jan 6, 2023", "text": "Awesome, Love it.", "stars": 5}, {"date": "Jan 5, 2023", "text": "This extension is actually very helpful, it provides a lot of good articles with the content that i liked and really needed in my Front-end career. Hope we will get more nice features with zero bugs (hopefully lol)", "stars": 5}, {"date": "Jan 5, 2023", "text": "Works incredibly!", "stars": 5}, {"date": "Jan 4, 2023", "text": "Awesome in one word", "stars": 5}, {"date": "Jan 3, 2023", "text": "Great resource for devs", "stars": 5}, {"date": "Jan 3, 2023", "text": "Very helpful :)", "stars": 5}, {"date": "Jan 3, 2023", "text": "Great, get to know something new everyday.", "stars": 5}, {"date": "Jan 1, 2023", "text": "I love it , vary useful wonderful extension", "stars": 5}, {"date": "Jan 1, 2023", "text": "This is really cool and usefull thing, I love this extention", "stars": 5}, {"date": "Dec 30, 2022", "text": "good", "stars": 5}, {"date": "Dec 19, 2022", "text": "so good for developer, I enjoy it.", "stars": 5}, {"date": "Dec 13, 2022", "text": "This extension is now a part of my daily schedule. It helps me keeping up to date with the latest technologies.", "stars": 5}, {"date": "Dec 9, 2022", "text": "Love it. So much information and content at your fingertips", "stars": 5}, {"date": "Dec 8, 2022", "text": "A very good extension to catch up all tech updates!", "stars": 5}, {"date": "Dec 7, 2022", "text": "It's being very helpful to keep it up with the tech world", "stars": 5}, {"date": "Dec 6, 2022", "text": "Must have extension for every Developer. The articles published for very insightful", "stars": 5}, {"date": "Dec 5, 2022", "text": "best extension", "stars": 5}, {"date": "Dec 2, 2022", "text": "Extremely easy way to manage and improve the knowledge in the overwhelming and ever growing amount of information overload.\nThank you daily.dev...Keep doing the great work.", "stars": 5}, {"date": "Dec 1, 2022", "text": "I really like this extension.", "stars": 5}, {"date": "Dec 1, 2022", "text": "Awesome extension !!!", "stars": 5}, {"date": "Dec 1, 2022", "text": "loved it", "stars": 5}, {"date": "Nov 30, 2022", "text": "This extension is good, but the it force me to open new tab with it.\nThere is no way to open new blank tab, I'll delete this extension anyway", "stars": 1}, {"date": "Nov 28, 2022", "text": "Amazing extension with great product!", "stars": 5}, {"date": "Nov 28, 2022", "text": "I am learning a lot from it. Thanks for suggesting great articles based on my taste.", "stars": 5}, {"date": "Nov 25, 2022", "text": "Awesome extension", "stars": 5}, {"date": "Nov 25, 2022", "text": "Amazing news feed for software engineers", "stars": 5}, {"date": "Nov 22, 2022", "text": "Best extension ever used on chrome work and study daily new things ........ :)", "stars": 5}, {"date": "Nov 22, 2022", "text": "Verry helpfull extension", "stars": 5}, {"date": "Nov 21, 2022", "text": "Super nice extension, I can always learn something new everyday!!", "stars": 5}, {"date": "Nov 21, 2022", "text": "Wonderful and very resourceful extension. I have been recommending this extension to my friends.", "stars": 5}, {"date": "Nov 19, 2022", "text": "I'm a new user(This is my first time using it) and I love it so far, and I would love if there was an option to save articles offline. I don't know if there already is one or not. Forgive me for my ignorance.", "stars": 5}, {"date": "Nov 18, 2022", "text": "wonderful extension", "stars": 5}, {"date": "Nov 18, 2022", "text": "This extension is excellent, it really helps me to keep on top of the latest tech news in the industry, so that I can compete with high-level developers in the field.", "stars": 5}, {"date": "Nov 17, 2022", "text": "All developers should have this extension 🙌 So useful", "stars": 5}, {"date": "Nov 17, 2022", "text": "The best", "stars": 5}, {"date": "Nov 16, 2022", "text": "Simply amazing.", "stars": 5}, {"date": "Nov 16, 2022", "text": "Awesome!", "stars": 5}, {"date": "Nov 16, 2022", "text": "Awesome!", "stars": 5}, {"date": "Nov 16, 2022", "text": "All Tech guys should have this!", "stars": 5}, {"date": "Nov 15, 2022", "text": "i love daily.dev", "stars": 5}, {"date": "Nov 14, 2022", "text": "incredible", "stars": 5}, {"date": "Nov 14, 2022", "text": "hiden my bookmarks", "stars": 4}, {"date": "Nov 12, 2022", "text": "This extension is perfect; it has many things I need and much more to explore", "stars": 5}, {"date": "Nov 11, 2022", "text": "The quality of the content that is curated to appear on your new tab is really impressive.  If you register and sign in, you are able to select topics that interest you.  Visually the new tab page looks very enticing and it requires some discipline to only bookmark the cards that look really interesting and then read them when you're taking a planned break.  Never before in my career have I been this informed about the latest industry trends.", "stars": 5}, {"date": "Nov 10, 2022", "text": "Great to build a habit to consume tech news.", "stars": 5}, {"date": "Nov 9, 2022", "text": "Absolutely great to keep up to date with tech, I look forward to opening new tabs :D Only downfall is that I want to stay on the new tab when I need to be searching something up lol", "stars": 5}, {"date": "Nov 8, 2022", "text": "Great app to stay up to date", "stars": 5}, {"date": "Nov 8, 2022", "text": "Brilliant way to keep up to date. I actually look forward to opening a new tab now, just to see if there is anything interesting that may catch my eye.", "stars": 5}, {"date": "Nov 7, 2022", "text": "Wonderfull extension to keep you updated with tech articles", "stars": 5}, {"date": "Nov 7, 2022", "text": "Very useful and interesting!", "stars": 5}, {"date": "Nov 3, 2022", "text": "Well designed and supper useful.", "stars": 5}, {"date": "Nov 3, 2022", "text": "Amazing news feed for developers", "stars": 5}, {"date": "Oct 30, 2022", "text": "very helpful extension! thank you guys!", "stars": 5}, {"date": "Oct 29, 2022", "text": "hide my bookmark", "stars": 4}, {"date": "Oct 27, 2022", "text": "It's so much simple to use this than something like Medium to get the latest tech news. It's not only the best extension on Chrome but it's quite literally one of the best platforms in general for tech news/updates/new ideas etc. It's easy to use, intuitive and full of content. As a web developer and using a browser constantly, especially opening new tabs often, it's impossible not to be continuously updated on the latest stuff happening in tech. Articles are always useful, funny(tech funny),... Show more", "stars": 5}, {"date": "Oct 26, 2022", "text": "Just awesome", "stars": 5}, {"date": "Oct 24, 2022", "text": "Excellent extension, many helpful information", "stars": 5}, {"date": "Oct 23, 2022", "text": "good extension", "stars": 5}, {"date": "Oct 20, 2022", "text": "hello developers if you're reading you have perfectly created it for other developers Unlimited thanks to you, by the way, can we add way to display feed from one discover source like it only show from Specific sources like only from \"GitHub, product hunt, GitLab\" Thank you.", "stars": 5}, {"date": "Oct 20, 2022", "text": "A must to increase productivity", "stars": 5}, {"date": "Oct 16, 2022", "text": "very helpful extension! thank you guys!", "stars": 5}, {"date": "Oct 14, 2022", "text": "Vast learning resource for anyone related to tech :)", "stars": 5}, {"date": "Oct 12, 2022", "text": "very helpful", "stars": 5}, {"date": "Oct 12, 2022", "text": "coool", "stars": 3}, {"date": "Oct 11, 2022", "text": "This is keeping me up-to-date not just int tech news but in software development in general.", "stars": 5}, {"date": "Oct 8, 2022", "text": "The idea is good but the articles selected should be of higher quality like hackernews.", "stars": 4}, {"date": "Oct 7, 2022", "text": "I was sceptical at first, I loved my plain old google.com tab, but I can honestly say it is something that has progressed my knowledge in certain areas.Great Articles, Reading Leveling system. Definetely recommend.", "stars": 5}, {"date": "Oct 5, 2022", "text": "It's absolutely brilliant, love it!", "stars": 5}, {"date": "Oct 4, 2022", "text": "Amazing extension, but I wish if I could limit the number of articles I can see each time\nas this will be ecourage me to check them instead of having a lot of titles each time I open a new tap\n\nthank you", "stars": 5}, {"date": "Oct 3, 2022", "text": "nice", "stars": 5}, {"date": "Oct 2, 2022", "text": "Awesome!", "stars": 5}, {"date": "Sep 30, 2022", "text": "Thank you for this great extention!", "stars": 5}, {"date": "Sep 29, 2022", "text": "Cool stuff", "stars": 5}, {"date": "Sep 29, 2022", "text": "Really useful , but , it's easy to go down the rabbit hole reading new stuff :))", "stars": 5}, {"date": "Sep 29, 2022", "text": "I can't live without it.... congrats to the team who worked on this app.", "stars": 5}, {"date": "Sep 27, 2022", "text": "A daily curated list of things I would actually love to read. Very helpful!", "stars": 5}, {"date": "Sep 26, 2022", "text": "Very useful, well organized and makes you up to date.", "stars": 5}, {"date": "Sep 23, 2022", "text": "I love it…you'll end up learning about new trend, technologies, frameworks etc. which you wouldn't have focussed on.\nV E R Y   U S E F U L…calling it must-have isn't an exaggeration…!", "stars": 5}, {"date": "Sep 23, 2022", "text": "Awesome, now I am a regular blog reader because it has helped to create an environment where I am supposed to read more blogs to develop my skills more.", "stars": 5}, {"date": "Sep 21, 2022", "text": "just wow!!! Best extension. love this tool", "stars": 5}, {"date": "Sep 19, 2022", "text": "Loved it", "stars": 5}, {"date": "Sep 13, 2022", "text": "A very beatiful extention to stay up to date", "stars": 5}, {"date": "Sep 9, 2022", "text": "Great extension help in updating with tech news", "stars": 5}, {"date": "Sep 7, 2022", "text": "Just great! Useful, well designed and relevant.", "stars": 5}, {"date": "Sep 6, 2022", "text": "Great extension, but the older version was better. Now you can only middle click the \"read article\" button, because they changed the behavior. On click the popup opens and not the article. I understand the decision, but this made the app for me way more complicated to use.", "stars": 3}, {"date": "Sep 6, 2022", "text": "Awesome! It has reduced to half my time for searching and browsing articles.", "stars": 5}, {"date": "Sep 5, 2022", "text": "Love it, Time ago I had to find each articule or news in different website. Now I feel keep update.", "stars": 5}, {"date": "Sep 3, 2022", "text": "Really useful extension, it gives me a portal to new knowledge every time I open a nes blank page!", "stars": 5}, {"date": "Sep 1, 2022", "text": "This is one of my most used plugins. this help me stay up to date news on any category I want. Thanks for making something useful for us.", "stars": 5}, {"date": "Aug 31, 2022", "text": "I really loves this ext so much. Learning is fun and enjoyable :)", "stars": 5}, {"date": "Aug 30, 2022", "text": "Every developer should use this ...", "stars": 5}, {"date": "Aug 29, 2022", "text": "It's the best platform to get updated to world of developers,  I recommend using it", "stars": 5}, {"date": "Aug 29, 2022", "text": "I start every morning with a cup of coffee, and DAILY DEV <3", "stars": 5}, {"date": "Aug 27, 2022", "text": "it is very useful and cool source of news", "stars": 5}, {"date": "Aug 23, 2022", "text": "It has really helped me a lot to find quality articles and it has been an amazing experience so far! Great job daily.devs!", "stars": 5}, {"date": "Aug 22, 2022", "text": "Is the best, I share with my frontend team.", "stars": 5}, {"date": "Aug 22, 2022", "text": "Very helpful, great articles!", "stars": 5}, {"date": "Aug 18, 2022", "text": "Best extension i have in chrome", "stars": 5}, {"date": "Aug 18, 2022", "text": "it's super useful! 👽", "stars": 5}, {"date": "Aug 17, 2022", "text": "Very useful !", "stars": 5}, {"date": "Aug 17, 2022", "text": "Really Useful for developers.", "stars": 5}, {"date": "Aug 17, 2022", "text": "Nice dev hub <3 Keep up good work!", "stars": 5}, {"date": "Aug 15, 2022", "text": "Best extension for new ideas, learning and productivity.", "stars": 5}, {"date": "Aug 15, 2022", "text": "Amazing, insightful, I definitely prefer opening up a new tab to something I am actually interested in!", "stars": 5}, {"date": "Aug 14, 2022", "text": "Thank you. The best dashboard for developers.", "stars": 5}, {"date": "Aug 13, 2022", "text": "Great", "stars": 5}, {"date": "Aug 12, 2022", "text": "Awesome !!!", "stars": 5}, {"date": "Aug 11, 2022", "text": "A great way to find high-quality articles about dev-topis!", "stars": 5}, {"date": "Aug 11, 2022", "text": "Cool, but you need to add an option to like articles", "stars": 5}, {"date": "Aug 11, 2022", "text": "Wonderful web app and extension. Just please, add an option to change the number of grid columns in the news section. It just shows two and there's a huge padding in the sides, shrink them too. Aside from that, it is great.", "stars": 4}, {"date": "Aug 11, 2022", "text": "The awsome add on ever to update your knowledge.", "stars": 5}, {"date": "Aug 10, 2022", "text": "Great tool., I think need to add filter to get articles from specific source, like producthunt", "stars": 5}, {"date": "Aug 10, 2022", "text": "Its not the words. Really its the best extension for Developers to use in their home page so if you\nre bored with chrome homepage then you can try it out over others", "stars": 5}, {"date": "Aug 8, 2022", "text": "One of the best developer centric chrome extensions. Devs do not need to wander around different websites to know the latest of the latest in the tech world. A tool to get the latest blog articles. daily.dev does it all. 🚀", "stars": 5}, {"date": "Aug 6, 2022", "text": "What a nice extension, it change my dev life", "stars": 5}, {"date": "Aug 5, 2022", "text": "Super Useful", "stars": 5}, {"date": "Aug 5, 2022", "text": "Such a great and useful extension!", "stars": 5}, {"date": "Aug 4, 2022", "text": "This is one of the most useful plugins in the world that can be used with browser. I can get up to date news on any category I want. Thank you who has encourage on this :)", "stars": 5}, {"date": "Aug 4, 2022", "text": "Pretty cool. Would like to see more beginner articles", "stars": 5}, {"date": "Aug 3, 2022", "text": "I mean this is just superb, splendid.\nExcellent is an understatement.", "stars": 5}, {"date": "Aug 2, 2022", "text": "Knowledgable content. Keep it up", "stars": 5}, {"date": "Aug 2, 2022", "text": "Excellent resource tool for Dev. Very helpful", "stars": 5}, {"date": "Aug 1, 2022", "text": "Awesome to stay up to date with all about developer content!", "stars": 5}, {"date": "Aug 1, 2022", "text": "It's a great app but I cant login if I am already registered. it says \"email already registered\" but where is the login link, if I am already registered (I am trying to login into new computer)??", "stars": 3}, {"date": "Jul 30, 2022", "text": "Best research tool for devs", "stars": 5}, {"date": "Jul 30, 2022", "text": "Great ressources and articles for devs.", "stars": 5}, {"date": "Jul 28, 2022", "text": "Extension is very useful. And reading blogs and being up-to-date to the things that I want.", "stars": 5}, {"date": "Jul 28, 2022", "text": "really useful", "stars": 5}, {"date": "Jul 28, 2022", "text": "Very useful! I love it", "stars": 5}, {"date": "Jul 27, 2022", "text": "Excellent job!", "stars": 5}, {"date": "Jul 25, 2022", "text": "Great!", "stars": 5}, {"date": "Jul 25, 2022", "text": "i'ts true good extension.give me a lot of knowledge everyday.i'm very happy.", "stars": 5}, {"date": "Jul 24, 2022", "text": "A very nice extension for developers, enjoyable and beautifuly designed. all the love <3", "stars": 5}, {"date": "Jul 23, 2022", "text": "one of the best extension for developer productivity, learning new things, news etc", "stars": 5}, {"date": "Jul 22, 2022", "text": "My favorite extension, I have learned a lot from it ✨\nThank you", "stars": 5}, {"date": "Jul 21, 2022", "text": "They integrated very good dev card system", "stars": 5}, {"date": "Jul 20, 2022", "text": "A wonderful extension ever for developer!", "stars": 5}, {"date": "Jul 19, 2022", "text": "Great", "stars": 5}, {"date": "Jul 19, 2022", "text": "This is super good.", "stars": 5}, {"date": "Jul 19, 2022", "text": "Good extension!", "stars": 5}, {"date": "Jul 18, 2022", "text": "Great", "stars": 5}, {"date": "Jul 17, 2022", "text": "Good thing I love it", "stars": 5}, {"date": "Jul 16, 2022", "text": "amazing", "stars": 5}, {"date": "Jul 15, 2022", "text": "So good", "stars": 5}, {"date": "Jul 15, 2022", "text": "I love it", "stars": 5}, {"date": "Jul 14, 2022", "text": "Every day i'm staying in tune\n\nAmazing tool!", "stars": 5}, {"date": "Jul 13, 2022", "text": "I love this extension, keep me update with tech news", "stars": 5}, {"date": "Jul 13, 2022", "text": "Best extension to get new knowledge every day.", "stars": 5}, {"date": "Jun 24, 2022", "text": "Great ext.", "stars": 5}, {"date": "Jun 23, 2022", "text": "Quite useful extension for developers to catch up with the news from community.", "stars": 5}, {"date": "Jun 22, 2022", "text": "This is incredible. So many useful resources available everytime without even needing to surf through the web to get em... The focus mode is what makes this a 5star rating for me. Best extension ever for me.", "stars": 5}, {"date": "Jun 21, 2022", "text": "It's really amazing to have news/articles about techs daily!", "stars": 5}, {"date": "Jun 17, 2022", "text": "I have only one minor \"problem\" with this extension.. Quite often I open a new tab to load a very specific page that I need to view, suddenly spot a whole bunch of really interesting looking articles, and then I forget what I opened that new tab for in the first place.\n\nIf I had to offer only one tip for anybody using this extension: open your new tab, TYPE THE ADDRESS YOU NEED, and then go wild and middle-click (or ctrl-click) on all the articles you want. (:", "stars": 5}, {"date": "Jun 15, 2022", "text": "as a jr dev i always want to be part of the community and know what's going on and daily news offers that maybe some day i can build something as cool as that", "stars": 5}, {"date": "Jun 15, 2022", "text": "The perfect extension fro a web developer. Discover new technologies, stay up to date!", "stars": 5}, {"date": "Jun 14, 2022", "text": "Really useful, love it", "stars": 5}, {"date": "Jun 14, 2022", "text": "one stop for my daily tech news !", "stars": 5}, {"date": "Jun 11, 2022", "text": "I am amazed by this extension! Much needed!", "stars": 5}, {"date": "Jun 10, 2022", "text": "a really perfect extension to stay updated with all news in world of programming ❤", "stars": 5}, {"date": "Jun 8, 2022", "text": "Finally have something to look at as a Developer.", "stars": 5}, {"date": "Jun 2, 2022", "text": "Daily.dev really helps me in staying up to date. Daily.dev has made it really easy for me to learn new skills, tips, tricks and other things for developing.", "stars": 5}, {"date": "May 26, 2022", "text": "Great extension. Give me a new high value knowledge everyday.", "stars": 5}, {"date": "May 26, 2022", "text": "Something I was searching for ages and couldn't fine one.", "stars": 5}, {"date": "May 25, 2022", "text": "Good source of knowledge, love this extension", "stars": 5}, {"date": "May 24, 2022", "text": "I love it. It keeps me up to date on what's going on in devland. It keeps growing and becoming more extensive and useful as more topics are added.", "stars": 5}, {"date": "May 24, 2022", "text": "I am loving this extension... It's a joy at the beginning of the day when opening internet. \nIt has an extensive variety of topics and the blogs  are compacted and informing !", "stars": 5}, {"date": "May 23, 2022", "text": "Fast, useful, open source, what else do you need.", "stars": 5}, {"date": "May 22, 2022", "text": "Love it! Very Helpful!", "stars": 5}, {"date": "May 21, 2022", "text": "Awesome, but for specific type of content very low amount of articles.", "stars": 5}, {"date": "May 19, 2022", "text": "It is one of the best ways to learn new things, and be updated on new technologies", "stars": 5}, {"date": "May 18, 2022", "text": "Excellent", "stars": 5}, {"date": "May 16, 2022", "text": "super usefull", "stars": 5}, {"date": "May 16, 2022", "text": "awesome extension, every progrmmer need it", "stars": 5}, {"date": "May 15, 2022", "text": "Awesome awesome", "stars": 5}, {"date": "May 14, 2022", "text": "love it \nreally help me to get more productivity and knowledge :D", "stars": 5}, {"date": "May 12, 2022", "text": "best ext for dev news", "stars": 5}, {"date": "May 10, 2022", "text": "Excellent", "stars": 5}, {"date": "May 9, 2022", "text": "source of knowledge", "stars": 5}, {"date": "May 9, 2022", "text": "What a find! Keeps me up to date with the latest trends and helps me hone my skills as a software developer.", "stars": 5}, {"date": "May 9, 2022", "text": "Great app", "stars": 5}, {"date": "May 6, 2022", "text": "Something I have ever searched for. Thanks", "stars": 5}, {"date": "May 4, 2022", "text": "Excellent source to keep devs updated", "stars": 5}, {"date": "May 3, 2022", "text": "An indispensable tool.", "stars": 5}, {"date": "May 3, 2022", "text": "awesome", "stars": 5}, {"date": "May 2, 2022", "text": "Needs more interesting articles to be added, not only dev content that is not in my field of expertise.", "stars": 3}, {"date": "May 2, 2022", "text": "Really good", "stars": 5}, {"date": "May 2, 2022", "text": "Amazing!", "stars": 5}, {"date": "May 2, 2022", "text": "A lot more entertaining than just a search engine tab, excellent content!", "stars": 5}, {"date": "May 1, 2022", "text": "If you are a developer, want stay updated on all the shiny new things. This is you new stop.", "stars": 5}, {"date": "Apr 28, 2022", "text": "It is amazing that helps me to stay up to date!", "stars": 5}, {"date": "Apr 21, 2022", "text": "Perfect!", "stars": 5}, {"date": "Apr 19, 2022", "text": "This repo is so good. It feels better than Medium", "stars": 5}, {"date": "Apr 19, 2022", "text": "This extension changed my homepage to daily.dev without asking me. Fortunately, Google Chrome warned me about it and I uninstalled it right away. So intrusive!", "stars": 1}, {"date": "Apr 15, 2022", "text": "Excellent articles", "stars": 5}, {"date": "Apr 15, 2022", "text": "it's very help for new and other things. i just love this.", "stars": 5}, {"date": "Apr 15, 2022", "text": "i like it", "stars": 5}, {"date": "Apr 13, 2022", "text": "Nice extension", "stars": 5}, {"date": "Apr 11, 2022", "text": "I m just loving it.... I like to read interesting topics on medium. But this extension gives me more flexible interesting options", "stars": 5}, {"date": "Apr 9, 2022", "text": "Very useful!", "stars": 5}, {"date": "Apr 7, 2022", "text": "Works really good", "stars": 5}, {"date": "Apr 6, 2022", "text": "Great idea! Totally like it", "stars": 5}, {"date": "Apr 5, 2022", "text": "The best extension ever!", "stars": 5}, {"date": "Apr 5, 2022", "text": "my favorite extension so far", "stars": 5}, {"date": "Apr 4, 2022", "text": "An amazing extension to keep on update in dev news.", "stars": 5}, {"date": "Apr 4, 2022", "text": "Great Extension", "stars": 5}, {"date": "Apr 3, 2022", "text": "Great extension, with great articles. Every dev should install this extension :)", "stars": 5}, {"date": "Apr 2, 2022", "text": "Really Amazing!!! For those who like programming, tech, etc... it's a \"must have it\" extension.", "stars": 5}, {"date": "Apr 1, 2022", "text": "Awesome tool for devs, good way to keep in touch with new features and good practices for your favorite langages and frameworks !", "stars": 5}, {"date": "Mar 31, 2022", "text": "I love this extension.\nI have star this extension but it randomly show \n//\nStar us on GitHub to support our open-source community!\n//\nKindly try to avoid showing this message if a registered user has stared this on GitHub.\nThanks for this 💎", "stars": 5}, {"date": "Mar 29, 2022", "text": "Very very good", "stars": 5}, {"date": "Mar 29, 2022", "text": "Very Helpful Extension.", "stars": 5}, {"date": "Mar 25, 2022", "text": "Use it every day, best homepage ever!", "stars": 5}, {"date": "Mar 22, 2022", "text": "Much better than surfing around for dev news!", "stars": 5}, {"date": "Mar 18, 2022", "text": "Top articles.", "stars": 5}, {"date": "Mar 18, 2022", "text": "Like", "stars": 5}, {"date": "Mar 12, 2022", "text": "very useful extension", "stars": 5}, {"date": "Mar 10, 2022", "text": "pretty good extension helps me to keep reading great articles without even searching for them", "stars": 5}, {"date": "Mar 8, 2022", "text": "Great extension for developers. This has become my new homepage in no time. Highly recommended!", "stars": 5}, {"date": "Mar 7, 2022", "text": "First thing to do after installing web browser", "stars": 5}, {"date": "Mar 6, 2022", "text": "Excellent extension, really helps me to stay updated with the latest tech news so that I can compete with high tier devs in the industry.", "stars": 5}, {"date": "Mar 3, 2022", "text": "Really helpful. Thanks to the developer(s).", "stars": 5}, {"date": "Mar 2, 2022", "text": "Best analog medium. Good job.", "stars": 5}, {"date": "Mar 2, 2022", "text": "Fantastic extension :)", "stars": 5}, {"date": "Mar 1, 2022", "text": "Big fan and a daily user of a very resourceful place!", "stars": 5}, {"date": "Mar 1, 2022", "text": "I love it! Daily dev is what I needed a long time ago...", "stars": 5}, {"date": "Feb 24, 2022", "text": "The best.", "stars": 5}, {"date": "Feb 24, 2022", "text": "It is very helpful for me.", "stars": 5}, {"date": "Feb 24, 2022", "text": "I ranked it one of the top extensions I ever used. It keeps me up-to-date with the current tech news and new upcoming and a lot more. I advised every developer has this extension on their browser.", "stars": 5}, {"date": "Feb 23, 2022", "text": "Exceptional!", "stars": 5}, {"date": "Feb 22, 2022", "text": "Really, it's a useful tool", "stars": 5}, {"date": "Feb 15, 2022", "text": "Love it", "stars": 5}, {"date": "Feb 15, 2022", "text": "exactly a tool developer needed to develop new skills. great job guys", "stars": 5}, {"date": "Feb 12, 2022", "text": "Awesome extension for developers.", "stars": 4}, {"date": "Feb 11, 2022", "text": "Very useful for me. Thanks so much", "stars": 5}, {"date": "Feb 10, 2022", "text": "Great application", "stars": 5}, {"date": "Feb 10, 2022", "text": "Working as the topline central platform architect for one of the top FMCG multi national company, I'm using this extensions on a daily basis with my team to catch the latest trends and to actualise our tech culture.\nUseful for both technical as well as more \"technology\" oriented profiles.\nHighly recommended extension and concept.\nKeep up the good work!", "stars": 5}, {"date": "Feb 9, 2022", "text": "Awesome extension\nI start my day by reading atleast 1 article from this extension", "stars": 5}, {"date": "Feb 8, 2022", "text": "Great Extension for a Developer", "stars": 5}, {"date": "Feb 8, 2022", "text": "Just usefull", "stars": 5}, {"date": "Feb 4, 2022", "text": "Formidable!\nAll articles are essential.\nDaily.mus selects topics by hand.", "stars": 5}, {"date": "Feb 4, 2022", "text": "Outstanding chrome extension! This improved a lot my daily readings. Thanks.", "stars": 5}, {"date": "Feb 3, 2022", "text": "Awesome and super useful tool!!", "stars": 5}, {"date": "Feb 3, 2022", "text": "Indispensable! Great job!", "stars": 5}, {"date": "Feb 1, 2022", "text": "this is parents like for developers", "stars": 5}, {"date": "Jan 31, 2022", "text": "This extension is very useful for every developer. Every developer should add this extension, it helps a lot.", "stars": 5}, {"date": "Jan 30, 2022", "text": "loved it!", "stars": 4}, {"date": "Jan 29, 2022", "text": "Awesome Extension", "stars": 5}, {"date": "Jan 27, 2022", "text": "A cool and unique idea. I stared using daily.dev and i saw I read many articles from daily.dev home. Before this app i was searching and reading article but this extension helped me to reach new blog posts and technology which improved my knowledge and provided me carrier growth. Thanks daily.dev team.", "stars": 5}, {"date": "Jan 27, 2022", "text": "It's okay when I'm free to browse, but 99% of the tim i'll open new tab to find my speed dials & google search bar.[Not the default url field i'm talking about].\nI want those in top of the feed page.\nCurrently removing this extension. If it has the two things later, i'll definetly install it again", "stars": 2}, {"date": "Jan 26, 2022", "text": "Something that I needed for years, searched for a lot, but instead of me finding it, it found me. The best thing that happened to my needs of reading stuff.", "stars": 5}, {"date": "Jan 25, 2022", "text": "Just incredible", "stars": 5}, {"date": "Jan 24, 2022", "text": "helpful extension", "stars": 4}, {"date": "Jan 23, 2022", "text": "Awesome", "stars": 5}, {"date": "Jan 23, 2022", "text": "very good & productive", "stars": 5}, {"date": "Jan 22, 2022", "text": "as a Beginner, nothing could be more helpful than having such Extension to generate a news feed only with what really matters!", "stars": 5}, {"date": "Jan 21, 2022", "text": "Awesome & very helpful", "stars": 5}, {"date": "Jan 21, 2022", "text": "This is an awesome extension. Quite useful for developers, specially new one's.", "stars": 5}, {"date": "Jan 21, 2022", "text": "Found it quite useful", "stars": 5}, {"date": "Jan 20, 2022", "text": "A really good and non-intrusive alternative to look for cool stuff!", "stars": 5}, {"date": "Jan 20, 2022", "text": "Good", "stars": 5}, {"date": "Jan 19, 2022", "text": "Very useful. One place to show different news in IT.", "stars": 5}, {"date": "Jan 18, 2022", "text": "I have using it for months to curate news from my favourite Tech-News Sources. I now miss the option to order News by date, which since the last update on Mid Jan 2022 cannot be seen any longer.\nGreat job anyway.", "stars": 4}, {"date": "Jan 14, 2022", "text": "Easy, light but powerful, very intutive and really helpful!\nAmazing, awesome even BREATHTAKING!\n\nKeep up the good work!", "stars": 5}, {"date": "Jan 13, 2022", "text": "Best way to keep an eye on the dev world.\nA way to sort publication by date would be a good idea", "stars": 5}, {"date": "Jan 13, 2022", "text": "It's a great tool. I am thankful to the  DailyDev for offering me a way to learn random but related topics, which I am interested in.", "stars": 5}, {"date": "Jan 13, 2022", "text": "I never thought reading can be this joyful", "stars": 5}, {"date": "Jan 10, 2022", "text": "One of the most useful tool for developers! I use it every day I can only recommend it for every developer! :)", "stars": 5}, {"date": "Jan 9, 2022", "text": "It is a fantastic extension. I love it! Brilliant! \nI got free stickers, too, from daily.dev (from the survey giveaway), hooray!", "stars": 5}, {"date": "Jan 7, 2022", "text": "Most brilliant product as Chrome extension. I just love it.", "stars": 5}, {"date": "Jan 7, 2022", "text": "Seeing interesting topics in a new tab makes my coffee mornings alive and enthusiastic!", "stars": 5}, {"date": "Jan 6, 2022", "text": "What better daily dose does a developer need. Extremely thankful to the creators team for a thoughtful yet knowledgeable :P extension.", "stars": 5}, {"date": "Jan 5, 2022", "text": "I've been using this as my \"New Tab\" view for many months already, and it's definitely here to stay! I could write volumes on how or why this extension is valuable, but I'll opt to keep this short and sweet, and highly recommend that you simply try it for yourself..", "stars": 5}, {"date": "Jan 4, 2022", "text": "awesome", "stars": 5}, {"date": "Jan 4, 2022", "text": "Awesome,  is became my preferred starting point for learning and keep updated on cutting edge technologies.", "stars": 5}, {"date": "Jan 4, 2022", "text": "One of the best extensions for a programmer. Love it !", "stars": 5}, {"date": "Jan 3, 2022", "text": "if you like to read articles like me this is the best extension for you. you can select your interest, filter the articles, upvote or downvote the articles and share with friends. go for it.", "stars": 5}, {"date": "Dec 30, 2021", "text": "I recommend Daily Dev for all my friends", "stars": 5}, {"date": "Dec 29, 2021", "text": "Great one for devs. I only read tech stuff when received via mail like from quastor. This site helps me to make it a habit to read news everyday. \nOne small suggestion.\nWhenever I open a new tab, it opens this page. I prefer having my brave browser's default new tab landing page as i can curate my favourite sites and tools there. So it would be better if we can toggle between these two tabs (default and daily.dev).\nI have a non work browser profile where i had to remove this extension because... Show more", "stars": 5}, {"date": "Dec 29, 2021", "text": "loved it thanks", "stars": 5}, {"date": "Dec 29, 2021", "text": "The is the best extension for you to be updated and educated with the new tech every day, we developers are busy and we don't even find time to search for what is new  but this extension delivers what you need to know(based on your settings) right into you doorstep(you new tab).\nThanks Guys and keep up the good work!", "stars": 5}, {"date": "Dec 28, 2021", "text": "this apps is great to me for reading news when first launch browser, but what if i want focus mode. i mean, when i do code, i do problem solving with fast new tab and press enter, then the daily.dev not fully loaded, but i spend some bandwith there. so maybe adding focus mode feature will solve that problem.", "stars": 5}, {"date": "Dec 28, 2021", "text": "very good extension. glad i found this", "stars": 5}, {"date": "Dec 27, 2021", "text": "This is just insanely awesome!!, it really rocks!", "stars": 5}, {"date": "Dec 24, 2021", "text": "Really the best extension", "stars": 5}, {"date": "Dec 24, 2021", "text": "Useful and relevant. Great job.", "stars": 5}, {"date": "Dec 23, 2021", "text": "I recommend this app to all dev.", "stars": 4}, {"date": "Dec 21, 2021", "text": "Just util.", "stars": 5}, {"date": "Dec 21, 2021", "text": "great application for learning good things that we want", "stars": 5}, {"date": "Dec 20, 2021", "text": "Great articles and blogs suggestions", "stars": 4}, {"date": "Dec 20, 2021", "text": "I really love this extension. There are always interesting articles to read and keep up to date with. I would definitely recommend it to everyone.", "stars": 4}, {"date": "Dec 17, 2021", "text": "Totally unexpected how good it is..", "stars": 4}, {"date": "Dec 16, 2021", "text": "Effortless way to stay updated on the desired technologies.", "stars": 5}, {"date": "Dec 15, 2021", "text": "I like how this tab was perfectly made, and every day I get impressed with the articles it gives.", "stars": 5}, {"date": "Dec 15, 2021", "text": "I agree with the advert: \"...stop wasting time searching for high-quality articles. Just install daily.dev...\"\nIt met my expectations 😊", "stars": 5}, {"date": "Dec 15, 2021", "text": "Awesome!", "stars": 5}, {"date": "Dec 15, 2021", "text": "I can monitor tech trends just working in browser", "stars": 5}, {"date": "Dec 12, 2021", "text": "Very good resource, sometimes difficult to find tech articles or platforms to read each morning. Daily dev helps me with that. I have something new to read everyday.", "stars": 5}, {"date": "Dec 12, 2021", "text": "Even i am beginner i loved this extension as it is useful for enhancing my knowledge on new technology", "stars": 5}, {"date": "Dec 11, 2021", "text": "Quality Content.", "stars": 5}, {"date": "Dec 11, 2021", "text": "Vital for developers)", "stars": 5}, {"date": "Dec 6, 2021", "text": "daily.dev - developer friendly", "stars": 5}, {"date": "Dec 1, 2021", "text": "Awesome, really helpful to improve myself!", "stars": 5}, {"date": "Nov 25, 2021", "text": "This is so awesome", "stars": 5}, {"date": "Nov 22, 2021", "text": "Excellent UI and easy to navigate ,with some amazing categories to choose from. THANK YOU.", "stars": 5}, {"date": "Nov 20, 2021", "text": "Such a good extention.", "stars": 5}, {"date": "Nov 18, 2021", "text": "best thing a developer can ever get is daily.dev, they guys provide really such amazing blogs that no one can even search for and every single blogs provides such amazing knowledge everytime!", "stars": 5}, {"date": "Nov 16, 2021", "text": "This is amazing ans usefull extension, Helpme to keep updated for the new technologies. I love it.", "stars": 5}, {"date": "Nov 12, 2021", "text": "It's a must have extension.", "stars": 5}, {"date": "Oct 24, 2021", "text": "My favourite  extension so far!", "stars": 5}, {"date": "Oct 17, 2021", "text": "Nice extension.", "stars": 5}, {"date": "Oct 7, 2021", "text": "This is awesome for developers.", "stars": 5}, {"date": "Oct 6, 2021", "text": "Keeps your spirits and knowledge up", "stars": 5}, {"date": "Oct 5, 2021", "text": "Such a great tool! It collects a tone of technical articles for me. It helps me save time and catch up with lasted techniques and related news. Thanks a lot for such an impactful tool!", "stars": 5}, {"date": "Sep 27, 2021", "text": "it helps to stay updated about whats going on :)", "stars": 5}, {"date": "Sep 21, 2021", "text": "Super useful...Awesomely curated..Excellently informative", "stars": 5}, {"date": "Sep 19, 2021", "text": "This plugin helps me to keep me on track. Just loved it.", "stars": 5}, {"date": "Sep 18, 2021", "text": "very helpful, thank you daily.dev", "stars": 5}, {"date": "Sep 15, 2021", "text": "One of the best things on internet for developers and engineers.", "stars": 5}, {"date": "Sep 14, 2021", "text": "Everything is perfect.\nI love how new and amazing articles shows up everyday.\nI really learned a lot from those articles.", "stars": 5}, {"date": "Sep 7, 2021", "text": "This is one of the most amazing chrome extensions I've ever seen. It helps me a lot to find all the amazing tech blogs. It has made my life a lot easier. Highly recommended. Thanks!", "stars": 5}, {"date": "Aug 29, 2021", "text": "The developer's universe in one place.", "stars": 5}, {"date": "Aug 21, 2021", "text": "Simple, quick and a lot of new about dev", "stars": 5}, {"date": "Aug 20, 2021", "text": "Excellent! I love it.", "stars": 5}, {"date": "Aug 19, 2021", "text": "Nice place in order to get updates and find anything. I really love.", "stars": 5}, {"date": "Aug 17, 2021", "text": "Loved It", "stars": 5}, {"date": "Aug 13, 2021", "text": "Developers newsfeed", "stars": 5}, {"date": "Aug 9, 2021", "text": "It has become a part of My Daily Dose of Reading. Absolutely love it.", "stars": 5}, {"date": "Aug 9, 2021", "text": "Love it!", "stars": 5}, {"date": "Aug 6, 2021", "text": "I really appreciate this work. I learn many new things thanks to this extension.", "stars": 5}, {"date": "Jul 27, 2021", "text": "It's simply amazing! Even though I'm a beginner developer I'm still getting new and very valuable information and knowledge every day from articles im getting with this extension. Love it! \n\nThank you guys for this project!", "stars": 5}, {"date": "Jul 26, 2021", "text": "I really liked this extension. I have one question tho. I want to sort the articles after i search for a specific topic. Is it doable?", "stars": 5}, {"date": "Jul 23, 2021", "text": "Love the Extension. Ihave joined multiple telegram channels and facebook groups to know knowledege of current web development technologies and strategies and nowt i can view them on just a new tab everytime with new article", "stars": 5}, {"date": "Jul 16, 2021", "text": "very good tool!", "stars": 5}, {"date": "Jul 16, 2021", "text": "Very useful for developers", "stars": 5}, {"date": "Jul 14, 2021", "text": "Love it", "stars": 5}, {"date": "Jul 5, 2021", "text": "Awesome extension.", "stars": 5}, {"date": "Jul 1, 2021", "text": "It's great", "stars": 5}, {"date": "Jun 9, 2021", "text": "Awesome product to keep in track with the rocket speed of news.", "stars": 5}, {"date": "Jun 3, 2021", "text": "very nice", "stars": 5}, {"date": "May 27, 2021", "text": "Absolutely amazing idea !", "stars": 5}, {"date": "May 21, 2021", "text": "The best chrome extension of my life so far. As a developer and tech guy it's really need to keep up with the market. \nAnd that's exactly what you guys are doing. \nLoved it !!!", "stars": 5}, {"date": "May 20, 2021", "text": "Thank you for creating this wonderful and insightful extension. It keeps me updated about the development world.", "stars": 5}, {"date": "May 15, 2021", "text": "Really helpul, amazing!", "stars": 5}, {"date": "Apr 20, 2021", "text": "Awesome app. I am able to get all latest developer news.", "stars": 5}, {"date": "Apr 20, 2021", "text": "loved it!", "stars": 5}, {"date": "Apr 19, 2021", "text": "I love it; interesting, educational, and engaging topics.", "stars": 5}, {"date": "Apr 14, 2021", "text": "Essential for all developers", "stars": 5}, {"date": "Apr 12, 2021", "text": "Great, wondering can you add RSS feed feature?", "stars": 5}, {"date": "Apr 12, 2021", "text": "good", "stars": 5}, {"date": "Apr 8, 2021", "text": "Really liked this extension.\nIt combines several tech news in one place.\nAs a Software Engineer this is really helpful.", "stars": 5}, {"date": "Apr 7, 2021", "text": "Awesome", "stars": 5}, {"date": "Apr 6, 2021", "text": "terrific", "stars": 5}, {"date": "Apr 4, 2021", "text": "SImply da best!!!", "stars": 5}, {"date": "Apr 1, 2021", "text": "Best replacement for the new tab from a developer's point of view.", "stars": 5}, {"date": "Apr 1, 2021", "text": "Love the feature where I get all the tech news in the new tab page.", "stars": 5}, {"date": "Apr 1, 2021", "text": "The tool is definitely a well built, beautifully simple yet intriguing one. It is very pleasing to the eyes as well! One thing that can be added is the ability to see which hashtag each given story is associated with :)", "stars": 5}, {"date": "Mar 27, 2021", "text": "The perfect extension for grabbing those news", "stars": 5}, {"date": "Mar 20, 2021", "text": "A very convenient extension that allows you to stay up to date with the latest news in the world of IT", "stars": 5}, {"date": "Mar 12, 2021", "text": "Awesome Extension..Highly recomended every dev peoples.....Rock it💥✨🔥🚀", "stars": 5}, {"date": "Mar 10, 2021", "text": "So good.", "stars": 5}, {"date": "Mar 5, 2021", "text": "I had a ton of bookmarks before creating an account. I thought making one would make sure I don't lose them. So I make an account and poof—all my bookmarks gone. why", "stars": 3}, {"date": "Mar 2, 2021", "text": "I find it very useful", "stars": 5}, {"date": "Mar 1, 2021", "text": "Each time I open up a new tab, I'm intrigued.", "stars": 5}, {"date": "Mar 1, 2021", "text": "Excellent -- the only news you really need as Dev. I love this extension.", "stars": 5}, {"date": "Mar 1, 2021", "text": "Extremely helpful", "stars": 5}, {"date": "Feb 28, 2021", "text": "grt tool :)", "stars": 5}, {"date": "Feb 27, 2021", "text": "I saw this curious \"new tab\" screen during a meeting and I fell in love with this interface, and the content looks really relevant. Thank you !", "stars": 5}, {"date": "Feb 26, 2021", "text": "I just started using daily.dev and I am loving it keep it up guys and I hope this plugin reaches more \npeople because it's really useful in keeping current knowledge up to date with the current changes", "stars": 5}, {"date": "Feb 19, 2021", "text": "This is a valuable extension in any devs tool belt. Getting your daily dev news when you open a new tab is great! However, sometimes distracting during work as there are great articles on it ;-).\nLove it! \nKeep up to great work on this Daily.Dev team!\n\nOut of curiosity was it called Daily.now? When was the name changed?", "stars": 5}, {"date": "Feb 18, 2021", "text": "everything what I need during the day. Thanks and keep it up 👍 ⬆️", "stars": 5}, {"date": "Feb 7, 2021", "text": "Extraordinary !  Can't Believe It was created and it exists now!", "stars": 5}, {"date": "Feb 5, 2021", "text": "An amazing source of information.\nThe only \"price\" is to open your tab to have an up-to-date very relevant content.\nThanks a lot and keep up the good work!", "stars": 5}, {"date": "Feb 1, 2021", "text": "Its refreshing when i open the browser or a new tab to receive news blurbs, articles about something tech related, now that i'm taking multiple tech courses and a bootcamp, when i see articles about javascript, python, and react i read them first, something that can help me, rather then getting stuck or down in the news from the articles that used to pop up,", "stars": 5}, {"date": "Jan 31, 2021", "text": "Very useful", "stars": 5}, {"date": "Jan 28, 2021", "text": "Slample and good.", "stars": 5}, {"date": "Jan 23, 2021", "text": "I love it!", "stars": 5}, {"date": "Jan 22, 2021", "text": "Really like this extension, makes it easy to keep up to date with tech world", "stars": 5}, {"date": "Jan 21, 2021", "text": "Awesome experience.", "stars": 5}, {"date": "Jan 21, 2021", "text": "Fantastic, to ride tech news like never before", "stars": 5}, {"date": "Jan 21, 2021", "text": "This extension really help me a lot. I love it.", "stars": 5}, {"date": "Jan 20, 2021", "text": "It's very a very useful extension, thanks for making it.", "stars": 5}, {"date": "Jan 19, 2021", "text": "this extension is amazing, very good to read something before work or when u r bored haha", "stars": 5}, {"date": "Jan 19, 2021", "text": "the best extension that I ever used", "stars": 5}, {"date": "Jan 18, 2021", "text": "Great app !", "stars": 5}, {"date": "Jan 17, 2021", "text": "Very good extension to stay up to date in a fun and convenient way.", "stars": 5}, {"date": "Jan 15, 2021", "text": "Thank you so much for developing such a amazing too/extension. Keep it up", "stars": 5}, {"date": "Jan 14, 2021", "text": "Great, highly practical, easy to use !", "stars": 5}, {"date": "Jan 13, 2021", "text": "Even if I not use all the time, sometimes I try get some interesting \"random\" material from here. Awesome jobs guys!", "stars": 5}, {"date": "Jan 7, 2021", "text": "I really like this idea, but unfortunately the quality of articles is very mixed, probably 70% of what I've clicked on is dross. I'm now getting adverts disguised as articles showing up.\n\nReally needs some moderation of the content if I'm going to keep using this.", "stars": 3}, {"date": "Jan 5, 2021", "text": "awesome one stop solution for my tech blog crave...wish there was a android app too", "stars": 4}, {"date": "Jan 4, 2021", "text": "DOPEST EXTENSION EVER", "stars": 5}, {"date": "Jan 3, 2021", "text": "This extension presents a lot of meaningful content related to Dev World. If you don't wanna search for tons of materials about programming - or don't know the right pages -,it'll be very powerful and helpful!", "stars": 5}, {"date": "Jan 3, 2021", "text": "This is a must-have for every developer in the world! I wish I had discovered this earlier.", "stars": 5}, {"date": "Dec 20, 2020", "text": "Awesome app would really want more articles to come up soon :-)", "stars": 5}, {"date": "Dec 18, 2020", "text": "I am using this extension for over 1 month now and in my opinion, it's one of the greatest ideas it keeps me up to date. I highly recommend it to every developer!", "stars": 5}, {"date": "Dec 17, 2020", "text": "Got recommended by a friend and really hooked up with it. I've been searching for something like this for ages!", "stars": 5}, {"date": "Dec 17, 2020", "text": "good extension for developer", "stars": 5}, {"date": "Dec 6, 2020", "text": "Can you not to force it be the default new tab page? As a developer, we always like a choice.", "stars": 3}, {"date": "Dec 4, 2020", "text": "Guys..... UI both light and dark is fantastic.... Love it .", "stars": 5}, {"date": "Dec 4, 2020", "text": "Hands down the best extension for a developer to be in touch with the ever changing field of tech. Would be great if I'm able to see the tags associated with a particular article in order for me to follow all the right tags", "stars": 5}, {"date": "Dec 4, 2020", "text": "I love this idea! I discover some very interesting pieces through this and works better than newsletters in keeping me updated if I am being honest. Highly recommended extension !", "stars": 5}, {"date": "Dec 3, 2020", "text": "good add-on", "stars": 5}, {"date": "Dec 3, 2020", "text": "Awesome!", "stars": 5}, {"date": "Dec 1, 2020", "text": "Very cool, i just would like to recommend a few more features that will make this extension a totally full experience:\n1. Include youtube videos to the dashboard as with articles.\n2. Maybe stackoverflow questions or other type of content that doesnt just stay in articles and blogs\n\nBut ignoring that, surely its an excellent extension for all type of developers!", "stars": 5}, {"date": "Dec 1, 2020", "text": "Really love it. If the recent tabs icons could be made a little bigger it will be awesome.", "stars": 5}, {"date": "Nov 29, 2020", "text": "Just amazing ! Love that its changing default page of browser !", "stars": 5}, {"date": "Nov 28, 2020", "text": "Useful", "stars": 5}, {"date": "Nov 28, 2020", "text": "This app is amazing! Totally feeds my desire to constantly learn and explore new technologies! Can sometimes take my attention away from work though lol", "stars": 5}, {"date": "Nov 27, 2020", "text": "The perfect solution to my problem of finding development content. Great! Thank you.", "stars": 5}, {"date": "Nov 24, 2020", "text": "Best thing u could have in this internet", "stars": 5}, {"date": "Nov 21, 2020", "text": "I like the way it brings all my articles of  interest in one place without me having to spend time and google it. It really helps me get new tech news.", "stars": 4}, {"date": "Nov 14, 2020", "text": "there is a problem on displaying images \nHope to solve it", "stars": 4}, {"date": "Nov 11, 2020", "text": "Cool", "stars": 5}, {"date": "Nov 9, 2020", "text": "This is wonderful extension. Marvellous!!!", "stars": 5}, {"date": "Nov 9, 2020", "text": "The idea is great, except that I occasionally lose card data, frequently get logged out, and worst of all (since all links refer back to api.daily.dev) experiencing frequent 500 server errors.\n\nI honestly don't understand why api.daily.dev has to be a middleman to shorten url links when it makes no sense to share that link directly. If it's supposed to be used to simply gather usage data, why isn't it a simple an <a> ping attribute used to dispatch that data?", "stars": 2}, {"date": "Nov 9, 2020", "text": "i absolutely hate that it changes new tab.", "stars": 1}, {"date": "Nov 6, 2020", "text": "I love it. All the important news in one page. It has necessary & useful features.", "stars": 5}, {"date": "Nov 4, 2020", "text": "As a user this provides me with the latest development news, it's never static so I'm always up to date with cool interesting and actually good articles!\nAs a author my articles get way more exposure and are featured on Daily.dev\n\nI love how it's becoming it's own little community!\n\nKeep up the good work and making daily.dev even better 🤟", "stars": 5}, {"date": "Nov 3, 2020", "text": "This is absolutely great, since now they've asked for a review... again. it be nice if it was less distracting 😊 Two, alphabet navigation on the left is too responsive or easily triggered. Otherwise great and possibly the platform or reason that I will finally write my Ranticles. My made up thing for articles of a collection of thoughts and horrible use experiences I've been keeping tabs and want to write about 😁", "stars": 4}, {"date": "Nov 3, 2020", "text": "It's so great", "stars": 5}, {"date": "Nov 2, 2020", "text": "great extention, awesome work", "stars": 5}, {"date": "Nov 2, 2020", "text": "daily.dev has provided a nice way to swift through the news and updates. quite a good thing to have on your browser if you need latest tech updates. Having good variety of tags to choose from is a real deal that daily.dev has given to the users! Happy with the service.", "stars": 4}, {"date": "Oct 31, 2020", "text": "good app", "stars": 5}, {"date": "Oct 31, 2020", "text": "I Love it.", "stars": 5}, {"date": "Oct 30, 2020", "text": "Love this, I've been looking for this. It's awesome.", "stars": 5}, {"date": "Oct 30, 2020", "text": "That is just amazing!!! Looking for something like that for a looooong time!!!! Now it is just missing a way to use it on mobile, like a app or a endpoint to access through internet, but as a extension it is just great.", "stars": 5}, {"date": "Oct 30, 2020", "text": "Awesome i love it ❤", "stars": 5}, {"date": "Oct 30, 2020", "text": "best for keep you exploring new and new things daily without any fake or regenerated template everyday, honestly speaking this is best of it's kind... install it...", "stars": 5}, {"date": "Oct 29, 2020", "text": "Great extension to get technology news.", "stars": 5}, {"date": "Oct 29, 2020", "text": "Vey Useful. Totally loved it. Thank You for such a great product.", "stars": 5}, {"date": "Oct 26, 2020", "text": "awesome :-)", "stars": 5}, {"date": "Oct 26, 2020", "text": "Would rate 5 starts if the extension allowed me to choose if I wanted it to be my default page on new tabs. I use other extensions as new tabs, so I simply cannot use this extension.", "stars": 1}, {"date": "Oct 21, 2020", "text": "Just Awesome", "stars": 5}, {"date": "Oct 18, 2020", "text": "Super awesome tool! Time saviour and information aggregation is world class.", "stars": 5}, {"date": "Oct 13, 2020", "text": "it's a must install extension for every beginner as well as developers.", "stars": 4}, {"date": "Oct 7, 2020", "text": "Fabulous", "stars": 5}, {"date": "Oct 2, 2020", "text": "it's good actually, though i would prefer adding the feature that enables you to pin your desired sites beside your history on the header because now we don't have the typical new tab, will update my review when seeing that feature.", "stars": 4}, {"date": "Oct 2, 2020", "text": "Pure awesomeness! Please add more sources.", "stars": 5}, {"date": "Sep 30, 2020", "text": "Great content for developers of all skill ranges. I read all the articles I can every single day, its a great way to stay up to date with the current trends passively!\nLove this extension <3", "stars": 5}, {"date": "Sep 30, 2020", "text": "Love this extension! I have only one feature request: I used Momentum extension before and it shows some nice quotes/weather/time, if you could somehow add it to daily, I would give it a 6-star!", "stars": 5}, {"date": "Sep 30, 2020", "text": "Amazing extension! I love it!\nYou can easily stay up to date with the Dev World and read a lot of amazing articles on all technologies!\nYou DEFINETLY need to install and try this one out!!!", "stars": 5}, {"date": "Sep 30, 2020", "text": "Amazing extension!", "stars": 5}, {"date": "Sep 30, 2020", "text": "So many dev articles curated on the new tab - that's awesome.\nI am lovin it!", "stars": 5}, {"date": "Sep 29, 2020", "text": "Awesome useful tool for Busy Developers", "stars": 5}, {"date": "Sep 24, 2020", "text": "Absolutely great extension", "stars": 5}, {"date": "Sep 21, 2020", "text": "I can not stop recommending this app, actually this is the first time ever I write a review for an app, because they deserve it!\n\nI personally learn something new every single day from the articles in Daily Dev, fantastic recommendations. The content is up to date, interesting and the app is easy to use.\n\nI would really much like to see this applied in other fields, interior design for example.", "stars": 5}, {"date": "Sep 21, 2020", "text": "Daily.dev extension really helped me consume all the latest and trend technology articles at one place. I never expected i could read all the articles this easier. Kudos to the daily.dev team.\n\nThanks", "stars": 5}, {"date": "Sep 20, 2020", "text": "An amazing extension", "stars": 5}, {"date": "Sep 17, 2020", "text": "This is such a time saver for busy people. A must have for every developer!", "stars": 5}, {"date": "Sep 14, 2020", "text": "Amazing extension to keep u informed!", "stars": 5}, {"date": "Sep 12, 2020", "text": "Just amazing! This is a must-have for any developer.", "stars": 5}, {"date": "Sep 11, 2020", "text": "A really great way to stay up to date on all things tech!", "stars": 5}, {"date": "Sep 10, 2020", "text": "Stunning design!", "stars": 5}, {"date": "Sep 9, 2020", "text": "Helpfull", "stars": 5}, {"date": "Sep 8, 2020", "text": "I loved it", "stars": 5}, {"date": "Sep 8, 2020", "text": "Perfect", "stars": 5}, {"date": "Sep 8, 2020", "text": "I love this extension. Shows many many new things coming up and also features I didn't know about", "stars": 5}, {"date": "Sep 6, 2020", "text": "Awfully good!", "stars": 5}, {"date": "Sep 6, 2020", "text": "amazing for me but if  you could add something related to music and games it would be awesome", "stars": 5}, {"date": "Sep 3, 2020", "text": "Love it.", "stars": 5}, {"date": "Sep 1, 2020", "text": "The best tools for busy devs to stay updated.", "stars": 5}, {"date": "Aug 26, 2020", "text": "Its a must for all developers. Its always uptodate. If a source is missing, you can submit it and the daily devs will look into it. They are very responsive.", "stars": 5}, {"date": "Aug 24, 2020", "text": "Lightweight but powerful extension. All the news you would need from the dev community. Highly recommend", "stars": 5}, {"date": "Aug 20, 2020", "text": "Very useful, everytime i open the new tab they attract me first !! love it", "stars": 5}, {"date": "Aug 18, 2020", "text": "My Favorite Extension so far", "stars": 5}, {"date": "Aug 15, 2020", "text": "best addon", "stars": 5}, {"date": "Aug 13, 2020", "text": "Love it, helps me keep up to date on latest news", "stars": 5}, {"date": "Aug 12, 2020", "text": "The best extension for developers! \nI can stay up-to-date with minimum effort and.", "stars": 5}, {"date": "Aug 12, 2020", "text": "Awesome product! I use it and changed the way how I consume news for much better!", "stars": 5}, {"date": "Aug 12, 2020", "text": "This is just excellent!", "stars": 5}, {"date": "Aug 3, 2020", "text": "Loved it.", "stars": 5}, {"date": "Aug 1, 2020", "text": "This is just awesome!!!", "stars": 5}, {"date": "Jul 30, 2020", "text": "Pretty Nice extension", "stars": 5}, {"date": "Jul 30, 2020", "text": "This is something that I have been looking for a long time. The only thing that I would love before subscribing to the paid version is giving priority to favorite sources but also show the ones with less priority, not an all or nothing approach", "stars": 4}, {"date": "Jul 29, 2020", "text": "I started using it and i feel like this extension is must to have\nDaily i was trying to find something to read as a developer\nBut this extension made it more easy to find best articles for me\nI am lovin it", "stars": 5}, {"date": "Jul 27, 2020", "text": "My go-to source for dev news", "stars": 5}, {"date": "Jul 26, 2020", "text": "Highly recommend for anyone wanting an easy way to keep up with Dev news!", "stars": 5}, {"date": "Jul 25, 2020", "text": "Must have for browser! All news at one place this is really helpful for developers like me to get all updates of latest trends.", "stars": 5}, {"date": "Jul 23, 2020", "text": "Very useful!", "stars": 5}, {"date": "Jul 11, 2020", "text": "Excellent, actually...", "stars": 5}, {"date": "Jul 9, 2020", "text": "Amazing product!", "stars": 5}, {"date": "Jul 7, 2020", "text": "It's okay, I like it very much BUT I did not find how to add a custom hashtag. For example, I wanted to add #svelte as a hashtag and when I wrote it in the \"Search Tags\" input it didn't search it nor let me submit it... is it a premium feature, a not implemented feature or I'm just missing something?", "stars": 4}, {"date": "Jul 5, 2020", "text": "I love it!", "stars": 5}, {"date": "Jul 4, 2020", "text": "This is simply awesome cool idea,,u should try it before checking for a review,,u'll stick to it♥", "stars": 5}, {"date": "Jul 3, 2020", "text": "Awesome extension", "stars": 5}, {"date": "Jun 29, 2020", "text": "Awesome....it's good for developers who want to know the current or an existing technology news.", "stars": 5}, {"date": "Jun 28, 2020", "text": "I've never really had the time to stop what I'm doing and spend an hour or two cruising the web looking for up to date industry information or where I can find great projects in a programming language new to me. I just love the high quality web resources available to me every time I open a new tab in my browser. The page is laid out and styled beautifully and its never affected the speed of my browser or compromised my security settings. This is a true 5 Star extension!", "stars": 5}, {"date": "Apr 12, 2020", "text": "service is awesome....but why it's not update the request source .", "stars": 4}, {"date": "Apr 10, 2020", "text": "Very nice!", "stars": 5}, {"date": "Apr 9, 2020", "text": "so much winning", "stars": 5}, {"date": "Apr 1, 2020", "text": "Well done guys, keep up with the good work and the open source spirit!", "stars": 5}, {"date": "Mar 30, 2020", "text": "I love it! Keep updating it!", "stars": 5}, {"date": "Mar 26, 2020", "text": "it's good, hope adding edit bookmark function", "stars": 5}, {"date": "Mar 21, 2020", "text": "A great platform for anyone not only for developers . A great platform to know what happen in the world  in the technology.", "stars": 5}, {"date": "Mar 14, 2020", "text": "Best thing to see in free time", "stars": 5}, {"date": "Mar 13, 2020", "text": "Great tool. I was searching something like this from ages.", "stars": 5}, {"date": "Mar 6, 2020", "text": "I loved it, I recommend to ever developer to use it!", "stars": 5}, {"date": "Mar 6, 2020", "text": "Un must have !!!!", "stars": 5}, {"date": "Mar 1, 2020", "text": "It's very COOL!", "stars": 5}, {"date": "Feb 29, 2020", "text": "Just amazing!  I love it!", "stars": 5}, {"date": "Feb 28, 2020", "text": "Very nice!!!!", "stars": 5}, {"date": "Feb 27, 2020", "text": "Looks great!", "stars": 5}, {"date": "Feb 21, 2020", "text": "This is sooo AMAZING!!!!", "stars": 5}, {"date": "Feb 20, 2020", "text": "Impressive, only wished I could access it through a standard web page as well instead of a new tab.", "stars": 5}, {"date": "Feb 19, 2020", "text": "this is amazing tool \nits gonna make free time productive \nthanks you all behind this awesome idea\nkeep it up", "stars": 5}, {"date": "Feb 17, 2020", "text": "Perfect", "stars": 5}, {"date": "Feb 16, 2020", "text": "Like its UI", "stars": 5}, {"date": "Feb 15, 2020", "text": "i think that addons is perffect", "stars": 5}, {"date": "Feb 13, 2020", "text": "Its amazing to just easily keep up with multiple sources! app works smoothly. BUT MAAAN IS IT DISTRACTING DURING WORK.", "stars": 5}, {"date": "Feb 13, 2020", "text": "A big fan of this extension. Makes keeping up with the latest conversations on different topics so much easier. Also like the UI and ease of management and bookmarking.", "stars": 5}, {"date": "Feb 13, 2020", "text": "Pretty Good one.", "stars": 5}, {"date": "Feb 12, 2020", "text": "Just f**** awesome!!! Can't describe better)", "stars": 5}, {"date": "Feb 11, 2020", "text": "Totally helpful, especially when you don't have huge amount of time to surf the internet and find the useful articles. Instead, Daily will provide it to you, daily!", "stars": 5}, {"date": "Feb 10, 2020", "text": "Best extension!", "stars": 5}, {"date": "Feb 7, 2020", "text": "Maybe a turn OFF/ON button will be good", "stars": 4}, {"date": "Feb 3, 2020", "text": "I love this extension on chrome and i would love it even more if it were on opera, please make it happen!", "stars": 5}, {"date": "Jan 31, 2020", "text": "Awesome tool to stay up-to-date on tech news! It helps me save tons of time as I don't need to manually search the articles one by one anymore. Can't believe I missed this for such a long time. Thanks for developing this tool, great job!", "stars": 5}, {"date": "Jan 29, 2020", "text": "Best way to get all my daily developer news.", "stars": 5}, {"date": "Jan 29, 2020", "text": "Nice Idea and it is good. Thanks", "stars": 5}, {"date": "Jan 27, 2020", "text": "Best plugin and most usable", "stars": 5}, {"date": "Jan 23, 2020", "text": "it is a great tool, my new work routine is start the day while finishing cup of coffee and reading news from daily. Thanks", "stars": 5}, {"date": "Jan 21, 2020", "text": "I wanted to star the extension with only 1 star because having it on the newtab is really frustrating. I'd really like it, and I would like to use it but I can't stop using Raindrop as my newtab extension. In my opinion, making a \"tech watch routine\" should be something planned. I read articles in the morning and I never randomly decide to read tech articles. Is there a way to have access to the content of the extension on a website ?", "stars": 5}, {"date": "Jan 19, 2020", "text": "Very nice.", "stars": 5}, {"date": "Jan 18, 2020", "text": "Awesome and nice ..", "stars": 4}, {"date": "Jan 17, 2020", "text": "Definitely my favourite plugin! Helps me stay updated with the latest dev news. Thank you for an awesome app", "stars": 5}, {"date": "Jan 17, 2020", "text": "Goog! Very good! Usefull IT news aggregtor! BRAVO!", "stars": 5}, {"date": "Jan 16, 2020", "text": "Every developer should have this extension. It's just amazing and saves me time to keep up with the tech posts and trends. However I hope they can filter the post by knowledge levels because if you already possessed intermediate knowledge for certain topics you would not want to check out some beginner's tutorial.", "stars": 5}, {"date": "Jan 15, 2020", "text": "awesome", "stars": 5}, {"date": "Jan 9, 2020", "text": "It's Awesome. When i come to office at morning first open chrome tab then i got lot of infomation. thanks.", "stars": 5}, {"date": "Jan 7, 2020", "text": "One of the best chrome extension, that I have ever used.", "stars": 5}, {"date": "Jan 6, 2020", "text": "Cool :)", "stars": 5}, {"date": "Jan 6, 2020", "text": "must have as a developer", "stars": 5}, {"date": "Jan 6, 2020", "text": "Very useful.", "stars": 5}, {"date": "Jan 5, 2020", "text": "Really awesome", "stars": 5}, {"date": "Jan 2, 2020", "text": "I can't work without this extension! Keeps me up-to-date on all the latest changes and trends in the web dev world!", "stars": 5}, {"date": "Dec 30, 2019", "text": "Best thing to look at when you open the browser, the content is very valuable, and interface is very good and easy to use. Very useful for developers. Absolutely loved it.", "stars": 5}, {"date": "Dec 28, 2019", "text": "Make a way to disable this extension from opening the website everytime I open a new tab. Its disturbing. Just open a tab when I click on the extension", "stars": 4}, {"date": "Dec 25, 2019", "text": "One of the best extension on internet. I loved it.", "stars": 5}, {"date": "Dec 20, 2019", "text": "its realy good to me. Thanks and blessing to us.", "stars": 5}, {"date": "Dec 11, 2019", "text": "Great tool, I love it", "stars": 5}, {"date": "Dec 9, 2019", "text": "F*** YEAH! \n\nI think that about sums it up. Devs should also catch up on news but we tend to be very busy to search the web... bottom line this is an amazing extension. Practical, made with <3 for us by people who love what they do.", "stars": 5}, {"date": "Dec 8, 2019", "text": "This is pretty awesome!", "stars": 5}, {"date": "Dec 6, 2019", "text": "Best way to stay on top of dev news/tech! Sure I've only scratched the surface (saw you can add your own feeds!) but finding it very useful!", "stars": 5}, {"date": "Dec 6, 2019", "text": "Great tool (only in english for now)", "stars": 5}, {"date": "Dec 5, 2019", "text": "Great extension. I use it all the time", "stars": 5}, {"date": "Dec 2, 2019", "text": "useful", "stars": 4}, {"date": "Nov 29, 2019", "text": "I love reading articles and always depended on google articles but daily 2.0 just checks all the right boxes", "stars": 5}, {"date": "Nov 28, 2019", "text": "simply awesome and fruitful extension", "stars": 4}, {"date": "Nov 28, 2019", "text": "I like it 100% now instead of blank new tab I have all this <3", "stars": 5}, {"date": "Nov 25, 2019", "text": "Very Good For Regular Readers!", "stars": 5}, {"date": "Nov 22, 2019", "text": "they great", "stars": 5}, {"date": "Nov 21, 2019", "text": "Been using Daily for more than a year now — huge fan of what it does for me. Every update right in my new tab! ✌️", "stars": 5}, {"date": "Nov 21, 2019", "text": "Great tool that helps me to stay up to date with latest dev news, tech and saves a lot of time. It's like a multiple newsletters in one place. Great Idea.\nWould appreciate if you could add \"Save to Pocket\" function and a search functionality in \"My Sources\" section.", "stars": 5}, {"date": "Nov 20, 2019", "text": "Everyday tool, great UX", "stars": 5}, {"date": "Nov 20, 2019", "text": "Awesome extension! Using it on daily basis, the only thing I regret is that I haven't found it earlier :C\nKeep up the good work and I would love to help you guys out with this extension", "stars": 5}, {"date": "Nov 15, 2019", "text": "super news plugin", "stars": 5}, {"date": "Nov 14, 2019", "text": "Simply a great idea and great implementation!  This is one extension I use every day and can't see my browser without!", "stars": 5}, {"date": "Nov 12, 2019", "text": "that's fantastic :) thank you!", "stars": 5}, {"date": "Nov 7, 2019", "text": "The best extension I ever installed", "stars": 5}, {"date": "Nov 5, 2019", "text": "it's allright..", "stars": 4}, {"date": "Nov 4, 2019", "text": "Hey Add setting for resizing the cards.", "stars": 4}, {"date": "Nov 4, 2019", "text": "It would be awesome if the dark mode and the light mode can switch automatically", "stars": 5}, {"date": "Nov 4, 2019", "text": "This extension is great. It provides the newest and most up to date information on development that I can find. I would recommend this to anyone that does development.", "stars": 5}, {"date": "Nov 2, 2019", "text": "Amazing stuff!", "stars": 5}, {"date": "Oct 31, 2019", "text": "Good solution!", "stars": 5}, {"date": "Oct 30, 2019", "text": "Everyday Learning. Thanks Guys)", "stars": 5}, {"date": "Oct 29, 2019", "text": "such a great idea which help to keep your skills up to date and following up the best practices", "stars": 5}, {"date": "Oct 27, 2019", "text": "I really love the articles and the news on here, if there was a feature where i can toggle the homepage of daily 2.0 instead of just replacing my new tab page, i would love it even more.", "stars": 4}, {"date": "Oct 22, 2019", "text": "Extremely useful and time-saving", "stars": 5}, {"date": "Oct 21, 2019", "text": "great plugin", "stars": 5}, {"date": "Oct 20, 2019", "text": "One of the most helpful extensions in my browser!", "stars": 5}, {"date": "Oct 17, 2019", "text": "It's pretty cool - but it's also pretty slow. It seems like this would be not too difficult to improve over time though.", "stars": 4}, {"date": "Oct 17, 2019", "text": "Beautiful", "stars": 5}, {"date": "Oct 17, 2019", "text": "Amazing! I use daily 2.0 every day! It is a great way to keep me up to date on the newest technology and allows me to learn things that I have never known before.", "stars": 5}, {"date": "Oct 13, 2019", "text": "Pretty Awwesome", "stars": 5}, {"date": "Oct 12, 2019", "text": "awsome, good for coder", "stars": 5}, {"date": "Oct 11, 2019", "text": "The UI and UX are so cool with the hover functions and stuff. You guys have nailed it", "stars": 5}, {"date": "Oct 8, 2019", "text": "Great. awesome.", "stars": 5}, {"date": "Oct 5, 2019", "text": "Amazing home screen! Great job!", "stars": 5}, {"date": "Oct 3, 2019", "text": "It is great extension.", "stars": 5}, {"date": "Oct 2, 2019", "text": "I really like this app, good articles!! It would be nice to have some \"level\" next to the articles. Because some of them just so basic. And It doesn't really bring me value. Or it would be cool if the users could rate the complexity and based on some algorithm it could be advised or not : )", "stars": 5}, {"date": "Oct 1, 2019", "text": "Keep up to date with some good reads and new tabs.", "stars": 5}, {"date": "Oct 1, 2019", "text": "Loved it (y)", "stars": 5}, {"date": "Oct 1, 2019", "text": "I was looking for something like this for sooo long !\nHelps a lot, thank you for your work !", "stars": 5}, {"date": "Oct 1, 2019", "text": "I mean thus far I have learned a lot because I chose to decide that the info that I didnt think I need\ncome to find out I needed it all alone", "stars": 5}, {"date": "Sep 30, 2019", "text": "Need bit better recommendations. Apart from that a very handy tool to go through latest articles and all at one, which cuts a lot of time for finding out which article to read or not.", "stars": 4}, {"date": "Sep 30, 2019", "text": "Nice idea and very helpfull \nThanks", "stars": 5}, {"date": "Sep 29, 2019", "text": "I love this extension but it's lacking some sort of a speed section. Since it's a New tab, that addition would make me really love this New tab extension. This comes with the fact that the \"frequently visited\" section doesn't fit the rest of the layout since the icons look bad. So at least add an option to customize those.", "stars": 4}, {"date": "Sep 26, 2019", "text": "Refreshing :)", "stars": 4}, {"date": "Sep 26, 2019", "text": "This is a fabulous idea. The page works great and is easy to navigate, change settings, and use. I'm not sure if it will be able to  learn from my browsing activity, but that would be really nice. I also wish I could add more than 5 interests.", "stars": 5}, {"date": "Sep 25, 2019", "text": "AWESOME!", "stars": 5}, {"date": "Sep 25, 2019", "text": "This is the one which I was expecting, Helps me to get some interesting news and learn new things in this hectic techy world", "stars": 5}, {"date": "Sep 25, 2019", "text": "Good work", "stars": 5}, {"date": "Sep 25, 2019", "text": "I was impressed by the extension ; Really good", "stars": 5}, {"date": "Sep 25, 2019", "text": "awesome :) helps me a lot", "stars": 5}, {"date": "Sep 24, 2019", "text": "I truly love it, is what I always wanted place where I could easily find posts about app development and related stuff", "stars": 5}, {"date": "Sep 24, 2019", "text": "Not good for productivity, but very interesting :D", "stars": 5}, {"date": "Sep 24, 2019", "text": "So far looks good, well replaces infinity tab, as it's focused directly to developers, web dev and similar, no need to customize news portals like engadget, techcrunnch, business insider links to infinitytab, all is set :) thumbs up, well done, guys.", "stars": 5}, {"date": "Sep 23, 2019", "text": "Absolutely stunning.", "stars": 5}, {"date": "Sep 23, 2019", "text": "Very useful for developer. Simple and very aesthetic\nMaybe add a panel for customization.", "stars": 5}, {"date": "Sep 23, 2019", "text": "This extension is great! Really keeps me updated with the latest news and anything regarding tech. Haven't experienced any issues so far. More power. =)", "stars": 5}, {"date": "Sep 20, 2019", "text": "I love all the articles I see now", "stars": 4}, {"date": "Sep 20, 2019", "text": "Very helpful! ^______________^", "stars": 5}, {"date": "Sep 18, 2019", "text": "This extension is awesome and very proven", "stars": 5}, {"date": "Sep 18, 2019", "text": "Thanks to the Dev. it's very helpful for developers. I'm happy using it everyday.\nAwesome!!!  : )", "stars": 5}, {"date": "Sep 18, 2019", "text": "Best add-on with me", "stars": 5}, {"date": "Sep 17, 2019", "text": "Just the thing I was looking for....", "stars": 5}, {"date": "Sep 14, 2019", "text": "love the UI and dark mode", "stars": 5}, {"date": "Sep 13, 2019", "text": "I'm not sure how the articles presented by this extension are being curated, but the quality of the writing is generally very low. If you are a developer, there are much more efficient ways you can spend your time that reading the half-baked content that this thing shovels into every new tab.", "stars": 2}, {"date": "Sep 7, 2019", "text": "Amazing stuff ,  Hats off to the developer of this extension and idea.", "stars": 5}, {"date": "Sep 5, 2019", "text": "Great way to stay in touch with whats going on across the dev universe. Honestly, even if you don't have time to read all the articles, sometimes just seeing headlines helps lol. Pretty good articles, though I wish it were easier to add other sources. Still, very very good extension!", "stars": 5}, {"date": "Sep 4, 2019", "text": "That was excellent, it was awesome and highly satisfied but there are specific things that can be developed, like when i removed most of the recommendations even after that the page was same, i think there is scope for developing recommendation engine, anyway it was awesome.Please develop and make it even better and better.", "stars": 5}, {"date": "Aug 30, 2019", "text": "Helped me a lot in staying up to date.", "stars": 5}, {"date": "Aug 28, 2019", "text": "Great extension. It has become my go to source for news and a great thing to see when opening a new tab. The only recommendation I have is I wish that you could customize the frequently used sites at the top.", "stars": 5}, {"date": "Aug 27, 2019", "text": "This is one of the greatest new tab extensions! And sad to hear google doesn't let you release your new versions! I don't know if this issue is solved or not, but if not, google is definitely going a wrong way!!!", "stars": 5}, {"date": "Aug 27, 2019", "text": "One the most smooth and functional, knowledgable and useful extension for your daily dose of geeky knowledge.", "stars": 5}, {"date": "Aug 25, 2019", "text": "AMAZING", "stars": 5}, {"date": "Aug 23, 2019", "text": "Is really cool plugin, however it will be great to have more tags to look for , I saw there are some tags that could be great to add ex. UI-UX , but in general is great!", "stars": 4}, {"date": "Aug 23, 2019", "text": "I find this extension extremely useful.  It keeps my finger on the pulse of what's going on in the tech world, without having to go hunting it.  I can even define what appears on my daily feed specific to the technologies I work with.  \n\nGreat tool, and I hope you guys get your extension updates approved, I've asked all people of my programming community to share, like etc! \n\nThanks for this to all the Daily team.", "stars": 5}, {"date": "Aug 20, 2019", "text": "I love this tool, daily tech updates and good learn new things everyday, great tool.", "stars": 5}, {"date": "Aug 16, 2019", "text": "If you want to stay up to date with new features/technologies you should use this extension. Absolutely awesome tool! Thank you guys!", "stars": 5}, {"date": "Aug 16, 2019", "text": "Really great extension, I think I will contribute, some cool features can be add like a search bar, a notation from the extension users, a views stats and a publishing date sorting option will be really great additions !!!!Thank's to the team and I hope I will can help to improve and continous aventura !!", "stars": 4}, {"date": "Aug 15, 2019", "text": "This is a great idea, but I would appreciate more if it would fit better to my preferences. For example one of my favorite topic that I chose was \"nodeJS\" but so far I didn't see any article/topic related to node.js", "stars": 4}, {"date": "Aug 15, 2019", "text": "At last i have found the best new tab extension for me. Many thanks to the developer. :)", "stars": 5}, {"date": "Aug 15, 2019", "text": "simple, polished and highly practical. THANKS", "stars": 5}, {"date": "Aug 13, 2019", "text": "Great app, loved it. Would appreciate if you provide options to let new tab as it was like blank. This way I can open the news tab when I want by clicking on extension rather than new tab.", "stars": 4}, {"date": "Aug 11, 2019", "text": "i love the ui, theme and all information given by daily. thank you.", "stars": 5}, {"date": "Aug 10, 2019", "text": "I really like the app but the fact it hijacks new tabs with no way to turn that off is unacceptable. I would love to use this on demand but for now will be removing.", "stars": 1}, {"date": "Aug 9, 2019", "text": "Helpful extension thanks <3", "stars": 5}, {"date": "Aug 6, 2019", "text": "i cant search on articles", "stars": 3}, {"date": "Aug 5, 2019", "text": "amazing", "stars": 5}, {"date": "Aug 1, 2019", "text": "There could be an option to hide read articles", "stars": 4}, {"date": "Aug 1, 2019", "text": "I just started and it's what I needed, it speaks my language.", "stars": 5}, {"date": "Jul 31, 2019", "text": "The best way to sync your reading between desktop and phone. Luv it!", "stars": 5}, {"date": "Jul 29, 2019", "text": "Best add-on", "stars": 5}, {"date": "Jul 27, 2019", "text": "I liked it", "stars": 4}, {"date": "Jul 25, 2019", "text": "Good UI, Best colors.", "stars": 5}, {"date": "Jul 13, 2019", "text": "Really awesome extension for developers. Thanks!", "stars": 5}, {"date": "Jul 11, 2019", "text": "Great source of curated information. So useful!", "stars": 5}, {"date": "Jul 10, 2019", "text": "You guys are fine!", "stars": 5}, {"date": "Jul 8, 2019", "text": "Keeps me Informed daily!", "stars": 5}, {"date": "Jun 23, 2019", "text": "Perfect for Dev <3 !", "stars": 5}, {"date": "Jun 22, 2019", "text": "Great !", "stars": 5}, {"date": "Jun 17, 2019", "text": "love it", "stars": 5}, {"date": "Jun 14, 2019", "text": "I've really boosted my knowledge considering that I'm quite a novice when it comes to coding and i can tell you for a fact i helped me for this past week I've been using it. its really useful as someone who is interested in computers and all. Well done Daily Now.", "stars": 5}, {"date": "Jun 13, 2019", "text": "Awesome new tab experience !\nLoved it.", "stars": 5}, {"date": "Jun 4, 2019", "text": "why this extension hides my favorites?", "stars": 2}, {"date": "May 23, 2019", "text": "great extension, would install again", "stars": 5}, {"date": "May 22, 2019", "text": "Nice sickening design. it's different and not boring. Its like stumbleupon! Man I miss that site. Anyway great articles are provided and you can sync bookmarks. You guys should make a bookmark manager for chrome like dewey bookmarks. except better!", "stars": 5}, {"date": "May 18, 2019", "text": "Great one!", "stars": 5}, {"date": "May 17, 2019", "text": ".Great extension for developers that bring great articles to read", "stars": 5}, {"date": "May 15, 2019", "text": "Excellent Chrome Extension for Developers!!", "stars": 5}, {"date": "May 13, 2019", "text": "Awesome! Relevant content, fully customisable. Helps keep you in the know with the latest trends and news.", "stars": 5}, {"date": "May 7, 2019", "text": "Love this idea, and the implementation is perfect. Just wish there were more c#/NET resources!", "stars": 5}, {"date": "May 7, 2019", "text": "Great extension! keeps me updated on the cutting edges technologies, love it.\ni would love if they add an option for \"favourite sites\" or \"see first sites\" for sites that i always want to see before other sites (even when the articles get older the other sites articles)", "stars": 5}, {"date": "May 4, 2019", "text": "Good, but needs fixing. Every 2 days it crashes and i have to reinstall it again lol. Do not know why.", "stars": 4}, {"date": "May 4, 2019", "text": "Gorgeous UI and marketing, product looks great so far. Super useful!", "stars": 5}, {"date": "May 2, 2019", "text": "Amazing tech News feed in my New Tab. Many thanks to the developers!", "stars": 5}, {"date": "May 2, 2019", "text": "Very good tool. Starting to read a lot", "stars": 5}, {"date": "May 2, 2019", "text": "I like it. Has good potential. Fast and beautiful. Modern and slick. But missing some important features:\n1. Mark as read. When I open and read the article, it should be greyed out or anything similar. Or a context menu or button that marks this article as read. Or try feedly's style of mark as read when scrolled. you get the idea.\n2. Put when exactly was the article published. For example, I want to only view articles within 24 hours.\n3. quick share icon. Share as url, save to pocket, everno... Show more", "stars": 4}, {"date": "May 2, 2019", "text": "Search function will be great.. other than this it the perfect extension", "stars": 5}, {"date": "May 1, 2019", "text": "Awesome UX!! Keep up the good work", "stars": 5}, {"date": "Apr 30, 2019", "text": "I've been using this extension for almost a year. It is the perfect combination of geek news without getting nerd-sniped. Well done Daily team!", "stars": 5}, {"date": "Apr 30, 2019", "text": "How can I trust the code base of this? how can i know that you are not selling my history of browsing to show ads?", "stars": 3}, {"date": "Apr 30, 2019", "text": "Congrats on Your 2.0 Launch! Liked it ;)", "stars": 5}, {"date": "Apr 23, 2019", "text": "Great extension!  well done interface", "stars": 5}, {"date": "Apr 22, 2019", "text": "Excellent extension.\nWould like to see search function", "stars": 5}, {"date": "Apr 22, 2019", "text": "brilliant extension <-:", "stars": 5}, {"date": "Apr 21, 2019", "text": "Really good tool focused on developer interests. Customizable, non-intrusive and has a dark mode, which I adore! Thanks!", "stars": 5}, {"date": "Apr 19, 2019", "text": "A five star review is reserve for things that just do exactly what you want. This is the best part about starting my browser because I always find at least two articles to read each day or more that are super interesting, and relevant in my field. All developers should consider this little addition to their browser.", "stars": 5}, {"date": "Apr 18, 2019", "text": "Good.", "stars": 5}, {"date": "Apr 18, 2019", "text": "Perfect extension if you wanna stay up to date with market technologies.", "stars": 5}, {"date": "Apr 15, 2019", "text": "No news for mobile development :(", "stars": 3}, {"date": "Apr 8, 2019", "text": "excellent", "stars": 5}, {"date": "Apr 6, 2019", "text": "Great idea Thanks", "stars": 5}, {"date": "Apr 5, 2019", "text": "Just awesome!", "stars": 5}, {"date": "Apr 5, 2019", "text": "is it possible to flag an article on medium that's for members only? it would save me some clicks if I knew what i can read vs what i have to pay for to read", "stars": 5}, {"date": "Apr 4, 2019", "text": "Best new tab screen for generating new ideas that I've ever come across!", "stars": 5}, {"date": "Apr 1, 2019", "text": "this is the first thing that needs to be done\n\n1. show info based on relevance & frequency of the multiple sources the info aggregation is getting the info from\n\n- so if 'python 3.0' is in say 80-100% of all the sources within a week's time, then i'll be worth showing\n\n\n2. highlights key terms such as the subject like companies, names, places, etc.\nso that the info is easily scannable\n\nthe media always did nothing but complained about info-overload for years, instead of valueless info, actual... Show more", "stars": 1}, {"date": "Mar 30, 2019", "text": "I think It's really useful for most developers", "stars": 5}, {"date": "Mar 29, 2019", "text": "Super great extension, love seeing new articles all the time while my code or terraform compiles. \n\nWould love to see a small description next to the sources list though, so I can more easily filter out stuff that I'm not at all interested in. Or maybe some other cross section of filters, like languages, frameworks, etc.\n\nKeep up the great work!", "stars": 5}, {"date": "Mar 29, 2019", "text": "Just f**** awesome!!! Can't describe better)", "stars": 5}, {"date": "Mar 27, 2019", "text": "Absolutely amazing. Saves you tons of time dudes. GET IT and USE IT", "stars": 5}, {"date": "Mar 22, 2019", "text": "So Good Extension For Developer + Made with ♥", "stars": 5}, {"date": "Mar 21, 2019", "text": "Really good!", "stars": 5}, {"date": "Mar 19, 2019", "text": "This is simply a fountain of help. Thank you!! 5 stars", "stars": 5}, {"date": "Mar 18, 2019", "text": "Awesome!.Need more blogs", "stars": 4}, {"date": "Mar 8, 2019", "text": "I can't live without it any more", "stars": 5}, {"date": "Mar 1, 2019", "text": "great extension dude! i suggest to implement searching feature because sometimes people want to read the topic which only they want. thankyou very much", "stars": 5}, {"date": "Feb 25, 2019", "text": "Great Tool, to give a feature suggestion, it would be better, if we can flag the bookmarked items and a view to see articles related to each flag (like in pocket extension) :).", "stars": 5}, {"date": "Feb 21, 2019", "text": "All the reviews are correct about this extension. I usually never give a 5 star rating as there is usually room for improvement. However, after only 1 day of use and the great and sincere care of the developers I had to give it a 5 star. Keep it up and all the best :)", "stars": 5}, {"date": "Feb 15, 2019", "text": "Its a nice extension but I wish if I could add custom sources of blogs which I like (Medium, Techcrunch, etc) and can set preferences.", "stars": 4}, {"date": "Feb 4, 2019", "text": "I was looking for an alternative to Muzli something more into programming. And this is just perfect (:", "stars": 5}, {"date": "Feb 3, 2019", "text": "Awesome!!", "stars": 5}, {"date": "Jan 27, 2019", "text": "Just amazing... Have been looking for such tool for long time", "stars": 5}, {"date": "Jan 22, 2019", "text": "Good, nice design.\n\nicon is a little bit ugly.", "stars": 5}, {"date": "Jan 13, 2019", "text": "I would love if there are more mobile dev articles on it too", "stars": 4}, {"date": "Dec 13, 2018", "text": "Amazing! All the news that you need is in your browser. Many thanks to the Dev.", "stars": 5}, {"date": "Dec 10, 2018", "text": "Great tool. Improved my daily news since of first day that I added on Chrome. My surprise was that today, all cards saved were removed of my account :/ The vast majority of the links I had not yet visualized and now I have lost everything.", "stars": 4}, {"date": "Dec 10, 2018", "text": "It's the best thing ever like i wouldn't know how to keep up with all of the new tech that is coming out every single second but with daily/dev its as easy as it could be, plus their amazing team somehow still knowhow to make it even better with their awesome updates", "stars": 5}, {"date": "Dec 10, 2018", "text": "helpful on the run", "stars": 5}, {"date": "Nov 28, 2018", "text": "Very Nice Plugin", "stars": 5}, {"date": "Nov 28, 2018", "text": "Some good material.  Wouldn't have browsed otherwise.", "stars": 5}, {"date": "Nov 27, 2018", "text": "I don't have words to describe how I love this, Thanks for this extension", "stars": 5}, {"date": "Nov 20, 2018", "text": "Excellent Idea and awesome Implementation.... Love it !!!", "stars": 5}, {"date": "Nov 20, 2018", "text": "really is perfect", "stars": 5}, {"date": "Nov 18, 2018", "text": "t's amazing. An absolute gem and time saver. My article was number 1 for almost an entire day! The bookmarking feature is also very handy.", "stars": 4}, {"date": "Nov 14, 2018", "text": "The morning coffee and a browse through Daily, perfection. Well done guys.", "stars": 5}, {"date": "Nov 9, 2018", "text": "I love it :)", "stars": 5}, {"date": "Nov 6, 2018", "text": "it's a good extension and  very helpful , I'm happy using it everyday", "stars": 5}, {"date": "Oct 31, 2018", "text": "As a developer, I cannot imagine a better new tab extension than Daily.co. Mad props! 👏", "stars": 5}, {"date": "Oct 21, 2018", "text": "It's a very useful chrome extension. Every day I can read developer news and articles. Here I can find everything. Thx for Developer!", "stars": 5}, {"date": "Oct 12, 2018", "text": "Thanks so useful extension, now I dont need any RSS subscriptions for stuff I need to read. Great idea and thanks.", "stars": 5}, {"date": "Oct 11, 2018", "text": "Seems like a great source of news however It's missing some customizability for me to use. E.g I don't want to use it as the new tab page, but in chrome settings when I click disable from letting daily go on the new tab section, it disables the extension entirely", "stars": 5}, {"date": "Oct 8, 2018", "text": "Awesome extension! I spend a lot of time on it and learn tons!", "stars": 5}, {"date": "Oct 2, 2018", "text": "Great way to squeeze in some reading in a developer's day. Very relevant content and the fact that it opens up on every new tab, it's hard to miss.", "stars": 5}, {"date": "Sep 26, 2018", "text": "Great  tool !!!! very useful", "stars": 5}, {"date": "Sep 23, 2018", "text": "Loved the extension. Nice theme! Excellent concept. Just one point to make: the sidebar shows the list of all the sources from where you gather your articles. If I click on a source, it grays out that source implying that no more articles will be shown from that particular source. What I fee is that this functionality should be just the inverse of this. For eg, what if I want to read all the articles by a particular source? There is no option for that. I clicked on the sources hoping to read ... Show more", "stars": 5}, {"date": "Sep 23, 2018", "text": "My favourite add-on :)", "stars": 5}, {"date": "Sep 22, 2018", "text": "Really amazing. Keeps me updated without having to scrap the useful links among hundreds of email newsletters.", "stars": 5}, {"date": "Sep 21, 2018", "text": "I truly appreciate this extension, although sometimes it keeps me from getting my work done :)", "stars": 5}, {"date": "Sep 13, 2018", "text": "Does nothing. Black, blank page on my new tab. No news.\nUPDATE: Added a couple of stars because it works at home. It does not work at my workplace. Hoping for a response explaining why this might happen? Thanks!", "stars": 3}, {"date": "Sep 12, 2018", "text": "Why I didn't find this before", "stars": 5}, {"date": "Sep 7, 2018", "text": "I like the dark theme news", "stars": 5}, {"date": "Sep 6, 2018", "text": "Best extension i found as a developer it helps me find developer related articles in my new tab every time i open chrome is't the best extension for any developer", "stars": 5}, {"date": "Sep 3, 2018", "text": "Great app", "stars": 5}, {"date": "Sep 1, 2018", "text": "Pretty Good one.", "stars": 5}, {"date": "Aug 27, 2018", "text": "Solid place for developers to get news/resources. My number spot for news behind  hacker news", "stars": 5}, {"date": "Aug 27, 2018", "text": "Daily News For Developer.", "stars": 4}, {"date": "Aug 27, 2018", "text": "In addition to the news, daily bookmark section is worth mentioning.", "stars": 5}, {"date": "Aug 21, 2018", "text": "Something I was searching for ages and couldn't fine one. Such a good idea. Great extension that helps me to stay up to date with latest tech. Highly recommended. Thanks!!", "stars": 5}, {"date": "Aug 19, 2018", "text": "Awesome", "stars": 5}, {"date": "Aug 15, 2018", "text": "its dope! Saves me from hunting all over medium for awesome articles. Great job!!", "stars": 5}, {"date": "Aug 15, 2018", "text": "Hi, really enjoy using your extension. \n\nI have a few annoying moment when trying to save and unsave my bookmark, sometime I missclick the button at it open new tab. \n\nHope you can improve the UX for this. \n\nThanks", "stars": 5}, {"date": "Aug 14, 2018", "text": "Very good extension.", "stars": 5}, {"date": "Aug 4, 2018", "text": "cool", "stars": 5}, {"date": "Aug 3, 2018", "text": "One of the must have extension as developer.\n\nSimple and effective.\n\nThanks a lot.", "stars": 5}, {"date": "Aug 2, 2018", "text": "Genial", "stars": 5}, {"date": "Jul 31, 2018", "text": "Really useful!", "stars": 5}, {"date": "Jul 31, 2018", "text": "It's super helpful to me, love it very much <3 <3 <3", "stars": 5}, {"date": "Jul 30, 2018", "text": "really useful", "stars": 5}, {"date": "Jul 18, 2018", "text": "I was about to set 5 stars cause its awsome. But then I saw the ad for monday.com. *SIGH* will this showered with commercial now?? Then it will deserve 1*. I don't wanna start my morning filter ad's from the real things.  Consider solving your revenue from other sources....", "stars": 3}, {"date": "Jul 14, 2018", "text": "It's amazing. An absolute gem and timesaver. My article was number 1 for almost an entire day! The bookmarking feature is also very handy.", "stars": 5}, {"date": "Jul 8, 2018", "text": "I love being able to reduce the amount of bookmarks I have by having a service that is at my fingertips as soon as I open my browser. Being able to see an aggregate of all the articles that may have taken me hours to get to or sift through is awesome and a fantastic way to start my day.", "stars": 5}, {"date": "Jun 25, 2018", "text": "This has become my go-to every morning while I have my cup of joe! It's awesome to have a lot of good news/article sources in one place (and easy to navigate). Definitely recommend it!", "stars": 5}, {"date": "Jun 15, 2018", "text": "I really like this. with no effort, I can see what's new and improve my skills.\nBefore to use it I had such difficulty in being up to date, looking for content on the web and now, I only open my browser and vuala, a lot of content.\n\nKeep strong guys and thank you so much.", "stars": 5}, {"date": "Jun 4, 2018", "text": "brilliant for developers.\ni love it!", "stars": 5}, {"date": "May 17, 2018", "text": "Awesome design. Great idea.", "stars": 5}, {"date": "May 9, 2018", "text": "Great source for some interesting dev reads throughout my day", "stars": 5}, {"date": "Apr 4, 2018", "text": "Very nice. Quality content.", "stars": 5}, {"date": "Apr 2, 2018", "text": "Should work on design, you can consider like giphy.com\n\n1. according to the popularity or claps, make cardbox sm, md, l,xl\nJust a thought!\n\nDaily is AWESOME", "stars": 3}, {"date": "Feb 6, 2018", "text": "Excellent design and simple", "stars": 5}, {"date": "Nov 7, 2017", "text": "Exceptional tool, great resource for getting daily updates on data that really matters", "stars": 5}, {"date": "Nov 7, 2017", "text": "Finally I have one place to find all the latest web news. One thing though, I need a way to bookmark posts", "stars": 5}, {"date": "Nov 7, 2017", "text": "Allows me to keep my web development knowledge updated with the latest news and discoveries.", "stars": 5}]