[{"text": "nice working fine", "stars": 5, "date": "Feb 13, 2024"}, {"text": "Thanks to this extension for good usability. Especially \"Only images from links\" option is very useful. I wish it will be more useful with the following improvement.\n- Option to sort thumbnails by filename or by position in the webpage.\n- Indication of the number of selected thumbnails  before download.", "stars": 4, "date": "Feb 3, 2024"}, {"text": "It worked some weeks ago now it don't show anymore any image, seems don't work. I will try to install again...", "stars": 3, "date": "May 12, 2023"}, {"text": "You should make it so that it can select images from all currently open tabs. I want to download some albums but the images in the overview page are only small 200x200 pixel versions of the image (which will be selected by the image downloader extension), only after clicking the image the page with the full image version is opened but only 1 per page so I don't save any time using this app sadly.", "stars": 3, "date": "May 6, 2023"}, {"text": "works good :)\nMissing: the size in kb/MB of each image.", "stars": 4, "date": "Feb 2, 2023"}, {"text": "I love this extension so much; it's the best image-finding, thumbnail-displaying, filtering/selecting image group downloader extension I've tried thus far.  I wish it had sister extensions for Firefox and other browsers, because I haven't found a comparable one yet.  One of the first extensions I install in a new profile.", "stars": 5, "date": "Jan 14, 2023"}, {"text": "Svg is saved as png image, not svg.", "stars": 3, "date": "Jan 5, 2023"}, {"text": "very good can download hidden svg files", "stars": 5, "date": "Nov 22, 2022"}, {"text": "Just wanted to drop by and say how happy I am with this extension. Never had any issues with it and it's super reliable. Thank you so much!", "stars": 5, "date": "Nov 10, 2022"}, {"text": "On a page with 4-5 images on it, the extension brings up around 30 images, each one repeats like 5 times, seems less than useful.", "stars": 3, "date": "Jun 11, 2022"}, {"text": "I don't write reviews but I wanted to write this in case anyone was looking for the same thing I was.\n\n~ This works on pinterest - it downloads FULL RESOLUTION images from feeds (such as boards) instead of thumbnail size images. \n~ This also works on flickr - it downloads highest full resolution images available even when the owner disabled right-click \n~ Also works on WeHeartIt despite the sites recent choice to place a limit on how many images you can download (afaik)\n\nFrom the extension yo... Show more", "stars": 5, "date": "May 1, 2022"}, {"text": "AMAZINGLY helpful in my job as a graphic designer. Such a fantastic plugin, thank you thank you!!!", "stars": 5, "date": "Jan 29, 2022"}, {"text": "Feature braking bugs", "stars": 1, "date": "Jan 27, 2022"}, {"text": "A super tool !! very powerful", "stars": 5, "date": "Nov 21, 2021"}, {"text": "Simply works!", "stars": 5, "date": "Oct 7, 2021"}, {"text": "I use it regularly. I prefer it to the original \"Image Downloader\" as it provides details and options not available on the original, such as size detail of images, options to search using different image search engines (sadly, since this extension hasn't been updated since 2019, the option to search using Yandex doesn't work very well anymore)", "stars": 5, "date": "Jun 23, 2021"}, {"text": "I like this extension a lot, really helps speed up my workflow. One feature that I would love is a \"browse folders\" button on the \"save to subfolder\" field so I can quickly select the folder I want to save to, rather than being forced to use a separate explorer window to navigate to my folder and copy the directory path.", "stars": 4, "date": "May 6, 2021"}, {"text": "doesnt work on instagram anymore. others may like it but its of no use to me", "stars": 1, "date": "Apr 28, 2021"}, {"text": "ya no es como antes ahora mismo ni aparecen las imágenes en grande\n\nIt is not like before right now nor do the images appear in large\n\nthere should be that when a publication video or a history, the image that appears when starting the video can be downloaded from the video, like before", "stars": 1, "date": "Apr 27, 2021"}, {"text": "really great so far. really better than original one. no bug yet. can download gifs too.", "stars": 5, "date": "Apr 26, 2021"}, {"text": "Im using this on Opera...\nHow do I disable the download popup confirmation??\nI dont want to keep clicking yes..", "stars": 4, "date": "Apr 23, 2021"}, {"text": "I use Image Downloader for my job, but it was having a few issues, and I saw a comment about it being continued here.  Was very excited to try this new version!  Unfortunately, it seems to bring up 5 or 6 identical versions of each image on the website I need it for.  They do have different names, but the original Image Downloader doesn't have this issue.  Since my only issue with the original was having to reinstall it occasionally to restore the subfolder option, I think I'll have to stick ... Show more", "stars": 4, "date": "Apr 22, 2021"}, {"text": "This is really good, the filter by link is really helpful. One problem is the extension doesn't save the files in the specific order from it was taken. It would be a great improvement specially for extracting pictures from an album with a specific order. Kudos for the job mate.", "stars": 4, "date": "Apr 16, 2021"}, {"text": "doesnt work anymore but found one that does\n\nhttps://chrome.google.com/webstore/detail/save-image-as-type-20/hhmnengcgekecnlielgcfcbjanjlnifg", "stars": 1, "date": "Mar 19, 2021"}, {"text": "i love this extension. it's really helpful and i recommend it to anyone looking for batch images download tool with other functions like reverse tracking the image.", "stars": 5, "date": "Feb 3, 2021"}, {"text": "Works well, does what it says it'll do, seems to be fairly speedy about it, and doesn't have a lot of clutter.\n\nTwo features I wish were present, though.  First, I would absolutely love it if this could download images from all open tabs, not just the current tab.  It would save a LOT of clicking.  As this feature is missing from virtually every bulk image downloader I've seen, I wonder if it's perhaps no longer possible to do this in Chrome.  If that's the case, then... oh well.  If, on the ... Show more", "stars": 4, "date": "Jan 28, 2021"}, {"text": "I've been using the older version of the extension for a long time, and only just stumbled across this one. It works just as well as the old one. Unfortunately, it still doesn't seem to be able to get past the cloudfront image protection on postype, but I didn't really expect it to. Still highly recommended.", "stars": 5, "date": "Jan 27, 2021"}, {"text": "Helpful", "stars": 5, "date": "Jan 18, 2021"}, {"text": "works very rarely, mostly it downloads only html pages instead of the linked pictures", "stars": 1, "date": "Dec 30, 2020"}, {"text": "Nice update from the original downloader that I have used for a long time. It saved me a lot of time downloading image from various website for interior design ideas. I will be using this from now on (Rest in peace, old Image Downloader, I will be missing you ^^)\nThank you very much!", "stars": 5, "date": "Dec 16, 2020"}, {"text": "This does exactly what I need it to. I buy a lot of supplies online and I keep a spreadsheet with all my invoices and order information. I like to keep product images attached because when I'm looking for something specific it's quicker than trying to read all of the descriptions. A lot of websites have it zoom in whenever you hover over the picture and you can no longer save through right-clicking. I'd either have to take a screenshot or go through the pages source code to find the full size... Show more", "stars": 5, "date": "Nov 29, 2020"}, {"text": "Seems like it would work perfectly in 90% of situations, however, doesn't seem to be compatible with my reason for installing it, saving picrew files. This might not be the extension's fault, as you need to go into the source section of \"inspect element\", copy each image's base 64 data, open that into a new tab, and only *then* can you save the image. If this is either fixed or literally impossible to fix, I'll change my rating to 5 stars (if that's possible in the web store?) Aside from this... Show more", "stars": 4, "date": "Nov 4, 2020"}, {"text": "thank you but how do i use it hehe", "stars": 5, "date": "Oct 5, 2020"}, {"text": "Why you all image downloader interrupts the size of image? No picture can exceeds from 300 x 200???? through direct direct of google we get full size picture about 1000 x 600 etc. I used multiples all have same sort of problem.", "stars": 5, "date": "Oct 2, 2020"}, {"text": "Thanks for the awesome extension, it works brilliantly! Is there some advanced how-to documentation somewhere? Like how to use \"FILTER BY URL\" correctly? I'm wondering if it's possible to have the \"SAVE TO SUBFOLDER\" be automatically the URL subfolder? And if it's possible to have it crawl through all the subfolder children of the webpage and download the images from those subfolders? For example, say there is a website with the following structure: mysite.com/collections/watches/dante; mysit... Show more", "stars": 5, "date": "Sep 27, 2020"}, {"text": "Extension works very well! I'm able to download images from real estate websites that use photos as backdrops. Also, the extension is able to recognize and download photos that the Pinterest extension doesn't recognize. Job well done! Thank you!!! BTW - your comment on the original Image Downloader extension (that doesn't work), brought me here.", "stars": 5, "date": "Sep 25, 2020"}, {"text": "Great for extracting photos from Google Maps Photos & websites with no right click options.\n\nMy only complaint is the image popup on the left side of the screen that you have to refresh the webpage in order to close.", "stars": 5, "date": "Sep 1, 2020"}, {"text": "Extension actually works pretty well, but has Bing redirect malware bundled in with it.", "stars": 1, "date": "Aug 29, 2020"}, {"text": "Hi Dima, the tool works but the quality of the images is quite poor compared to manually right clicking each photo... Is there a fix for this or do I have to sacrifice quality for time?", "stars": 3, "date": "Aug 26, 2020"}, {"text": "Top", "stars": 5, "date": "Jul 20, 2020"}, {"text": "You're the best! I've recommended this extension to at least ten different people. Keep up the great work!", "stars": 5, "date": "Jul 16, 2020"}, {"text": "PERFECT ALL", "stars": 5, "date": "Jul 3, 2020"}, {"text": "Works like a charm!", "stars": 5, "date": "Jul 3, 2020"}, {"text": "Thank you!", "stars": 5, "date": "Apr 15, 2020"}, {"text": "Please add ability to download .jfif files, too.", "stars": 5, "date": "Mar 28, 2020"}, {"text": "Unfortunately this extension doesn't find all the images from a web page.", "stars": 3, "date": "Mar 24, 2020"}, {"text": "Its so good! I needed this so much... Thank you for making this :D", "stars": 5, "date": "Mar 5, 2020"}, {"text": "Oh man,  thanks a lot. Just tried it yesterday. Love it. It's what I've been looking for. So glad I came across your extension.  I'll tell my friends.", "stars": 5, "date": "Feb 28, 2020"}, {"text": "So far looks good but not for my usage, if possible I would like to download selected images from context menu", "stars": 3, "date": "Jan 28, 2020"}, {"text": "easy to use, thanks a lot!", "stars": 5, "date": "Jan 3, 2020"}, {"text": "Easy to use and very helpful... Thanks a lot Developer Team plus all that are working to make this happen.", "stars": 5, "date": "Jan 2, 2020"}, {"text": "Subforder is not work sometimes.I'm so sad.", "stars": 3, "date": "Dec 30, 2019"}, {"text": "Opened on a Drive page containing several hundred images, it won't download a single one, just offers junk found on other pages.", "stars": 2, "date": "Dec 26, 2019"}, {"text": "Beautiful. Just what I was looking for.", "stars": 5, "date": "Nov 29, 2019"}, {"text": "hi dmitry can you make it work for yupoo.com? (ie: https://x.yupoo.com/photos/3501236316/albums)\nworks great on other sites thanks!", "stars": 5, "date": "Nov 28, 2019"}, {"text": "It just works, very useful!", "stars": 5, "date": "Nov 26, 2019"}, {"text": "Not only is this extension wonderful, but Dmitry is so responsive to feedback and is committed to making the app even better. I had some issues with a specific site and the way they were obfuscating the image sources, and he came through that day with a fix which I just tested and works perfectly.\nThanks so much for being committed to this app!", "stars": 5, "date": "Nov 18, 2019"}, {"text": "Works great", "stars": 5, "date": "Nov 17, 2019"}, {"text": "Works as expected, thank you!!", "stars": 5, "date": "Nov 14, 2019"}, {"text": "This app is absolutely perfect!", "stars": 5, "date": "Nov 7, 2019"}, {"text": "It works", "stars": 5, "date": "Oct 27, 2019"}, {"text": "i'm so glad i saw your comment about you having continued this extension.  i've been using it for a few years now ( i do a lot of graphics design work so i'm always needing to download resource images/textures etc. ).  i'd noticed random issues popping up when using it lately... but couldn't imagine giving it up.  now, thanks to you, i don't have to!  thank you so much for your hard work!!", "stars": 5, "date": "Oct 17, 2019"}, {"text": "Great extension. Have a chance to add 'save to zip' option in future update by the way?", "stars": 5, "date": "Oct 1, 2019"}, {"text": "Best one! Thank you Dmitry for not leaving alone and improving this peace of software :)", "stars": 5, "date": "Sep 30, 2019"}, {"text": "Perfect! Downloads multiple image posts and also from private profiles.", "stars": 5, "date": "Sep 23, 2019"}, {"text": "Superb stuff. Wish I'd found this ages ago. Saves me loads of time downloading images from the web. It does a good job of scraping the image links from pics you can't right click and download. Good to see the author continuing this extension.", "stars": 5, "date": "Sep 18, 2019"}, {"text": "Best of its kind, so many features, and really works well. Options include reverse image search using convenient shortcuts, open in new tab, download (individual or batch), many ways to filter results, search, sort, and many more.", "stars": 5, "date": "Sep 7, 2019"}, {"text": "The Best extension of its kind!!!\n\nSimple and great!\n\nAll you need to do is Just click on the IDC icon or MORE Simply, use the Keyboard shorcut in chrome extension setting.", "stars": 5, "date": "Aug 4, 2019"}, {"text": "Wow, Amazing!\n\nThis extension is very great! I will recommend 100% guys!\n\nThank you Dev!", "stars": 5, "date": "Aug 3, 2019"}, {"text": "The most useful plugin in the store! MUST to have. Thanks to developers.", "stars": 5, "date": "Jul 18, 2019"}]