[{"stars": 5, "text": "The only thing that makes me sad is that I should find it and use this extension long time ago ;-)\nWorks stable and awesome.\n\n:colortheme=matrix\n:set fs (full screen)\n:set nofs (no full screen)", "date": "Sep 22, 2022"}, {"stars": 5, "text": "This is a life saver for Githup pull requests! Thank you for making this!", "date": "Jul 11, 2022"}, {"stars": 5, "text": "I love Wasavi! Thank you to the developers! I used to get annoyed with slow text editing in chrome to the point that I would open a blank Vs Code file just to have my vim key bindings. Now I can edit directly inside text boxes! What a time saver!", "date": "Apr 2, 2022"}, {"stars": 5, "text": "Awesome extension.  Super enjoyable and good to practice vi typing!", "date": "Jan 5, 2022"}, {"stars": 5, "text": "Thank you!", "date": "Feb 24, 2021"}, {"stars": 5, "text": "Very simple and effective.", "date": "Dec 17, 2020"}, {"stars": 5, "text": "awesome\nWant to contribute", "date": "Oct 3, 2020"}, {"stars": 5, "text": "It is great, and excellent combination with Vimium", "date": "Mar 27, 2020"}, {"stars": 5, "text": "I don't use it often, but from time to time it's a great relieve being able to switch to VIM mode at will!", "date": "Dec 17, 2019"}, {"stars": 5, "text": "I often find myself writing python code in the browser inside jupyter notebooks, and the ability to use a vim-like editor to format text and complex expressions is an absolute life-saver. I've found the vim emulation of this plugin to be very good overall, and the ability to recreate some of my common mappings especially makes this plugin a favorite of mine. If you're familiar with vim and have to format complex expressions of any kind in the browser this extension is an absolute must-have.", "date": "May 18, 2019"}, {"stars": 5, "text": "it's just a pure bundle of awesomeness", "date": "Mar 24, 2019"}, {"stars": 5, "text": "Vim is a good tool for typing, really.", "date": "Feb 18, 2019"}, {"stars": 5, "text": "Wonderful one! thanks!", "date": "Oct 30, 2018"}, {"stars": 5, "text": "I'm in love", "date": "Aug 12, 2018"}, {"stars": 5, "text": "It's not a full-featured Vi, but it does most of the things it needs to do, and it does it well. Even editing an email in the Gmail web interface \n works properly when you've pasted images inline. I'm impressed.", "date": "Aug 8, 2018"}, {"stars": 5, "text": "BRILLIANT idea. As other users have suggested, it would be nice to have support for more Vim commands, but still, very, very useful for me", "date": "Jul 4, 2018"}, {"stars": 4, "text": "Very useful, but limited in number of supported vim commands.", "date": "Jun 21, 2018"}, {"stars": 5, "text": "This extension has changed my life.", "date": "May 25, 2018"}, {"stars": 5, "text": "Perfect!", "date": "Feb 21, 2018"}, {"stars": 5, "text": "it just works", "date": "Nov 23, 2017"}, {"stars": 5, "text": "One of my favorite extensions! Does one thing, and does it well.", "date": "Oct 19, 2017"}, {"stars": 4, "text": "This is very good.  However, I can consistently break this by jumping to a line number greater than the number of lines in the buffer.  For example, if my buffer only has 4 lines and I type 5gg, the app will crash, and there is no way of getting rid of it other than going into chrome developer tools and removing it from the DOM.  (Any work done would also be lost.)", "date": "Aug 21, 2017"}, {"stars": 5, "text": "Best option for vi keybindings in Chrome.", "date": "Jul 14, 2017"}, {"stars": 5, "text": "Amazing for longer emails and comments.", "date": "Jul 14, 2017"}, {"stars": 4, "text": "first impression is neat! However, it breaks the syntax highlighting on codeboard.io, doesn't seem to offer syntax highlighting by itself, and I see no way to disable wasavi again except for reloading the page.\n\nAlso, :set mouse=a  would be nice\n-----------------------------\nnvm, you can close just like you close vim, with :wq\n\nMake sure you do that before you try to do something with the text you entered. It seems like wasavi uses its own buffer", "date": "Jun 20, 2017"}, {"stars": 5, "text": "A great addition to editing code online, I was able to use it in browser solidity.", "date": "Mar 23, 2017"}, {"stars": 4, "text": "cant figure out how to get rid of the vim window and apply changes to real text box once done", "date": "Mar 16, 2017"}, {"stars": 1, "text": "It just doesn't work.  Nothing happens when I press ctrl-enter or insert.  It is enabled, but the icon is \"greyed out\".", "date": "Mar 10, 2017"}, {"stars": 5, "text": "Really like this tool\nThanks for creating it.", "date": "Jan 26, 2017"}, {"stars": 3, "text": "Gave me some issues posting on Facebook, but I'd rather have it than not.", "date": "Jan 9, 2017"}, {"stars": 5, "text": "Beautiful.", "date": "Dec 31, 2016"}, {"stars": 5, "text": "How to increase font size?\n\nPlease use event page instead of background page - do not eat my RAM all the time.", "date": "Nov 15, 2016"}, {"stars": 5, "text": "Wow, this is very impressive. Good work!", "date": "Oct 2, 2016"}, {"stars": 3, "text": "support for chinese keyboard is not so good. After I type somethings in insert mode and escape to command mode, the cursor goes always to where I began typing.", "date": "Sep 4, 2016"}, {"stars": 5, "text": "I tried vimium, and it wasn't my thing. I considered switching browsers just for vimperator, but decided not worth. This is exactly what I was looking for.\n\nEdit: After spending some more time looking around wasavi settings, I was *so* impressed that I felt the need to open up this page and edit this review to make it even more positive. Great work.", "date": "Aug 17, 2016"}, {"stars": 5, "text": "Superb extension!", "date": "Jul 27, 2016"}, {"stars": 5, "text": "A VERY helpful extension that has implemented a surprisingly effective subset of Vim for my browser TEXTAREAs. Has become a \"must have.\"", "date": "Jul 22, 2016"}, {"stars": 5, "text": "Great extension for all Vimers!", "date": "Jul 7, 2016"}, {"stars": 5, "text": "Just amazing.", "date": "Jul 1, 2016"}, {"stars": 5, "text": "I just installed this yesterday, today it's my favourite chrome extension", "date": "Jun 21, 2016"}, {"stars": 4, "text": "all discuz forum app is broken when posting something to server, because it uses an iframe to load ajax stuff, wasavi inject code into iframe which make the callback can't read it correctly", "date": "Apr 8, 2016"}, {"stars": 4, "text": "Really like this. However the sentence navigation keys \"(\" and \")\" do not seem to work. Can fix?", "date": "Apr 7, 2016"}, {"stars": 5, "text": "How can a vim addict give this anything less than 5 stars?", "date": "Mar 23, 2016"}, {"stars": 5, "text": "Incredible. Writing and editing emails in-browser has always been a chore and I had always dreamed of leveraging the power of vi(m). The dream is now reality.\n\nThank you so much for making this extension!", "date": "Feb 6, 2016"}, {"stars": 5, "text": "Work fine, like it.", "date": "Feb 3, 2016"}, {"stars": 5, "text": "Simply. Love. It.", "date": "Feb 3, 2016"}, {"stars": 5, "text": "Awesome. I love having this in GMail.", "date": "Jan 12, 2016"}, {"stars": 5, "text": "A must have extension for vim addict.", "date": "Dec 11, 2015"}, {"stars": 5, "text": "Combine this with Vimium and you'll know Joy.", "date": "Oct 2, 2015"}, {"stars": 3, "text": "Definitelly god step, but works only in few text area. It didn't work even  there.", "date": "Sep 7, 2015"}, {"stars": 5, "text": "@Jesson Foo\n\nwasavi has a config file.\nAt the wasavi command line type\n\":opt\" and then enter (without quotes)\nIt will take you to the wasavi options exrc.\nCheck the wasavi website for what you can set.\n\nThis is some of what is in my exrc:\n\n\" .......1.........2.........3..\nset nooverride\nset nosmooth \"scroll\nset nofullscreen \"fs\nset nojkdenotative\nset nostripe\n\" .......1.........2.........3..\nset number relativenumber\nset textwidth=0\nset incsearch ignorecase smartcase\nset tabstop=2 shiftwidth=... Show more", "date": "Sep 5, 2015"}, {"stars": 5, "text": "Seriously awesome extension. I'm seriously loving the Vim community right now. Between this and Vimium, using the browser is becoming so much easier and more fun.", "date": "Aug 31, 2015"}, {"stars": 5, "text": "great extension", "date": "Aug 11, 2015"}, {"stars": 5, "text": "Rating 5 stars in support, hoping for vimrc customization! and dreaming of plugins!!", "date": "Aug 4, 2015"}, {"stars": 5, "text": "This works really well.  Very nicely done!!", "date": "Aug 1, 2015"}, {"stars": 5, "text": "awesome!", "date": "Jul 24, 2015"}, {"stars": 5, "text": "Fantastic extension!", "date": "Jul 15, 2015"}, {"stars": 5, "text": "It is a very useful and awesome extension. Helped me a lot! Thanks!", "date": "May 8, 2015"}, {"stars": 5, "text": "This is so helpful to me. I can't stand typing at text areas outside of vim.  Thank you!", "date": "Apr 28, 2015"}, {"stars": 5, "text": "can't retain cursor position upon :x, not a big issue anyway\n\nand do not support settings sync, this is a real PITA", "date": "Apr 27, 2015"}, {"stars": 5, "text": "Wow! Just wow! This thing is awesome! You are amazing! Thank you sooooo much! Please keep improving it. It needs spellchecker and custom themes, maybe macros. But it is already truly awesome!", "date": "Apr 14, 2015"}, {"stars": 5, "text": "If you like Vim you can now enjoy it in your browser input fields, how great is that? And it has lots of useful options as well.", "date": "Mar 23, 2015"}, {"stars": 5, "text": "Great! Just works.", "date": "Feb 25, 2015"}, {"stars": 5, "text": "THANK YOU!!!", "date": "Feb 6, 2015"}, {"stars": 5, "text": "MAGICAL. This is now my default way to write in Wordpress. Thank you!", "date": "Oct 4, 2014"}, {"stars": 4, "text": "I love this, only had to change the default shortcut.", "date": "Sep 19, 2014"}, {"stars": 5, "text": "This is an awesome extension.  It saves me countless copy & pastes to and from VIM every day!", "date": "Aug 20, 2014"}, {"stars": 5, "text": "This tool is perfect for me. By far the most useful extension on chrome.", "date": "May 8, 2014"}, {"stars": 5, "text": "Amazing !!!!!", "date": "May 8, 2014"}, {"stars": 3, "text": "The first step in Vimizing the Internet. \n\nToo bad Wasavi doesn't handle a personal _vimrc file. So it's impossible to remap the Esc key to jk, or give an another look.", "date": "Feb 24, 2014"}, {"stars": 2, "text": "Looks pretty good. The close/quit semantics seem to need work. When I close it it often pops back up again. Quite frustrating.\n\nI concur. Visual support would be nice. Also, if you could figure out how to support G-mail's stupid g@dd@mn compose box that would be handy!", "date": "Nov 8, 2013"}, {"stars": 5, "text": "So cool. Would love some visual support!", "date": "Sep 13, 2013"}, {"stars": 5, "text": "This extension completes my Vi lifestyle.  Seriously, it actually works as you'd imagine/want!", "date": "Sep 11, 2013"}, {"stars": 5, "text": "Awesome extension! Really useful, works far better than I expected", "date": "Sep 7, 2013"}, {"stars": 5, "text": "Great work!! I am very grateful to you. I was looking for an vi editor for text areas. And it works. exrc setting is helpful. Waiting for future releasing. My thanks again to you.", "date": "Mar 24, 2013"}, {"stars": 5, "text": "Amazing work! I've been using it to edit textareas in wiki software at work.\n\nI've also had good luck with the stability of this extension so far (no hanging as reported in another review).", "date": "Mar 19, 2013"}, {"stars": 3, "text": "I badly want to like this.  Unfortunately it hangs frequently, rendering it unusable.\n\nI can only plead: work on this.  It has the potential to be awesome.", "date": "Oct 24, 2012"}, {"stars": 5, "text": "Exactly what I was looking for, thanks for opensourcing it as well.", "date": "Aug 16, 2012"}]