[{"text": "Still keeps pausing.", "stars": 1, "date": "Mar 8, 2024"}, {"text": "this extension is great. big warning though, you may find a 2.0 version on the web store as well.\nDO NOT DOWNLOAD IT!!! it will change your search engine and try to hack you", "stars": 5, "date": "Mar 5, 2024"}, {"text": "It's working. I really like it.\n\nThe NonStop2.0 is by another author, so plz don't mess up.", "stars": 5, "date": "Feb 27, 2024"}, {"text": "I think some of the people leaving bad reviews and talking about how this extension is a scam may have downloaded 'Nonstop 2.0'. That extension has been known to secretly change your search engine to a shady 3rd party site that gathers your data maliciously and tries to infect your computer with malware through dodgy pop ups. Just a heads up. DON'T download Youtube Nonstop 2.0!", "stars": 4, "date": "Feb 24, 2024"}, {"text": "Kinda rude that it changes your default search engine to Microsoft :-/", "stars": 3, "date": "Feb 20, 2024"}, {"text": "the best", "stars": 4, "date": "Feb 19, 2024"}, {"text": "Seems to work with everything BUT MUSIC. When listening to music you still get the dreaded \"Are you still watching\" pop up.", "stars": 3, "date": "Feb 8, 2024"}, {"text": "Installed it today, expecting it to keep my youtube playlist running in the background indefinitely. Doesn't work. Youtube still pops up the annoying \"are you still there\" prompt, and pauses the playlist until you attend to it. the extension doesn't \"push the continue button\" like it's supposed to.", "stars": 1, "date": "Feb 5, 2024"}, {"text": "Works wonderfully. I've had it for about a week or so and haven't seen the \"Are you still watching\" pop up at all.", "stars": 5, "date": "Feb 4, 2024"}, {"text": "Works for me", "stars": 5, "date": "Feb 3, 2024"}, {"text": "not working, pop up pauses video and stays paused until i interact with it :P", "stars": 1, "date": "Jan 26, 2024"}, {"text": "Does not work, prompt came up and video is paused", "stars": 1, "date": "Jan 23, 2024"}, {"text": "Does what it says. So far at least it works as intended for me.", "stars": 5, "date": "Jan 23, 2024"}, {"text": "it did work. love it", "stars": 5, "date": "Jan 11, 2024"}, {"text": "Checked source code and it looks safe, unlike the \"NonStop 2.0\" which is adware that changes to bing search.", "stars": 5, "date": "Jan 3, 2024"}, {"text": "doesnt work \n\"Video paused. Continue watching?\" pop up and still pause the video", "stars": 1, "date": "Jan 3, 2024"}, {"text": "people say it doesn't work but it does, it removes any youtube pause/ take a break / are you still there notifications. if you try without and you walk away from your pc the video may pause in 15-30min sometimes an hour. it also works with youtube music as well. I'm using opera gx and it has 0 issues with ublock and a set quality extension, it doesn't take up any resources doesn't add any extra users its just an extension that removes all youtube pause popups and keeps the video and music pla... Show more", "stars": 5, "date": "Dec 27, 2023"}, {"text": "its doenot work waste of time dont add fake user", "stars": 1, "date": "Dec 26, 2023"}, {"text": "need a fix .. 24/12/23", "stars": 2, "date": "Dec 24, 2023"}, {"text": "Changing my default browser to a phishing browser? Are you guys out of your mind?", "stars": 2, "date": "Dec 15, 2023"}, {"text": "It doesn't work when I'm in other tabs.", "stars": 4, "date": "Dec 11, 2023"}, {"text": "not working since youtube warning us about adblock extension to leave it", "stars": 4, "date": "Nov 27, 2023"}, {"text": "Youtube now black screens for a few seconds between clips. :[ enjoyed this extension for many months without problems before youtubes anti ad block campaign.", "stars": 3, "date": "Nov 25, 2023"}, {"text": "yootoob is currently trying to fight adblockers, so I am experiencing a bit of pausing.  Hopefully it can be mitigated else I will have to stream music elsewhere.  I don't want any products that yootoob would advertise to me, so really they are wasting their client's money.", "stars": 4, "date": "Nov 21, 2023"}, {"text": "stopped working a few days ago, update pls! :((", "stars": 3, "date": "Nov 17, 2023"}, {"text": "It was okay until several days ago", "stars": 3, "date": "Nov 13, 2023"}, {"text": "Doesn't work. Rubbish!", "stars": 1, "date": "Nov 4, 2023"}, {"text": "Stopped working a couple weeks ago", "stars": 1, "date": "Oct 29, 2023"}, {"text": "Stopped! I've used recently a few videos..... misleading extension probably steals information and subscribe to other channels because don't do nothing.", "stars": 1, "date": "Oct 27, 2023"}, {"text": "It still works to a good degree, the pause message isn't removed but that's no issue if you're not looking at the screen (I have YouTube playing while I go to sleep). People should remember this is a free app and YouTube devs will be continuously fighting to counteract it. Therefore, I'm very grateful to the developer; the pause thing is a totally moronic 'feature' of YouTube.", "stars": 4, "date": "Oct 27, 2023"}, {"text": "Don't Work any more", "stars": 1, "date": "Oct 26, 2023"}, {"text": "not really working as well as it could. sometime its working sometimes not", "stars": 2, "date": "Oct 25, 2023"}, {"text": "This has been working for a long time, but recently it doesn't work at all. It's such a bummer because it is such a helpful tool", "stars": 2, "date": "Oct 25, 2023"}, {"text": "its stopped working!!", "stars": 1, "date": "Oct 19, 2023"}, {"text": "It used to work. But it has stopped. I am super frustrated.", "stars": 5, "date": "Oct 18, 2023"}, {"text": "Initially worked fine. But has now stopped working. What a drag.", "stars": 2, "date": "Oct 16, 2023"}, {"text": "It no longer works with the recent version of Chrome, it's time to look for another one", "stars": 2, "date": "Oct 14, 2023"}, {"text": "OK while it lasted. Stopped working in the newer versions of Chrome (116+).", "stars": 3, "date": "Sep 22, 2023"}, {"text": "Stops working after awhile. Many other users report the same problem and you would think the creator(s) would fix this problem if they wanted to improve extension.", "stars": 3, "date": "Sep 14, 2023"}, {"text": "I think it stopped working properly for me", "stars": 3, "date": "Sep 12, 2023"}, {"text": "It works.", "stars": 5, "date": "Sep 7, 2023"}, {"text": "not working", "stars": 1, "date": "Sep 6, 2023"}, {"text": "it worked!", "stars": 5, "date": "Sep 1, 2023"}, {"text": "Worked excellent for a long time, but recently my playlist contains quite a few songs with suicide warning that stops music from playing. Google support says \"The warning can't be disabled and YouTube Music has no plans to remove it\". Would like to see it fixed with this extension. The warning is \"The following content may contain suicide or self-harm topics\" and it has a button to continue playing - \"I understand and wish to proceed\".", "stars": 4, "date": "Aug 24, 2023"}, {"text": "works, nothing more to say", "stars": 5, "date": "Aug 22, 2023"}, {"text": "doesn't work anymore.", "stars": 1, "date": "Aug 15, 2023"}, {"text": "no longer works", "stars": 1, "date": "Jul 30, 2023"}, {"text": "This extension hijacks your search engine by forcing you to using Bing.", "stars": 1, "date": "Jul 24, 2023"}, {"text": "yea it worked", "stars": 4, "date": "Jul 24, 2023"}, {"text": "Works great for youtube.music, always has! Thank you.\nIt does sometimes leave the little \"are you still listening\" box in the corner of the screen, but who cares? :P", "stars": 5, "date": "Jul 23, 2023"}, {"text": "Since that popup-adding update my depression worsened, I didn't notice music stopped when coding, and without music I exhaust myself in lonely room. This extension is a cure. Thanks a lot to the dev(s) from a dev.", "stars": 5, "date": "Jul 15, 2023"}, {"text": "Mixed feelings: First time trying it everything seemed ok. Then it quit working and when I went to check it, Brave told me that it required a permission to work. Upon looking at this I found that the extension NOW wanted, nay, NEEDED to change my default search provider in order to work. So reported abuse because it never mentioned this beforehand. Came to write a review and apparently you can't without installing it....ok fine just for a few minutes, whatever. Oh.....gee look, that requireme... Show more", "stars": 2, "date": "Jul 12, 2023"}, {"text": "Doesn't work", "stars": 1, "date": "Jun 4, 2023"}, {"text": "It was working great, but lately it does not work if the tab is not active. Hope it will be fixed soon! Keep the great job!", "stars": 4, "date": "Jun 2, 2023"}, {"text": "It doesn't work anymore. I think it doesn't recognize when the tab is discarded by Chrome's Tab manager", "stars": 2, "date": "May 31, 2023"}, {"text": "Youtube hasst diesen trick.\n\nps.: Works perfectly", "stars": 5, "date": "May 23, 2023"}, {"text": "not working anymore", "stars": 1, "date": "May 20, 2023"}, {"text": "It prevent \"autoplay next video\" settings from disabled. Remove it if you have problem.", "stars": 3, "date": "May 19, 2023"}, {"text": "So... could we get it working when the tab does NOT have focus? I kind of want to work while my music is in the background. That's the whole point.. right??", "stars": 3, "date": "May 16, 2023"}, {"text": "Stopped working.", "stars": 1, "date": "May 8, 2023"}, {"text": "out of update", "stars": 4, "date": "May 8, 2023"}, {"text": "it stopped working after a while ut was pretty good", "stars": 2, "date": "May 6, 2023"}, {"text": "served me well through the years. too bad it stopped working. rip", "stars": 2, "date": "May 1, 2023"}, {"text": "This doesn't work. Removed.", "stars": 2, "date": "Apr 30, 2023"}, {"text": "It works fine, but since I installed it I get error messages with other tools \"“ruby” will damage your computer.\" and when I want to disable or remove this plugin, it completely closes my browser. So I have no idea yet how to uninstall it...", "stars": 1, "date": "Apr 25, 2023"}, {"text": "It stopped working...KIND OF. \n\nWhen selecting a saved playlist, I have to hit the play all button, then hit the \"loop\" Icon to keep my saved playlist running. AdBlock-\"The best adblocker\" is also ran on my browser and still seems to work with the tab open in the background, regardless of whether the button pops up or not, the vid keeps playing.", "stars": 5, "date": "Apr 25, 2023"}, {"text": "It doesnt work, still get that same message about it being paused and if i want to keep playing it.", "stars": 1, "date": "Apr 20, 2023"}, {"text": "not working", "stars": 1, "date": "Apr 16, 2023"}, {"text": "It does not work.", "stars": 1, "date": "Apr 15, 2023"}, {"text": "Was one of the top extension that i used on chrome. Well I guess the recent extension update made by chromium did really affect it really bad.", "stars": 4, "date": "Apr 11, 2023"}, {"text": "Not working... :\\ Brave browser", "stars": 1, "date": "Apr 5, 2023"}, {"text": "Finaly I can enjoy space documentarys for sleep in peace", "stars": 5, "date": "Apr 2, 2023"}, {"text": "Good.", "stars": 5, "date": "Apr 2, 2023"}, {"text": "Doesn't work, video played in playlist, (not fullscreen, neither miniplayer) and still got the pop up (the video was on main screen, on focus, not in background).", "stars": 1, "date": "Mar 22, 2023"}, {"text": "Seems it stopped working, recently..may be it needs some updated..", "stars": 4, "date": "Mar 10, 2023"}, {"text": "It worked when the tab is on. But when I switched tab and didn't comeback to it for hours, it'll stop working.", "stars": 3, "date": "Feb 25, 2023"}, {"text": "Used to work perfectly but looks like this extension no longer works anymore. Hopefully Devs update this soon.", "stars": 4, "date": "Feb 22, 2023"}, {"text": "Does not worling, uninstalled.", "stars": 1, "date": "Feb 21, 2023"}, {"text": "NOT WORKING AGAIN!!!! You did not leave an email address to \"so called\" get in touch with you.  I keep revisiting your extension and trying it out now and then to see if you have worked out the bugs yet as the idea is one that is good and much needed. It would be great if someone made an extension like this but have it actually work!! It should not even be an issue.  Why should Google give a rat's behind how much bandwidth I use. If I want to play youtube nonstop when I leave my house so the ... Show more", "stars": 1, "date": "Jan 28, 2023"}, {"text": "It doesn't work. Actually, became worse and occurs more often the \"are you still watching\" poppup :{)", "stars": 1, "date": "Jan 26, 2023"}, {"text": "No longer works", "stars": 1, "date": "Jan 24, 2023"}, {"text": "Been using it for a long time, works 99.9% of the time! Thank you!", "stars": 5, "date": "Jan 18, 2023"}, {"text": "10/10, absolutely essential extension!", "stars": 5, "date": "Jan 17, 2023"}, {"text": "doesn't work\nhave the tab open with youtube but each time since install that the youtube popup appears the extension doesn't click it to continue playing", "stars": 1, "date": "Jan 14, 2023"}, {"text": "Works great! Should be an automatic feature of Youtube. (It was two weeks ago...)", "stars": 5, "date": "Jan 1, 2023"}, {"text": "google should be paying you for this, but taking their customers work as their own is the name of their game", "stars": 5, "date": "Dec 28, 2022"}, {"text": "DOES NOT WORK.", "stars": 1, "date": "Dec 27, 2022"}, {"text": "On 22.12 it asked me for \"Read browsing history\" permission, emh... no?! Why?", "stars": 2, "date": "Dec 22, 2022"}, {"text": "love how google featured this instead of implementing it into youtube itself, just another example of lazy developers", "stars": 3, "date": "Dec 10, 2022"}, {"text": "been using it forever", "stars": 5, "date": "Dec 9, 2022"}, {"text": "When the tab is in the background the extension does not work at all. This happens because YouTube does not display the prompt while the tab is not visible so the extension cannot click on it. As soon as you go to the tab, the prompt is displayed and the extension clicks on it. However, this is not helpful at all. It is the same as you do click on the prompt. Additionally, the automatic click that the extension does on the prompt it does not count as a real click from YouTube so in the next s... Show more", "stars": 1, "date": "Nov 18, 2022"}, {"text": "doesnt work anymore", "stars": 1, "date": "Oct 25, 2022"}, {"text": "good but stopped working", "stars": 4, "date": "Oct 21, 2022"}, {"text": "Doesn't work.", "stars": 1, "date": "Oct 14, 2022"}, {"text": "very usefull thank you", "stars": 5, "date": "Oct 5, 2022"}, {"text": "This works GREAT!!!!!! Thank You. Now, I can take a shower, do housework, etc without my music stopping!", "stars": 5, "date": "Oct 1, 2022"}, {"text": "Yay, another stupid YouTube feature which requires 3rd party solutions, nice!\nI really wonder who are the architects and designers coming up with these silly ideas...", "stars": 5, "date": "Sep 28, 2022"}, {"text": "I don't understand why this is necessary but it perfectly solves the problem that youtube created for no reason", "stars": 5, "date": "Sep 26, 2022"}, {"text": "Doesn\"t work", "stars": 1, "date": "Sep 13, 2022"}, {"text": "It works perfectly in Opera GX, thank you! :)", "stars": 5, "date": "Sep 12, 2022"}, {"text": "I think it works again, at least my music didn't stop in like 5 hours :)", "stars": 5, "date": "Sep 9, 2022"}, {"text": "Sept 22:  Does not work on chromebook.", "stars": 2, "date": "Sep 8, 2022"}, {"text": "don't work", "stars": 2, "date": "Aug 27, 2022"}, {"text": "Stopped working, needs developer update! Please fix.", "stars": 3, "date": "Aug 17, 2022"}, {"text": "(August 11, 2022) it's not working", "stars": 1, "date": "Aug 11, 2022"}, {"text": "Absolutely brilliant it does the job! Its so stupid that this is something that YouTube doesn't let you turn off. However I have had to stop using it due to it interupting my media controls. Although it prevents YouTube from pausing the video it also prevents media controls on your keyboard from pausing the video which is very annoying. If this didn't happen it would have been a 5/5 extension.", "stars": 4, "date": "Aug 10, 2022"}, {"text": "stopped working, 40 minutes seems to be how long videos will play in another tab", "stars": 4, "date": "Aug 4, 2022"}, {"text": "August 1st - does not work as averred...", "stars": 1, "date": "Aug 2, 2022"}, {"text": "does not work", "stars": 1, "date": "Jul 15, 2022"}, {"text": "works", "stars": 5, "date": "Jul 3, 2022"}, {"text": "It's July 1, 2022 and this extension does NOT work unfortunately. Had high hopes after watching a review (years old one of course) and added it to Chrome but my YouTube videos still pause with the stupid pop-up. ugh", "stars": 1, "date": "Jul 2, 2022"}, {"text": "That looks interesting, plugin on the bar and big notification \"Film został wstrzymany. Chcesz oglądać dalej?\" Which mean \"The movie has been paused. Do you want to keep watching?\". Idk if it is problem with language or browser Brave but it just doesn't work", "stars": 1, "date": "Jul 1, 2022"}, {"text": "Works as intended, no added fuss. If I had to pick ONE extension that I could only use, it would be this one. I can live with ads. I can live with poor website design. But I CANNOT live with my tunes being interrupted for no reason.", "stars": 5, "date": "Jun 26, 2022"}, {"text": "It doesn't work anymore, please update it.", "stars": 3, "date": "Jun 14, 2022"}, {"text": "wonderful!!!", "stars": 5, "date": "Jun 11, 2022"}, {"text": "Doesn't work", "stars": 1, "date": "May 29, 2022"}, {"text": "god damn goodie", "stars": 5, "date": "May 27, 2022"}, {"text": "Im dropping 5 stars for now, it not working the \"are you still watching\" still pops up and stop my music (cant say how long it took for it to pop up since i wasnt really tracking the time but after a good amount of 20 or 30 mins pass then pop) the site says it would auto click it but it not doing it.\n\nI watched the video hoping it would show me what i miss but so far i didnt seem to do anything different from the video.\n\nAfter reviewing the reviews i cant say it help me mostly bc i am a simpl... Show more", "stars": 5, "date": "May 21, 2022"}, {"text": "just to support developer, love it :)", "stars": 5, "date": "May 10, 2022"}, {"text": "Does exactly as Intended!! Thank you so much!", "stars": 5, "date": "Apr 2, 2022"}, {"text": "stoppedworking after the adblock youtube drama", "stars": 4, "date": "Mar 18, 2022"}, {"text": "Doesn't work if you do not have the tab open. kind of pointless and defeats the object of installing the addon.", "stars": 2, "date": "Mar 11, 2022"}, {"text": "useless, just installed but does not work", "stars": 1, "date": "Mar 7, 2022"}, {"text": "Does not work", "stars": 1, "date": "Mar 4, 2022"}, {"text": "On Brave, doesn't work properly. haven't gotten the popup dialog, but autoplay doesn't work anymore, so it doesn't skip to the next item in the playlist.", "stars": 1, "date": "Mar 3, 2022"}, {"text": "Since installing the extension 1-2 years ago, I've not had any problems with youtube stopping. I saw a lot of reviews complaining about it not working in some situations, but that has not been my exprience. I've probably used my pc for thousands of hours over the last 2 years, and the extension has not failed once", "stars": 5, "date": "Feb 27, 2022"}, {"text": "this doesn't work, had this turned on while watching youtube on a single tab and the video was still paused by youtube, I waited for a little bit but this app was doing nothing", "stars": 1, "date": "Feb 21, 2022"}, {"text": "Been using this for years. Every now and then youtube seems to be able to break through it, but it gets fixed in a couple of days. Of all my extensions (and I have a ton) this is my favorite non-essential. I /would/ pay for it!", "stars": 5, "date": "Feb 9, 2022"}, {"text": "I've downloaded the extension and the video still pauses, even when the tab that plays the video is active and the only one active. It did not solve the problem.", "stars": 2, "date": "Feb 1, 2022"}, {"text": "now i can finally listen to my music", "stars": 4, "date": "Jan 23, 2022"}, {"text": "We need this on cell phones to reduce distracted driving. I would rather not have to mess with my phone while it plays music in my car. Why does Youtube want to force us to fiddle with our phones? It reduces awareness of our surroundings, and could get some stupid teen killed when they stop music and distract them. Youtube is run by morons that messed up all our wet dreams, thank god for this extension, I only wish it didn't cause issues, although I fully blame YOUTUBE for creating the stupid... Show more", "stars": 5, "date": "Jan 19, 2022"}, {"text": "Unfortunately it doesn't work for me.", "stars": 1, "date": "Jan 8, 2022"}, {"text": "Works as advertised on Brave Browser (as a techie I cannot recommend the Chrome browser). I use it in concert (pun intended) with Ublock Origin! In a pinned tab, it will play non-stop with no ads, all day long, all while I'm in other tabs. It does just as well in Firefox Browser, but know this; that I'm using Linux Mint, and not any of the proprietary OS's. Everyone knows how glitch prone those entities are.", "stars": 5, "date": "Dec 20, 2021"}, {"text": "I have been using this plugin for years. It's awesome, working smoothly in the silence, no extra configuration or step needed.", "stars": 5, "date": "Dec 2, 2021"}, {"text": "Perfect, can leave youtube tab and do whatever i want in chrome or leave outside with music playing. cant believe youtube have that stupid thing implemented and dont let us dissable.", "stars": 5, "date": "Nov 30, 2021"}, {"text": "doesn't work, read the reviews...", "stars": 1, "date": "Nov 28, 2021"}, {"text": "it works Perfect...", "stars": 5, "date": "Nov 28, 2021"}, {"text": "Been using this extension for years, works perfectly even after YouTube updates. Props to the developers for this! 5/5\n\nI hate it when my videos randomly stops!!!", "stars": 5, "date": "Nov 26, 2021"}, {"text": "Bye Bye Pause Youtube :D", "stars": 5, "date": "Nov 23, 2021"}, {"text": "Left the PC on the main page fullscreen, still got that popup and video paused due to it. Useless!", "stars": 1, "date": "Nov 17, 2021"}, {"text": "This has stopped working.", "stars": 1, "date": "Nov 13, 2021"}, {"text": "It works well with the current Brave Browser and YouTube Versions.\nOnly the ads can interupt the flow of playlists now^^", "stars": 5, "date": "Nov 8, 2021"}, {"text": "Does not work at all. Only 1 window with 1 tab open on Youtube. Nothing else opened. Focus in on tab. Youtube still stops when the box appears. Total garbage.", "stars": 1, "date": "Nov 8, 2021"}, {"text": "Works!", "stars": 5, "date": "Oct 18, 2021"}, {"text": "I also have the problem with media keys not pausing the music but I'm still putting five stars in here because this extension has been absolute gold for a very long time! Please put through a fix!", "stars": 5, "date": "Sep 30, 2021"}, {"text": "I've been using it for the past 2 years and never had issues with it. Thanks!", "stars": 5, "date": "Sep 25, 2021"}, {"text": "Great help for all these days but the media key on my keyboard wont work after pressing pause and play a few times when im in game recently. It will show me that the youtube video is paused while the audio is still ongoing. Assistance on this issue wouls be much appreciated ;)", "stars": 4, "date": "Sep 23, 2021"}, {"text": "This is fantastic but I ended up reseting my whole windows installation to figure out why I could pause youtube with my keyboard media keys. HOURS UPON HOURS of troubleshooting and fixing everything led me to find that this would prevent you from doing this. Please fix being able to pause with the keyboard media keys as well as the media control on chrome.", "stars": 4, "date": "Sep 23, 2021"}, {"text": "Almost a mandatory extension for every browser. I'm sorry Google if you can't show me the ads when I'm listening to music in playback, but such is life, uh?", "stars": 5, "date": "Sep 11, 2021"}, {"text": "It's enabled yet music pauses on YouTube Music", "stars": 2, "date": "Sep 5, 2021"}, {"text": "not working", "stars": 1, "date": "Sep 3, 2021"}, {"text": "not working in youtube music desktop app and its linked to chrome and it says the addon is there :(", "stars": 1, "date": "Aug 29, 2021"}, {"text": "Update from 8/21: Still works as designed (3Y now). Like all techs I run Linux (Mint) OS, and use Firefox & Chromium browsers, with the vital uBlock Origin (as vital as anti-virus), which prevents ads from interfering with this extension. NonStop works on both browsers flawlessly; no hesitations. I use it on FF for Android too. Make sure to restart browser after install.", "stars": 5, "date": "Aug 20, 2021"}, {"text": "I don't know what are people are talking about really, this extension works just fine. I recommend it!", "stars": 5, "date": "Jul 29, 2021"}, {"text": "Good extension, works 100/100", "stars": 5, "date": "Jul 12, 2021"}, {"text": "ONLY blocks the popup, not also the video auto-pausing.", "stars": 1, "date": "Jul 12, 2021"}, {"text": "Didn't work. Simple as that, really.", "stars": 1, "date": "Jun 29, 2021"}, {"text": "It doesn't work when the tab isn't selected, so when you have multiple tabs open with one of them being youtube, you need to have the youtube tab open.", "stars": 2, "date": "Jun 20, 2021"}, {"text": "I don't know how was before but in 2021 it works. Thank you!)", "stars": 5, "date": "Jun 17, 2021"}, {"text": "not working", "stars": 1, "date": "Jun 17, 2021"}, {"text": "Pls make compatible with  embedded videos", "stars": 4, "date": "Jun 15, 2021"}, {"text": "works great, I did not encounter any problems yet, thank you for this.", "stars": 5, "date": "May 25, 2021"}, {"text": "It does not work", "stars": 1, "date": "May 20, 2021"}, {"text": "Works great A majority of the time, but sometimes I'll click it and it won't work, so I'd have to uninstall and then re-install it again for it to work. Happens once a week and it gets annoying having to do this regularly, but it works great!", "stars": 4, "date": "May 14, 2021"}, {"text": "stopped working", "stars": 5, "date": "May 11, 2021"}, {"text": "I'm still getting ads.", "stars": 1, "date": "May 7, 2021"}, {"text": "Just works!", "stars": 5, "date": "May 6, 2021"}, {"text": "It works ig. I don't really know what to say lol", "stars": 5, "date": "Apr 26, 2021"}, {"text": "nice", "stars": 4, "date": "Apr 25, 2021"}, {"text": "It works! (had to restart the browser) What a relief again to listen to my playlist!", "stars": 5, "date": "Apr 20, 2021"}, {"text": "fake/does not work", "stars": 1, "date": "Apr 16, 2021"}, {"text": "Works perfectly, as advertised. Finally, YouTube is usable for music again", "stars": 5, "date": "Apr 6, 2021"}, {"text": "Fantastic, gets the job done. Still works even if alt-tabbed.", "stars": 5, "date": "Apr 5, 2021"}, {"text": "not  working from few days (youtube did some ui changes so propably sth with it) till that time worked perfectly", "stars": 3, "date": "Mar 25, 2021"}, {"text": "Loved it! Works as advertised.", "stars": 5, "date": "Mar 21, 2021"}, {"text": "It does what it says it does ... 5 stars", "stars": 5, "date": "Mar 18, 2021"}, {"text": "I use it very much. Already, some years. Ago. Thank you a lot. 1 milion beers from me. Cheers!", "stars": 5, "date": "Mar 10, 2021"}, {"text": "It finally works after tried 4 different extensions", "stars": 5, "date": "Feb 28, 2021"}, {"text": "Doesn't work. Double checked if it is on, and it was on and enabled. YT still pauses videos.", "stars": 1, "date": "Feb 15, 2021"}, {"text": "Works just as inteded. I use the YT Music desktop application and since I got this extension, no more having to switch to it every few mins.", "stars": 5, "date": "Feb 1, 2021"}, {"text": "It just doesnt work for me.... I sit in my game and then some time later my music stops,... needs to be better", "stars": 1, "date": "Jan 30, 2021"}, {"text": "Works as intended, thanks.", "stars": 5, "date": "Jan 25, 2021"}, {"text": "Thank you so much! It does exactly what it says.", "stars": 5, "date": "Jan 18, 2021"}, {"text": "Stop playing It doesn't work .", "stars": 1, "date": "Jan 15, 2021"}, {"text": "btw if anyone is using this on a different desktop other than desktop 1, it doesn't work. i only realised it a few days ago. other than that this extension is great and very convenient", "stars": 5, "date": "Jan 8, 2021"}, {"text": "Great extension - is there any chance you could add it to \"click\" the \"I understand and wish to proceed\" button for 'explicit' music videos automatically?", "stars": 4, "date": "Jan 8, 2021"}, {"text": "Not work", "stars": 1, "date": "Jan 5, 2021"}, {"text": "Godsent. Works like a charm. Thank you.", "stars": 5, "date": "Jan 4, 2021"}, {"text": "Works amazingly", "stars": 5, "date": "Dec 29, 2020"}, {"text": "It works 99% of the time. I have to remark also that it was available from the the first day the autopause anti-feature was rolled out here.", "stars": 5, "date": "Dec 25, 2020"}, {"text": "Doesn´t work on edge chromium", "stars": 2, "date": "Dec 22, 2020"}, {"text": "it works", "stars": 5, "date": "Dec 21, 2020"}, {"text": "You've got to wonder what else this extension is doing. 277kb is a massive size for such a simple task.", "stars": 2, "date": "Dec 14, 2020"}, {"text": "The inventer of this extension should win a trophee ! I've been waiting so long for this !\n\nMANY THANKS !!!!!!!!!!!!!", "stars": 5, "date": "Dec 11, 2020"}, {"text": "Five stars! Been using this extension for a number of months now and wow. I make and listen to a bunch of playlists on Youtube and can listen to them without that stupid \"video is going to pause\" thing happening. It does come up for a split second before the extension shoots it down, so the audio of the video sometimes skips once, but it's not a big deal compared to what my experience would be. Highly recommend this!!", "stars": 5, "date": "Dec 9, 2020"}, {"text": "Love this extension, perfect for when I'm playing games and wanna chill. No alt-tabbing to click \"yes\" on the window asking if I'm away when my PC is obviously active. Or when I'm going to sleep, throw on some music and fall asleep listening to it and wake up to it on one of my favourite songs (of many). Only thing I wanna ask, is if this extension can be added to the Opera GX browser, I'm currently trying it out and this is probably my most used extension.. Other than AdBlocker.", "stars": 5, "date": "Dec 8, 2020"}, {"text": "I watch YouTube video each day so this extension is just handsome.\nThanks for that and continue your excellent work.", "stars": 5, "date": "Dec 1, 2020"}, {"text": "Doesn't work from now. I thought earlier it did work.", "stars": 3, "date": "Dec 1, 2020"}, {"text": "Only seems to work if youtube is the active tab.  When switched to another tab or window it simply doesn't do anything.", "stars": 3, "date": "Nov 20, 2020"}, {"text": "Dos not work.\n\nBuild info:\n86.0.4240.193 (64-bits)", "stars": 2, "date": "Nov 13, 2020"}, {"text": "It works for me with YouTube on the screen, and I hope in the future updates would bring more features. Thanks!", "stars": 5, "date": "Nov 8, 2020"}, {"text": "Works perfectly! Thanks!", "stars": 5, "date": "Nov 7, 2020"}, {"text": "Works as it states it will. The \"still watching\" box pops up and then the extension auto selects yes immediately.", "stars": 5, "date": "Nov 6, 2020"}, {"text": "Just doesnt work.", "stars": 1, "date": "Oct 26, 2020"}, {"text": "This extension worked for the first day, but hasn't worked since. My videos still pause on occasion, regardless of if I'm in the window, or if the window is the only browser open.", "stars": 3, "date": "Oct 19, 2020"}, {"text": "it was alright until my keyboard shortcut for play/pause doesn't work anymore..", "stars": 3, "date": "Oct 18, 2020"}, {"text": "Works good only thing i wish is that it worked on music.youtube.com too", "stars": 5, "date": "Oct 11, 2020"}, {"text": "Nope, doesn't work at all. I've even got the window open, and it's stopped the video twice to ask if I'm still watching. Garbage extension. Do not download.", "stars": 1, "date": "Oct 5, 2020"}, {"text": "This has stopped working. Instead of the \"continue watching?\" injection that this extension overcame, now YouTube stops play with the message \"Get the best YouTube experience. Sign in to save videos, subscribe, and more. <not now> <sign in>\". You may need to update the extension to account for this change to YouTube stoppage mechanism.", "stars": 5, "date": "Sep 30, 2020"}, {"text": "Thanks for providing us this extension. recently this doesn't work well. it kept showing \"continue?\" and stop youtube. Please take a look and fix. Thanks again.", "stars": 5, "date": "Sep 30, 2020"}, {"text": "Fully transparent. Open source extension. Well done!", "stars": 5, "date": "Sep 27, 2020"}, {"text": "It works with autopause prompt, but it automatically keeps activating the random video list, which is equally annoying.", "stars": 3, "date": "Sep 23, 2020"}, {"text": "2020-09-18 Not working.", "stars": 1, "date": "Sep 18, 2020"}, {"text": "very good", "stars": 5, "date": "Sep 17, 2020"}, {"text": "Works if you have any brains to put it in a separate window all on it's own...", "stars": 5, "date": "Sep 10, 2020"}, {"text": "Stopped working today.", "stars": 2, "date": "Sep 7, 2020"}, {"text": "Thank you for this. I actually have no problems with the app even if multiple tabs are open. Great work!", "stars": 5, "date": "Sep 7, 2020"}, {"text": "Doesn't work for me, unfortunately. I still get these pauses.", "stars": 1, "date": "Sep 6, 2020"}, {"text": "Doesn't work for what I expected it to work for (listen to music with Youtube in the background while doing other stuff). I uninstalled it.", "stars": 2, "date": "Sep 1, 2020"}, {"text": "Doesn't work at all in Slimjet, not with window/tab in focus nor in the background.", "stars": 1, "date": "Aug 31, 2020"}, {"text": "Works perfectly! Recommended.", "stars": 5, "date": "Aug 26, 2020"}, {"text": "Doesn't work, videos still pause.", "stars": 1, "date": "Aug 25, 2020"}, {"text": "not working", "stars": 1, "date": "Aug 24, 2020"}, {"text": "love this app thank you so much", "stars": 5, "date": "Aug 20, 2020"}, {"text": "Video is still pausing so it's pretty much useless", "stars": 1, "date": "Aug 15, 2020"}, {"text": "so good to counter that stupid box but recently it has stopped working for me. It doesn't even unpause the video anymore when i have the tab selected :( Please fix soon, it was such a good extension and i hate the stupid pop up box", "stars": 5, "date": "Aug 13, 2020"}, {"text": "very useful. is there an update on this add-on", "stars": 5, "date": "Aug 12, 2020"}, {"text": "Worked great for me until today (August 11, 2020) when it abruptly stopped working - \"Video paused - continue?\" box appears and must be clicked to continue playing.", "stars": 3, "date": "Aug 11, 2020"}, {"text": "Very useful.", "stars": 5, "date": "Aug 10, 2020"}, {"text": "A must have for anyone who regularly use YouTube!", "stars": 5, "date": "Aug 6, 2020"}, {"text": "3 hours after I installed this extension Chrome told me that my passwords had been exposed. No idea if it really happened, or if this extension is the culprit, but I'm not taking any chances, since this was the only change I made.\n\nBut it seemed to work, for what it's worth.", "stars": 3, "date": "Aug 1, 2020"}, {"text": "CAUTION ! \nSince i've added this to chrome, I keep getting randomly redirected to http://r.srvtrck.com/. I did some research and it's obviously a malware : This domain acts as virtual platform to internally readdress users to third-party that presents lots of advertising contents.\nPlease be warned that these days, tons of extensions in the chrome web store does that kind of things. Publishers gets paid by \"pay per view\" and insert a script in their extensions that randomly open that kind of ads.", "stars": 1, "date": "Jul 27, 2020"}, {"text": "I mean, youtube keeps updating their site to actively make this not work. It worked for a time but now it doesn't anymore.\nI hope this app gets updated again because we need apps like this because youtube is so malicious with their manipulative practices.", "stars": 3, "date": "Jul 26, 2020"}, {"text": "It was working perfectly until yesterday, I need some help please. I have Google 10 laptop, Windows 10 with chrome. Thanks.", "stars": 4, "date": "Jul 20, 2020"}, {"text": "Seems to have stopped working recently.", "stars": 3, "date": "Jul 18, 2020"}, {"text": "Works like a charm.\n\n\nUpdate: Dec 2023. Seems no longer working :( RIP", "stars": 5, "date": "Jul 11, 2020"}, {"text": "Works perfectly fine", "stars": 5, "date": "Jul 8, 2020"}, {"text": "As soon as I installed this virus, I had accounts getting created by themselves on various websites and I would receive the \"click here to activate your account\" emails for each of them.\n\nAvoid it like the plague.", "stars": 1, "date": "Jul 7, 2020"}, {"text": "Does not work...PERIOD!", "stars": 1, "date": "Jun 30, 2020"}, {"text": "Thank you for making this extension, you're saving me $12 a month on garbage YouTube Premium", "stars": 5, "date": "Jun 29, 2020"}, {"text": "It's simple, it didn't make YouTube NonStop.", "stars": 1, "date": "Apr 16, 2020"}, {"text": "I like this app because, listening to my videos helps me relax after a long day.\n\n                    Thank you.", "stars": 5, "date": "Apr 14, 2020"}, {"text": "It doesn't work at all, I have had it running all evening and still, every hour or so, I still need to click 'continue playing'", "stars": 1, "date": "Apr 12, 2020"}, {"text": "Perfect 👍", "stars": 5, "date": "Apr 11, 2020"}, {"text": "This extension performs this function well. However, it unpauses whenever I want to pause the video through the command of wireless earphones. Much appreciated if this can be fixed. Nonetheless, a good and well functioning extension.", "stars": 4, "date": "Apr 10, 2020"}, {"text": "Same issue like other users \"Does not work\", it still pauses.", "stars": 2, "date": "Apr 7, 2020"}, {"text": "I'm giving it four stars since I haven't used it long enough yet to cover all my possible scenarios of this extension working, but so far it has. I have a YouTube playlist that I like to play during my showertime concerts lol so that's what made me go looking for something like this. It worked well until the end of the playlist, which didn't loop as I had requested, BUT I forgot to disable the \"Autoplay\" feature directly below the playlist which overrides the loop command, so be sure to disab... Show more", "stars": 4, "date": "Apr 7, 2020"}, {"text": "It works and i love it! ( Troubleshooting tip that worked for me )\nAt first it didn't work, I closed and reopen my browser with no luck. However i closed my browser then opened my task manager and went to 'details' and forced closed all the google chromes there and made sure there wasnt any google chrome task open anywhere and then when i reopened my browser it started working. \nSo if you had trouble that might help you", "stars": 5, "date": "Apr 7, 2020"}, {"text": "Works like a charm, whether tab is active or not. Must have if listening music from YouTube.", "stars": 5, "date": "Apr 5, 2020"}, {"text": "Not working", "stars": 1, "date": "Apr 3, 2020"}, {"text": "nice extensions now i can watch full playlist relaxing sound when want to sleep till wake up tommorow morning.", "stars": 5, "date": "Apr 1, 2020"}, {"text": "It does what it says on the tin. Highly reccomneded to stop one of the greatest annoyances ever perpetrated on youtube users. Donate if you can.", "stars": 5, "date": "Mar 30, 2020"}, {"text": "Thanks, it works great!", "stars": 5, "date": "Mar 29, 2020"}, {"text": "It doesn't work for me..", "stars": 1, "date": "Mar 28, 2020"}, {"text": "EDIT2: Welp. It just broke again. Didn't work. Had to click \"Yes\" to keep playing. Windows 10, Chrome was minimized\n\nEDIT: I re-installed it then restarted Chrome. Now it seems to work. Maybe you need to refresh the tab or restart Chrome after install\n----\nYeah...definitely does ABSOLUTELY. NOTHING. I've had to click the \"yes i'm still watching\" like 5 times within the past 2 days. So stupid.\nAlso, those comments about needing to have the YouTube tab be the active one is BS. I'm still getting... Show more", "stars": 2, "date": "Mar 26, 2020"}, {"text": "Huge trash ,does not work", "stars": 1, "date": "Mar 23, 2020"}, {"text": "I was about to create a similar extension till I found this. It works as it should!", "stars": 5, "date": "Mar 23, 2020"}, {"text": "Doesn't work when tab not selected, but I think thats due to limitations on extensions, not due to lack of support", "stars": 5, "date": "Mar 21, 2020"}, {"text": "Really helpful (and now works fine in an unselected tab), only dropping a star because of the difficulty in deliberately pausing", "stars": 4, "date": "Mar 20, 2020"}, {"text": "it does what it says but if you try to use the universal playback keys on Edge to pause the video it will keep resuming it", "stars": 3, "date": "Mar 19, 2020"}, {"text": "eats too much cpu power as it tries to unpause even if it is not needed", "stars": 2, "date": "Mar 19, 2020"}, {"text": "The installation went good, but unfortunately the extension doesnt do anything at all. Might need an update? Using Chrome 80.0.3987.149", "stars": 1, "date": "Mar 18, 2020"}, {"text": "DOESN''T WORK \nvideo always paused useles", "stars": 1, "date": "Mar 14, 2020"}, {"text": "It doesn`t work..", "stars": 1, "date": "Mar 12, 2020"}, {"text": "Works perfect", "stars": 5, "date": "Mar 12, 2020"}, {"text": "not working on m.youtube.com, please fix", "stars": 1, "date": "Mar 11, 2020"}, {"text": "Works perfectly for me and it's awesome! It did seem not to work at first for whatever reason, but now it runs without a hitch. Sometimes I need to hit pause two times for the video to pause, but that's such an insignificant issue considering that it allows me to listen to music without interruption. Thank you!", "stars": 5, "date": "Mar 10, 2020"}, {"text": "It was working great before recent times\nNow Youtube added some other ways to stop videos from looping.\nIf you listen to music or watch video on repeat for long it is starts pretending like it is trying load it (running circle), but I am pretty sure I've never had this issue before and nothing changed in my Internet functionality and properties, so I think Youtube found another way to stop video from long loop.\nAnd I think it is based on duration of running video , not count  of loops, I also... Show more", "stars": 5, "date": "Mar 8, 2020"}, {"text": "Works as advertised. I have usually multiple youtube tabs open, has been working great without any extra steps needed.", "stars": 5, "date": "Mar 2, 2020"}, {"text": "Thank you, good job! While everything is working properly", "stars": 5, "date": "Feb 29, 2020"}, {"text": "When wearing an AirPods, I pause the music by tapping the AirPods twice. While using this program, I can't pause music by this way.", "stars": 4, "date": "Feb 29, 2020"}, {"text": "It's nice that it keeps youtube from stopping, however there are some bugs with it. It is not media key friendly and if you pause it using mediakeys, it will start playing again. When the window is minimized as well is influences whether or not it works. Sometimes it'll just pause after a trackswitch and you have to push play on media keys again. However media keys then work.", "stars": 4, "date": "Feb 27, 2020"}, {"text": "Works perfectly! I was a little concerned downloading because of some of the reviews saying you had to have the youtube tab open, but I've had no issues with it for the several months I've been using it now. I'll have yt open in a different tab or even a different window and my music plays nonstop for hours! This thing has been a huge lifesaver, thank you lawfx!", "stars": 5, "date": "Feb 27, 2020"}, {"text": "It does it's job, but pausing with the keyboard media shortcuts is very tricky... specially when the system is slow/lagging. Also, a \"pause\" button would be appreciated while the pause function isn't improved.", "stars": 3, "date": "Feb 26, 2020"}, {"text": "Does what it says on the tin", "stars": 5, "date": "Feb 23, 2020"}, {"text": "Absolute genius plugin! It does exactly what i need it to do, which is circumvent the annoying Youtube pop up asking me if i'm still watching. The Youtube pop up does stay on the screen, but does not stop the playback of the video / video playlist. As pretty much every person who is seeking a plugin like this, they'll be listening to music on a likely minimised or hidden browser tab, so that doesn't matter. This dev deserves a beer!!", "stars": 5, "date": "Feb 19, 2020"}, {"text": "Great app, i mean, really great app, it works also when yhe tab is not selected. I love it! Thank you for creating it, you guys, are the best! Cheers!", "stars": 5, "date": "Feb 18, 2020"}, {"text": "Thanks dude, I really mean it!", "stars": 5, "date": "Feb 17, 2020"}, {"text": "Works like a charm! Simple e pretty straightforward!", "stars": 5, "date": "Feb 15, 2020"}, {"text": "I often play games like Dark Souls with Youtube in the background, so this is great when in the middle of PvP and can't change screens. It looks like it needs an update though, just started today but,Youtube is pausing videos again.", "stars": 5, "date": "Feb 9, 2020"}, {"text": "IT WORKED!!\nFinally I can hear music without that ridiculous thing appearing all the time. Thanks a lot.", "stars": 5, "date": "Feb 9, 2020"}, {"text": "While it works, it also makes it so that whenever I pause the video while the tab is not selected using the pause key on my keyboard, it immediately unpauses. I have to pause it this way two or three times before it actually stays paused, which is very annoying.", "stars": 2, "date": "Feb 2, 2020"}, {"text": "sweet", "stars": 5, "date": "Feb 2, 2020"}, {"text": "Tab was open and selected. Simply did not work. I am keeping it though, just in case devs decide to fix. Fingers crossed cause the pausing is just so inconvenient.", "stars": 5, "date": "Jan 24, 2020"}, {"text": "Only works sometimes. I am not entirely sure how to make it work all the time. If my pc goes idle or if im using multiple programs or if i am in other windows it doesn't work very well with google. Works fantastic in firefox though but I mostly use google for youtube bc firefox isn't as compatible with youtube features since google now owns youtube.", "stars": 3, "date": "Jan 23, 2020"}, {"text": "Plain and simple? It doesn't work. I'm still getting 'Video paused, continue watching?' after every 3 songs.", "stars": 1, "date": "Jan 21, 2020"}, {"text": "Works while in AWS too!  I have to work in AWS often and when changing in and out of the AWS window, YouTube was always pausing my \"Grand Sound\" stream.  Now it it only blips for a second and then keeps playing.  Thanks.", "stars": 5, "date": "Jan 20, 2020"}, {"text": "fake/does not work", "stars": 1, "date": "Jan 20, 2020"}, {"text": "Doesn't work any longer... :-(", "stars": 1, "date": "Jan 17, 2020"}, {"text": "Absolutely works 100%!! Please create one for Firefox too! TEN STARS", "stars": 5, "date": "Jan 16, 2020"}, {"text": "just installed but...videos continue to stop! usenless extension!", "stars": 1, "date": "Jan 15, 2020"}, {"text": "Exactly what is needed", "stars": 5, "date": "Jan 8, 2020"}, {"text": "just doesn't work, even when youtube is the tab that's open. Waste of space really", "stars": 1, "date": "Jan 5, 2020"}, {"text": "Doesn't work for me", "stars": 1, "date": "Jan 4, 2020"}, {"text": "I hope this works. Just this week I started getting that annoying,\" video paused. Are you still watching?\" I always watch youtube either on my Roku or Fire Stick. So, I hope this extension syncs with my account on those devices. If it doesn't I guess I will be casting from my laptop to my TV.", "stars": 5, "date": "Jan 1, 2020"}, {"text": "As Gordon Ramsey might put it: \"Delicious! Finally, a good f****** extension!\"\n\n5/5", "stars": 5, "date": "Dec 30, 2019"}, {"text": "its great", "stars": 5, "date": "Dec 28, 2019"}, {"text": "It makes youtube to continue playing all the time. Even if I pause playing with Steamkeys (https://chrome.google.com/webstore/detail/streamkeys/ekpipjofdicppbepocohdlgenahaneen). So, to my great displeasure, it is impossible to use.", "stars": 2, "date": "Dec 27, 2019"}, {"text": "still works as of 12/23/19 :)", "stars": 5, "date": "Dec 24, 2019"}, {"text": "Exactly what I've been looking for.  No more... ''Continue Watching ?''  BS....  Love IT", "stars": 5, "date": "Dec 22, 2019"}, {"text": "Doesn't work for me. Has already paused twice while using the addon :(\nWhen paused, i switched to the youtube tab and the \"are you still watching\" poppup was there, waiting for me to click on it.", "stars": 1, "date": "Dec 19, 2019"}, {"text": "PERFECT, now I can just play the ,,hours long,, videos or let the auto play drive the show", "stars": 5, "date": "Dec 18, 2019"}, {"text": "It works perfectly, you need to restart your browser first though.", "stars": 5, "date": "Dec 17, 2019"}, {"text": "Thx works perfect", "stars": 5, "date": "Dec 16, 2019"}, {"text": "Good but with issue. I can't remote youtube with the multimedia button play/pause on the keyboard. I press the pause button and video start automatically again. The same issue is with youtube on the TV. I send the video via browser to the TV and if I press on the remote control pause button than video pause for one sec and run again.", "stars": 3, "date": "Dec 14, 2019"}, {"text": "doesnt seem to work anymore", "stars": 2, "date": "Dec 11, 2019"}, {"text": "working here", "stars": 5, "date": "Dec 11, 2019"}, {"text": "11.12.2019 not working anymore", "stars": 1, "date": "Dec 11, 2019"}, {"text": "Does not work\n\nedit: works now. solves an annoying problem", "stars": 5, "date": "Dec 8, 2019"}, {"text": "Hell yeah thank you so much dude ♥", "stars": 5, "date": "Dec 6, 2019"}, {"text": "Does the job perfectly", "stars": 5, "date": "Dec 3, 2019"}, {"text": "Everything works for me. Love it", "stars": 5, "date": "Dec 3, 2019"}, {"text": "It does not work anymore for me. I used it for a long time and worked properly until today, so thank you for that period your app helped me a lot in not getting angry on youtube. :)\n I am sure it could be fixed somehow. Please update it! Anyway,Thank you and I wish you the best!", "stars": 4, "date": "Dec 1, 2019"}, {"text": "does nothing", "stars": 1, "date": "Nov 30, 2019"}, {"text": "junk. doesnt work", "stars": 1, "date": "Nov 29, 2019"}, {"text": "does not work at all, do not get it all I can say is it is prob a logger to get your info used it for a whole day and it did not do anything my yt still paused every like 15 mins. dont wast your time on this useless app!!!!", "stars": 1, "date": "Nov 28, 2019"}, {"text": "Doesn't work for me.\nWin10 x64. Chorme.", "stars": 1, "date": "Nov 27, 2019"}, {"text": "I came here to say thank you. This is work perfectly even I minimize windows. Thank you for making this extension. For the people who find out this extension is working, please make a good review 5 stars :)", "stars": 5, "date": "Nov 27, 2019"}, {"text": "Thanks m8 very helpful and didn't know I needed it till I started listening to playlists a few days ago. Thanks for giving us power over our browsers! Also it works fine with my media controls, so idk.", "stars": 5, "date": "Nov 27, 2019"}, {"text": "god thank you", "stars": 5, "date": "Nov 25, 2019"}, {"text": "well idk why but its not working for me", "stars": 2, "date": "Nov 24, 2019"}, {"text": "Doesn't work!", "stars": 1, "date": "Nov 21, 2019"}, {"text": "Works as advertised. Recommended.", "stars": 5, "date": "Nov 19, 2019"}, {"text": "Didn't work, still pops up and pauses. Extension never resumes the video/playlist.", "stars": 1, "date": "Nov 18, 2019"}, {"text": "It definitely works, even in tabs you don't have open.\nOne issue you might have (I'm not sure if it's because of this extension) is that you can't unsubscribe anymore (popup closes immediately). So the developer might want to look into that.\n\nThank you for the extension", "stars": 5, "date": "Nov 15, 2019"}, {"text": "I really love it. It's working with the desktop application that youtube released and everything. But, recently (Past couple of days, actually) YouTube has taken action specifically against this extension. Now whenever I use this extension, the songs just keep loading endlessly. Hope you update it and I will surely use it again.", "stars": 5, "date": "Nov 13, 2019"}, {"text": "It just does not work.", "stars": 1, "date": "Nov 7, 2019"}, {"text": "No funciona!\nIt doesn't work!", "stars": 1, "date": "Nov 7, 2019"}, {"text": "Excellent! Big thanks to the developer!!!\n\nI have multiple tabs, multiple desktops, etc. I started YouTube Music in a tab, selected a different tab in the same window, then minimized it and changed to another desktop. Music still playing uninterrupted after several hours.\n\nUpdate: Unfortunately there is a bug causing it to treat the pause button on my keyboard as if YouTube was pausing the video, causing it to start playing again. This renders my keyboard impotent. Please fix. I'd love to giv... Show more", "stars": 4, "date": "Nov 7, 2019"}, {"text": "Doesn't work at all. The only thing it does do is unpause after I have manually paused the video.", "stars": 1, "date": "Nov 3, 2019"}, {"text": "Since a few days ago, whenever I use my media key (using the streamkeys extension) to pause the video, it just resumes it right after. I disabled this extension to see if it was the problem and it was.", "stars": 5, "date": "Nov 2, 2019"}, {"text": "Was fine until it recently stopped working.", "stars": 4, "date": "Oct 31, 2019"}, {"text": "Straight to the point, those annoying pop-ups pausing the videos are gone!", "stars": 5, "date": "Oct 29, 2019"}, {"text": "I prefer youtube auto pause blocker, works a lot better than this one", "stars": 1, "date": "Oct 24, 2019"}, {"text": "Doesn't work at all", "stars": 1, "date": "Oct 23, 2019"}, {"text": "Thank you a lot", "stars": 5, "date": "Oct 22, 2019"}, {"text": "not work", "stars": 1, "date": "Oct 20, 2019"}, {"text": "It does its job, but unfortunately conflicts with \"Plasma Integration\" addon (the default addon on KDE desktops). Specifically: when you play music on youtube, and press \"Play\" media-key on keyboard for Chrome to pause the music, \"youtube-nonstop\" enables it back.\n\nPresumably, \"youtube-nonstop\" uses as a heuristic \"whether the tab/browser was focused when youtube stopped playing\", and apparently this heuristic alone is not enough.", "stars": 3, "date": "Oct 20, 2019"}, {"text": "doesn't work. what's to like there", "stars": 2, "date": "Oct 18, 2019"}, {"text": "Just perfect. I use it on my Shield TV with Kiwi browser and uBlock so I can watch music videos without interruption. Kudos for the developer.", "stars": 5, "date": "Oct 16, 2019"}, {"text": "not working for youtube music", "stars": 1, "date": "Oct 15, 2019"}, {"text": "Works like a charm for me (the next time I used my computer so it looks like a restart is needed that's all), no issue of songs repeating cos I leave my Youtube to autoplay whatever is up next.", "stars": 5, "date": "Oct 15, 2019"}, {"text": "Works, but causes videos to repeat, and computer's 'skip to next' doesn't fix it. Youtube's 'skip to next' breaks the cycle until the next time it decides to repeat on loop.", "stars": 3, "date": "Oct 11, 2019"}, {"text": "Amazing plugin when it doesn't repeat the video 100x :(", "stars": 4, "date": "Oct 10, 2019"}, {"text": "When I use this extension songs repeat on youtube even when playing from a list. I've just heard the same track 4 times in a row.", "stars": 2, "date": "Oct 10, 2019"}, {"text": "When it worked it was good. Not working anymore.", "stars": 2, "date": "Oct 10, 2019"}, {"text": "Its working but idk where is the problem, when you are listening to a playlist on a youtube it wont skip to another song... after disabling this addon videos are playing without problem so i assume something is wrong :)", "stars": 4, "date": "Oct 8, 2019"}, {"text": "Seems to be not working. Or is it because i want to use it with the randomly created playlist \"My Mix\"?\n\nEdit: Tried it again. This time with only YT open and no other Tabs. It works now but when the popup starts to appear, every single video from there on gets paused for a second and then resumes so only 4 stars", "stars": 4, "date": "Oct 5, 2019"}, {"text": "awesome. works perfectly", "stars": 5, "date": "Sep 26, 2019"}, {"text": "Excellent & Necessary Extension - when you know the following: \n\nExtension Name:         YouTube NonStop\nExtension Purpose: Controls Youtube  \"Video paused. Continue watching?\"\n\nFeature Control: \nDuring YouTube video viewing, YouTube posts a randomly timed on-screen question asking if the viewer is still watching the currently playing video. YouTube will stop the currently playing video, if the viewer does NOT click the \"Yes\" answer.\n\nExtension Execution: \nYouTube NonStop Chrome extension aut... Show more", "stars": 5, "date": "Sep 22, 2019"}, {"text": "I can't thank you enough for this extension, You're part of the reason for the greatness in humanity. It doe's the job well :)", "stars": 5, "date": "Sep 18, 2019"}, {"text": "this really helped me", "stars": 5, "date": "Sep 18, 2019"}, {"text": "It works great, except I can't use media buttons on my bluetooth speaker :(", "stars": 4, "date": "Sep 14, 2019"}, {"text": "Hungarian youtube version not working. :(", "stars": 2, "date": "Sep 14, 2019"}, {"text": "It works, but the overlay resume playing is still there. and now overlay control on top.", "stars": 4, "date": "Sep 14, 2019"}, {"text": "Can function normally\nBut it will make my media pause button invalid", "stars": 3, "date": "Sep 7, 2019"}, {"text": "It doesn't detect if the pause comes from a media keys, if I try pausing the video with pause button in my keyboard or in my headset it starts playing again after a short while, making it impossible to pause a video without going to the tab", "stars": 3, "date": "Sep 5, 2019"}, {"text": "Great extension,  works awesome!!", "stars": 5, "date": "Sep 3, 2019"}, {"text": "bug report, conflict with youtube playlist, if finish the end of playlist it will jump out of the playlist when this plugin on", "stars": 5, "date": "Aug 27, 2019"}, {"text": "really works!!! :)", "stars": 5, "date": "Aug 27, 2019"}, {"text": "Does not work...", "stars": 2, "date": "Aug 26, 2019"}, {"text": "Not doing its onle feature x)", "stars": 1, "date": "Aug 24, 2019"}, {"text": "This extension worked perfectly for me. Thank you so much.", "stars": 5, "date": "Aug 21, 2019"}, {"text": "Thanks for the extension. As mentioned by \"Doug Hyden\", I am able to use this extension through Windows Virtual Desktop.\n\nOthers extensions I am using, if others are interested ( I always listen to \"Youtube Mix\" - Playlist with random videos suggested by YT based on my preferences)\n- Stream Keys - Keyboard shortcuts for pause/play/ next/ previous videos in playlist\n- Enhancer for Youtube - Lot of features are there. I am using for adblocker, enforcing 144p for videos to save bandwidth and shu... Show more", "stars": 5, "date": "Aug 19, 2019"}, {"text": "Works mostely great but sometimes when I stop a video it just starts playling after some time on its own. (chrome - only when browser not minimized)", "stars": 5, "date": "Aug 15, 2019"}, {"text": "The application works fine. Thank's!", "stars": 5, "date": "Aug 7, 2019"}, {"text": "It doesn't work at all for me even though I have the youtube tab open.", "stars": 1, "date": "Aug 3, 2019"}, {"text": "Does not work, pure and simple. In window, full screen, etc. Has one job that it does not do... 8/1/19. Uninstalled.", "stars": 1, "date": "Aug 1, 2019"}, {"text": "Works perfectly as of 7/29/2019. Thanks!", "stars": 5, "date": "Jul 30, 2019"}, {"text": "It works as it is supposed to, thanks so much i can study with music for hours!!", "stars": 5, "date": "Jul 9, 2019"}, {"text": "F*K youtube eh f*k google f*k ads f*k their money. ad block + piracy ftw", "stars": 5, "date": "Jul 6, 2019"}, {"text": "After some time it will put the video on pause", "stars": 1, "date": "Jul 5, 2019"}, {"text": "Makes youtube usable again", "stars": 5, "date": "Jul 1, 2019"}, {"text": "Doesn't work.", "stars": 1, "date": "Jun 29, 2019"}, {"text": "Not so great - it messes with the controls. When it is active i can't, for the life of me, hit the control buttons, so for changing volume or skipping to the next video i have to first cancel fullscreen.", "stars": 2, "date": "Jun 29, 2019"}, {"text": "Not working...", "stars": 1, "date": "Jun 27, 2019"}, {"text": "not working", "stars": 1, "date": "Jun 25, 2019"}, {"text": "perfect", "stars": 5, "date": "Jun 25, 2019"}, {"text": "I had no idea this existed.   Listening to music on Youtube was starting to get pretty annoying, as it would constantly auto-pause.       Thanks to the developer(s) for this extension, its great.", "stars": 5, "date": "Jun 22, 2019"}, {"text": "I'm so grateful for this handy extension! I listen to music while I clean or do dishes and the constant interruptions were so annoying. I would have to drop what I was doing just to hit 'yes.' The frequency of the box seemed to increase over time or maybe that was my irritation, but either way I thought I would have to give up on YouTube. Thank you!", "stars": 5, "date": "Jun 22, 2019"}, {"text": "Doesn't work for me. I always use a window with 1/4 width of my screen, so i can see my playlist in a column below the video. Could be that a problem?\n\nI also use to have the window minimized, so I don't know if the extension should be working or not ¯\\_(ツ)_/¯", "stars": 2, "date": "Jun 20, 2019"}, {"text": "Worked as intended.", "stars": 5, "date": "Jun 19, 2019"}, {"text": "Really a great add on!! Everyone saying that it does not work is wrong...All you need to do is just have on tab left open in your active window. If you have another window open, as soon as you minimize, it will pause. Thanks for stopping such an annoying thing made by Google :)", "stars": 5, "date": "Jun 17, 2019"}, {"text": "Just doesn't work, even with the window open :/", "stars": 1, "date": "Jun 17, 2019"}, {"text": "best program", "stars": 5, "date": "Jun 16, 2019"}, {"text": "Though it doesn't seem to work in full screen or theatre mode, it is nonetheless working to prevent this annoying problem. The momentary pause, with little white box popping up, does seem to happen with every song though, whereas before it happened about every 3 songs.  Why does youtube do this by the way. I even read that getting their premium service does not stop it from happening. Why would they want to annoy their users so much?", "stars": 4, "date": "Jun 16, 2019"}, {"text": "Best solution for this useless \"feature\".", "stars": 5, "date": "Jun 15, 2019"}, {"text": "Does NOT work. Dont waste your time with this spamware. Instead use microsoft edge or mozilla browsers for watching youtube without pause.", "stars": 1, "date": "Jun 14, 2019"}, {"text": "When I first try this it doesn't work and I wrote a email to the developer. He told me what to do. Thank you very much Nikolaos :)", "stars": 5, "date": "Jun 10, 2019"}, {"text": "Perfect", "stars": 5, "date": "Jun 9, 2019"}, {"text": "it works.. even in a tab that is not in front. Just needed to restart my browser", "stars": 5, "date": "Jun 9, 2019"}, {"text": "If this doesn't work, close the application and reboot the system.", "stars": 5, "date": "Jun 9, 2019"}, {"text": "Doesn't work! please block them on google webstore", "stars": 1, "date": "Jun 8, 2019"}, {"text": "The YouTube tab was selected on Chrome and this plugin was red in color still I got the annoying popup to click 'Yes' and on clicking on this add-on all it said was 'Donate on Paypal'. Disappointed.", "stars": 1, "date": "Jun 8, 2019"}, {"text": "A life saver, really. Thank you so much!\n\nIf yours isn't working first time, try to restart your computer. It worked for me.", "stars": 5, "date": "Jun 8, 2019"}, {"text": "doesn't work", "stars": 1, "date": "Jun 8, 2019"}, {"text": "Thank you I, you saved my sanity!  Smacking jackwipes you tube at it's own game!  I ponyed up some grocery money for you.  Keep up the great work!", "stars": 5, "date": "Jun 6, 2019"}, {"text": "Does not seem to be working for me, with Chrome / Win 10. I still get random \"video paused, continue watching?\" popups that I have to manually close, whether the tab for that video is active in their Chrome window or not (while I'm navigating in another Chrome window). The extension does seem however to press play again on video I just paused.", "stars": 3, "date": "Jun 6, 2019"}, {"text": "Works exactly like described. Good work. But I have an keyboard with a shortcut so I can pause a video (FN+F5). But when I use that button the extension thinks it's YouTube with there alert so it plays the video right after I pause it. Hope you can fix this, would be great.", "stars": 4, "date": "Jun 6, 2019"}, {"text": "Not work", "stars": 1, "date": "Jun 6, 2019"}, {"text": "Do what it says, but there's small pause when the pop-up is displayed.", "stars": 4, "date": "Jun 5, 2019"}, {"text": "Youtube has become more aggressive with these popups to push people towards paying for youtube premium. Then this extension comes to rescue. The popup does show up but the video isn't interrupted. As long as my playlist is playing and the music isn't interrupted this extension is doing a great service!", "stars": 5, "date": "Jun 5, 2019"}, {"text": "Thank you, it just works!", "stars": 5, "date": "Jun 5, 2019"}, {"text": "not working", "stars": 1, "date": "Jun 5, 2019"}, {"text": "doesnt work !", "stars": 1, "date": "Jun 5, 2019"}, {"text": "Thank you", "stars": 4, "date": "Jun 5, 2019"}, {"text": "when YouTube gets so desperate about selling YouTube Premium it needs to pop this message every 15 minutes. Just Pathetic. Luckily someone made this and we are all so grateful for it. Thank you so much.", "stars": 5, "date": "Jun 3, 2019"}, {"text": "Doesn't work.", "stars": 1, "date": "May 31, 2019"}, {"text": "works, thanks", "stars": 5, "date": "May 31, 2019"}, {"text": "You are a literal saint! A big thank you for your work.", "stars": 5, "date": "May 31, 2019"}, {"text": "Please add an option to also skip the \"inappropriate for some users\" message before videos, it keeps pausing my playlist.", "stars": 4, "date": "May 30, 2019"}, {"text": "Does not work :(", "stars": 2, "date": "May 28, 2019"}, {"text": "Working great", "stars": 5, "date": "May 27, 2019"}, {"text": "it works", "stars": 5, "date": "May 26, 2019"}, {"text": "It has one task, yet doesn't even manage to do that. Youtube videos still is pausing.", "stars": 1, "date": "May 25, 2019"}, {"text": "Doesn't work", "stars": 1, "date": "May 25, 2019"}, {"text": "Installed today...didn't work.  Uninstalled...", "stars": 1, "date": "May 24, 2019"}, {"text": "good extension, but there is one problem. I use the Yandex browser and when the video opens in picture-in-picture mode when viewing YouTube, I can’t pause the video in this window. Can this be something to fix? thank", "stars": 4, "date": "May 11, 2019"}, {"text": "Does not work.", "stars": 1, "date": "May 10, 2019"}, {"text": "dont work", "stars": 1, "date": "May 4, 2019"}, {"text": "very good", "stars": 4, "date": "Apr 24, 2019"}, {"text": "Does not work, Win 10 Pro, Chrome. Same Tab same everything , stops like it used to stop.", "stars": 2, "date": "Apr 23, 2019"}, {"text": "The idea is good, however there are some things to improve. For example working witch multimedia keys, as I press pause on my keyborard I want it to stop but the plug-in resumes it automaticly :D Also there is a little delay when the video pauses. It's like 100 ms of delay but still annoying.", "stars": 3, "date": "Apr 17, 2019"}, {"text": "This works great for me, I use chrome to cast throughout my entire home - this way I can leave the PC with a playlist going for the entire day! (Like I used to... GD youtube really)", "stars": 5, "date": "Apr 15, 2019"}, {"text": "It works", "stars": 5, "date": "Apr 14, 2019"}, {"text": "Not working. 5 stars if it works, and I will donate, if you take donations. I am restarting to see if it will fix the issue. But for now, no luck. (If you can point me to any working solutions, please let me know.)", "stars": 1, "date": "Apr 14, 2019"}, {"text": "Doesnt work", "stars": 1, "date": "Apr 4, 2019"}, {"text": "You need to have the tab open sadly.", "stars": 4, "date": "Apr 3, 2019"}, {"text": "Works like a charm, like @Doug Hyden said, keep youtube in it's own window.", "stars": 5, "date": "Apr 3, 2019"}, {"text": "works half the time, for some reason. Still needs some work to perfect it in my humble opinion. I still receive the annoying pop up notifications asking me to keep watching music videos, and it's annoying.", "stars": 2, "date": "Apr 1, 2019"}, {"text": "It is not working.", "stars": 1, "date": "Apr 1, 2019"}, {"text": "Youtube has today an almost total monopoly...\nAnd they are now acting like basic greedy douchebags, the same they said,  years ago, they would \"NEVER\" become...\nWell, this is from YT community : \n\nFUYT.", "stars": 5, "date": "Mar 30, 2019"}, {"text": "Enables the listening of music on YouTube without the energy crashing 'are you still watching'. So many hours saved. This extension enables my work flow and enhances my productivity.", "stars": 5, "date": "Mar 26, 2019"}, {"text": "Invalid", "stars": 1, "date": "Mar 17, 2019"}, {"text": "Working well so far. Tyvm!", "stars": 5, "date": "Mar 13, 2019"}, {"text": "Does not work for me..\nI don't have the tab open it plays in the background while I work on other things. Maybe that is the problem. So for me it sucks", "stars": 1, "date": "Mar 6, 2019"}, {"text": "this add on was working perfectly till today, it seems Youtube is catching on. I find now that occasionally the Youtube nag box still hangs up playback, perhaps it's time to include a small randomized delay before sending the automated reply to keep the playback rolling.", "stars": 5, "date": "Feb 26, 2019"}, {"text": "Has worked in the past. Today it did not work. I only had one tab open on chrome. Playlist played through 15 of 19 videos before youtube stopped playing with the popup \"video paused continue watching.\" I'm not sure if it's a temporary glitch or if youtube has changed something.", "stars": 4, "date": "Feb 22, 2019"}, {"text": "First I'd like to thank the developer of this extension; You are a saint.\n\nAs for the review; I find this pairs beautifully with the streamkeys extension, especially when you make use of virtual desktops for listening to music. The main issues with Youtube Nonstop are:\n1) It cannot run when the desired Youtube tab is not open in its current window\n2) There is a short hitch when the \"video paused. continue watching\" prompt appears on the page\n\nI circumvent the first issue entirely by simply le... Show more", "stars": 5, "date": "Feb 15, 2019"}, {"text": "Really works fine!", "stars": 5, "date": "Feb 11, 2019"}, {"text": "Hello!\n\nGreat addon, was really happy to google up \"How to remove the youtube resume thing\" and find this extension right away!\n\nUm, will this ever work on Android, or is there a way to make it work on Android already??\n\nGood work!\nCheers!", "stars": 5, "date": "Feb 4, 2019"}, {"text": "Works perfectly and the one who made it is very helpful.\nThanks a lot!", "stars": 5, "date": "Feb 4, 2019"}, {"text": "Thank you", "stars": 5, "date": "Feb 3, 2019"}, {"text": "The tab has to be open for it to work. For someone that listens to music in the background and uses youtube as their primary source of music, it does little to actually benefit me if I have to return to the tab to make it work.", "stars": 3, "date": "Jan 31, 2019"}, {"text": "It doesn't work when the tab isn't selected, so when you have multiple tabs open with one of them being youtube, you need to have the youtube tab open. Other than that it can't be just open and minimized. So right now I've put a tab in a seperate window that is extremely small with my playlist playing and it is working fine, but would've been a lot better if it worked without youtube being the main tab or the window with youtube being minimized. I'd rather not waste screen space.", "stars": 3, "date": "Jan 23, 2019"}, {"text": "Works like a charm for me! there's a slight pause when youtube tries to pause the video but then this handy little extension resets it & away we go.", "stars": 5, "date": "Jan 17, 2019"}, {"text": "Didn't work right away, but after a restart started working as intended. Awesome work, you are a life saver!", "stars": 5, "date": "Jan 16, 2019"}, {"text": "It works in active frame only. But thanks for useful plugin.", "stars": 4, "date": "Jan 16, 2019"}, {"text": "Not working, I can literally see the chrome extension Icon with the annoying youtube thing in the background.", "stars": 1, "date": "Jan 15, 2019"}, {"text": "thank you so much, now it works in both youtube and youtube music", "stars": 5, "date": "Jan 15, 2019"}, {"text": "it doesn't work on my device. It's macbook air with mac os sierra 10.12.6", "stars": 2, "date": "Jan 7, 2019"}, {"text": "Thank you man, now i can play with my second screen without taking every two songs to continue playing it", "stars": 5, "date": "Jan 4, 2019"}, {"text": "Works.", "stars": 5, "date": "Jan 3, 2019"}, {"text": "Hi. Was working, now not, as at 2019.01.02; Chrome version 71.0.3578.98 (Official Build) (64-bit).", "stars": 4, "date": "Jan 2, 2019"}, {"text": "Thank you!", "stars": 5, "date": "Dec 25, 2018"}, {"text": "Works", "stars": 5, "date": "Dec 20, 2018"}, {"text": "This is no longer working for me.\n\nWas previously a 5*", "stars": 1, "date": "Dec 19, 2018"}, {"text": "Does not work", "stars": 1, "date": "Dec 14, 2018"}, {"text": "Thanks man, it works amazing.\nis there any way to support you with some beer money? you deserve it.", "stars": 5, "date": "Dec 14, 2018"}, {"text": "Thank you so much for making this awesome extension to remove the most annoying thing of YouTube! Everything is working perfectly fine for me.", "stars": 5, "date": "Dec 14, 2018"}, {"text": "Great Addon. O listen to music using headphones while working on the PC or using a remote desktop so don't have my browser windows enlarged. Only recently after creating my own play list has YouTube started this annoying video paused click to continue rubbish. Addon is working great after install and PC restart, great work in making Youtube usable again.", "stars": 5, "date": "Dec 10, 2018"}, {"text": "awesome !!! thanks a million .. I had to restart the browser but works flawlessly !!!! I LOVE YOU !!!! \n\nPS: I am not a gay :D", "stars": 5, "date": "Dec 5, 2018"}, {"text": "Can it remain video in fullscreen? I still need to get up and press \"F\"...", "stars": 4, "date": "Dec 4, 2018"}, {"text": "Works as intended!", "stars": 5, "date": "Dec 3, 2018"}, {"text": "It's working! thank you))))", "stars": 5, "date": "Nov 29, 2018"}, {"text": "Great stuff! \nThe video pausing occured only recently in my Chrome Browser. \n\nThanks for giving us seamless music experience! ♥", "stars": 5, "date": "Nov 24, 2018"}, {"text": "Gosh this just saved my life. It works!", "stars": 5, "date": "Nov 20, 2018"}, {"text": "I LOVE IT! I usually listen to music all night, but recently ive started waking up to \"video paused, are you still watching?\" i got this extension hoping for the best, and i woke up to music! thank you for making youtube great again :)", "stars": 5, "date": "Nov 17, 2018"}, {"text": "thanks", "stars": 5, "date": "Nov 14, 2018"}, {"text": "works like a charm", "stars": 5, "date": "Nov 13, 2018"}, {"text": "not working.", "stars": 1, "date": "Nov 7, 2018"}, {"text": "Today stopped working", "stars": 3, "date": "Nov 2, 2018"}, {"text": "I did notice the music stop for a moment and then continue automatically, so I guess this did the trick. Thanks!", "stars": 5, "date": "Nov 1, 2018"}, {"text": "Does not work for me", "stars": 1, "date": "Oct 29, 2018"}, {"text": "It didn't work immediately after I installed it. \n\nWorked the next day when I start my PC again.\n\nNot everything is perfect, though this is consider a blessing already.\n\nThanks lad. I wish you good health. (Drinks vodka)", "stars": 5, "date": "Oct 29, 2018"}, {"text": "Works great!", "stars": 5, "date": "Oct 21, 2018"}, {"text": "It does not work, after 30 mins it popped up again!!", "stars": 1, "date": "Oct 21, 2018"}, {"text": "it does remove the anoying popup and continues playing, but instead it will often pause the video if u rewind or forward it, so yeah not really that great, trade 1 anoyance for another..", "stars": 2, "date": "Oct 21, 2018"}, {"text": "Definitely works, but has a bad tendency to automatically play videos in the background. Great job nonetheless!\n\nEdit: Now working flawlessly. Thank you so much!", "stars": 5, "date": "Oct 11, 2018"}, {"text": "Can you make this work on music.youtube.com? It seems like it only works on youtube.com.", "stars": 3, "date": "Oct 11, 2018"}, {"text": "Simple just add on and go. Works perfectly. I highly recommend it....", "stars": 5, "date": "Oct 9, 2018"}, {"text": "Great initiative. Sadly it doesn't work for me though.", "stars": 5, "date": "Oct 7, 2018"}, {"text": "This is now my favorite addon. I can listen to music while doing other things and not have to run over to the computer every twenty minutes to unpause the video. Thanks.", "stars": 5, "date": "Oct 7, 2018"}, {"text": "So far it's working for me, thanks for making YouTube great again! XD", "stars": 5, "date": "Oct 6, 2018"}, {"text": "I love the idea, but unfortunately it doesn't work. Just got the popup again. I run ublock origin at the same time, FYI.\n\nUPDATE: It works after all. I left it running just in case, and I just saw it do it's job while watching youtube. Great job! Perhaps I should have restarted the browser or my computer after installing it. I'm not sure why it didn't work at first, but I'm sure it's working now. Thanks for your diligent efforts.", "stars": 5, "date": "Oct 6, 2018"}, {"text": "Doesn't work. Still getting the pop up even though I'm not fullscreening and my youtube tab is focused.", "stars": 2, "date": "Oct 4, 2018"}, {"text": "Will be very nice once it can remove it while the tab isn't open. This is working now but it has the problem of playing a video if it's paused in another tab for a while.", "stars": 4, "date": "Oct 4, 2018"}]