[{"text": "i love this because its quick to log in and it work's", "stars": 5, "date": "Feb 28, 2024"}, {"text": "i cant useit\ni allready paste the token and didnt login", "stars": 1, "date": "Feb 23, 2024"}, {"text": "Does not work.", "stars": 1, "date": "Feb 20, 2024"}, {"text": "good, but.... does it work with bots?", "stars": 5, "date": "Feb 8, 2024"}, {"text": "My friends has it and as long as I don't talk to strangers it's ok", "stars": 3, "date": "Feb 5, 2024"}, {"text": "it does not work everytime i paste a token it does not work.", "stars": 3, "date": "Feb 5, 2024"}, {"text": "i like it just not the color maybe its just me ik its not an issue of the tool it works great but could you please make a dark theme like just black i would really appreciate it thanks nice work keep it up", "stars": 5, "date": "Jan 28, 2024"}, {"text": "very cool very nice", "stars": 5, "date": "Jan 14, 2024"}, {"text": "Is that safe", "stars": 5, "date": "Jan 12, 2024"}, {"text": "It's Very Nice Extension In comparison of other login extension. Becuz the other extensions requires to open discord.com/login but in this extension there is nothing required just paste the token and it will open the id. Great Job Flxder But Can you make extension like token extractor it is new uploaded extension on chrome but i don't think its secure so please make a extension to automatically find token. Becuz the update of discord web service when we open inspect of discord.com sometimes i... Show more", "stars": 5, "date": "Jan 4, 2024"}, {"text": "Keep it up!\nIt's working, i just got one question, every token that's going to be pasted on the empty box, goes to you?", "stars": 4, "date": "Dec 27, 2023"}, {"text": "Working", "stars": 5, "date": "Dec 21, 2023"}, {"text": "ya it dont work if you could tell me how its supposed to work that would be great", "stars": 1, "date": "Nov 30, 2023"}, {"text": "Really not working=.=", "stars": 1, "date": "Nov 19, 2023"}, {"text": "after entering token showing login page", "stars": 1, "date": "Sep 27, 2023"}, {"text": "idk how it even worked for those that comment below\nI tried Opera GX, Microsoft edge, Chrome but none even worked", "stars": 1, "date": "Sep 3, 2023"}, {"text": "the developer said on his discord that it could stopped working for some users after the new discord name update but its working for me so idk, maybe im lucky", "stars": 5, "date": "Aug 24, 2023"}, {"text": "still works it is simple and nice :D", "stars": 5, "date": "Aug 22, 2023"}, {"text": "thanks they explained the situation on the discord server that addon is not working due to the new username update and will be fixed as soon as possible", "stars": 5, "date": "Aug 16, 2023"}, {"text": "great addon", "stars": 5, "date": "May 14, 2023"}, {"text": "nice", "stars": 5, "date": "May 14, 2023"}]