[{"stars": 5, "text": "Program actually works almost as expected. From dev's answer \"wysiwig editors are typically using content editable html5 mode. Bug Magnet works with content editable divs.\" \nYes, the plugin won't work for each and every input field, because under the hood they are different. But if you open \"normal\" input field like google.com search or classic old school input fields - the Bug Magnet will work!", "date": "Jan 19, 2024"}, {"stars": 1, "text": "Shows up in Chrome, but selecting options from the context menu never populates any input fields or text areas.", "date": "Nov 22, 2023"}, {"stars": 2, "text": "Everything is good but it is not starting in my chrome", "date": "Mar 21, 2023"}, {"stars": 2, "text": "After installing this tool from google chrome web store, when I right click on page, I am not able to see the option of Bug Magnet.", "date": "Sep 11, 2020"}, {"stars": 5, "text": "Thanks a lot.", "date": "Aug 30, 2019"}, {"stars": 5, "text": "Awesome Plug-in.", "date": "Nov 8, 2018"}, {"stars": 4, "text": "I can't add a config file. If I close the modal and reopen it, it's empty again", "date": "Mar 1, 2018"}, {"stars": 5, "text": "Amazing plug-in, reduces alot of effort with the test data. Higly recommended", "date": "Feb 27, 2018"}, {"stars": 5, "text": "Awesome plug-in.\nThank you !", "date": "Jan 3, 2018"}, {"stars": 5, "text": "Highly recommended this to use, while checking the boundary values and required different types of Test Data.", "date": "Nov 1, 2017"}, {"stars": 2, "text": "Extension does not work once installed.", "date": "Nov 28, 2016"}, {"stars": 5, "text": "show", "date": "May 4, 2016"}, {"stars": 5, "text": "Really useful extension. The option to add your own configuration is also very handy. \n\nDefinitely something I use every day.", "date": "Feb 9, 2016"}, {"stars": 5, "text": "Used it for testing our dashboard of bugclipper.com and it has been very helpful. Highly recommened.", "date": "Apr 28, 2015"}, {"stars": 5, "text": "An elegant and simple solution to exploratory testing.  A handy tool that any QA Test Engineer would find useful -- highly recommended", "date": "Jan 8, 2015"}]