[{"text": "Exactly what I was looking for. Code reviews are mundane without the ability to insert a Pikachu GIF at will.", "stars": 5, "date": "Feb 28, 2024"}, {"text": "Thank you very much for this great extension. I'm now the most popular code reviewer in the team. Everybody wants me to review their PRs because of the fun GIFs I'm adding to the review comment :)", "stars": 5, "date": "Feb 2, 2024"}, {"text": "I basically can't do my job well without this extension, so thank you. Though whatever the current github-changed-something bug prevents me from selecting the \"suggestion\" button, so I had to disable it temporarily. Is there some way we can track an issue or a whatever to know when the fix has come thru?", "stars": 5, "date": "Jan 19, 2024"}, {"text": "Giving this 5 stars because it's been a joy to use so far! However, it looks like GitHub might have made a change that breaks the placement of the \"GIF\" button in the comment box.", "stars": 5, "date": "Jan 18, 2024"}, {"text": "Love it", "stars": 5, "date": "Aug 4, 2023"}, {"text": "Love it!", "stars": 5, "date": "May 22, 2022"}, {"text": "Works great", "stars": 5, "date": "Nov 30, 2021"}, {"text": "I can now properly express myself in pull requests and issues on GitHub. How did I manage before?", "stars": 5, "date": "Oct 11, 2021"}, {"text": "Before I got this extension I was weak. Now...", "stars": 5, "date": "Mar 23, 2021"}, {"text": "Works perfectly. And very fast. Cool!", "stars": 5, "date": "Mar 23, 2021"}, {"text": "I do not see the Gif button...\n\nTried to insert in my README.md after installation of git extension.\nhttps://github.com/EvaMalinina/todo-list-react-hooks/blob/main/README.md", "stars": 2, "date": "Jan 11, 2021"}, {"text": "I love it, works as advertised", "stars": 5, "date": "Oct 21, 2020"}, {"text": "This had a 5 star from me until it stopped working. It doesn't show the GIF button anymore. Once this is fixed, I'll bump it back up to 5 stars.", "stars": 2, "date": "Dec 9, 2019"}, {"text": "Neat! Save me so much time to add gif for my pull request. love it!", "stars": 5, "date": "Aug 28, 2019"}, {"text": "How much time have I wasted looking for the perfect GIF to attach to my pull request? That's a thing of the past now. 🙌", "stars": 5, "date": "Apr 24, 2019"}, {"text": "Sooo much easier to add GIFs in my Github pull requests now. It does exactly what you want it to do, not more not less. Why open a new tab when you can do it RIGHT THERE ON THE PULL REQUEST. GiFabulous extension!!!! GIFs for Github or a gift for Github from the coding gods. Its the small things in life. A++", "stars": 5, "date": "Jan 16, 2019"}, {"text": "I used to struggle to adequately communicate my concerns or jubilations about my code reviews. This all changed when I discovered this extension. No context switching, no endlessly searching for a gif and forgetting why I was in the first place. From within the GitHub Pull Request comment box I can quickly add a gif and truly express how I feel about the code. Simple and easy. Thank you!!", "stars": 5, "date": "Nov 14, 2018"}, {"text": "Flipping premium time saver right here. This extension is a must have for any and all github users 👍", "stars": 5, "date": "Nov 14, 2018"}]