[{"text": "The extension unexpectedly got corrupted and after repairing it, all my saved tab windows (some of which I had saved for years) were now gone and I have no way of retrieving them again", "stars": 1, "date": "Oct 2, 2022"}, {"text": "Simple, easy clean, works perfectly. I just press one button and everything open is saved, no unnecessary setup.", "stars": 5, "date": "Aug 24, 2022"}, {"text": "Great work. Simple and easy to use. It would be even better if you could name your savings. But thank you so far", "stars": 5, "date": "Jul 1, 2022"}, {"text": "Very useful extension. Suggestion: make it possible to save just one tab at a time. (I rarely need to save all my tabs at once.)", "stars": 4, "date": "Mar 17, 2022"}, {"text": "Nice app! Please add oportunity open saved tabs in incógnito and use shift to open backgroung tabs from saved.", "stars": 4, "date": "Nov 1, 2021"}, {"text": "very nice extension! though is there a way to name the saved tabs? it would be a nice feature especially if you have multiple tabs saved ^^", "stars": 4, "date": "Oct 6, 2021"}, {"text": "light, simple, and does exactly what it says", "stars": 5, "date": "Aug 13, 2021"}, {"text": "simple and clean, u should own it. Look forward to sync to cloud in v2.0.", "stars": 5, "date": "Jan 16, 2021"}, {"text": "Awesome extension. Very helpful", "stars": 5, "date": "Mar 6, 2020"}, {"text": "my pal al(abraham). made this great extension which is really helpful .. like when u r watching p**n n stuff.. and if uwant to go to the same video that made u orgasmic  .. al is the guy for u ... cheers", "stars": 5, "date": "Mar 6, 2020"}, {"text": "Great work. I love how you can open all the tabs in a window with a single click.", "stars": 5, "date": "Mar 6, 2020"}, {"text": "Great extension. Can you have it sync across multiple devices? The Delete All button's position can also lead to accidentally deleting all tabs.", "stars": 3, "date": "Feb 26, 2020"}, {"text": "This is great. Please allow selection of the entire window. If I have 10 tabs in one window I have to select each one. I should be able to just select the Window instead from the list.", "stars": 4, "date": "Feb 20, 2020"}, {"text": "i love this extention because i be forgeting things and so with this extention i just save it for later and when i have to go back i just go to the extention and bring it back up. Very useful  and  helpful. you'll love it.", "stars": 5, "date": "Feb 19, 2020"}, {"text": "very good", "stars": 5, "date": "Oct 25, 2019"}, {"text": "Always wanted this feature on Chrome and finally able to effortlessly save my tabs and reopen them later. Does the job very well. Highly recommended! Kudos to the developer :D", "stars": 5, "date": "Oct 4, 2019"}, {"text": "Vvery use full & must have extension. You can store as many sessions & windows you want where as chrome allows you to restore only one recent session(which is kind of useless. I can get them via history itself :P)\n3 cheers to the developer for saving us & our tabs ;) .", "stars": 5, "date": "Sep 18, 2019"}, {"text": "A very handy extension that makes you productive. Its a \"must have\" for students.", "stars": 5, "date": "Aug 24, 2019"}, {"text": "a great extension. always wanted something like this. used to struggle a lot during projects. this extension comes to the rescue. Great work. Highly recommend to download", "stars": 5, "date": "Aug 4, 2019"}, {"text": "I am using it right now. It's a great tool to save the pages you currently have open. Very useful when I need to save multiple pages for a project I will have to come back to. It's a one-click solution and keeps my bookmarks uncluttered.\n\nGo Ahead!!", "stars": 5, "date": "Aug 3, 2019"}]