[{"date": "Mar 8, 2024", "text": "This is the ultimate darkmode app! Midnight Lizard parts the curtain and lets the USER make all the big decisions on how they want their sites to look. It also lets you save those very specific settings on a SITE BY SITE BASIS. No more two options and one blacklist. No. This program will let you have your cake and eat it, too. Excellently made. UI to die for. If you have the means, go support these guys, they're doing God's work.", "stars": 5}, {"date": "Jan 25, 2024", "text": "Effing amazing!", "stars": 5}, {"date": "Jan 16, 2024", "text": "Love this extension. The UI is very intuitive and contains a ton of adjustment options. There are also quick them adjustments that make this extension a quick and easy addition.", "stars": 5}, {"date": "Jan 7, 2024", "text": "OMG, simply the best and just exactly what I needed.  Having several sensitivities, and suffering from long hours off looking at my monitor, I now have fullly adjustable control.  Soo much relief. I'd never do without. I was astonished to see that you can custom set each to it's own individual settings!!!", "stars": 5}, {"date": "Dec 23, 2023", "text": "Great extension allowing customization of website/webpage background color, etc. to one's liking. \n\nHowever,  it doesn't seem to work on https//www.msn.com, or https://www.msn.com/en-us/. \n\nBut if I click on any of the titles like \"News (https://www.msn.com/en-us/news), \"Entertainment,\" \"Money\" or \"Sports\"  it then works.   Hope the developer(s) would look into this.", "stars": 5}, {"date": "Dec 20, 2023", "text": "so far so good", "stars": 5}, {"date": "Nov 25, 2023", "text": "helps me to have an aesthetic web browsing", "stars": 5}, {"date": "Nov 24, 2023", "text": "I really enjoy this extension, I have a high end computer and experience no lag like the other reviews where saying. the themes are awesome, its customizable, its high quality, it doesn't have ads or ask for money, its easy to understand and it works as intended. My only criticism is that on docs it inverts it and makes the images look weird", "stars": 4}, {"date": "Oct 7, 2023", "text": "It is too heavy on the browser. pages load really slow and colors change 2-3 times during the process. \nAlso the pics are a bit dull on twitter, instagram, etc  with that extension", "stars": 2}, {"date": "Oct 2, 2023", "text": "Meilleur que Dark Reader ! / Better than Dark Reader!", "stars": 5}, {"date": "Sep 28, 2023", "text": "We love the midnight lizard.", "stars": 5}, {"date": "Sep 19, 2023", "text": "it works good, unlike google dark mode! 10/10 would recomend", "stars": 5}, {"date": "Sep 13, 2023", "text": "It works great and is very customizable", "stars": 5}, {"date": "Aug 27, 2023", "text": "It contains several great theme options and even more can be easily downloaded and installed from its website. It serves as a great dark-mode extension as well! I don't normally review extensions, but this one is truly fantastic.", "stars": 5}, {"date": "Aug 9, 2023", "text": "Superb .. I use it all the time .", "stars": 5}, {"date": "Jul 8, 2023", "text": "the best extension for dark mode, better than Dark reader and Dark mode", "stars": 5}, {"date": "Apr 26, 2023", "text": "It messes with the adblockers", "stars": 1}, {"date": "Mar 2, 2023", "text": "Holy cow! This is perfect! (lol, my review is very bot-like made)", "stars": 5}, {"date": "Feb 22, 2023", "text": "Rock solid app!  Used it for years, I run windows, and it has been flawless.  Thank you!  Keith", "stars": 5}, {"date": "Feb 12, 2023", "text": "Systematically in macOS, perfect", "stars": 5}, {"date": "Feb 9, 2023", "text": "I like it best. Allow me to switch automatically according to system appearance.", "stars": 5}, {"date": "Jan 24, 2023", "text": "Fairly useful for some sites. However, there are some problems here and there. When I use it on Docs, it just blocks the whole color menu. Circle frame images on some sites also become square for some reason? Aside from that, not too much of a problem. Would recommend for fun or aesthetic purposes.", "stars": 3}, {"date": "Jan 22, 2023", "text": "Overly busy, ugly UI menu. The \"Apply\" button doesn't work when switching themes or enabling/disabling.", "stars": 2}, {"date": "Jan 7, 2023", "text": "One of my most loved extensions", "stars": 5}, {"date": "Dec 31, 2022", "text": "Excellent", "stars": 5}, {"date": "Dec 17, 2022", "text": "Working just fine !", "stars": 5}, {"date": "Dec 12, 2022", "text": "Works better than any other extension, especially with text in frames and so on", "stars": 5}, {"date": "Nov 9, 2022", "text": "This doesn't work on every site, but your not going to find a dark mode that does. Even so, the amount of customization, easy to use settings, and the fact that it works on most sites makes it probably the best dark mode on this site.", "stars": 5}, {"date": "Oct 10, 2022", "text": "Love this xt. Would be super pumped if we could create a keypress combo do disable it temporarily (eg. to read a chart)! Nice work great product.", "stars": 5}, {"date": "Sep 15, 2022", "text": "This works great but I would love to see an option to disabling borders since I use it for debugging, and adding borders is moving things around in the website. I will install it again if this feature is (hopefully) included :)\n\nKind regards, Nancy", "stars": 4}, {"date": "Sep 15, 2022", "text": "IT works and has the color changes I need for hours of Law RESEARCH per day! And it is as good as gold, being as secure as it is!", "stars": 5}, {"date": "Sep 2, 2022", "text": "This is a life saver!  My eyes have trouble differentiating between the blue and purple search results and this fixed that.  Thank you, Thank you!", "stars": 5}, {"date": "Aug 21, 2022", "text": "I got this extension for the purpose of making the background of proton mail emails darker, since dark reader has so many issues.\nThe interface for this is quite bad and it's really difficult to dial in a theme the way you like it.\nBut, the kicker is it causes a substantial amount of lag.\nWhile writing an email in protonmail, because I type fast, it's noticeable behind the letters I am typing since there is now a delay.  IE, typing half a sentence before it is displayed.\nWill continue the hun... Show more", "stars": 1}, {"date": "Aug 10, 2022", "text": "best of all of them. rly great", "stars": 5}, {"date": "Aug 10, 2022", "text": "I've been using this extension for 3+ years with few to no difficulties. It's now one of the first things I add when setting up a new computer/environment. This is a must have for anyone that looks at a screen.", "stars": 5}, {"date": "Jul 20, 2022", "text": "This might be better than Dark Reader...", "stars": 5}, {"date": "Jul 3, 2022", "text": "Great", "stars": 5}, {"date": "Jul 1, 2022", "text": "I never wrote a review for an app or an extension before, but this one? deserves it.\nIt's such an amazing useful beautiful smart extension. one of a kind.", "stars": 5}, {"date": "Jun 29, 2022", "text": "I moved over from Stylish, which turns out to be vastly inferior to this extension. Plus, Stylish charges $12.99 per year for anything over 3 website styles. \nThank you, Midnight Lizard developers.", "stars": 5}, {"date": "Jun 27, 2022", "text": "E X C E L L E N T. No doubt in it. ThankQ", "stars": 5}, {"date": "Jun 13, 2022", "text": "Wonderful, works on many sites and can be customized per site. Settings can be changed/modified intuitively. I have not one complaint at this time.", "stars": 5}, {"date": "Jun 6, 2022", "text": "Useless I don't have a week to learn what should be very simple. Seems to be for people who are really into computers. I don't even know where to begin. I just wanted to reduce the blue light but could not figure this garbage out. Just find a normal blue light filter if that's what you need and don't waste your time on this. Not for the average person at all.", "stars": 1}, {"date": "Jun 1, 2022", "text": "A very amazing extension, I have been looking an extension which makes me use my own settings but in a simple way, instead of coding it, thanks!!!", "stars": 5}, {"date": "May 3, 2022", "text": "Looks like the support forum isn't monitored at all, so I'll post this here. Hasn't been updated since 2021, so is this abandoned? \n\nI'm using ML but it's not working on all pages. I have it set to \"off\" by default, but when I toggle it on for a specific page, choose a theme and \"apply\", not all the page elements are being \"themed\". Even with a complete refresh of the page (Ctrl-R), not all elements are themed. It's a shame: I had high hopes for this after coming from Dark Reader. :(.", "stars": 2}, {"date": "Mar 17, 2022", "text": "beast mode", "stars": 5}, {"date": "Mar 9, 2022", "text": "Woks on everything, perfectly!", "stars": 5}, {"date": "Mar 7, 2022", "text": "Easy to use and pleasing for the eyes.", "stars": 5}, {"date": "Feb 17, 2022", "text": "Best dark mode extension I have found. And the color schemes and customization are awesome.", "stars": 5}, {"date": "Feb 7, 2022", "text": "WAY better than Dark Reader; faster, less buggy, more reliable.. and even better default colour schemes!", "stars": 5}, {"date": "Dec 14, 2021", "text": "This has been perfect and just what I've been looking for. I use it for both mobile and PC. On mobile, Kiwi browser gives the option to use chrome extensions and the built-in night mode has a toggle button. I wanted a dark mode that would follow my device theme when it switches and this has worked flawlessly. The complex processing mode seems to work best for the majority of websites on mobile but love to option to choose from others if one might look better. Good work devs, thank you 👍🏻", "stars": 5}, {"date": "Nov 23, 2021", "text": "the best", "stars": 5}, {"date": "Nov 7, 2021", "text": "Just want bright(est) white text on dark(est) black background for the high(est) contrast; why is there not a thrme that does just that in 1 click?\n\nGoogle Docs, Sheets, etc barely visible\ntried so many different settings\n\nhttps://docs.google.com/spreadsheets/\n\nhttps://docs.google.com/\n\nBUG Background colors turn white on Craigslist, \n\nNot sure if doing this correctly but think found a bug on Craigslist. Go to a page and the background becomes very white (barely readable). Go to Midnight Liza... Show more", "stars": 3}, {"date": "Oct 25, 2021", "text": "I specifically took time to rate this extension. Great job dev team midnight lizard is a very helpful buddy during all nighters.", "stars": 5}, {"date": "Oct 23, 2021", "text": "It's a really great extension for night time dark mode experience, has lots of schemes support, plus you can customize them by toggling in the settings, even better they also have a gallery of themes. I like the Twitter dark mode the best and surprised to find it in the collection. But the only downside of using this is that, compared to Dark Reader, which I've been using for years now, this extension with its tons of functionalities and features is very slow. Pages take longer to load and af... Show more", "stars": 3}, {"date": "Oct 19, 2021", "text": "it was ok for me  as i dont know how to use it", "stars": 3}, {"date": "Sep 29, 2021", "text": "verry good", "stars": 5}, {"date": "Sep 22, 2021", "text": "Great extension Pavel.\nSupport in Vivaldi is missing a couple of things.\nIn Vivaldi the UI can be magnified (\"zoomed\") separate from the page zoom level.\nThe whole extension drop down is is too large and runs off below the window and there is no vertical scroll bar. Please add it. Please make that panel behave as an ordinary page for zooming in and out.\nImport and Export in Vivaldi is not working.\nSo I tried the import canned themes from the website and the \"ADD TO BROWSER\" did not work in Ch... Show more", "stars": 5}, {"date": "Sep 19, 2021", "text": "This is one of my favorite tools/extensions for both FF/chrome/vivaldi. I can't even browse without it! I mean I used to get so aggravated and try messing with all the userstyles that were pre-made for stylus (and the previous data stealer, stylish), they were good, but none really worked the way i needed them to, and i always would end up just pulling them into npp, and spending forever trying to bend them to my own will - eventually..... it's an hour later, and I realize I just wasted all t... Show more", "stars": 5}, {"date": "Sep 11, 2021", "text": "Awesome!", "stars": 5}, {"date": "Sep 9, 2021", "text": "Better then nothing", "stars": 5}, {"date": "Jul 28, 2021", "text": "Awesome, you can  download bunch of available other colors/themes from the clouds of it.", "stars": 5}, {"date": "Jul 21, 2021", "text": "best setting - tnx", "stars": 5}, {"date": "Jul 15, 2021", "text": "Bug: It does not work on Youtube (makes the whole page grey-ish and not able to see things clearly) or any browser contains videos. Please make sure to fix this. Thank you!", "stars": 4}, {"date": "Jul 8, 2021", "text": "Just Awesome", "stars": 5}, {"date": "Jul 8, 2021", "text": "I had a few issues with Google Docs then they fixed it. I love this extension. Its amazing!!", "stars": 5}, {"date": "Jul 2, 2021", "text": "Works + I feel it's less memory-intensive compared to Dark Reader.", "stars": 5}, {"date": "Jun 19, 2021", "text": "awesome", "stars": 5}, {"date": "Jun 15, 2021", "text": "Very good extension! Offers tons of customizability and works seamlessly with most websites and the fact that it's free is just icing on the cake", "stars": 5}, {"date": "Jun 15, 2021", "text": "What an amazing piece of extension. This really helped me add nord theme on my browser and I couldn't be happier about the performance and looks.", "stars": 5}, {"date": "Jun 15, 2021", "text": "Good!", "stars": 5}, {"date": "May 19, 2021", "text": "So good \n😍😍😍", "stars": 5}, {"date": "May 16, 2021", "text": "but not working perfectly on facebook.com. why?", "stars": 5}, {"date": "Apr 25, 2021", "text": "its very good, but the memory usage is suffering since I installed it .", "stars": 4}, {"date": "Apr 20, 2021", "text": "Well done, thank you for this.", "stars": 5}, {"date": "Apr 17, 2021", "text": "WOW!!!", "stars": 5}, {"date": "Apr 13, 2021", "text": "Great and unlike a lot of similar extensions it is completely free! Which it should be as why should being able to use the internet like everyone else be a paid privilege. It is also highly customisable!", "stars": 5}, {"date": "Mar 30, 2021", "text": "Very great. Better than other dark mode extension. Most of the sites looks great, but some of them doesn't look so great. Overall, pretty good.", "stars": 4}, {"date": "Mar 29, 2021", "text": "Just good.", "stars": 5}, {"date": "Mar 24, 2021", "text": "Best Dark Mode Ever", "stars": 5}, {"date": "Mar 17, 2021", "text": "dark theme is nice :)", "stars": 5}, {"date": "Mar 11, 2021", "text": "perfect", "stars": 5}, {"date": "Mar 6, 2021", "text": "It looks great, but slows down gmail a lot.", "stars": 4}, {"date": "Feb 27, 2021", "text": "very googd ,i like", "stars": 5}, {"date": "Feb 20, 2021", "text": "THIS IS THE BEST EXTENSION IN MY OPINION, SOO MANY OPTIONS", "stars": 5}, {"date": "Feb 9, 2021", "text": "Could not live without this extension! I use it on every computer I own, wish chrome would allow extensions on mobile so I could use it there.", "stars": 5}, {"date": "Feb 9, 2021", "text": "just absolutely amazing really happy i found it", "stars": 5}, {"date": "Feb 8, 2021", "text": "Best among the extensions i have tried. Looking for this kind of extension from long time.", "stars": 5}, {"date": "Feb 5, 2021", "text": "It works quite well and has a lot of options To customize it to your own liking but it is slightly complex and is hard to understand it at the beginning (Though that is solved by a simple YouTube Tutorial)\nWould be better if it simpler to understand ,Another thing is that when you want to create a custom colour there is no colour selector option you need to get the colour code , Which is slight Pain .\nOver all is the best in the field of Customising the colour of Your Browser", "stars": 4}, {"date": "Feb 1, 2021", "text": "Lag was awful for someone who works fast pace for work where every second counts. Even on simplified view. Okay for browsing, I guess. But, I work 10+ hours a day, and I need my browser to be responsive. Too bad. I really like how customized you can make the themes. Oh well!", "stars": 2}, {"date": "Feb 1, 2021", "text": "perfect", "stars": 5}, {"date": "Jan 31, 2021", "text": "just havin this extension turned on (and not switched on for any site, and even having all tab suspended) makes youtube video constantly lag lag lag. features are good, but such behaviour is unacceptable. too sad i just have to uninstall it or turn on/off situationally.", "stars": 3}, {"date": "Jan 28, 2021", "text": "This extension is fantastic. It really saddens me to see the web go from this incredibly intuitive, easy to read, easy to navigate standard we had about 10 years ago, to increasingly worse and worse ui on increasingly ad-ridden websites. Whereas extension-less browsing was once a perfectly acceptable norm, today I would not dream of it.\n\nIn today's browsing experience, certain extensions are absolutely necessary--AdBlock, uBlock Origin, TamperMonkey (Anti-AdBlock Killer), etc. Thankfully, you... Show more", "stars": 5}, {"date": "Jan 26, 2021", "text": "I was getting tired of extensions with only 2 options (black or white), so this was a perfect solution. I loved how customizable it was! A little confusing at first to manage the current webpage vs global settings but I figured it out. The only reason I'm sadly going to uninstall the extension (and why I docked 2 stars) is because it slows down my computer soooo much. It was lagging everything I did on chrome. As soon as I switched to my other black-or-white-only extension, it came right back... Show more", "stars": 3}, {"date": "Jan 12, 2021", "text": "this is life changing.", "stars": 5}, {"date": "Jan 10, 2021", "text": "thank you now I can write and read in with the burn of the white.", "stars": 5}, {"date": "Jan 9, 2021", "text": "This extension is amazing! It might take a few minutes to wrap your head around the control scheme, but that allows for a totally customisable experience! \nI am not sure whether I missed it, but my only gripe is that there appears to be timer options to turn on/off Midnight Lizard. It would be great if you could use a timer to switch between a night/day theme. \n\nThis would, for e.g, allow a Solarized light palette during the day, switching to dark in the evening.", "stars": 5}, {"date": "Jan 2, 2021", "text": "Avoid it at best. I dont know why developers act like kardashians whom have achieved nothing in life nor can make their software or service successful without users who use them constantly and recommend so that developer can get more users and sometimes donate them to keep project and life alive. I was using dark reader before this but having issues with the extension on webpages after enabling it and no reply from Russian developer of dark reader (maybe dead or lost in colds and winters of R... Show more", "stars": 1}, {"date": "Dec 29, 2020", "text": "Please add import/export functionality. Otherwise this extension is nothing but great.", "stars": 4}, {"date": "Dec 21, 2020", "text": "Really appreciate this amazing piece of software. Very well done, easy to use, provides lots of customization options. Unfortunately, performance on many websites is reduced drastically. I know there are multiple processing modes, including a simplified one which improves performance, but it does not meet my needs in terms of customization functionality.", "stars": 5}, {"date": "Dec 7, 2020", "text": "Great choices! Thanks, guys.", "stars": 4}, {"date": "Nov 17, 2020", "text": "My school/ and Google have forced dark mode onto me, thus messing up documents to the point where I sometimes can't read them. This extension has solved that problem, as now I can do my schoolwork in peace :) Thank you for this amazing extension!", "stars": 5}, {"date": "Nov 12, 2020", "text": "A fine extension, the settings can though be a bit difficult to understand , and I wish there was an option to keep images normal instead of having to filter them too.", "stars": 4}, {"date": "Nov 8, 2020", "text": "Impressive extension for dark mode, lots of settings and verry good results on pages, verry good french translation, this extension is a verry good addons I have searched during a long time..\n\nfound here by chance this morning after numerous search without luck\nhttps://www.guidingtech.com/best-dark-mode-extensions-for-chrome/", "stars": 5}, {"date": "Nov 5, 2020", "text": "The extension is great but consumes a lot of CPU. Just by having it enabled (even though it's disabled on the current site I'm browsing) my CPU spikes up and scrolling the page is laggy. Disabling the extension fixes the problem. I've a very powerful i7 computer, so I can't imagine how this runs on a low-end PC. \nI have a similar issue with the similar DarkReader extension. I don't understand why it requires that much CPU if it's only supposed to apply some CSS over a site.\nPlease consider re... Show more", "stars": 2}, {"date": "Oct 23, 2020", "text": "This extension is just what I was looking for! Perfect for late-night users that need dark mode, and this works exceptionally well in Google Docs, which was definitely what I was looking for!", "stars": 5}, {"date": "Oct 20, 2020", "text": "Best Dark mode extension I've ever had", "stars": 5}, {"date": "Oct 7, 2020", "text": "This was hard to use. I wanted to make the background dark and the text white, instead of gray. Gray is depressing. There are a million settings, but that was not one of the choices. All kinds of knobs and buttons on the screen that I didnt know what they did. For over 5 minutes I kept moving sliders. Just had no clue. Maybe by random I clicked the right thing.", "stars": 1}, {"date": "Oct 6, 2020", "text": "Easy to use and works great!", "stars": 5}, {"date": "Oct 4, 2020", "text": "its very good", "stars": 5}, {"date": "Sep 26, 2020", "text": "this does exactly what i want. all the time!", "stars": 5}, {"date": "Sep 13, 2020", "text": "Ta buenarda", "stars": 5}, {"date": "Sep 3, 2020", "text": "I like this because you can customise it !", "stars": 5}, {"date": "Aug 31, 2020", "text": "This thing is awesome! Google docs, google slides, and google forms have been so hard on my eyes for school assignments, and this extension can change it all! i completely recommend it.", "stars": 5}, {"date": "Aug 11, 2020", "text": "Great extension! It's very easy to get just the right color levels for any time of day and is very reliable. I've used several other \"night-mode\" extensions and find this to be the best. Thank you!", "stars": 5}, {"date": "Jul 6, 2020", "text": "Game Changer", "stars": 5}, {"date": "Jul 4, 2020", "text": "Excellent extension. Lifesaver.", "stars": 5}, {"date": "Apr 12, 2020", "text": "excellent app. Almost perfect. But Buggy when latex codes comes on the screen", "stars": 4}, {"date": "Apr 9, 2020", "text": "It's easy to use and have a really good color schemes that are easy on the eyes", "stars": 5}, {"date": "Apr 9, 2020", "text": "Very flexible .  I love it .", "stars": 5}, {"date": "Apr 9, 2020", "text": "excelente, saved my eyes .", "stars": 5}, {"date": "Apr 3, 2020", "text": "love it Dude! many thanks for your work   c(°-°)=b", "stars": 5}, {"date": "Apr 2, 2020", "text": "This extension is pretty much perfect, but it would be nice to have the option to keep the Midnight Lizard popup in dark mode, even when it's disabled on the current page (this would be great for websites that already offer dark mode). Also, it doesn't seem to work on the Chrome Web Store, it just says \"Settings for default\" without making it dark...", "stars": 5}, {"date": "Mar 14, 2020", "text": "Always used a dark mode text editor, this is the best one I used so far. Many websites had hard to read details in other extensions so I set the site access to on click.", "stars": 5}, {"date": "Mar 13, 2020", "text": "Epic Darkmode", "stars": 5}, {"date": "Mar 10, 2020", "text": "I'm excited that it's available on book walker com which does me a favor.If one day I do have a Amercian bank card I'd like tosupport but one question whenopen a new page at first fewseconds it's still dazzling  and the pictures on bookwalker aren't quite true to the original. possible to solve?", "stars": 4}, {"date": "Mar 7, 2020", "text": "Running on new Edge.  Feels a little heavy.  Noticeable page load lag on new Edge.", "stars": 3}, {"date": "Feb 27, 2020", "text": "This extension saves me hours of work when restyling websites loaded with color elements because said elements are recolored. Also, it’s perfect for users with zero css knowledge.", "stars": 5}, {"date": "Feb 25, 2020", "text": "Works great!  Only issue I've had so far is after reverting back to light mode using Alt-Shift-L, it takes several presses, sometimes many, of Alt-Shift-M to go back to my dark Lizard settings.", "stars": 5}, {"date": "Feb 13, 2020", "text": "This is really great i am looking for this for a while but i only got extinsions with just black and no other colours, so i am very happy with this", "stars": 5}, {"date": "Jan 27, 2020", "text": "Love it so much BUT::::::::::: there's a bug now where CONSTANTLY it doesn't work as intended with youtube anymore. FIX PLEASE!! love this app so much and i hope i don't need to install another one!", "stars": 5}, {"date": "Jan 23, 2020", "text": "The best universal darkMode out there! This is even better than DarkReader!", "stars": 5}, {"date": "Jan 16, 2020", "text": "So far I love it but I do have 2 feature requests/suggestions. 1. An option to Import an entire CSS script then modify the values as desired to create the perfect custom theme. 2. Export to CSS option. I understand if this feature isn't likely but while I like WYSIWYG editors, I know CSS & I also like having the precise control that being able to edit the CSS directly provides. That's why I've been using Stylus, but having an option to use the WYSIWYG for the base theme, then customize it fur... Show more", "stars": 5}, {"date": "Jan 14, 2020", "text": "do not work on 1337x.to fuek up the page https://prnt.sc/qnpoer   https://prnt.sc/qnpp5g", "stars": 3}, {"date": "Jan 12, 2020", "text": "epic", "stars": 5}, {"date": "Jan 3, 2020", "text": "Great !\nmaybe the Best ..", "stars": 5}, {"date": "Dec 25, 2019", "text": "amazing", "stars": 5}, {"date": "Dec 13, 2019", "text": "yes, Very nice!", "stars": 5}, {"date": "Dec 11, 2019", "text": "Fantastic! My eyes are thankful.", "stars": 5}, {"date": "Nov 20, 2019", "text": "Great extension overall but hogs my cpu resources and the site freezes. Scrolling is slow. Perhaps it'll work well on a powerful pc. However it makes my reading experience horrible. Will try to solve it on my side.", "stars": 4}, {"date": "Nov 12, 2019", "text": "This extension is awesome! Could you do anything with the white flash while loading pages?", "stars": 5}, {"date": "Nov 2, 2019", "text": "Ï used before this Dark Reader but in option they are no math Midnight Lizard win on all aspects !\nbest app for chrome for sure !", "stars": 5}, {"date": "Oct 24, 2019", "text": "It's good, still have some issues, one criticals is that can't set readed link show as different color highlighted, or may be didn't find way to set it up.", "stars": 4}, {"date": "Oct 7, 2019", "text": "Just switched to this from Dark Reader, and so far I'm loving it. I went and grabbed all of the extra themes from the theme site. Great job dev! Thanks!\n\nThe only problem I've had is that I can't favorite or like themes on the theme site, only install and apply them. I tried this on my main Chrome with all other extensions disabled, in Chrome incognito with only this, and a clean install of Firefox with just Midnight Lizard. Not a huge issue for me but it might be for others.", "stars": 5}, {"date": "Sep 14, 2019", "text": "Like ReShade for videogames ... but ReShade is Windows only :(", "stars": 5}, {"date": "Sep 6, 2019", "text": "fascinating", "stars": 5}, {"date": "Sep 6, 2019", "text": "Normally, it's spectacular, but it's been crashing recently which makes me have to repair and have all my settings reset, on Chrome/Windows 7. Also, embedded Twitter videos on other websites have inverted colors for some reason.", "stars": 3}, {"date": "Sep 2, 2019", "text": "Extension fails regularly for chrome on macos. I have to repair it at least once a day", "stars": 3}, {"date": "Sep 1, 2019", "text": "I have been looking for something like this but it is so much better than I never imagine. So luv it.", "stars": 5}, {"date": "Aug 31, 2019", "text": "Please continue updating to effective and efficient. Keep on user's pain points, You will be next foxmail, even Wechat!", "stars": 5}, {"date": "Aug 30, 2019", "text": "very god", "stars": 5}, {"date": "Aug 24, 2019", "text": "Completely breaks some sites. Garbage", "stars": 2}, {"date": "Aug 17, 2019", "text": "2 stars cuz was doing it well but still using cpu so cant use it- bettery drains fast.. Even in Simple mode. Why it needs cpu? A little bette then Dark reader but still all the time.", "stars": 2}, {"date": "Aug 8, 2019", "text": "so nice", "stars": 5}, {"date": "Jul 8, 2019", "text": "GREAT! Finally a Global Dark theme extension that works!\nI tried about 20 different extensions and none of them work correctly. SO FAR, this one does exactly what I want. Thank you!", "stars": 5}, {"date": "Jun 28, 2019", "text": "nice!", "stars": 5}, {"date": "Jun 17, 2019", "text": "Amazing! Better than NE and TLV!!!!!", "stars": 5}, {"date": "Jun 2, 2019", "text": "Saved my eyes during night time. 10/10 would recommend", "stars": 5}, {"date": "May 29, 2019", "text": "Got a bad headache or a MIGRAINE and light hurts your eyes? (Migraines 3-4 times a month for me...) Trying to NOT keep someone awake while you surf? Having a hard time just seeing poor contrast pages? Here ya go!  Install to google and away you go! You can even CHOOSE color schemes that work better for your eyes. I love inverted color.", "stars": 5}, {"date": "May 15, 2019", "text": "It's better and more customizable than Dark Reader and as of now, it seems than it's faster.", "stars": 5}, {"date": "May 5, 2019", "text": "I used to use Dark Mode, but it doesn't work with some of the sites I use.  Either it works with some some of the sites and not others, despite it has a ton of themes to choose from.\n\nML is the only one that works with all the sites I used.", "stars": 5}, {"date": "May 3, 2019", "text": "Hello. The extension is really amazing. But I have reinstalled Windows 10 and now Lizard isn't working for local PDF files. When i press green button on up right, it shows settings for \"Default\". But earlier it was saying \"Local files\".", "stars": 5}, {"date": "Apr 27, 2019", "text": "great color style and design !   I have tried a lot extensions of dark mode , but this one is the best so far.  The color sets are designed carefully and aesthetic. I have tried other extensions but they are just inverse the color, which made the contrast still too high that cause eye strain. But this one, the color of texts and background making a mild feeling, I feel my eyes less tired. First time write a comment for an extension, it definitely deserve 5 star !", "stars": 5}, {"date": "Apr 6, 2019", "text": "I'm very happy with this extension. I use Duolingo, a language learning app. Some days before they changed the appearence in a way, that the whole page is dazzling and has not enough contrast, what is wearing the eyes after short time. Thanks to this extension I found the right remedy!", "stars": 5}, {"date": "Apr 6, 2019", "text": "Excellent app, bir it would be better if it was easier to see how it was going to affect the pages one wished to modify,", "stars": 4}, {"date": "Apr 3, 2019", "text": "the most powerful midnight mode i've ever met, thank you very much !", "stars": 5}, {"date": "Mar 23, 2019", "text": "It's very powerful than other extension. I feel so confrotable.", "stars": 5}, {"date": "Mar 18, 2019", "text": "No doubt, this is the best dark mode extension I have tried (I have tried about 4 kinds)\ngoods:\n- extensible: there are many themes can choose in https://midnight-lizard.org/schemes/index/full/, and add a theme just by click button \"add to extension\", very convenient :)\n- high performance: render dark mode immediately. \"TLV Night Mode\" is a dark mode extension that I have tried, and one of its built-in themes very suit for me, but it need flash several times when open a page, which I think is... Show more", "stars": 5}, {"date": "Mar 16, 2019", "text": "so nice", "stars": 5}, {"date": "Mar 15, 2019", "text": "The best, don't download any other night mode/contrast changing extension. I tried ev single one of them in Chrome store, this is not only the best one but the only one with millions of settings to change & features, while others claim they have but don't work or you have to turn it on for each page, or don't affect the whole page (just text boxes & footers), or make pictures contrast screwed up so you can't see the pics normally. This is only one in Chrome store that doesn't do any of that, ... Show more", "stars": 5}, {"date": "Feb 21, 2019", "text": "Very nice. I tried virtually every darkening extension in the web store, and found this one to be the best. Is easy to work with, well designed, and works great!", "stars": 5}, {"date": "Feb 21, 2019", "text": "better than \"Dark Reader\", don't know why this havn't so much user.", "stars": 5}, {"date": "Feb 17, 2019", "text": "Thank you for creating this wonderful application. It is filled with customization, full of options, very in depth, and still easy to use! It changed my web browsing experience completely! A wonderful extension that should be used by all! \n\n\nPS: I absolutely love that you can blacklist certain sites if they are already fine and do not need any adjustment!", "stars": 5}, {"date": "Feb 16, 2019", "text": "best night mode ever . where others strugle with flash/videos this extention recognize 95% and do  not invert the colors on grafic visualisation wich is a huge + .  i need this on mobile chrome desperately . if anyone has any suggestions", "stars": 5}, {"date": "Feb 10, 2019", "text": "A little slow, but the only page-darkening extension I've found that is free, actually works, and isn't malware. Not only that, but it also has the best customization, even when compared to the ones that inexplicably are charging for broken trash. Thanks for helping me replace Magic Actions for Youtube!", "stars": 4}, {"date": "Feb 7, 2019", "text": "M U S T  H A V E\n\nComplex but intuitive. After 15 minutes, everything was a bliss for my eyes.", "stars": 5}, {"date": "Jan 31, 2019", "text": "Very good! I have been looking for a similar extension for a long time...", "stars": 5}, {"date": "Jan 23, 2019", "text": "EXCELLENT. I CAN TRANSLATE TO SPANISH IF U GIVE GOOGLE PLAY CREDIT", "stars": 5}, {"date": "Jan 14, 2019", "text": "Tried out a fair few of the 'night reader' extensions and this one won out due to the customization. If I'm having issues with a particular page it's easy to change to one of the profiles and go from there!", "stars": 5}, {"date": "Jan 13, 2019", "text": "Amazing, just what I was looking for", "stars": 5}, {"date": "Jan 11, 2019", "text": "Prefect Application", "stars": 5}, {"date": "Jan 10, 2019", "text": "Best night mode tool in class! Thank you!!", "stars": 5}, {"date": "Jan 9, 2019", "text": "Simple and neat. Very satisfied", "stars": 5}, {"date": "Jan 7, 2019", "text": "Awesome! Looks great and works beautifully on all the websites I use daily. My only issue is that it seems to be creating some lag. Especially on the Outlook webapp. Any tips?", "stars": 4}, {"date": "Jan 7, 2019", "text": "Really well done! I've tried a few of these extensions, this one is perfect as far as I can tell. Some of the others also blacked out buttons I needed to see and made navigating the web difficult at times. This extension gets rid of all the crazy bright white but still allows me to clearly see everything I want to click. 5+ star extension :)", "stars": 5}, {"date": "Jan 4, 2019", "text": "This is exactly what I needed for night time computer use. You can even toggle it off for certain websites, if the colours throws the site off of normal, or if it includes its own night mode. The only thing I would do differently is change my link options back to default, but it seems that you can't change individual link types, nor can you set the whole link settings back to default. Otherwise it's great and you have so many options for schemes, and can adjust the tiniest things if you don't... Show more", "stars": 5}, {"date": "Jan 1, 2019", "text": "Useful but too complex.\nI like you can set it off by default.\nI can't change link color separately.\nSometimes it can't override some elements on certain page, which is very annoyed.", "stars": 4}, {"date": "Dec 31, 2018", "text": "can't make text full red.", "stars": 4}, {"date": "Dec 30, 2018", "text": "Good job, but I actually installed to see if it corrected a problem in all browsers which is the similarity in colors from a link to a visited link.", "stars": 4}, {"date": "Dec 29, 2018", "text": "good", "stars": 4}, {"date": "Dec 28, 2018", "text": "better than dark reader in terms of customization and speed  !", "stars": 5}, {"date": "Dec 28, 2018", "text": "the best extension in the store, keep up the good work.", "stars": 5}, {"date": "Dec 21, 2018", "text": "adequate my expectation", "stars": 5}, {"date": "Dec 21, 2018", "text": "Awesome tool. fully  customizable.", "stars": 5}, {"date": "Dec 13, 2018", "text": "Great extension. very customisable.", "stars": 5}, {"date": "Dec 12, 2018", "text": "Just awesome, full of customization and work like charm. Thanks You Developer", "stars": 5}, {"date": "Dec 9, 2018", "text": "Increases load and refresh page time by quite a bit", "stars": 3}, {"date": "Dec 7, 2018", "text": "very good in google pics fb and other", "stars": 5}, {"date": "Dec 7, 2018", "text": "Very nice!", "stars": 5}, {"date": "Dec 4, 2018", "text": "Great", "stars": 5}, {"date": "Dec 1, 2018", "text": "well designed and superior to other dark themes. thankyou from bob", "stars": 5}, {"date": "Nov 30, 2018", "text": "Works great!! The best part is that it even changes colours in PDFs that you load in the web browser!", "stars": 5}, {"date": "Nov 29, 2018", "text": "Outstanding! This extension checks all the boxes. The degree to which you can adjust the settings is amazing. Thanks for creating this extension.", "stars": 5}, {"date": "Nov 21, 2018", "text": "Amazing how simple it is to use and how flawless it is on so many websites.", "stars": 5}, {"date": "Nov 20, 2018", "text": "Really love it. Easy to disable and enable also can add exclude and include link. But not really work in twitter but it okay since it already have night mode. Google, facebook work really well.", "stars": 5}, {"date": "Nov 18, 2018", "text": "INTEGRITY AND SUMMARY  (5 STAR!) \nThis extension thoroughly deserves its 5 star rating. It is truly stunning, admirable and without fault. It is BY FAR the best extension on the internet at what it does. Not only does it work in such and incredibly versatile and useful / essential way, but I deeply admire the fact that the people or person who made this app has not put any adverts in it, or set a charging price to obtain it, or a pay-wall for a premium level — it is truly free all over, and n... Show more", "stars": 5}, {"date": "Nov 9, 2018", "text": "Did exactly what i wanted it to! Took the bright out of web pages, but also let me choose how to do it!", "stars": 5}, {"date": "Nov 5, 2018", "text": "Best in the game so far!", "stars": 5}, {"date": "Nov 3, 2018", "text": "Awesome app! Very many possibilities to customize and very good default config. Tried many other Addons for the purpose of darken the Screen, but this is the first one that really satisfies me.", "stars": 5}, {"date": "Oct 30, 2018", "text": "Really awesome app. You can disable it whenever you want, and it works perfectly from my experience so far atleast.", "stars": 5}, {"date": "Oct 30, 2018", "text": "Does a very good job 👍", "stars": 5}, {"date": "Oct 26, 2018", "text": "I literally just now installed this extension and I already love it! Finding an extension that will change the page w/o changing the pics has been so difficult, but I believe I have finally found it. \nIf I run into any snags, I'll come back here & ask the developer for assistance, but right now, I love this extension!", "stars": 5}, {"date": "Oct 25, 2018", "text": "Very effective and works well out of the box- highest degree of customization is very awesome, at a slight cost of performance that is tolerable; much needed when working in low-light conditions.", "stars": 5}, {"date": "Oct 19, 2018", "text": "Fantastic Product!!\nBest Extension ever on Chrome..", "stars": 5}, {"date": "Oct 17, 2018", "text": "My only wish: On Wikipedia (and other wiki sites) unvisited links are blue, visited links are purple, but the uncreated links are not _red_ as they should be.", "stars": 5}, {"date": "Oct 16, 2018", "text": "This extension is great for making websites more readable.  Many of the default color schemes are very helpful, and I also love how easy it is to customize the settings.", "stars": 5}, {"date": "Oct 15, 2018", "text": "Disclaimer:  I have been enjoying this Excellent Dark-Mode Extension for Less Than 2 Weeks;  Therefore, if my analysis evolves, I'll edit the following review accordingly.\n\nBased upon my Extensive Research of available Dark-Mode Extensions, Chrome provides TWO (2) that are truly Outstanding—which Definitely includes \"Midnight Lizard\";  Additionally, Chrome provides more than a Dozen Dark-Mode extensions that are LESS Than \"Excellent\".  (My Research did NOT take into account the Many CSS Injec... Show more", "stars": 5}, {"date": "Oct 13, 2018", "text": "The best ever I've seen in it's category!\nIt's not perfect but it renders, much better than any other I've seen.", "stars": 5}, {"date": "Oct 9, 2018", "text": "last version has cause some hiccups on my chromebook. everytime i tried to type in a form where the extension was theming the site, the whole screen goes black as the whole browser and UI crashes. had to power down the chromebook and restart it. figured it was the laptop dying out , but once i disabled the extension, everything works smoothly without any hiccups.", "stars": 3}, {"date": "Oct 7, 2018", "text": "better than stylus", "stars": 5}, {"date": "Oct 6, 2018", "text": "This has replaced Dark Reader for me. It's got much better customization options and the default settings are near perfect.", "stars": 5}, {"date": "Oct 3, 2018", "text": "I am grateful for this extension because I have spent hours and hours trying to adjust the colors on my screen to prevent the migraines that I get from the default colors. Thank you so much!", "stars": 5}, {"date": "Oct 2, 2018", "text": "It is cool", "stars": 5}, {"date": "Sep 28, 2018", "text": "It's a nice complement to macOS Mojave darkmode.", "stars": 5}, {"date": "Sep 12, 2018", "text": "Why is it slowing down Chrome so much? I can barely write emails..\nI need this to NOT slow down the work otherwise it's counterproductive and doesn't make sense to use.\nAny fix?", "stars": 3}, {"date": "Sep 4, 2018", "text": "Was tormented trying to read some github project documentation while tired. Installed this and my eyes are now happy.", "stars": 5}, {"date": "Aug 28, 2018", "text": "Great! Innovative! support this", "stars": 5}, {"date": "Aug 25, 2018", "text": "awesome", "stars": 5}, {"date": "Aug 23, 2018", "text": "Great for vision impaired!", "stars": 5}, {"date": "Aug 20, 2018", "text": "Good, hope to use it long time.", "stars": 5}, {"date": "Aug 16, 2018", "text": "nice", "stars": 5}, {"date": "Aug 15, 2018", "text": "Great application.", "stars": 5}, {"date": "Aug 14, 2018", "text": "While a great extension overall in the past. Recently, it has been failing to apply setting changes with frequent pop-up saying \"Settings application failed. Refresh the pag and try again. QUOTA_BYTES Quota Exceeded.\"", "stars": 2}, {"date": "Jul 27, 2018", "text": "I was pleasantly surprise to not only have this extension meet my expectations, but also still be readable. Most extensions with a filter or theme don't try to make everything readable, so I have to highlight or alter something. With midnight Lizard, I didn't. This is a first impression use so my review is a bit bias, but I fully recommend this to anyone. I hope this remains the same for a really long time.", "stars": 5}, {"date": "Jul 26, 2018", "text": "Excellent in every way. Allows customization up to the NTH degree, just as it should be, and I've yet to be charged a penny.", "stars": 5}, {"date": "Jul 7, 2018", "text": "Best", "stars": 5}, {"date": "Jul 6, 2018", "text": "After trying practically every dark theme extension on Chrome, this one far surpassed the rest. Its content rendering is smart and context based, and doesn't bog down page loads. It's also insanely powerful and customizable. The dev is very responsive to issues & resolves them quickly (via GitHub).", "stars": 5}, {"date": "Jun 27, 2018", "text": "Great extension. Like others have said, this is an actual theme that applies changes to parts of the page based on the context, rather than just inverting the colors like most other extensions. While not perfect, it does the job well. Creator, thank you so much for this!", "stars": 5}, {"date": "Jun 24, 2018", "text": "wow..Finally someone got it right. the other top five only get a portion of it correctly whereas you do it all perfectly and so seamless it looks like its official OEM", "stars": 5}, {"date": "Jun 14, 2018", "text": "Absolutely love this extension! It makes the pages dark in almost a perfect way. It takes some tweaking, but I prefer a soft, slate kind of black. Best of all, it does not make the pages scroll choppy! Thanks for making this!", "stars": 5}, {"date": "Jun 13, 2018", "text": "very good for my eyes", "stars": 5}, {"date": "Jun 12, 2018", "text": "Greatest App in here", "stars": 5}, {"date": "Jun 9, 2018", "text": "Awesome", "stars": 5}, {"date": "Jun 9, 2018", "text": "thank you so much this is a complete features extension that solved my eye problem with the screen", "stars": 5}, {"date": "Jun 6, 2018", "text": "Amazing!", "stars": 5}, {"date": "Jun 4, 2018", "text": "Best website darkening theme. Unlike the rest of the ones which just invert the page, this one intelligently goes through it and adjusts each element to not only prevent some dark elements from turning bright, but also scales the darkness according to the whole page and keep text always readable.\n\nVery responsive to bug reports too.\n\nMay be a little slow on slow computers on large pages, particularly Facebook. I don't think there's much that can be done about that though.", "stars": 5}, {"date": "May 31, 2018", "text": "wOw", "stars": 5}, {"date": "May 27, 2018", "text": "I haven't been able to do anything with it yet.", "stars": 1}, {"date": "May 25, 2018", "text": "super cool which gave me lots of benefits", "stars": 5}, {"date": "May 22, 2018", "text": "Love it.", "stars": 5}, {"date": "May 19, 2018", "text": "can't set correctly.", "stars": 1}, {"date": "May 7, 2018", "text": "best", "stars": 3}, {"date": "Apr 16, 2018", "text": "I love it.", "stars": 5}, {"date": "Apr 13, 2018", "text": "Some problems that are going to get fixed soon. It's active development. It's a very very good extension nontheless! I use it to make everything dark", "stars": 4}, {"date": "Mar 31, 2018", "text": "the best", "stars": 5}, {"date": "Mar 27, 2018", "text": "Why do I need to customize css? Userscript, Stylish..\nFinally, I got this!\nThank you very much!", "stars": 5}, {"date": "Mar 26, 2018", "text": "simply awesome", "stars": 5}, {"date": "Mar 25, 2018", "text": "So simple! This just saved my eyes, night shift Security guard. So worth preserving your night vision and works on Google Docs for all my report writing.  Thanks for this!", "stars": 5}, {"date": "Mar 24, 2018", "text": "top", "stars": 5}, {"date": "Mar 19, 2018", "text": "Love it! Tons of customizing options. Some websites I set maybe red, others grey. I like that it remembers difference of the options that I have used for different pages.", "stars": 5}, {"date": "Mar 17, 2018", "text": "Fantastic work so far! Exactly what I wanted, and I've been using Hacker Vision for more than 5 years!", "stars": 5}, {"date": "Mar 16, 2018", "text": "this will have to do for now til they fix my other one :/", "stars": 3}, {"date": "Mar 11, 2018", "text": "amazing", "stars": 5}, {"date": "Mar 4, 2018", "text": "Awesome job on this. thank you so much. i have to dark all websites and rest my eyes. love it.", "stars": 5}, {"date": "Mar 2, 2018", "text": "Works amazingly for 99.99% of websites. And if not, easy to turn off. Love it!", "stars": 5}, {"date": "Feb 27, 2018", "text": "Wow! Like other stuff that inverts colors, making any colors other then white look AWFUL, this extensions only converts the colors that hurt your eyes, best dark extension there is, AMAZING!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!1", "stars": 5}, {"date": "Feb 19, 2018", "text": "ive tried many dark mode stuff...this bst by far andf allows for options...little distortion etc", "stars": 5}, {"date": "Feb 19, 2018", "text": "Great job here. Doesn't invert everything like many other extensions causing pictures or already dark pages to become a problem. Each website can be individually tailored, and the customising options are plenty. Thankyou", "stars": 5}, {"date": "Feb 15, 2018", "text": "Great job on this. Thank you so much. I must have dark websites! All the interwebs are belong to us! =D", "stars": 5}, {"date": "Feb 10, 2018", "text": "The BEST", "stars": 5}, {"date": "Feb 5, 2018", "text": "After install I got on all sites:\n\"Midnight Lizard cannot connect to this page...\"\n\nI had to refresh pages/ restart browser to enable plugin", "stars": 5}, {"date": "Feb 4, 2018", "text": "By far the best dark extension i could find. But still it doesn't work on some websites. For example in google forums, the left side navigation menu and the background stay white but the messages' colors get changed.", "stars": 4}, {"date": "Feb 1, 2018", "text": "By far the most powerful and customizable theming extension. Slightly buggy and confusing, but for the most part works exceptionally well.", "stars": 5}, {"date": "Jan 27, 2018", "text": "This is the smartest and easiest on the eye of any dark extension I've used.  I'm extremely pleased with the default color scheme. My google calendar looks elegant and I can write in google docs for much longer without having to rest my eyes.", "stars": 5}, {"date": "Jan 25, 2018", "text": "It works great and looks great.\n\nI'm curious about why you have no hotkey for turning it on/off?\n\nAnyway thanks for your great job :)", "stars": 5}, {"date": "Jan 24, 2018", "text": "It's a perfect extension for customizing a night/dark webpage theme without inverting the color. You can configure your favorite color combination to make the webpage most comfortable for your to read.", "stars": 5}, {"date": "Jan 21, 2018", "text": "excellent extension! adjustable and easy to use. clean, small UI! \nThank you so much for this and keep up the great work ^_^", "stars": 5}, {"date": "Jan 19, 2018", "text": "Very good, this is all i need!", "stars": 5}, {"date": "Jan 16, 2018", "text": "Best extension ever for whoever loves dark themes", "stars": 5}, {"date": "Jan 13, 2018", "text": "Nice ^_^", "stars": 5}, {"date": "Jan 13, 2018", "text": "very good", "stars": 5}, {"date": "Jan 9, 2018", "text": "It's working nicely. Thanks", "stars": 5}, {"date": "Jan 2, 2018", "text": "Works perfect on most sites ! Wonderful ! Thanks for making it free too !", "stars": 5}, {"date": "Dec 29, 2017", "text": "It works very well with most websites. Has some nice adjustments that can be made. \n\nBut... some pages with rich content / lots of scripts (ie Facebook) become very slow. \n\nViewing some pages on eBay could be better (some areas show up as medium-grey).", "stars": 4}, {"date": "Dec 28, 2017", "text": "Love how much strain it takes off of eyes looking at a screen all day!", "stars": 5}, {"date": "Dec 28, 2017", "text": "Awesome, much needed", "stars": 5}, {"date": "Dec 28, 2017", "text": "love it, such a great work", "stars": 5}, {"date": "Dec 27, 2017", "text": "Excellent. I have been looking for this", "stars": 5}, {"date": "Dec 27, 2017", "text": "Hands down the best dark mode extension, most others just invert the colors, which ruins pictures, links, and can be a pain in loading times. This is so far the only one that doesn't do that rubbish and my eyes have never been happier!", "stars": 5}, {"date": "Dec 22, 2017", "text": "If you want an extension that changes the color scheme of every website without distorting it, THIS IS THE BEST EXTENSION. Plus it's fun to play with the settings and find the one you like best.", "stars": 5}, {"date": "Dec 19, 2017", "text": "Excellent. Very detailed and intuitively easy to use  reading mode extension.", "stars": 5}, {"date": "Nov 28, 2017", "text": "This is a slammin' piece of software, But...\n\n    Why does everything need to be on the web? Developers used to have a real help file attached to the program... now I have to be in a hot spot and look through a forum to find elaboration on a control or the simplest question that might not even be there\n     (I am usually in one of two RF shielded locations. I might as well be on the moon.)\n     I've been playing with computers since 1980 and this particular issue is one that has been going do... Show more", "stars": 5}, {"date": "Nov 7, 2017", "text": "So useful, allow to not be harassed anymore by these white pages on the web\n\nTHANK\nYOU!!!!", "stars": 5}, {"date": "Oct 25, 2017", "text": "Much better and more customization options than other dark themed or inverted background extensions.", "stars": 5}, {"date": "Oct 16, 2017", "text": "Extremely buggy whitelist/blacklist functionality. Would not recommend.", "stars": 1}, {"date": "Oct 15, 2017", "text": "This extension is truly fantastic.", "stars": 5}, {"date": "Oct 10, 2017", "text": "This ext works the best for me of these types of extensions. Thanks a lot!", "stars": 5}, {"date": "Oct 8, 2017", "text": "Thank you SO much for this app! I absolutely cannot stand bright white backgrounds, especially at night.\nThis app really helps me more than I can express! I do a lot of ohoto editing and web-surfing, so this is a godsend for my poor and overworked eyeballs!\nThanks so much", "stars": 5}, {"date": "Oct 4, 2017", "text": "ILove it! The deluminate extension is super bugged! This is not bugged and WAY BETTER!!! HIGHLY RECOMMENDED!!!", "stars": 5}, {"date": "Oct 1, 2017", "text": "I have tested tones and it is the best so far, if we added the coloring of the links clicked, it will be perfect !!!", "stars": 5}, {"date": "Sep 29, 2017", "text": "I've just started using this, But this extension is incredible. Works great with Vivaldi.", "stars": 5}, {"date": "Sep 27, 2017", "text": "Great idea but the control panel will not let you turn off for certain pages, disable for certain sites, or make many changes to the control panel. You can either enable or disable it from Chrome.", "stars": 1}, {"date": "Sep 18, 2017", "text": "Fantastic extension, definitely worth supporting.", "stars": 5}, {"date": "Aug 28, 2017", "text": "Thank you so much, I only wish I had found this extension sooner!!!", "stars": 5}, {"date": "Aug 20, 2017", "text": "I love that you can customize and even pick a schedule or pick from presets. Only thing to improve that I can think of would be to select custom colors or gradients from a color wheel", "stars": 4}, {"date": "Aug 13, 2017", "text": "I tried many but this is awesome. brilliantly designed with all options to modify UI according to user choice.\nSorry, I don't have more than five stars, certainly you deserve more.", "stars": 5}, {"date": "Jul 30, 2017", "text": "Indeed the best color changing extension in the store! Amazing stuff.", "stars": 5}, {"date": "Jul 12, 2017", "text": "Excellent, very well made. I have proven a lot of high contrast extensions, but this is the most solid and  customisable .", "stars": 5}, {"date": "Jun 23, 2017", "text": "Great for bedtime reading, when I don't want bright lights in my face. This is the best color changing extension I've seen. It even lets you change the scroll bars, etc, which other extensions allow to remain a bright glaring white against darkened backgrounds.The location bar cannot be changed, but to deal with that I can F-11 to full screen mode and make it disappear. One improvement I'd like to see is a true black background; the darkest available is a dark gray. I use that, with a dark am... Show more", "stars": 5}, {"date": "Jun 18, 2017", "text": "Excellent! Works instantaneously & with minimal effort! :-) Thanks so much to the developer for this nifty extension!", "stars": 5}, {"date": "Jun 15, 2017", "text": "It is great. I hope to see new updates. Thanks a lot Pavel", "stars": 5}, {"date": "Jun 13, 2017", "text": "Awesome! As I need", "stars": 5}, {"date": "Jun 10, 2017", "text": "Amazing. <3 This is the extension I needed. \n\nThank you to the developers for their great work. \n\nThere is nothing more to say.", "stars": 5}, {"date": "Jun 10, 2017", "text": "This app deserves recognition ^_^ I've been looking for ways to change website background or invert the color into something more comfortable for the eyes. This definitely did the trick. It works on almost any website if not all. \nIt may not be perfect (yet) as some icons can be less visible depending on your settings but it is by far the best extension I've seen so far for the job.", "stars": 5}, {"date": "Jun 3, 2017", "text": "I can't think of any darkening extension butter than this one. I tried like 6 others but I ended up settling with this", "stars": 5}, {"date": "Jun 1, 2017", "text": "Good so far -5 mins in- would recommend so far : D", "stars": 5}, {"date": "May 26, 2017", "text": "so far so good...easy to use, and so far the best", "stars": 5}, {"date": "May 14, 2017", "text": "easy to use", "stars": 5}, {"date": "Apr 27, 2017", "text": "Great for late night reading.", "stars": 5}, {"date": "Apr 25, 2017", "text": "2 minutes into using this and i deleted my other darkening extentions. This is the friggin best! Thanks for making this.", "stars": 5}, {"date": "Apr 24, 2017", "text": "This is the best Dark theme everywhere extension I've used so far. Congratulations to the developers!", "stars": 5}, {"date": "Apr 19, 2017", "text": "Wow! This is pure fantastic piece of code!", "stars": 5}, {"date": "Apr 10, 2017", "text": "Excellent. Only feature I miss - ability to save customized theme with name.", "stars": 4}, {"date": "Apr 6, 2017", "text": "Most extensions like this just invert the colors and images.  Midnight Lizard does not invert or cover up images, YouTube thumbnails, or stylized text.\n\nI really like the versatility and customization options.  There are a couple sites I'd like a little bit darker.  This extension let's you whitelist sites or add specific themes to a site (such as green, blue, gray themes, etc)\n\nMidnight Lizard is much better and more robust than other dark theme extensions such as Hacker Vision, Dark Reader,... Show more", "stars": 5}, {"date": "Mar 9, 2017", "text": "Love it! Very useful.", "stars": 5}, {"date": "Mar 8, 2017", "text": "Not perfect but the best invert colors type extension I've found for chrome and I've looked fairly hard.  I still haven't found anything as good on Chrome as Firefox for this purpose but this extensions looks promising.", "stars": 4}, {"date": "Mar 6, 2017", "text": "Usually extension like this only change page & font color.\n\nThis extension brought a new different level. It's like tuning a TV.\n\nI like the fact that we could dim images individually too.\n\nDefault color schemes are awesome, well thought I said. Either they dark or light.", "stars": 5}, {"date": "Feb 19, 2017", "text": "i could not even use it!!!!", "stars": 1}, {"date": "Feb 16, 2017", "text": "Like it very much :)\n\nBut unfortunatelly it doesn't save settings for specific sites, it saves always for all sites.\n\nWould be good some textfield where we can just add sites where we want to disable it.\n\nOh, and a shortcut for \"disable on this site\", please :D", "stars": 4}, {"date": "Feb 7, 2017", "text": "Wonderful and simple. I was looking for something to \"black out\" Google Docs and this works like a charm!", "stars": 5}, {"date": "Feb 5, 2017", "text": "This is especially good for late night users watching text relaxed without getting eyes hurt.", "stars": 5}, {"date": "Jan 30, 2017", "text": "Very good at what it does. Would really like to see a Firefox implementation too, as I use FF more often.", "stars": 5}, {"date": "Jan 20, 2017", "text": "Neat!! If it can use hotkey to switch toggle that would be awesome :))", "stars": 5}, {"date": "Dec 25, 2016", "text": "Amazing, just what I was looking for", "stars": 5}, {"date": "Dec 24, 2016", "text": "got lot of color options..saturation, brightness, contrast, gray level and color scheme to choose options..", "stars": 5}, {"date": "Dec 4, 2016", "text": "Cool.", "stars": 5}]