[{"text": "The only one that will properly set focus away from the address bar and into the new page!\n\nI just wish it were smaller/simpler. I don't need the extra bells and whistles, and it takes 1.5MiB when it could probably be a mere <100KiB.", "stars": 4, "date": "Mar 9, 2024"}, {"text": "Thanks mate! hopefully before the heat death of the universe chrome has this built in :)", "stars": 5, "date": "Mar 4, 2024"}, {"text": "The extension does what it says...\nbut why Chrome is missing such a simple function?\nWhy do we need to add extensions for such a small thing that should ne normal default in ANY browser!\nWhy Chrome doest switch to the new tab by default? \nShame on Chrome...seriously!", "stars": 5, "date": "Mar 2, 2024"}, {"text": "Superb", "stars": 5, "date": "Feb 23, 2024"}, {"text": "If you encounter a blank page, try reinstalling the extension and reapplying the permissions. This resolved my issue.", "stars": 5, "date": "Feb 7, 2024"}, {"text": "Simple and straight forward just works!!!! Thanks", "stars": 5, "date": "Jan 20, 2024"}, {"text": "As it is, it seems to work well enough. But... WHY does it need and keeps nagging me, with an obtuse message to \"allow management access to access all your apps!\". Seems odd, in there are no \"apps\" I wish this extension to \"manage\" for me.", "stars": 3, "date": "Jan 12, 2024"}, {"text": "I found the fix to the \"blank page opening\" on local HTML file redirect issue! In Extensions, locate New Tab Redirect, click Manage Extension, then turn on the switch for \"Allow access to file URLs\".", "stars": 5, "date": "Dec 14, 2023"}, {"text": "Works on edge: the idea to check chrome webstore for an extension for edge wouldn't have crossed my mind in a million years, but it here it is, so 5 stars to the programmer. \nrajesh4life said \"Edge will initially disable it on installation to \"protect\" you, so you'll need to Manage Extensions and turn it on from extension Manager, then set your preferred URL\". \nAfter following his instructions it works for me.", "stars": 5, "date": "Dec 13, 2023"}, {"text": "I used this for many years with no problems. On 9 December 2023 I updated ChromeOS and now all New Tab Redirect does is give a blank white page instead of the \"page of links\" local HTML file that I have always had listed in the box for \"Redirect URL\".", "stars": 4, "date": "Dec 9, 2023"}, {"text": "I use this extension multiple times a day! It works amazing alongside TeuxDeux. Love it.", "stars": 5, "date": "Dec 1, 2023"}, {"text": "It would probably be awesome if it worked, it probably worked for most people but still a cool concept just need a bit refining instead of going to a white screen for some, but hey it was probably really hard so claps to you!", "stars": 3, "date": "Nov 17, 2023"}, {"text": "It still does not work at all with a local file. A blank page is displayed, no error code or nothing!", "stars": 1, "date": "Nov 14, 2023"}, {"text": "Use this for quick access to the links from local file on PC. Thanks that you added the feature to support local file, since new chrome new rules about local files.", "stars": 4, "date": "Nov 7, 2023"}, {"text": "Thanks for fixing the file permission issue which came along with Chrome v118. I am very happy to have my new tabs from a local file working again!  Great extension / great author!", "stars": 5, "date": "Nov 6, 2023"}, {"text": "I used the new tab redirect for years, but it recently changed so that it is now almost useless. I used it to redirect to a file on my computer, and though it seems to say it is possible, I can find no way to type in the file location and only get a blank stare from the list that contains a huge number of links I don't use and have never used.", "stars": 2, "date": "Nov 4, 2023"}, {"text": "There are a few options I don't understand.  It would be nice to have tool tips when you mouse over an option. Since Edge removed the ability to edit our new tab pages, this was a very nice find!", "stars": 5, "date": "Oct 26, 2023"}, {"text": "I've used this extension for years and appreciate the continued support and development.  Like a lot of others here, a recent update, either the extension or Chrome (probably Chrome) made it stop working.  It would just open a new tab named \"New Tab Redirect\" but not actually redirect.  To fix this, go to Extensions  > Manage Extensions > New Tab Redirect (Details), and near the bottom there is a slider for \"Allow access to file URLs\".  Enable that and if your redirect was to a local webpage ... Show more", "stars": 5, "date": "Oct 25, 2023"}, {"text": "I have been using this extension for years to display my custom tab/starter page in Chrome. A lot of work has been put into that page, and I use it every day for my job. Since the 118 Chrome update, it no longer works. I've had to set my custom page as my homepage and I now need to open a tab and click the home icon. 2 clicks vs 1 doesn't seem that bad, but it adds up day after day. Enabling all of the new permissions has not resolved the issue, at least not for me. It still does not open my ... Show more", "stars": 4, "date": "Oct 25, 2023"}, {"text": "great!!", "stars": 5, "date": "Oct 25, 2023"}, {"text": "Why old is suddenly - there are similar extensions (fx: Change New Tab) that does not need all this information:\n\nThe newest version of \"New Tab Redirect\" has been turned off because it requires additional permissions.\n\nThe extension can now:\n\n- Change the page you see when you open a new tab\n- Read the icons of the websites you visit\n- Manage your apps, extensions and themes", "stars": 1, "date": "Oct 25, 2023"}, {"text": "A few days ago redirecting to local file (for instance file:///somefile.html) stopped working :(", "stars": 4, "date": "Oct 22, 2023"}, {"text": "I really liked it and it was good at what it does. Since the 118 update though, it hasn't worked which caused me to go looking for alternatives where the developer was keeping pace with Chrome Updates.", "stars": 4, "date": "Oct 19, 2023"}, {"text": "It was working fine until the latest Microsoft edge update. Now it just loads a blank page.", "stars": 1, "date": "Oct 16, 2023"}, {"text": "it was great until stopped loading local page. now i use fast new tab redirect instead", "stars": 4, "date": "Oct 16, 2023"}, {"text": "Won't open local files after chrome update (118)", "stars": 4, "date": "Oct 12, 2023"}, {"text": "Love this extension. I've been trying to find a way to stop the annoying auto history drop down display in Chrome in the search bar FOREVER. Finally found this so EVERYONE around you doesn't see ALL of your history displayed just right there on the main screen. God forbid someone has to use your computer.", "stars": 5, "date": "Sep 18, 2023"}, {"text": "Worked for me using Edge on 64 bit Windows 11 Pro. I did this: Opened Edge, added this extension. Closed Edge. Opened Edge, clicked on 'New Tab'. Clicked on 'Permissions'. Added my chosen URL in the provided box. (eg. I added: https://www.bing.com/). Closed Edge. Opened Edge. Clicked 'New Tab'. The new tab opened to my preferred URL, and continued to do so. For me this was add free and remains reliable.", "stars": 5, "date": "Sep 17, 2023"}, {"text": "on chrome, if you are using a search engine other than google, they will put you onto a white new tab page with no customisation, probably to try and get you to go back, however with this extension, by making it redirect to chrome://new-tab-page, it puts me back to the normal chrome new tab with the normal customisation", "stars": 5, "date": "Sep 10, 2023"}, {"text": "Simple, just like the blank page I use it for.", "stars": 5, "date": "Aug 29, 2023"}, {"text": "Thank you for this !! It's exactly what I'm looking for, after opening the new tab focus goes to google search textbox and not on link. Thank you.", "stars": 5, "date": "Aug 17, 2023"}, {"text": "Thank you! This worked for me. I'm not ready to switch over to Microsoft edge/bing .. I like my google.", "stars": 5, "date": "Jul 31, 2023"}, {"text": "great extension, the only improvement that would make it perfect is adding a black background instead of white, cause the time you need to wait the page to load you get flash banged with a white page, it ruins the dark mode experience.", "stars": 4, "date": "Jul 27, 2023"}, {"text": "Works as intended, thank you!", "stars": 5, "date": "Jul 20, 2023"}, {"text": "Simple and works perfectly.", "stars": 5, "date": "Jun 26, 2023"}, {"text": "Very good extension!!!", "stars": 5, "date": "Jun 15, 2023"}, {"text": "i need to keep autofocus on URL bar so i can quicly search google in the new tab; this extension makes the redirect to my Gmail which I set, changes browser URL and I loose focus from URL bar so I cant search and have to do it manuall", "stars": 1, "date": "Jun 14, 2023"}, {"text": "Why the negative reviews? I wanted to open a specific webpage on a new chrome tab and I was shocked this is not implemented on chrome by default. Thank you for this extension. Just works :)", "stars": 5, "date": "May 22, 2023"}, {"text": "works as expected. set anything you like as your new tab default page.", "stars": 5, "date": "May 10, 2023"}, {"text": "good", "stars": 5, "date": "Apr 15, 2023"}, {"text": "it works", "stars": 5, "date": "Apr 10, 2023"}, {"text": "The settings makes no sense\n\nAdd a site to the list  setings on this open in a new TAB\n\nor a main setting not to Switch pages BUT to open it in a new TAB", "stars": 1, "date": "Feb 7, 2023"}, {"text": "Great app. I set it to open Google when I open a new tab. I recommend this app.", "stars": 5, "date": "Feb 6, 2023"}, {"text": "Gotta have this extension on Microsoft Edge. The NTP in Edge is super annoying and one can't get rid of it. Why is the new tab page in Edge so bloated? Chrome and Chromium's is very minimal and not annoying.", "stars": 5, "date": "Jan 18, 2023"}, {"text": "Fine app and does what it's supposed to. Only gripe, minor one, is that the new tab doesn't start with the focus on the URL bar, but a quick tap of F6 remedies that so minor detail.", "stars": 4, "date": "Nov 18, 2022"}, {"text": "No fuss no muss and simple to use. Does exactly what it says it does.... redirects your new tab to the web page of your choosing!! Great App!!", "stars": 5, "date": "Nov 11, 2022"}, {"text": "Super.", "stars": 5, "date": "Nov 10, 2022"}, {"text": "This is a must-have app for Chrome.", "stars": 5, "date": "Oct 30, 2022"}, {"text": "The default new tab in chrome is ugly, flashbangs me when it's dark, and isn't form-factored correctly for ultrawide monitors. The Google homepage, on the other hand, is clean, has a dark theme, and is form-factored correctly. The solution -- this extension.", "stars": 5, "date": "Oct 29, 2022"}, {"text": "It works well (Ms Edge disable every time the browser updates but of course it is due to ms)", "stars": 5, "date": "Sep 24, 2022"}, {"text": "Awesome", "stars": 5, "date": "Sep 15, 2022"}, {"text": "Thank you, thank you, thank you! Just got a screaming fast new PC with Windows 11. I like the feel of the new Edge browser, but hated that the new tab was stuck with a Bing search bar. Problem solved!", "stars": 5, "date": "Jul 9, 2022"}, {"text": "Simply does what it says which was exactly what I was looking for. No up-sale. No data harvesting. No ads. Just does the one thing it says it does. I'm donating.", "stars": 5, "date": "Jul 8, 2022"}, {"text": "lets me have a blank new page instead of that google garbage", "stars": 5, "date": "Jul 5, 2022"}, {"text": "Finally found something that I need so I can read my med news every time I open up a new tab. Thank you!!", "stars": 5, "date": "Jun 21, 2022"}, {"text": "very helpful", "stars": 5, "date": "Jun 17, 2022"}, {"text": "I completely rely on this extension for functionality that should be native to Chrome/ium. It's never broken and never tried to monetise or serve me ads.", "stars": 5, "date": "Jun 14, 2022"}, {"text": "Description says 'if you save an empty string it uses about:blank' - I can't seem to enter a blank page into that option - but clicking on the 'blank page' option below gives me what I want (blank page with the url selected so I can just start typing to search.\n\nThanks", "stars": 4, "date": "Apr 5, 2022"}, {"text": "Finally something that works this way!", "stars": 5, "date": "Jan 9, 2022"}, {"text": "Works exactly as advertised.", "stars": 5, "date": "Nov 13, 2021"}, {"text": "The only problem is that it does not work in vivaldi, the browser I use most", "stars": 5, "date": "Nov 9, 2021"}, {"text": "Adding this extension seems to have broken Chrome's capability to display some PDFs. After downloading this plug-in, I now get a \"Couldn't load plug-in.\" for certain PDFs. This extension is the only thing that's changed and I've never seen this error before.\n\nThanks a bunch.", "stars": 1, "date": "Oct 28, 2021"}, {"text": "It was a bit hard to find Chrome extension doing exactly this,so thanks for creating it.", "stars": 5, "date": "Oct 14, 2021"}, {"text": "Just working, I copy and paste my own page address.", "stars": 5, "date": "Sep 8, 2021"}, {"text": "Did what I wanted.  Just a simple redirect to a page I want to use as my new-tab page.", "stars": 5, "date": "Sep 1, 2021"}, {"text": "Absolutely love it does exactly what it says it will and explains everything in very clear detail. 10 / 10", "stars": 5, "date": "Jun 2, 2021"}, {"text": "Works as intended.", "stars": 5, "date": "Apr 14, 2021"}, {"text": "Virus (Trojan)? Shortly after downloading and enabling this extension, my Malwarebytes application started popping up messages about a Trojan attempting to a risky connection to a blocked web site on every web site I visited in my browser. I disabled and removed the extension and the warning message disappeared. I can only assume that some malware may have infected this extension so I am not in a position to recommend it.", "stars": 2, "date": "Apr 2, 2021"}, {"text": "This works excellently in Microsoft Edge and allows users to release the grasp that Microsoft has on it's users of the browser. Totally recommend.", "stars": 5, "date": "Feb 28, 2021"}, {"text": "Does what it says and it's pretty fast. No complaints.", "stars": 5, "date": "Jan 30, 2021"}, {"text": "So this used to work really well for me.  Used it for maybe a year.  But I noticed it stopped working now for me....\nMaybe Google chrome has some kind of update to block it for users with certain settings?\n\nI know some of my chrome settings are controlled by my organisation.  E.g. under the \"Show home page\" option the 'New Tab page' bit is greyed out and controlled by my administrator.  Really quite annoying as the page I'm sent to, takes ages to load.", "stars": 3, "date": "Jan 26, 2021"}, {"text": "It does what it says!   Would have been nice if they allowed this as an option in Chrome, but I doubt that's going to come back.\n\nThis is very helpful to just set your new tab to any page you want!", "stars": 5, "date": "Jan 11, 2021"}, {"text": "This should be a default option in Chrome", "stars": 5, "date": "Jan 4, 2021"}, {"text": "I am surprised there aren't more like this. The only issue is that whatever page you choose obviously has to load before you can do stuff, so no matter what you do it will interrupt your workflow for a second if you use vimium. If you don't, you won't notice a difference, but if you do, I recommend setting the \"Always update tab, not redirect. (Enable for cursor in the address bar)\" setting and using a quick to load page like Google. beats having to switch to the mouse.\n\nStill five stars beca... Show more", "stars": 5, "date": "Nov 17, 2020"}, {"text": "This is amazing. I hope you have a great life, I hope you get married, and have children, become a billionaire, and help those in need just like you helped me now. Love you so much. Thank you for this. This changed my life. My wife came back to me. I'm so happy.", "stars": 5, "date": "Nov 6, 2020"}, {"text": "Great! Works as expected.", "stars": 5, "date": "Oct 29, 2020"}, {"text": "Ugly", "stars": 1, "date": "Oct 28, 2020"}, {"text": "it really good to have stuff you love", "stars": 5, "date": "Sep 13, 2020"}, {"text": "Super !", "stars": 5, "date": "Sep 1, 2020"}, {"text": "Does exactly what I needed it to do. When I open a new tab it opens as my home page that I set.", "stars": 5, "date": "Aug 29, 2020"}, {"text": "i like now broke", "stars": 5, "date": "Aug 12, 2020"}, {"text": "1.52MiB (4MiB unpacked) for a new tab redirect functionality? Are you serious? \nAlso, even with that task the extension coping worse and slower than analogue that takes 14 lines of code.", "stars": 1, "date": "Jul 26, 2020"}, {"text": "\"Always update tab, not redirect\" is working again in Chrome Version 84.0.4147.89\n\nFor a few previous versions it wasn't working which was a Chrome limitation and not a fault of the extension.", "stars": 5, "date": "Jul 23, 2020"}, {"text": "Extensions like google spreadsheets and Documents dont work if you click their button, it says Request to the server have been blocked by an extension , only if you try the option below the icon.", "stars": 3, "date": "Jul 22, 2020"}, {"text": "trying to get the reinstated dnv in milbrook al", "stars": 5, "date": "Jul 18, 2020"}, {"text": "Very Good.", "stars": 5, "date": "Jul 18, 2020"}, {"text": "This is amazing, avoids company enforced page for new tabs. Is there something similar for the home page and start up page?", "stars": 5, "date": "Jul 17, 2020"}, {"text": "Active cursor feature is broken. So annoying.", "stars": 2, "date": "Jul 7, 2020"}, {"text": "When I open a new tab, the first thing I want to do is start typing the URL of the page I opened the new tab to get to. The cursor isn't in the address bar when I open a new tab, and if it was I'd need it to have the URL highlighted so I can overwrite it as easily as if the URL bar was empty like it is on the Chrome default new tab.", "stars": 2, "date": "Jul 4, 2020"}, {"text": "I've used this in the past on browsers and found it very helpful. Have recently been using the new Microsoft Edge Chrome Based Browser, which in many ways is the fastest and best browser I've used before.  However, New Tabs on this browser is the only area you can't modify, it is locked into Microsoft MSN Search, which I don't like, because MSN Bing Search often shows images that I do not agree with, and I'd rather just use a different more private search - specifically Qwant . But when I ins... Show more", "stars": 5, "date": "Jun 29, 2020"}, {"text": "Very fast way to be in control of something as simple as a new tab just like in the olden days when you were actually in control of your browsers settings YEAH !", "stars": 5, "date": "Jun 26, 2020"}, {"text": "WebOasis in every new tab, what more can a guy ask for. Perfect extension! Thanks Jim!", "stars": 5, "date": "Apr 16, 2020"}, {"text": "only one that rlly works", "stars": 5, "date": "Apr 2, 2020"}, {"text": "Autofocussing the Omnibar (Adressbar) stopped working in Chrome 82.x", "stars": 4, "date": "Feb 18, 2020"}, {"text": "thanks for building an awesome extension!  simple and effective.  \nis there anything I can do to focus the url input when I open a new tab?  \nwithout the extension, if I open a new tab, I have the chrome's url input focused so that I can start typing a url.\nwith the extension enabled, my custom page loads fine, but I have to click into the url input to focus before typing a url.\nthat's the only con i've found - is there any way around that?\nthanks again for a great extension!", "stars": 4, "date": "Feb 14, 2020"}, {"text": "This extension works great in Chrome 80, though in Chrome Canary 82 the new tab address bar doesn't allow for input unless it's clicked on. Please release a fix, as this is a great extension!", "stars": 4, "date": "Feb 6, 2020"}, {"text": "I like this extension, but removing a star because there's no option to get rid of the white flash during the redirect. When running the Dark Reader extension, it results in getting blasted each time you open a new tab. I found the following to be much easier on the eyes. Even if it doesn't support a custom page, it gives me what I'm looking for (a simple new tab with focus on search bar and black fading to dark grey with not white flashing content). https://chrome.google.com/webstore/detail/... Show more", "stars": 4, "date": "Feb 2, 2020"}, {"text": "No idea why this isn't 5 stars! Thirty years developing software and wish I could send you money. This fixed an ongoing annoyance of mine with chrome. It's simple and just works. THANK YOU!", "stars": 5, "date": "Jan 4, 2020"}, {"text": "Works perfectly and easily. Thank you !!!!", "stars": 5, "date": "Dec 8, 2019"}, {"text": "I really appreciate the cursor remaining in the address bar. However, the white flash is really annoying when using a dark theme in the night.", "stars": 4, "date": "Nov 14, 2019"}, {"text": "I have noticed a small problem with it recently.\nI can't get it to focus on the new tab page. It focuses on the Address Bar no matter what setting I use.\nI use Google as my new tab page, but It always focuses on the Address Bar instead of the Google search field.", "stars": 5, "date": "Oct 26, 2019"}, {"text": "Perfectly simple.  I just wanted the new tab to open my preferred search engine; this extension accomplished that.  And if you're looking for a DARK THEMED search, check out the customization available with Startpage.", "stars": 5, "date": "Oct 25, 2019"}, {"text": "im lucky dude!!!!!!!", "stars": 5, "date": "Oct 20, 2019"}, {"text": "In latest chanary build vers.80 not work search to stop the URL bar from showing Google searches instead of actual websites !!!\nplease fix !!!", "stars": 1, "date": "Oct 19, 2019"}, {"text": "Dis gonna be good!", "stars": 5, "date": "Oct 19, 2019"}, {"text": "stopped working google chrome latest version", "stars": 5, "date": "Aug 27, 2019"}, {"text": "Does exactly what I want it to do.", "stars": 5, "date": "Aug 27, 2019"}, {"text": "Using this extension to override a company-managed policy to direct each new tab to its homepage. Works perfectly.", "stars": 5, "date": "Jul 31, 2019"}, {"text": "I really liked this extension and it worked great, but it keeps breaking and needing repairs but if I don't repair it fixes itself and then it'll break again sometime after. I tried uninstalling and installing a new version and it still did that. I've never had trouble with and I had it for months.", "stars": 4, "date": "Jul 17, 2019"}, {"text": "Would get 5 stars if it worked with new URLs. It says it saves the new URL, but still takes me to the previous URL. Uninstalling and reinstalling the extension does not get rid of this persistent storage of the old URL. This on Chrome Version 75.0.3770.142 (Official Build) (64-bit), with version 3.1.5 of the extension.", "stars": 2, "date": "Jul 16, 2019"}, {"text": "I have found this extension as the best utility designed for chrome. I have never liked google chrome showing me a google search bar on the new page/home page, also worst part is shows others my browsing history along. Since ever I got this extension I have got rid of all that nuisance, and this is serving since the past 8 years", "stars": 5, "date": "Jul 7, 2019"}, {"text": "WORKING! Thanks!", "stars": 5, "date": "Jun 24, 2019"}, {"text": "Works very well on my Windows 10 PC. Does not work at all on my Chromebook.", "stars": 3, "date": "Jun 13, 2019"}, {"text": "the only extension i could find with an appropriate level of privacy protection and simplicity", "stars": 5, "date": "Jun 8, 2019"}, {"text": "does what it supposed to do. nothing else to add. perfect", "stars": 5, "date": "May 29, 2019"}, {"text": "I've been using this extension for I don't know how many years and it's perfect. It does, and has always done, exactly what I need it to do. This is the first thing I load onto any new computer, personal or work. I rarely donate to extensions but this one is really worth it.", "stars": 5, "date": "May 27, 2019"}, {"text": "is so simpify,i like it.", "stars": 5, "date": "May 12, 2019"}, {"text": "Pretty good, does what it says. Also works well in Microsoft Edge Chromium.", "stars": 5, "date": "Apr 20, 2019"}, {"text": "Works!", "stars": 5, "date": "Apr 19, 2019"}, {"text": "It does exactly as it says and works well, but... it doesn't let you show your bookmarks if you don't have them set to always be on, so it doesn't have a very important function, but works great otherwise!", "stars": 3, "date": "Apr 4, 2019"}, {"text": "Exactly what I was searching for and works perfectly.", "stars": 5, "date": "Feb 26, 2019"}, {"text": "Works perfectly fine! Thanks!", "stars": 5, "date": "Feb 15, 2019"}, {"text": "This thing works! the other extensions first open the default page and then quickly reload the url you want. This is the only extension that doesn't do that.", "stars": 5, "date": "Feb 12, 2019"}, {"text": "Pretty straight forward extension that makes starting the exact tab I want really  easy! I've used for several years now, on several browsers too, and both chrome and Brave have been easy to use and setup! Thank you!", "stars": 5, "date": "Jan 31, 2019"}, {"text": "I works just as described, its perfect!", "stars": 5, "date": "Jan 16, 2019"}, {"text": "Just what i needed!", "stars": 5, "date": "Jan 11, 2019"}, {"text": "I set this to load my on-my-hard-drive local page of links (file:///C:/data/web/local.htm) and it takes about TWO SECONDS to load. I just tried \"New Tab Changer\" which works MUCH faster.", "stars": 3, "date": "Dec 30, 2018"}, {"text": "Does what it says in a simple and easy way. Works well for me.", "stars": 5, "date": "Dec 23, 2018"}, {"text": "Fab, does exactly what is needed, thanks Mr Developer.", "stars": 5, "date": "Nov 14, 2018"}, {"text": "Works great!\nPROS:  Gets rid of those stupid boxes (or now circles) in chrome that invades your privacy by showing EVERYONE your browsing history.\nGives back my favorite feature of searching or feeling lucky.\nCONS: Doesn't let my browser theme show thru.  I like the \"DARK\" themes, especially at night. So much easier on the eyes.\nThat's the only reason it didn't get 5 stars.", "stars": 4, "date": "Oct 9, 2018"}, {"text": "Thank you for this awesome extension. It's very helpful", "stars": 5, "date": "Oct 2, 2018"}, {"text": "Best Tab Redirect Extension!", "stars": 5, "date": "Sep 30, 2018"}, {"text": "WORKS GREAT!\nI use my own custom page & having it come up by default now is exactly what I want.", "stars": 5, "date": "Sep 8, 2018"}, {"text": "A very good extension", "stars": 5, "date": "Sep 1, 2018"}, {"text": "So simple! Add www.google.com as the preferred address in options & BOOM! Done!", "stars": 5, "date": "Aug 16, 2018"}, {"text": "I think this program will rid my desktop screen of the annoying squares that cover most of mt desktop screen", "stars": 5, "date": "Aug 9, 2018"}, {"text": "does what it says on the box", "stars": 4, "date": "Aug 8, 2018"}, {"text": "The best", "stars": 5, "date": "Aug 4, 2018"}, {"text": "Works without any problems", "stars": 5, "date": "Jul 20, 2018"}, {"text": "very nice extension", "stars": 5, "date": "Jul 19, 2018"}, {"text": "Works without a hitch for me - I've had this running for months.", "stars": 5, "date": "Jul 4, 2018"}, {"text": "Simple and doing the job perfectly. I have tried with a bunch of other related apps but none is working this well. Great.", "stars": 5, "date": "Jun 21, 2018"}, {"text": "It doesn't work.  It automatically changes back to previous setting (page - URL).  It does NOT hold to what I have selected.  I was a software tester in my profession and I would call this a TOTAL FAILURE.", "stars": 1, "date": "Jun 19, 2018"}, {"text": "Excellent work!", "stars": 5, "date": "Jun 17, 2018"}, {"text": "ok", "stars": 4, "date": "Jun 12, 2018"}, {"text": "It is simple and works great, other extensions either didn't work or I couldn't download.", "stars": 5, "date": "Jun 8, 2018"}, {"text": "its awesome because i have themes in google.com but not New Tab page so i can just start on google.com YAS", "stars": 5, "date": "Jun 3, 2018"}, {"text": "I,ve been using this extension for along time and its just the best, i lost it when chrome was updated and had to hunt for it luckily if found it here, just the best for the new tab page.", "stars": 5, "date": "Jun 1, 2018"}, {"text": "simple and useful.\n\nthank you...", "stars": 5, "date": "May 31, 2018"}, {"text": "The only extension that simply and correctly changes chrome's New Tab behaviour. It's nuts that an extension was needed to do this but at least there is one...\n\nThe one small problem I've noticed is that the \"Back\" browser button is always active even though there are no previous pages to scroll through. The \"Back\" button should be disabled when the first page is reached.", "stars": 5, "date": "May 14, 2018"}, {"text": "Perfect for setting my new tab page to about:blank", "stars": 5, "date": "May 7, 2018"}, {"text": "It worked as advertised. Thanks!", "stars": 5, "date": "Apr 27, 2018"}, {"text": "Very happy for what the App does, but unhappy that I have to download and add an App to have it done.", "stars": 5, "date": "Apr 26, 2018"}, {"text": "Perfect!", "stars": 5, "date": "Apr 11, 2018"}, {"text": "loved it", "stars": 5, "date": "Apr 7, 2018"}, {"text": "Fantastic - I can redirect to duckduckgo on a new tab opening - which for some reason is not a user option in chrome", "stars": 5, "date": "Mar 31, 2018"}, {"text": "it is great\neasy to use\nfast\neffective\ncustomizable\ncan use your own webpage, local or internet", "stars": 5, "date": "Mar 24, 2018"}, {"text": "This works great!\nIt does exactly what it's supposed - simple and fast!!\nThank you!", "stars": 5, "date": "Mar 18, 2018"}, {"text": "wish it was built in", "stars": 4, "date": "Mar 1, 2018"}, {"text": "really very useful", "stars": 4, "date": "Mar 1, 2018"}, {"text": "I like it for it does what should have been already set up in the settings of Google Chrome.\n\nVery happy for what the App does, but unhappy that I have to download and add an App to have it done.", "stars": 4, "date": "Feb 27, 2018"}, {"text": "I CAN ACCESS YOUTUBE BY THE CLICK OF A BUTTON!!!!!!!!!!!!", "stars": 5, "date": "Feb 24, 2018"}, {"text": "AMAZING. SADLY IT NOT FOR ME THO.", "stars": 5, "date": "Jan 30, 2018"}, {"text": "Ha ha....\nIt's works exactly what I want. My search engine in chrome is not changeable but this one does the trick. A million Thanks dude.", "stars": 5, "date": "Jan 23, 2018"}, {"text": "Would be great if it allowed you to custome sites and apps on a new tab.", "stars": 2, "date": "Jan 16, 2018"}, {"text": "I tried nearly 10 extensions, and only this served its purpose perfectly. Thanks to the aweseome developers!", "stars": 5, "date": "Jan 12, 2018"}, {"text": "Thank you", "stars": 5, "date": "Jan 9, 2018"}, {"text": "Rid of nasty thumbnails.", "stars": 5, "date": "Jan 3, 2018"}, {"text": "Used to work perfectly but hasn't been updated in 3 years. Now interferes with browser saved passwords. Had to disable. Developer unresponsive to email. I regret having sent a donation for \"continued development\".\n\nChromium Version 63.0.3239.84 (Official Build) Built on Ubuntu , running on Ubuntu 16.04 (64-bit).", "stars": 2, "date": "Dec 31, 2017"}, {"text": "It will not allow you to change default!!  Uninstalling when I can figure out how.  (*^^* !!", "stars": 1, "date": "Dec 28, 2017"}, {"text": "This extension works exactly as expected on a PC. I'm able to open a new tab to the URL of my choosing without any effort. When browsing the internet at night, I use an extension (Dark Reader) which darkens website backgrounds. I've always been irked by the New Tab's default page (with extensions such as Dark Reader), which doesn't allow extensions to run effectively. NTB now saves my eyes and I couldn't be more thankful!\n\nPS: Have NOT tested this on a Mac", "stars": 5, "date": "Dec 27, 2017"}, {"text": "Works as you would expect.", "stars": 5, "date": "Dec 23, 2017"}, {"text": "simple and good", "stars": 4, "date": "Dec 20, 2017"}, {"text": "I don't understand how Google force us to use an extension for doing that.", "stars": 5, "date": "Dec 19, 2017"}, {"text": "I can finally hide the most frequently visited sites when I open a new tab.  I have never once clicked on one, and I don't really like others spying on what my favorite sites are when I open a new tab with someone watching.", "stars": 5, "date": "Dec 18, 2017"}, {"text": "amazing", "stars": 5, "date": "Dec 9, 2017"}, {"text": "Does exactly what I want - new tab to be Google, with the the cursor in the search box (you can choose to have it in the omnibox if you prefer)\n\nI'm amazed this isn't incorporated into the Chrome settings anyway - it's such an obvious thing for people to want.", "stars": 5, "date": "Dec 6, 2017"}, {"text": "Really sucks. Wants extra permissions. Who do you think you are. Zuckwrberg?", "stars": 1, "date": "Dec 1, 2017"}, {"text": "Finally an extension which does what it has to be done. Simply. Minimalist. Great.\nIt would be perfect if it could delete the tab navigation history after redirection, so the very first site in the history is the redirected site instead the redirection page.\nThanks for your work.", "stars": 5, "date": "Nov 30, 2017"}, {"text": "Open source on GitHub, perfect for five stars. The explanation of all optional permissions is excellent, but they have  no obvious effects (?)", "stars": 5, "date": "Nov 26, 2017"}, {"text": "I added this because from the description I thought I could get the old tab back - with google search but without the recent sites. \n\nHowever, that's NOT TRUE. There are lots of options, most of which are completely useles for me, such as Internals, and the 'blank page' option. \n\nI wish it had more accurate description of what it really is. Removing now.", "stars": 2, "date": "Nov 26, 2017"}, {"text": "The extension is not enabled. I have to enable each and every time I use Chrome.", "stars": 2, "date": "Nov 24, 2017"}, {"text": "Does exactly what I want; replaces Chrome's ugly and potentially intrusive new tab page with the original simple and clean Google search page.\n\nThe extension is very easy to set up and I haven't experienced any issues with a misplaced cursor, the speed of new tab loading, or needed to delete highlighted text as mentioned by others. \n\nShould be the default Chrome setting for new tabs, in my opinion.", "stars": 5, "date": "Nov 16, 2017"}, {"text": "really nice, i made it to redirect to my homepage geeting rid of all the unwanted most visited thumbnails", "stars": 5, "date": "Nov 13, 2017"}, {"text": "very good", "stars": 5, "date": "Nov 8, 2017"}, {"text": "Doesn't put the cursor back on the address bar, but otherwise is helpful in eliminating the annoying and privacy invading \"Last Visited\".  -- R Carlson MD", "stars": 5, "date": "Nov 1, 2017"}, {"text": "This works perfect for me. It does exactly as stated and works without issue. Thanks for making it.", "stars": 5, "date": "Oct 30, 2017"}, {"text": "ok to good work", "stars": 4, "date": "Oct 25, 2017"}, {"text": "It does what it says, simple¡¡¡¡¡", "stars": 5, "date": "Oct 25, 2017"}, {"text": "Oh, hallelujah, it works! All I needed was a simple change to my search engine of choice. Thank you!", "stars": 5, "date": "Oct 23, 2017"}, {"text": "How sad it is we need to add this extension to disable chrome most visited sites from popping up. All i wanted is for google.com to show when opening chrome/tabs. Thank you Jim Schubert for saving me the frustrating task of contacting google to do this.", "stars": 5, "date": "Oct 21, 2017"}, {"text": "THANK GOODNESS Google FINALLY fixed the bug that caused the URL to not be highlighted. I've used this extension for YEARS and can't imagine trying to use Chrome without it. Great job, Jim Schubert.", "stars": 5, "date": "Oct 18, 2017"}, {"text": "Where usefull extension in Google Chrome but it doesn't work in Vivaldi browser.", "stars": 4, "date": "Oct 17, 2017"}, {"text": "Just wanted to redirect the new tab page and it worked great for my pc.", "stars": 5, "date": "Oct 16, 2017"}, {"text": "Works wonders for my school laptop 10/10", "stars": 5, "date": "Oct 9, 2017"}, {"text": "Love this app, hides all those recent search history or frequently visited pages from prying eyes.  Definitely recommended if you are sharing a computer with someone else.", "stars": 5, "date": "Oct 9, 2017"}, {"text": "Have been using for years, but since recent update (or chrome update) it no longer pre-selects the text in the address bar, which made it easier and faster to use the omnibar in subsequent searches. Please fix this, thanks!", "stars": 3, "date": "Oct 6, 2017"}, {"text": "Works as it is supposed to and offers good options for  whether you want the cursor  to start in google search or start in address bar.", "stars": 5, "date": "Oct 4, 2017"}, {"text": "Great extension, i'm using it for some time. But, there is a but, something changed recently and on opening new tab the highlight is on the address bar, i used to start typing, on opening new tab, the address url that i wanted. Now i cannot do that because it doesn't erase what's after the cursor. Added a focus in my html, but it doesn't seem to work. Please resolve this", "stars": 5, "date": "Oct 1, 2017"}, {"text": "Chrome update broke address bar highlighting after new tab is opened. However extension is great.", "stars": 5, "date": "Sep 30, 2017"}, {"text": "Something seems to have changed recently. When you open a new tab, in the address bar you get \"chrome://apps\".\nThis is normally highlighted so you can type over it straight away. Now it isn't so you have to delete the text before typing an address or a search.", "stars": 4, "date": "Sep 30, 2017"}, {"text": "Instead of having \"about:blank\" in address bar, it should just literally be BLANK. Because otherwise I have to click and delete the \"blank\" text. Pointless!! It used to not do that, so I don't know if something with the extension changed, or if it was with Chrome. I used to be able to click in the address bar and highlight the entire text, but not anymore. I can update my rating if needed / if this gets fixed!", "stars": 2, "date": "Sep 29, 2017"}, {"text": "I can no longer immediately type and go to the pages I want to immediately. I now have to highlight the entire URL bar.", "stars": 1, "date": "Sep 29, 2017"}, {"text": "As reported by others, the text in the address bar is no longer highlighted - very annoying. I used the extension very successfully to redirect to about:blank.\n\nFor now, I've switched to the Empty New Tab Page extension https://goo.gl/5ZAqzL", "stars": 2, "date": "Sep 29, 2017"}, {"text": "Seems like during a recent update, the following behaviour changed.\n\nPreviously when a new tab opened, the \"about:blank\" text was highlight by default, ready to be overtyped.\n\nNow, the cursor is placed before \"about\"... so the previous action of \"new tab -> type address\" now no longer works as a streamlined action. Need to manually SELECT TEXT to overtype.\n\nCan this please be amended/reverted in a future update???\n\nThanks", "stars": 2, "date": "Sep 29, 2017"}, {"text": "This gave me all the flexibility to do exactly what I wanted without granting excessive permissions", "stars": 5, "date": "Sep 28, 2017"}, {"text": "Simple and easy to use.  Highly recommend it.", "stars": 5, "date": "Sep 28, 2017"}, {"text": "Love this extension. However, like many others are saying in recent reviews, the \"always update\" option recently broke, and the cursor appears at the beginning of the url rather than highlighting the url. Please fix and I will update my review to 5 stars.\n\nEdit: after checking the github page, it seems to be a Chrome bug.", "stars": 5, "date": "Sep 27, 2017"}, {"text": "It does work and nothing serious.", "stars": 3, "date": "Sep 27, 2017"}, {"text": "For some reason, the \"always update\" option which would highlight the address bar and allow you to start typing in the new tab right away is not working and instead just places the cursor at the beginning of the address bar making it extremely annoying to work with. Please fix immediately.", "stars": 2, "date": "Sep 27, 2017"}, {"text": "Why isn't the address bar highlighted now? It used to be highlighted so I can start typing right away, now I have to manually select. Please fix this problem...", "stars": 3, "date": "Sep 26, 2017"}, {"text": "It loads a new page, but unfortunately the URL is not focused and selected so you always have to select the url in there before being able to search for something. Very cumbersome.", "stars": 3, "date": "Sep 24, 2017"}, {"text": "USED to be a great extension, now not so much.\nPlease fix this extension. There was an option which highlighted the address but now it just puts the cursor at the beginning. PC, checking the box for Always update tab, not redirect\" does nothing, on or off.", "stars": 3, "date": "Sep 24, 2017"}, {"text": "Can you make it to change the color of the background. White is killing my eyes. Thanks", "stars": 5, "date": "Sep 19, 2017"}, {"text": "I've used this extension for a long time with \"Always update tab, not redirect\" checked so that I could start typing in the address bar right away. It used to be that the address was selected so I could just type over it, but now it's no longer selected, so when I type it just types before the address. Please fix this so it's like it was before!", "stars": 4, "date": "Sep 17, 2017"}, {"text": "The 'Always update tab' feature is no longer working on my mac, although it still works on my PC. I'm running Chrome 61.\n\nEDIT: Problem solved in Chrome 62", "stars": 5, "date": "Sep 14, 2017"}, {"text": "Very simple.", "stars": 5, "date": "Sep 11, 2017"}, {"text": "Feature no longer working \"Always update tab\" the first tick-box option no longer selects all text but just places curser at start of address bar. I preferred if it selected all text so i can easily type in new url", "stars": 5, "date": "Sep 10, 2017"}, {"text": "It would be nice if the new tabs loaded faster since if it redirects to a search engine then it's a little irritating having to wait for the new tab to get ready before you can type a search term", "stars": 5, "date": "Aug 26, 2017"}, {"text": "must have addon.", "stars": 5, "date": "Jul 30, 2017"}, {"text": "Works perfectly on Iron browser in Windows 7 64", "stars": 5, "date": "Jul 30, 2017"}, {"text": "This is one of the extensions I cannot use Chrome without. What makes it unique is its ability to NOT focus the address bar while redirecting, allowing me (and others) to have the focus on the webpage itself. All of the other similar extensions are not able to do this URL bar unfocusing.\n\nPlease, Jim Schubert, do NOT give up on this feature in the future.", "stars": 5, "date": "Jul 24, 2017"}, {"text": "This extension appears to do virtually nothing. I've configured it to send new tabs to a URL, but it always presents me with a generic New Tab Redirect page instead.", "stars": 2, "date": "Jul 20, 2017"}, {"text": "worked as promised , which was to remove the thumbnails of suggested sites at bottom of the google homepage.\n\nwhich results in a nice plain google search bar.\n\nHOWEVER.\n\nit only works once , every time you close the browser ... the extension becomes disabled for some reason ?\n\nso you have to enable it again every time you open the browser .\n\nother than that , does what it says it does", "stars": 2, "date": "Jul 20, 2017"}, {"text": "It has always been reliable. Does what it's suppose to do.", "stars": 5, "date": "Jul 17, 2017"}, {"text": "Nice and simple, I like when my new tab always blank. :)", "stars": 5, "date": "Jul 12, 2017"}, {"text": "Love it! Chrome still doesn't natively have this so I have been using this for years =)", "stars": 5, "date": "Jul 8, 2017"}, {"text": "URL bar doesn't automatically focus and I have to manually hit ctrl+a to select the full url. This sort of behaviour is new.", "stars": 3, "date": "Jul 6, 2017"}, {"text": "Great simple solution for disabling the annoying new tab page. I don't know how do people not rate this a 5 star", "stars": 5, "date": "Jun 23, 2017"}, {"text": "I'm able to make all new tabs open to a blank page, about:blank.\n\nGreat stuff.  I was so annoyed with the speed dial set up like Opera has with Chrome bookmarking for me sites on it and I couldn't make it stop!  Now it's dead, good!!", "stars": 5, "date": "Jun 14, 2017"}, {"text": "Exactly what i wanted.\nIt's sometimes embarrassing to show someone my most visited page.", "stars": 5, "date": "Jun 2, 2017"}, {"text": "This doesn't even work! It sends me to the correct URL, but it just sits there at a blank screen! No matter what URL I put in it just refuses to work. Sorry, but I am just super mad at this extension.", "stars": 1, "date": "May 27, 2017"}, {"text": "Just what I lookking for. Sad that Chrome make us add an app to change its defult features. Now people who use my computer can't see my latest searches or websites.", "stars": 5, "date": "May 8, 2017"}, {"text": "worked great until recently.  Suddenly it is overriding my search engine and randomly sends my searches to yahoo or bing with no rhyme or reason to it.", "stars": 1, "date": "Apr 29, 2017"}, {"text": "good", "stars": 4, "date": "Apr 27, 2017"}, {"text": "Thanks!", "stars": 5, "date": "Apr 7, 2017"}, {"text": "Very good. Does what is says. Also explains the permissions which is why I'm giving it 5 stars (usually don't take the time to rate extensions otherwise)", "stars": 5, "date": "Apr 4, 2017"}, {"text": "4 1/2 stars. Does what I want it to do with one exception. I use this at work to discourage novice surfing. Haven't figured out how to put a NO SURFING warning on the page yet. Once I can do that, this app moves to a 5.", "stars": 4, "date": "Mar 28, 2017"}, {"text": "good excellent option", "stars": 5, "date": "Mar 14, 2017"}, {"text": "It worked for me, i wanted it to open MY Google homepage not the normal one and it worked slight delay but good.", "stars": 4, "date": "Mar 14, 2017"}, {"text": "does it well", "stars": 5, "date": "Mar 12, 2017"}, {"text": "Amazing! If you want to remove the 8 thumbnails for your new tab page, use this extension!! Simply redirect to https://www.google.com and they will be gone!", "stars": 5, "date": "Mar 12, 2017"}, {"text": "I don't quite understand exactly what this extension does... Can someone please explain it to me in very simple terms?\nI'm relatively tech-savvy but after reading the description and a hand full of reviews, I don't quite get it... So you can open a url in a new tab??\nI have had this extension for quite a while now and as I go through my extension cleanup, I can't understand what this does and if I currently benefit from having it added...\nThank you", "stars": 3, "date": "Mar 11, 2017"}, {"text": "Not as fast as New Tab Changer, but the options are more extensive. There's the option to have the cursor in the address bar or not. In the other extension, you're stuck with the cursor in the address bar.", "stars": 4, "date": "Mar 10, 2017"}, {"text": "its very slow opening new tabs!", "stars": 1, "date": "Mar 7, 2017"}, {"text": "Great. I lost the functionality of predictive text on Chrome. Added this extension and it is back!", "stars": 5, "date": "Feb 10, 2017"}, {"text": "Does what it is supposed to do, but sometime it seems a little bit slugish", "stars": 4, "date": "Jan 4, 2017"}, {"text": "Easily solved my annoying problem of new pages opening in Google search, rather than my chosen home page. This extension was used with my new Chromebit device.I wish all extensions worked as well as New Tab Redirect. Thanks Mr. Schubert.", "stars": 5, "date": "Dec 30, 2016"}, {"text": "just got ...what I wanted", "stars": 5, "date": "Dec 22, 2016"}, {"text": "not good one", "stars": 1, "date": "Dec 18, 2016"}, {"text": "Does not open google search links by default", "stars": 1, "date": "Dec 8, 2016"}, {"text": "To be able to  start typing in the address bar right away after opening a new tab: \n\nCheck the box marked 'Always update tab, not redirect. (Enable for cursor in the address bar)\" When installing. \n\nOR, \n\nIn chrome, under \"window\", click  \"Extensions\", find New Tab Redirect. click \"options,\" then check the box marked \"Always update tab, not redirect. (Enable for cursor in the address bar)\"", "stars": 5, "date": "Nov 17, 2016"}, {"text": "Not needed,\n\nYou can just go into the Chrome settings and change the new tab from there. Why do we even need this? Also, the Chrome settings works properly and well for all OS's and gives you more customization in the tabs aspect.\n\nEh,", "stars": 1, "date": "Oct 31, 2016"}, {"text": "When redirecting new tab on google.com, you can normally use the original search box again and avoid this irritating jump to the url/omnibar whenever you want to type inside the search box. However, if i create different chrome users and install this extension in each of them with identical settings, it will work that way on some chrome users, and won't on some others. In those where it does not work, there is just no impact on the original search box and no difference with the standard chrom... Show more", "stars": 4, "date": "Oct 29, 2016"}, {"text": "Great. Have been using it from past 2 years, never gave me a problem works as advertised", "stars": 5, "date": "Oct 17, 2016"}, {"text": "Perfect! On Linux, similar Firefox extension had no way of highlighting URL bar; this extension features a checkbox, \"Always update tab, not redirect\" which allows you to ctrl+t to open a new tab and type the URL. Much more efficient!", "stars": 5, "date": "Oct 15, 2016"}, {"text": "great!!!", "stars": 5, "date": "Oct 13, 2016"}, {"text": "SLOW", "stars": 2, "date": "Oct 4, 2016"}, {"text": "Very good!👍🏻", "stars": 5, "date": "Sep 28, 2016"}, {"text": "Clean, fast, and easy! Thanks for this wonderful, simple, and easy to use extension!", "stars": 5, "date": "Sep 24, 2016"}, {"text": "Sweet!", "stars": 5, "date": "Sep 15, 2016"}, {"text": "Quick & easy - what's not to love?", "stars": 5, "date": "Sep 15, 2016"}, {"text": "I have used this extension for quite a long time, and I have finally gotten my fill of having to go into setting and tell it one more time to load my home page, not the new tab page.  I don't know whether it forgets every time it updates, or if it's just an arbitrary thing.  Once or twice could be excused; a few times is annoying, but not worth messing with.  But it has finally done it for the last time on my computers.", "stars": 2, "date": "Aug 31, 2016"}, {"text": "Very helpful.", "stars": 5, "date": "Aug 22, 2016"}, {"text": "Thank you so much for creating this!  No mor embarrassing moments at work with the boss over my shoulder as I open a new tab.  ;)", "stars": 5, "date": "Aug 10, 2016"}, {"text": "Very nice, was looking for this for a while.", "stars": 5, "date": "Jul 25, 2016"}, {"text": "Excellent!", "stars": 5, "date": "Jul 8, 2016"}, {"text": "In ver.52.0.2743.60 beta x64 \"new tab redirect\"start slow and cursor is on tab search not in mid of page search,please update!", "stars": 5, "date": "Jul 1, 2016"}, {"text": "worked great!", "stars": 5, "date": "Jun 24, 2016"}, {"text": "It makes no sense", "stars": 1, "date": "Jun 15, 2016"}, {"text": "best", "stars": 5, "date": "Jun 11, 2016"}, {"text": "Works fast on my macbook (maybe it hesitates half a second, but nothing significant. I can still right-click search (some reviewer said this was broken for Mac).", "stars": 5, "date": "Jun 10, 2016"}, {"text": "It could offer \"home page\" as general variable choice, but ok, it is possible to paste concrete URL and it works. Surely better than normal low-end demo Chrome from Google.", "stars": 5, "date": "Jun 9, 2016"}, {"text": "Doesn't seem to work on my Chromebook. Works fine on the desktop though.", "stars": 3, "date": "May 29, 2016"}, {"text": "When I open Chrome, I would like Chrome to not have the first tab load of:\nhttps:/chrome.google.com/webstore/category/apps?hl=en\n\nChrome is a fast browser except when it is loading.", "stars": 4, "date": "May 27, 2016"}, {"text": "Thanks !! i do not know how to say thanks.. I was redirect always to another page. It is great!!!", "stars": 5, "date": "May 23, 2016"}, {"text": "chromebook user ... this did exactly what it said on the tin.  i just installed it 5 minutes ago, already happy.  if this review is more than a couple days old then it didn't break my computer.", "stars": 5, "date": "May 23, 2016"}, {"text": "Works as described.\n\n[Chrome & OS X 10.11.4]", "stars": 5, "date": "May 2, 2016"}, {"text": "exactly what I needed!", "stars": 5, "date": "Apr 24, 2016"}, {"text": "Wish it was easier to download", "stars": 4, "date": "Apr 12, 2016"}, {"text": "Does what i want which is to display a simple new tab page without the most visited thumbnails. No lags. No delay.", "stars": 5, "date": "Apr 5, 2016"}, {"text": "Just what I was looking for. I prefer the non-default cursor position option so I can quickly search in a new tab as well as see my custom page load.", "stars": 5, "date": "Mar 30, 2016"}, {"text": "It took 1 min or less to add the extension and when I clicked on a new page voila, It Works!!!!", "stars": 4, "date": "Mar 29, 2016"}, {"text": "Nice and slow!", "stars": 2, "date": "Mar 8, 2016"}, {"text": "I loved it until the last chrome update, now i'm prompted to authorize the app every time I start chrome. and the app icon is now stuck in the hamburger menu.", "stars": 3, "date": "Mar 6, 2016"}, {"text": "I really like this extension. It is a must have in my opinion just like adblock, Click&Clean and webrtc leak prevent. Thank you!", "stars": 5, "date": "Mar 6, 2016"}, {"text": "Its did what I want. thanks", "stars": 5, "date": "Mar 5, 2016"}, {"text": "It redirects new tabs to the page I want and it puts the cursor in the address bar. It's perfect.", "stars": 5, "date": "Mar 3, 2016"}, {"text": "On a PC. Does exactly what I need it to do which is going to a a page of my choice. Thanks", "stars": 4, "date": "Mar 2, 2016"}, {"text": "I've been wanting this for years. Works great on a Mac with Chrome 48.", "stars": 5, "date": "Mar 2, 2016"}, {"text": "just what i needed!", "stars": 5, "date": "Feb 26, 2016"}, {"text": "This is excellent. When I open a new tab I can have Google.com display instead of all the junk I see with the bookmarks, 8 most visited websites and other stuff that's too distracting for me. \n\nI don't know what other people are complaining about here. This works and it's simple. Nothing fancy.", "stars": 5, "date": "Feb 23, 2016"}, {"text": "NTR saves me so much time searching for web addresses!  It is awesome!  I highly recommend it.  For more information on how this might installed in a school setting for teachers, check out http://evscicats.com/blog/new-tab-redirect-a-chrome-extension/", "stars": 5, "date": "Feb 22, 2016"}, {"text": "pretty good", "stars": 5, "date": "Feb 14, 2016"}, {"text": "It didn't redirect my new tabs no matter how much i fiddled with the settings.", "stars": 1, "date": "Feb 7, 2016"}, {"text": "Good, except that moving items up or down the list crashes it. I still use it though. Easy layout", "stars": 4, "date": "Jan 25, 2016"}, {"text": "Love it. Great 'Permissions' setting's Implementation  which warns users that \"some extension settings (not just NwTbRedrt) whether default or customized can capture data and present security danger\" showing user/prog'er./dev's script examples and potential risk. even extrapolating the consequenses; revoked publication for undefined/indirect or even worse potential INTENTIONALLY Omitted potentional exploit...\nThis is Very good ideology, 'security is not a noun to be bartered with, sold or pur... Show more", "stars": 5, "date": "Jan 20, 2016"}, {"text": "Does exactly what I wanted! Now I can make my New Tab Page open up to whatever I want (Bing in this case), thanks Jim!", "stars": 5, "date": "Jan 14, 2016"}, {"text": "Good extension. Slow redirect time. I start entering something in the address bar, and 15 seconds later Google.ca will finally show up.", "stars": 3, "date": "Jan 11, 2016"}, {"text": "don't use this", "stars": 1, "date": "Jan 10, 2016"}, {"text": "One of the best for redirecting you new TAB to a specific site.", "stars": 5, "date": "Jan 5, 2016"}, {"text": "Slow, used to hitting new tab and typing as keyboard entries are kept in buffer.  Not with this app.\n\nSpeed varies but if you don't mind waiting for the redirect to pop up before typing (1 -7 seconds) then it works good.", "stars": 3, "date": "Jan 3, 2016"}, {"text": "To slow to redirect!", "stars": 2, "date": "Dec 25, 2015"}, {"text": "Does what it says", "stars": 4, "date": "Dec 18, 2015"}, {"text": "Does exactly what I want", "stars": 5, "date": "Dec 15, 2015"}, {"text": "Great, I cant' believe Chrome doesn't have this option, if you look at IE it has great customization features for the new tab.\n\nMuy bueno, es increible que Chrome no tenga esta opcion.", "stars": 4, "date": "Dec 14, 2015"}, {"text": "does not work", "stars": 4, "date": "Dec 7, 2015"}, {"text": "Work flawlessly but performance is slowww", "stars": 3, "date": "Dec 4, 2015"}, {"text": "Ty :') But on my MAC it don't work :D LOL", "stars": 5, "date": "Dec 4, 2015"}, {"text": "Thank you very, very much", "stars": 5, "date": "Dec 1, 2015"}, {"text": "Great Application East to use", "stars": 5, "date": "Nov 28, 2015"}, {"text": "Great. Does what I want,to go to the Apps page instead of the ULTRA ANNOYING most visited page thats blocks up my beautiful... ah .... porsche theme.", "stars": 5, "date": "Nov 25, 2015"}, {"text": "Made my browsing speed so much slower.", "stars": 1, "date": "Nov 22, 2015"}, {"text": "Does exactly as it says every time, awesome!", "stars": 5, "date": "Nov 17, 2015"}, {"text": "Not recommended. Breaks all select/right-click function to quickly search any selected text encountered for fast search by default search engine.", "stars": 2, "date": "Nov 15, 2015"}, {"text": "It works...\n\nTHANK YOU...\n\nJIM...", "stars": 5, "date": "Nov 15, 2015"}, {"text": "didn't work. wanted to use yahoo and it kept redirecting back to some stupid yahoo search that i think has been disrupting my webpage viewing", "stars": 1, "date": "Nov 10, 2015"}, {"text": "Bit buggy sometimes. Sometimes permissions get denyed and new tab webpage gets erased :(", "stars": 4, "date": "Oct 29, 2015"}, {"text": "It does what it's supposed to do, simply, easily, and efficiently.  Simple, intuitive user interface.", "stars": 5, "date": "Oct 28, 2015"}, {"text": "great", "stars": 5, "date": "Oct 19, 2015"}, {"text": "Simple, fast and does the job, no need for any RAM hungry extras.", "stars": 5, "date": "Oct 13, 2015"}, {"text": "Allows you to use a user-defined URL as your New Tab page. Simple!", "stars": 5, "date": "Oct 5, 2015"}, {"text": "Excellent, I like it, I would recommended to all.", "stars": 5, "date": "Sep 30, 2015"}, {"text": "great little extention.", "stars": 5, "date": "Sep 22, 2015"}, {"text": "please someone help me uninstall this its REALLY REALLY anooying", "stars": 1, "date": "Sep 22, 2015"}, {"text": "Regretfully does not work after cleaning Chrome history, cookies, etc. I guess something gets deleted which is holding this information.", "stars": 2, "date": "Sep 14, 2015"}, {"text": "Sync of url across new devices do not work and breaks this chrome plugin/module.", "stars": 1, "date": "Sep 14, 2015"}, {"text": "Excellent !!!", "stars": 5, "date": "Sep 5, 2015"}, {"text": "A simple fix for something that should be in Chrome already.", "stars": 5, "date": "Sep 1, 2015"}, {"text": "Worked sometimes on certain windows versions and not on others. I wanted it to open to a specific web page which showed my Google apps. It never really could do that! Wishing Google would just repair their update!", "stars": 3, "date": "Aug 22, 2015"}, {"text": "The User Interface of setting is ugly,but it still provides me a not bad experience.", "stars": 4, "date": "Aug 20, 2015"}, {"text": "Perfect - thanks!", "stars": 5, "date": "Aug 19, 2015"}, {"text": "got it to get rid of thumbnails... soooo confusing", "stars": 1, "date": "Aug 17, 2015"}, {"text": "Thank you for coming back NTR. My favorite extension, besides adblock of course. ;) Like so many others I don't understand what data Google has pulled that has led them to believe the default new tab is what people really want. \n\nI'd prefer it if it maintained the old look of the app page with icons in the middle and no \"title bar\" at the top but I'm just glad it exists.", "stars": 4, "date": "Aug 16, 2015"}, {"text": "Works great to get rid of dreadful default Newtab, if you don't have a custom one in mind. However, there is one HUGE flaw; if your browser crashes and you lose all your tabs, you have only a split second to restore your session before that bar disappears. Perhaps your tabs will still be in your history, but if they're not, you might be in big trouble. I simply cannot recommend this app with this huge problem", "stars": 2, "date": "Aug 6, 2015"}, {"text": "Works fine.", "stars": 4, "date": "Aug 6, 2015"}, {"text": "show", "stars": 5, "date": "Aug 3, 2015"}, {"text": "Despite all the options I'm sure many find nice, the single one I care about is to set my new tab to be my Home Page, which is in particular a custom one on my PC, something this extension seems to be quite incapable of doing? If it can do so, making it a simple option would be wonderful.", "stars": 2, "date": "Jul 21, 2015"}, {"text": "Works as advertised.  This should be implemented as a default option in Chrome.  However, the Devs of Chrome seem to think they know best.  Many thanks to the writer of this add on!", "stars": 5, "date": "Jul 20, 2015"}, {"text": "Works perfectly.\n+1 for open source.", "stars": 5, "date": "Jul 18, 2015"}, {"text": "I don't like it because the themes I put doesn't show up!! >:( Its all good but I think you should edit it to make the themes show! Thank You", "stars": 2, "date": "Jul 9, 2015"}, {"text": "The Chrome devs removed chrome apps in new tab, this puts it back! Yay!", "stars": 5, "date": "Jul 6, 2015"}, {"text": "Disabled the annoying \"most visited sites\" frames on the Chrome home page!! Now I have nice,clean home page without broadcasting every site I've visted. As others have stated in reviews, Google should have a setting to disable this feature.", "stars": 5, "date": "Jul 5, 2015"}, {"text": "Great extension.", "stars": 5, "date": "Jul 5, 2015"}, {"text": "good", "stars": 5, "date": "Jun 30, 2015"}, {"text": "not working well", "stars": 2, "date": "Jun 28, 2015"}, {"text": "excellent extension! it does the trick.", "stars": 5, "date": "Jun 26, 2015"}, {"text": "Works as described, but god its slow. My pc is fast and snaps to the job with everything i do, except this. Takes almost 5 seconds to open google when I start a new tab. Guess it's better than nothing.", "stars": 3, "date": "Jun 23, 2015"}, {"text": "Just what I needed! I couldn't get my session continued and have the new tab page I wanted simultaneously. I'd change a setting and I'd end up with the regular startup again. This has resolved all of the odd issues I was having!", "stars": 5, "date": "Jun 18, 2015"}, {"text": "Great app.  Can't live without it.", "stars": 5, "date": "Jun 13, 2015"}, {"text": "A excellent replacement for the great feature google chrome (i still have no idea why) took off. Although it isn't a total repleca, it really server the purpose. The moment I open a new tab I can now directly click on an installed app instead of making around three clicks on chrome's stupid forced unwanted update.", "stars": 5, "date": "Jun 12, 2015"}, {"text": "Works but hate chrome", "stars": 3, "date": "Jun 10, 2015"}, {"text": "This extension is exactly what I was looking for to customize my \"New Tab\" page. Simply brilliant!", "stars": 5, "date": "Jun 5, 2015"}, {"text": "Does exactly what its suppose to perfectly. Thank You", "stars": 5, "date": "May 28, 2015"}, {"text": "Allows about:blank instead of those intrusive new tab  thumbnails in Chrome.  This fixes that. Well done.", "stars": 5, "date": "May 21, 2015"}, {"text": "Very useful. Takes a second or two to load, though.", "stars": 4, "date": "May 11, 2015"}, {"text": "Exactly what I needed.\n\nMuch better than the rest.", "stars": 5, "date": "May 6, 2015"}, {"text": "Nicely executed, and it does what it should. I wish that the address bar could be selected as usually, but in the FAQ the developper writes that this is not possible due to the limitations that Google has given the developers. Shame on you, Google!\n\nAs he writes, though, you can always use the ctrl+L or cmd+L to select the bar, so you're ready to write.\n\nBut anyway, good work Mr. Schubert.", "stars": 5, "date": "Apr 29, 2015"}, {"text": "I love this app because you can make any page your newtab mine is apps", "stars": 5, "date": "Apr 25, 2015"}, {"text": "Dude, chrome includes this functionality by default. There is nothing  stopping a user from simply going into the settings and changing that setting without any problems. Your heart is in the right place though.", "stars": 1, "date": "Apr 21, 2015"}, {"text": "Like it a lot.\nSometimes I have tu unistall and reinstall the app because it stops working, don't know why", "stars": 5, "date": "Apr 21, 2015"}, {"text": "It got rid of my theme and I cannot uninstall it.", "stars": 1, "date": "Apr 19, 2015"}, {"text": "Does exactly what I want. I open a new tab, and it goes to my custom homepage with links to all my sites that I can't live without.\n\nI like that I could set it to open more than one tab if I wanted. I don't need that capability yet, but if I do, it's already there.", "stars": 5, "date": "Apr 18, 2015"}, {"text": "I want my old chrome book   new tab. :(", "stars": 1, "date": "Apr 9, 2015"}, {"text": "Many people don't want to show their visited places thumbnails to everyone looking their screen. This extension is perfect and the only solution I've found. We have lost many time only to arrive to the conclusion that Google does not want that feature to be deactivated. Will this extension be disabled by them in the future?", "stars": 5, "date": "Apr 8, 2015"}, {"text": "it is good", "stars": 3, "date": "Apr 7, 2015"}, {"text": "Loved it, helpful", "stars": 5, "date": "Apr 7, 2015"}, {"text": "This is really a very good extension.... I really loved this extension!!!!!", "stars": 5, "date": "Apr 6, 2015"}, {"text": "The single most important Chrome extension, IMO.\nFantastic work, Jim.", "stars": 5, "date": "Apr 2, 2015"}, {"text": "legal", "stars": 5, "date": "Mar 27, 2015"}, {"text": "FYI - AdwCleaner keeps flagging this as a bad extension, and removing it.", "stars": 4, "date": "Mar 26, 2015"}, {"text": "I tried many new tab extensions and speed dial extensions before I found this one.  I was just looking for a simple new tab showing icons of all my chrome apps.\n\nThe challenge was that my Chromebook doesn't show its list of apps in the chrome://apps page, whereas my laptop does.  So I couldn't just redirect to the chrome://apps page.  I needed an extension that had its own apps page that worked on both computers.  \n\nThis extension solved all my problems.  It was the simplest, yet still config... Show more", "stars": 5, "date": "Mar 26, 2015"}, {"text": "I simply wanted my \"new tab\" to be the apps instead of the actual \"new tab\" search screen. I tried the redirect chrome gave as an option in the settings but that failed. This extension fixed that issue real quick and simple.", "stars": 5, "date": "Mar 25, 2015"}, {"text": "Brilliant!  Overrides the weird changes the Chrome devs keep making to the new page screen.\n\nAlso keeps the cursor in the Omnibar which depending on your release version, isn't always the case.", "stars": 5, "date": "Mar 24, 2015"}, {"text": "Easily and useful", "stars": 5, "date": "Mar 23, 2015"}, {"text": "I'm constantly hoarding tabs and I looove this extension.  I don't even write reviews but I thought that this really deserved to know how much I appreciate it :)", "stars": 5, "date": "Mar 19, 2015"}, {"text": "Works brilliantly!", "stars": 5, "date": "Mar 17, 2015"}, {"text": "This is exactly what I was looking for.  It does nothing more than open my home page when I click on the New Tab button.  Perfect!", "stars": 5, "date": "Mar 16, 2015"}, {"text": "Great tool to add a feature that should be standard in Chrome. My new tabs are now slow only when my computer is slow -- odd how that works. ;-)", "stars": 5, "date": "Mar 4, 2015"}, {"text": "Great Extension - been looking for something like this for the past couple years!!", "stars": 5, "date": "Mar 2, 2015"}, {"text": "Finally put an end to web slices.  This was exactly what I was looking for.", "stars": 5, "date": "Feb 26, 2015"}, {"text": "Thank you!!!! Does exactly what I wanted", "stars": 5, "date": "Feb 25, 2015"}, {"text": "The only extension I use. It really should be built into Chrome, since it's such a simple and obvious thing (even IE has this built-in!). But, until the folks at Google work up some common sense, this extension gets the job done just fine.", "stars": 5, "date": "Feb 24, 2015"}, {"text": "Good for PC, just fair for Mac.\nWhile this extension does a good job sending you to the page you want to load on PC, it does a poor job for Mac.  Specifically, I want to open a new tab and type in the URL while other useful choices are displayed. On the Mac must highlight the fresh tab's URL and replace it, which is too much of a pain.", "stars": 3, "date": "Feb 22, 2015"}, {"text": "Awesome.\nUse it to counter the Javelin Browser Sync new tab page stealing.\n(Which otherwise is a very hande extension...)", "stars": 5, "date": "Feb 22, 2015"}, {"text": "Pretty handy, isn't slow or laggy at all. 11/10", "stars": 5, "date": "Feb 18, 2015"}, {"text": "This new tab is like some messed up full settings page, but it's not.\n\nI strongly don't recommend it for anyone that likes nice things, like me :)", "stars": 1, "date": "Feb 18, 2015"}, {"text": "I like it!", "stars": 5, "date": "Feb 8, 2015"}, {"text": "it works no problems, great extension.", "stars": 5, "date": "Feb 5, 2015"}, {"text": "I keep typing in the URL and it won't even redirect it!! Fix this!", "stars": 1, "date": "Feb 3, 2015"}, {"text": "Thank you forever!", "stars": 5, "date": "Feb 2, 2015"}, {"text": "I can't delete it?", "stars": 1, "date": "Feb 2, 2015"}, {"text": "Exactly what i needed, thank you!", "stars": 5, "date": "Jan 30, 2015"}, {"text": "Slam Dunk", "stars": 5, "date": "Jan 28, 2015"}, {"text": "It does what I want without any confusing or extra crap. Simple, and it works wonderfully.", "stars": 5, "date": "Jan 21, 2015"}, {"text": "get rid of chrome most visited page thumbnail", "stars": 5, "date": "Jan 20, 2015"}, {"text": "Cool app", "stars": 4, "date": "Jan 20, 2015"}, {"text": "Great", "stars": 5, "date": "Jan 17, 2015"}, {"text": "it wont let me put my chrome themes and this doesnt even work", "stars": 1, "date": "Jan 16, 2015"}, {"text": "so many supercharge new tab page apps are out in the wild but\n\ni just want my plain old startpage to be the root of all on all devices\n\nthis does the trick plain and simple\n\nonly if i could download/backup the extension somehow\n\neven this time it was others that i got \"recommended\" by the Allmighty beforehand", "stars": 5, "date": "Jan 15, 2015"}, {"text": "excellent app solved my problem.", "stars": 5, "date": "Jan 15, 2015"}, {"text": "Set my new tab page to ** chrome://apps/ ** Why didn't Google give us this option? Because they're Google :) Longest running history of a company that makes a ton of really awesone groundbreaking things but finishes NOTHING. Anyway, thanks for this dude :)", "stars": 5, "date": "Jan 14, 2015"}, {"text": "Takes too much time as well as chrome being launched.both shoul be fixed.", "stars": 3, "date": "Jan 14, 2015"}, {"text": "no option in chrome://flags !!!! \nthis extension helps me \nso much. Thanks and Happy New year to Jim \nSchubert.", "stars": 5, "date": "Jan 12, 2015"}, {"text": "good one", "stars": 5, "date": "Jan 7, 2015"}, {"text": "This is great, but I have one big complaint: it loads the page's URL into the omnibox. That makes it really difficult to quickly type an address, even when the cursor is in the omnibox... instead, I have to select-all, delete, and then type.", "stars": 3, "date": "Jan 6, 2015"}, {"text": "works well but makes the browser slow....", "stars": 3, "date": "Jan 6, 2015"}, {"text": "Simple and does the job. I've tried others, but always come back to this. 5 stars!", "stars": 5, "date": "Dec 27, 2014"}, {"text": "Doesn't work for me", "stars": 1, "date": "Dec 21, 2014"}, {"text": "Works exactly as expected. Nothing else to say.", "stars": 5, "date": "Dec 21, 2014"}, {"text": "too slow, what's the meaning if it takes 30 seconds to load a new tab???", "stars": 1, "date": "Dec 18, 2014"}, {"text": "Works perfectly, but slow sometimes", "stars": 4, "date": "Dec 17, 2014"}, {"text": "Formidable !!!", "stars": 5, "date": "Dec 12, 2014"}, {"text": "Does exactly as it says. Lets you specify the URL of a page to load in New Tab instead of the default.\n\nRespects privacy by letting you choose which permissions to grant the extension.\n\nHas an option to place cursor in Address Bar after loading your custom New Tab page.\n\nPerfect! :)", "stars": 5, "date": "Dec 8, 2014"}, {"text": "A little slow, but handy", "stars": 4, "date": "Dec 4, 2014"}, {"text": "It baffles and really frustrates me that my home page and search engine keep getting reset to Yahoo, why is that even an option on Google Chrome?! \n\nThis was a super simple fix, thank you!", "stars": 5, "date": "Dec 2, 2014"}, {"text": "Excellent utility!!", "stars": 5, "date": "Nov 30, 2014"}, {"text": "Only giving one (1) Star for one reason. Other then my complaint, the extension has been great until now: Followed the directions on the support site to get Google New Tab App page to be my home screen, etc. Upset Google changes this all the time. Why the hell do I need a Google Search Homepage when all I have to do is type in the content in the omnibox? New Tab Redirect has worked until now.", "stars": 1, "date": "Nov 25, 2014"}, {"text": "Adjusting New Tab url settings should be a feature in chrome, but since it isn't, this is a great alternative. \n\nIt does exactly what it says, but I only gave it 4/5 stars because it's slow. If you're on a fast network and computer, it's a noticeable and significant delay (~ 2 seconds). I've experienced the issue when all other extensions are disabled.", "stars": 4, "date": "Nov 24, 2014"}, {"text": "Great! However, I wish chrome added this as a standard part of the settings menu.  You'd think with over 514k users using this extension, there may be a reason for that.", "stars": 5, "date": "Nov 23, 2014"}, {"text": "I love how useful this is, considering it hides the stuff from by private life when I'm in public. Only problem is that I can't get back to the page to add in new redirected pages, because I forgot what the link was. I suggest you add a button or something that takes you to the page.", "stars": 4, "date": "Nov 19, 2014"}, {"text": "Works like a charm! Sets any page I want as well as selects the addressbar!", "stars": 5, "date": "Nov 19, 2014"}, {"text": "Awesome. Except for the fact that it kind of slow.", "stars": 4, "date": "Nov 16, 2014"}, {"text": "Brings back the old functionality of Chrome - great!", "stars": 5, "date": "Nov 16, 2014"}, {"text": "Used to be great, now it takes too long to load the page", "stars": 3, "date": "Nov 12, 2014"}, {"text": "I love it, thanks!", "stars": 5, "date": "Nov 6, 2014"}, {"text": "very nice app. I definitely recommend !", "stars": 5, "date": "Nov 4, 2014"}, {"text": "i love", "stars": 5, "date": "Oct 22, 2014"}, {"text": "does not allow Tab click to open as Apps Screen", "stars": 2, "date": "Oct 19, 2014"}, {"text": "Excellent! \n\nChrome now back to working the way it should be.", "stars": 5, "date": "Oct 13, 2014"}, {"text": "Way slow...", "stars": 1, "date": "Oct 13, 2014"}, {"text": "Simple. Useful.", "stars": 5, "date": "Oct 10, 2014"}, {"text": "Crap crap crap crap, this extension does nothing that it promised to do.", "stars": 1, "date": "Sep 29, 2014"}, {"text": "Works Great!", "stars": 5, "date": "Sep 24, 2014"}, {"text": "Perfectly what I needed! I am back to my good old apps page as new tab thanks to this!", "stars": 5, "date": "Sep 23, 2014"}, {"text": "cursor wont stay in address bar!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!", "stars": 1, "date": "Sep 22, 2014"}, {"text": "Simple, great and functional!", "stars": 5, "date": "Sep 21, 2014"}, {"text": "piece of garbage that only works once every ten tries, malwarebytes also flags for  adware, stay away!", "stars": 1, "date": "Sep 20, 2014"}, {"text": "Found a bug.\n\nThe keeps redirecting and blinking for some weird reason. even if I switch to other tabs that tab gets redirected too.", "stars": 1, "date": "Sep 19, 2014"}, {"text": "It would be nice if this also worked for any link, e.g., those internal to a website (such as Smitten Kitchen).", "stars": 4, "date": "Sep 17, 2014"}, {"text": "Does exactly what it claims to.", "stars": 5, "date": "Sep 14, 2014"}, {"text": "Simple solution to an annoying situation that shouldn't even exist as a problem!", "stars": 5, "date": "Sep 12, 2014"}, {"text": "works perfectly :)", "stars": 5, "date": "Sep 10, 2014"}, {"text": "Stopped working. With this extension enabled, when I click new tab, I get a wait of 20-30sec before tab opens. Disable extension and bang - instant new tab. \n\nSomething has changed in Chrome maybe?", "stars": 1, "date": "Sep 8, 2014"}, {"text": "Only worked after rebooting PC. Then does not work I CRAP", "stars": 1, "date": "Sep 6, 2014"}, {"text": "Crap...avoid...", "stars": 1, "date": "Sep 5, 2014"}, {"text": "I would keep using this, except, when I open a new tab, the focus is not in the address bar--this messes up my groove (I know, it's picky).\n\nIt's a decent extension.", "stars": 4, "date": "Sep 4, 2014"}, {"text": "bad very bad", "stars": 1, "date": "Sep 4, 2014"}, {"text": "Great extension. I've been using it for years. Thanks", "stars": 4, "date": "Aug 27, 2014"}, {"text": "dpfwsr", "stars": 3, "date": "Aug 20, 2014"}, {"text": "Thank You!  I like Chrome but was irritated because I could not set the new tab open to my homepage. This does the job. It should have been automatically built into Chrome.", "stars": 5, "date": "Aug 18, 2014"}, {"text": "This is a swell extension. Despite Google's self-appointed position as (non-evil) Rulers of the Universe, one _should_ be permitted to control their New Tab page. (One _should_ be able to properly italicize words in extension reviews, too—but one thing at a time, I suppose.)\n\nThe only thing I regret about NTR is the exclamation point that appears after its name when you open a new tab. Obviously the exclam isn't officially part of its name, or it would appear at the top of this page, too. Oka... Show more", "stars": 5, "date": "Aug 10, 2014"}, {"text": "Rating as 4 star (good) only, not excellent. The settings are not saved, despite saving each time. Every time, I log in to chrome, I have to 'grant' permission and also set settings for new tab page. Other wise, Google Chrome plays devil.", "stars": 4, "date": "Aug 8, 2014"}, {"text": "Great app. Does what it advertises to do; redirect to a page YOU want and not what Google wants you to go to.", "stars": 4, "date": "Aug 3, 2014"}, {"text": "This should all ready be a part of chrome. Thanks Jim for providing us this extension.", "stars": 5, "date": "Aug 2, 2014"}, {"text": "Great.", "stars": 5, "date": "Aug 2, 2014"}, {"text": "Great fix for a broken or unsavory new tab page!", "stars": 4, "date": "Aug 2, 2014"}, {"text": "Just what i've been looking for.", "stars": 5, "date": "Jul 29, 2014"}, {"text": "Can't live without my custom bookmarks site opening in new tabs. This extension is indispensable.\n\nOne tip in case anyone finds it not working. I'm setting up a new Win7 installation, and when I saved my site's URL into New Tab Redirect, it kept opening the default apps page as though I'd entered nothing. I eventually changed to a different URL (chrome://apps/) and then back to mine, and it worked after that.", "stars": 5, "date": "Jul 28, 2014"}, {"text": "good", "stars": 5, "date": "Jul 26, 2014"}, {"text": "They fixed the extension back in 2014 but it now has a new issue. It no longer redirects to your chosen start page when you click to open a new tab. Perhaps this is due to Chrome updates or something and they have not updated the extension but it is now as of November 2023 effectively useless again and does not work.", "stars": 2, "date": "Jul 25, 2014"}, {"text": "love it", "stars": 5, "date": "Jul 25, 2014"}, {"text": "I wanted a way to replace Google chromes new tab page because the history tiles will get on my nerves. I just wanted Google's search page to appear every time I will open a new tab. Once I found this extension I was able to do that. Amazing thank u developers.", "stars": 5, "date": "Jul 24, 2014"}, {"text": "How in gods name do I get rid of it?", "stars": 1, "date": "Jul 23, 2014"}, {"text": "Perfect! Just Perfect!", "stars": 5, "date": "Jul 22, 2014"}, {"text": "chrome://apps/ works perfect excellent extension", "stars": 5, "date": "Jul 20, 2014"}, {"text": "good", "stars": 5, "date": "Jul 19, 2014"}, {"text": "Best extension ever!!!!!\nHighly recommend.", "stars": 5, "date": "Jul 18, 2014"}, {"text": "When I first installed this, I did not realize all it could do.  Once I set the permissions to allow bookmarks, I realized I can have all my most frequent sites in the new tab along with all the apps installed I installed in Chrome.  The only other thing I would love to have is the ability to customize colors and backgrounds.  Also, if your bookmarks are in folders, they won't be seen!", "stars": 5, "date": "Jul 18, 2014"}, {"text": "Can't seem to figure it out.", "stars": 1, "date": "Jul 16, 2014"}, {"text": "yup", "stars": 5, "date": "Jul 13, 2014"}, {"text": "Very nice, except for the fact that I use a high-contrast theme on EVERYTHING and it's so white it blinds me every time I open a new tab. I wish there was Custom CSS support", "stars": 1, "date": "Jul 12, 2014"}, {"text": "Could have been 5 stars, but it doesn't seem to work in \"Windows 8 mode\".", "stars": 4, "date": "Jul 11, 2014"}, {"text": "Awesome. Man Chrome is annoying but apps like this are such easy fixes it's almost bearable ;)", "stars": 5, "date": "Jul 11, 2014"}, {"text": "Nice workaround. Hopefully google get the hint that their new tab page is absolute garbage, when over 500K users need an extension to get around it.", "stars": 5, "date": "Jul 5, 2014"}, {"text": "Works as advertised.\n\nBut what really drives it to 5 stars is how it handles permissions. Unlike most Chrome extensions, New Tab Redirect installs with a minimal set of permissions, and only asks for more if you decide to use the extra features that need them. This is the example that all Chrome developers ought to follow.", "stars": 5, "date": "Jul 2, 2014"}, {"text": "It's incredibly difficult to believe that this isn't built in to stock Chrome! It is so mind-bogglingly useful!", "stars": 5, "date": "Jul 1, 2014"}, {"text": "All it does is remove the picture for the theme in chrome...", "stars": 1, "date": "Jun 25, 2014"}, {"text": "sh_z\nperfect", "stars": 4, "date": "Jun 25, 2014"}, {"text": "Finally no annoying, flashy, distracting Google Doodles every day. Thank you!", "stars": 5, "date": "Jun 25, 2014"}, {"text": "add new tab redirect in Google chrome settings.", "stars": 5, "date": "Jun 24, 2014"}, {"text": "Does exactly what it says", "stars": 5, "date": "Jun 24, 2014"}, {"text": "hee", "stars": 4, "date": "Jun 20, 2014"}, {"text": "yeah", "stars": 5, "date": "Jun 20, 2014"}, {"text": "Update broke it. Inconsistent behavior. Makes opening a new tab freeze the browser. Problem disappeared when I uninstalled it.", "stars": 2, "date": "Jun 16, 2014"}, {"text": "I don't know why Google wants to force everyone to do things allot of us do not want to do. \n\nThis is a good tool to help you fix your new tab.\n\nIt does what it say and it's easy to use.", "stars": 5, "date": "Jun 14, 2014"}, {"text": "good but how do I get it back or uninstall it?", "stars": 3, "date": "Jun 13, 2014"}, {"text": "Awesome as there is no official solution", "stars": 5, "date": "Jun 13, 2014"}, {"text": "3 stars not 5 because it is deliberately atrocious design for purely mercenary reasons to require an extension for this SO BASIC function.\n\nI switch to Chrome from Firefox occasionally as a web designer but would never consider it as my default browser and just this 'feature' if nothing else stops me recommending it to clients.\n\n(Firefox; go to url about:config, change browser.newtab.url)\n\nAnyway, thanks Jim Schubert.", "stars": 3, "date": "Jun 11, 2014"}, {"text": "Works great. 5 stars!", "stars": 5, "date": "Jun 9, 2014"}, {"text": "To remove this extension, click the 3 lined button in the top right hand corner and select extensions. Then once clicked there will be a lot of extensions (maybe) and beside them are bins. Click on the bin and this extension will be gone", "stars": 3, "date": "Jun 9, 2014"}, {"text": "Does work for the first maybe 10 minutes, than as soon as I sign in to a different gmail account or anything more than 10 minutes - it shuts off or wont work - check in the extensions tab and it was checked on - so I dont get why it WONT do what it says.", "stars": 1, "date": "Jun 5, 2014"}, {"text": "DOESNT WORK", "stars": 1, "date": "Jun 4, 2014"}, {"text": "Simple and perfect", "stars": 5, "date": "Jun 3, 2014"}, {"text": "Allowing the box for personal preference rather than choose from a popular is wonderful!\nNow my new tab is the old chrome new tab - exactly what I wanted! I do NOT need chrome to think for me or do my recalling - I know how all by myself :)", "stars": 5, "date": "Jun 2, 2014"}, {"text": "It was nice, but the somewhat-recent update made the redirect lag a bit, so if you open a new tab and quickly switch to a different tab (like I usually do), it redirects the tab you just switched to, so you end up with a blank tab and the redirect. Might be something fixable in the options menu but I'm a wee bit too lazy to check, but not too lazy to type a quick rant.", "stars": 3, "date": "Jun 2, 2014"}, {"text": "Simply does not do what it says..very bad..", "stars": 1, "date": "Jun 1, 2014"}, {"text": "Thank You, Jim!  Excellent 'lil add-on here!", "stars": 5, "date": "May 30, 2014"}, {"text": "Doesn't work. At all.", "stars": 1, "date": "May 30, 2014"}, {"text": "Thank goodness!!!!!! Thank you thank you thank you.\n\nAll I wanted was for my apps page to open up. Why can't we choose that? I'm lookin' at you, Google. \n\nSo thanks again, Jim, for making this.", "stars": 5, "date": "May 28, 2014"}, {"text": "ok", "stars": 5, "date": "May 28, 2014"}, {"text": "about:blank and you get the old blank page, I just love it!\nAwesome extension!!", "stars": 5, "date": "May 26, 2014"}, {"text": "needs too much rights in my chrome. I think you access my data and sell it to ad networks - uninstalled!", "stars": 1, "date": "May 24, 2014"}, {"text": "I own a marketing firm that works with the top 1000 sites on the web. These include properties geared towards adults.  Too often when working with a non adult industry client I would fire up a new tab only to have PornHub + 7 others staring the board of an auto company etc in the face. While it was often an ice breaker,  it also caused some issues. \n\nThis has been a business saver.", "stars": 5, "date": "May 24, 2014"}, {"text": "not what I want. but I can't find anything better.\n\nYou said I can choose how many top sites or bookmark I can view. But there's no options to do that.", "stars": 2, "date": "May 24, 2014"}, {"text": "Brings back most of the functionality of the old new tab page (it's missing multiple app pages, but oh well) while also accomplishing what Google is trying to do with the new one (without being awful)\n\nEven better, it allows the users to grant partial permissions based on what they want the extension to do and how much they trust it.", "stars": 5, "date": "May 22, 2014"}, {"text": "Running Windows Vista, but cannot get this extension to work.  It has no effect.  Yes, it is enabled.  Any help would be great.", "stars": 1, "date": "May 22, 2014"}, {"text": "This extension is fantastic in combination with a simple start.me page.", "stars": 5, "date": "May 21, 2014"}, {"text": "this is not working anymore, I get no page found error msg", "stars": 3, "date": "May 21, 2014"}, {"text": "Top notch - does what it says on the tin!", "stars": 5, "date": "May 20, 2014"}, {"text": "Jim - appreciate the hard work that has gone into this. Perfect extension.\n\nI would recommend this to all chrome users looking for a simple new tab - way better than the default new tab in chrome..", "stars": 5, "date": "May 19, 2014"}, {"text": "Absolutely great. Just ticks me off when after each update, it enables the cross browser sync and since the folder is different for my Chrome in each computer (work and home), I always need to change it back.", "stars": 4, "date": "May 19, 2014"}, {"text": "This app does what it needs to and also a bit more. The latter is not a plus per se. For some reason however, it uses a custom style for the apps tab by default. Also if used to redirect to a URL, opening a new tab does not highlight the full address bar, forcing you to CTRL+T, CTRL+A before you can actually type something in the bar of your new tab.", "stars": 3, "date": "May 18, 2014"}, {"text": "Perfect!  Gives me exactly what I wanted, the apps page as my new-tabs page, instead of that miserable new tab page that Google was forcing us to use.", "stars": 5, "date": "May 17, 2014"}, {"text": "so great.i like it!", "stars": 5, "date": "May 16, 2014"}, {"text": "fantastic!\n\nlets me revert my new tab to whichever page i want.", "stars": 5, "date": "May 15, 2014"}, {"text": "Awesome extension.", "stars": 5, "date": "May 15, 2014"}, {"text": "I'm kind of just rating this extension 5-stars to counteract for the imbeciles who are rating this poorly and writing irrelevant reviews. It does exactly what it is designed to do and it does it well.\n\nCommon misconceptions in the review section that I'd like to clear up:\n-This Extension did not install itself\n-This Extension is not mysteriously evading uninstallation. Just click the trash can in chrome://extensions.\n-This Extension's primary function is to avoid the New Tab page, not replace... Show more", "stars": 5, "date": "May 14, 2014"}, {"text": "Its stupid it messed up my freaking computer", "stars": 1, "date": "May 14, 2014"}, {"text": "Works great.", "stars": 4, "date": "May 13, 2014"}, {"text": "hi like new tab redirect, now it is not responding and interface is different from overview page...", "stars": 4, "date": "May 11, 2014"}, {"text": "This Extension recently brought half a million users to a full stop by displaying a new window that asked a user for more permissions.  \n\nAny piece of software that disrupts use of Chrome by intruding upon normal activities, even momentarily, resembles a virus.", "stars": 1, "date": "May 10, 2014"}, {"text": "Good to have apps on the newtab page, but I very much dislike the URL bar setup. Clicking once on the url field appends typing to the text already there instead of replacing the url with your typing. If this were not the case I would update to 5 stars.", "stars": 2, "date": "May 9, 2014"}, {"text": "works ;)", "stars": 5, "date": "May 9, 2014"}, {"text": "Didn't work", "stars": 1, "date": "May 8, 2014"}, {"text": "I really like this. Cant get the chrome:apps page to select the url once the new tab generates, it requires me to hit CTRL+L which it didn't do beforehand. I now realise that this is because of a Google Chrome limitation regarding omnibar selection. Therefore, I now give this 5 stars. Thanks for making this app.", "stars": 5, "date": "May 8, 2014"}, {"text": "i want to report a bug.\nsteps to recreate this are;\n1.open a website in a tab\n2.click on new tab button\n3.switch back immediately to the previous tab (with site opened)\n4.new tab apps will open in that tab instead of the new tab .new tab remains blank and the open website will close and apps open on it's own.\n\nthis extension just closed an opened website", "stars": 4, "date": "May 8, 2014"}, {"text": "awful", "stars": 1, "date": "May 7, 2014"}, {"text": "There is now a check box to keep the omnibar focussed while loading a tab of your choice. PLEASE DON'T CHANGE A THING! It's perfect now!\n\n@Brent Allison: Don't give a bad review because you don't know how to go into settings > extensions and disable or remove an extension.", "stars": 5, "date": "May 6, 2014"}, {"text": "love it.  it's useful", "stars": 5, "date": "May 6, 2014"}, {"text": "Exactly what I was looking for.  Tired of having to type chrome://apps everytime I wanted a new tab.", "stars": 5, "date": "May 6, 2014"}, {"text": "All it needs back is the \"highlighted\" address bar upon opening a new tab :(", "stars": 4, "date": "May 4, 2014"}, {"text": "Address bar now highlighted--> 5 stars", "stars": 5, "date": "May 4, 2014"}, {"text": "What happened with focus and not highlighting the URL? I loved this extension before and fear I will now have to disable it because I can't just open a new tab and start typing like I am used to. Please fix it!", "stars": 2, "date": "May 3, 2014"}, {"text": "It doesn't work!", "stars": 1, "date": "May 2, 2014"}, {"text": "Not working ):", "stars": 1, "date": "May 1, 2014"}, {"text": "HOW DO I GET TO IT, it says \"added to your chrome\" but i dont know how to get to my \"chrome\"", "stars": 1, "date": "May 1, 2014"}, {"text": "Very useful extention\nTip: If you want to uninstall, go to chrome://extensions/?id=icpgjfneehieebagbmdbhnlpiopdcmna and click the Bin icon.", "stars": 5, "date": "May 1, 2014"}, {"text": "app works great. a bit slow when redirecting but reasonable.\nespecially good when using [ chrome://apps/ ]\nfor the old new tab page.\nonly problem is when you open a new tab the text in omnibar isn't \"marked\" forcing deletion of the address shown (in my personal use the apps page address)\nhope the makers fix this soon.", "stars": 4, "date": "Apr 30, 2014"}, {"text": "Please have the entire address bar highlighted instead of the cursor ending up at the end if possible. Great extension, ty!", "stars": 4, "date": "Apr 28, 2014"}, {"text": "i dont know why i didnt allow this apps, end up it is in my chrome", "stars": 1, "date": "Apr 27, 2014"}, {"text": "This is crap-- latest update made it crapier", "stars": 1, "date": "Apr 27, 2014"}, {"text": "Jim - thank you for the quick fix for allowing the cursor focus on the search bar.\n\nYou're #1 with me and my fellow colleagues for great attention to details. \n\nThanks again and may I suggest you to other users.", "stars": 5, "date": "Apr 27, 2014"}, {"text": "Great extension and fantastic developer. However there a problem as noted by many, upon opening a new tab the focus is on the URL bar now. Please could it be changed back or made an option.", "stars": 5, "date": "Apr 26, 2014"}, {"text": "Thanks for all the hard work on this.  However, the 3.1 version now focuses the address bar automatically instead of the page body.  I'm sure this feature is useful to someone but can we have an option to disable it for those of us who don't want the address bar focused?\n\nThanks!", "stars": 3, "date": "Apr 25, 2014"}, {"text": "This extension does its job, and does it well.\n\nSame issue here with the google \"search field\" (no omnibox) not focused on new tab, everything else perfect !", "stars": 5, "date": "Apr 25, 2014"}, {"text": "When opening a new tab, the url in the url field is no longer selected, so you have to manually select it, before typing a new one. I'll also leave the rating at 5, also hoping this is just temporary.", "stars": 5, "date": "Apr 25, 2014"}, {"text": "The newest update puts the cursor up in the address bar instead of in the Google search bar!", "stars": 3, "date": "Apr 25, 2014"}, {"text": "Reading the version 3.1 update notes, it reminded me how developers are often so unappreciated for their highly-skilled and demanding work.\n\nThis extension is excellent, and it's clear to see how conscientious and trustworthy the developer is. I cannot recommend it enough. 5 stars!", "stars": 5, "date": "Apr 25, 2014"}, {"text": "This was great until the update yesterday. Now the cursor focus on a new tab changes to the end of the address bar, and it's not highlighted. It used to automatically go to the Google search bar (with Google as my default new window), or at the very least, highlight the URL so a search could be easily done.\n\nI hope this gets fixed soon!", "stars": 2, "date": "Apr 25, 2014"}, {"text": "I've had this extension running for years and it's just in the background, worked perfectly like good software should and I took it for granted. I appreciate the hard work so I'm not going to leave a bad review but the 3.1 update moved the cursor to the URL or Omnibox instead of the Google search bar and I'm all out of whack now. Please fix this soon. Thanks again", "stars": 4, "date": "Apr 25, 2014"}, {"text": "It works. \nProps to Jim for dealing with all the haters.", "stars": 5, "date": "Apr 25, 2014"}, {"text": "wish I could just new tab and type still but the url is no longer highlighted... hope this will change soon. great app other than that!", "stars": 4, "date": "Apr 25, 2014"}, {"text": "New Tab redirect is awsome ,but what i dont like in new 3.1 version is when i redirect to http://google.rs for example the cursor stays in the adress bar (up there),not in the google search bar...so i have to  manually click down into the google search bar...and this is the reason why i installed New Tab redirect at first..because cursor stucks in upper adress bar in Chrome default new tab screen.I wish this could be fixed!I think version 3.0 didnt have this problem!", "stars": 3, "date": "Apr 25, 2014"}, {"text": "Great app. Would it be possible to have the option to center all the apps on the \"default\" page like the standard \"chrome://apps\" page? Also, is there anyway to add a dropdown similar to the old \"recently closed tabs\" that the old default chrome home had?", "stars": 4, "date": "Apr 25, 2014"}, {"text": "I absolutely love this New Tab Redirect Extension.  People need to quit complaining about additions to this program, so what about permissions.  If you don't like em then make your own extensions!", "stars": 5, "date": "Apr 24, 2014"}, {"text": "Great theory but how the hell do you use this thing once it's installed???  I've tried Google search, their own website and other online sites but nowhere does it tell you how to change the redirect once you did it the first time.  VERY annoying!!!", "stars": 2, "date": "Apr 24, 2014"}, {"text": "I loved this but it stopped working for me.  \n\nOn options page, I see: \"As of Chrome 33, chrome-internal://newtab/ no longer works.\"\n\nIs this why it's not working anymore? \n\nIs there work-around?  Perhaps I'll try uninstalling and reinstalling...", "stars": 3, "date": "Apr 24, 2014"}, {"text": "it sucked so much I cant even change it", "stars": 1, "date": "Apr 23, 2014"}, {"text": "Please add an option to clear url bar. I have to clear it manually every time I want to search something", "stars": 5, "date": "Apr 23, 2014"}, {"text": "I've had this installed for a long time. recently, it stopped working correctly, but I wonder if it had something to do with the redesign? I reinstalled it and all is good again. I really like the new look. thanks for the extension!", "stars": 5, "date": "Apr 23, 2014"}, {"text": "too slow new tab redirect works faster", "stars": 1, "date": "Apr 21, 2014"}, {"text": "would like to see the omnibar autoselect, but i understand that this is not possible at this point in time. Screw you google.", "stars": 4, "date": "Apr 20, 2014"}, {"text": "In Chrome 33, it does not highlight the url bar. (only places the cursor at the end of the url)  Can you add this functionality please?", "stars": 4, "date": "Apr 17, 2014"}, {"text": "Thank you finally something I was looking for.", "stars": 5, "date": "Apr 17, 2014"}, {"text": "how do i uninstall this app!!!1", "stars": 1, "date": "Apr 16, 2014"}, {"text": "I LOVED this extension. Before the updates. Now it takes literally a minute for a new tab to load. I have no choice but to look elsewhere. Too many new permissions and tasks.", "stars": 1, "date": "Apr 15, 2014"}, {"text": "\"Dunno about all this new permission stuff, but new tabs should open with blank URLs. Currently I open chrome://apps but I have to delete that every time i open a newtab\"\n\nI'm having the same exact issue, and have disabled it as a result.  It's a shame because I was loving it until this happened.  It really slows down my productivity to have to have to delete that url to do a search or type in another URL.", "stars": 3, "date": "Apr 14, 2014"}, {"text": "after chrome update v.34 etension don't mark url bar on new tab, when i start printing, letters append my default url", "stars": 4, "date": "Apr 12, 2014"}, {"text": "It used to automatically highlight the omnibar for easy searching, but now the cursor appears after the tab url.", "stars": 3, "date": "Apr 11, 2014"}, {"text": "It does what it does. It asks for too much permission though. More than necessary. On the other hand new tab doesn't auto select the new tab url anymore so googeling doesn't work due to my old habits where the URL was selected.\nFor the rest it does the job, redirecting a new tab page. But it does remove restore tabs after crash message.", "stars": 2, "date": "Apr 11, 2014"}, {"text": "Works great for me. The explanation of the increased permissions makes sense. Able to configure everything I needed.", "stars": 5, "date": "Apr 8, 2014"}, {"text": "It does the job. The only caveat being its appearance. That said, Chrome isn't the prettiest in terms of design anyway, so it sort of matches.", "stars": 4, "date": "Apr 7, 2014"}, {"text": "works perfectly", "stars": 5, "date": "Apr 4, 2014"}, {"text": "Does what it says it does. Combines top sites, apps, and bookmarks into one new tab page. I personally turned off the bookmarks since my bookmark bar is already there.\n\nFour stars because it's pretty ugly, and lacks and customization for appearance.  Maybe transparent background to show the installed Chrome theme?  Color, font, size options?  Functionality is good, appearance not so much.", "stars": 4, "date": "Mar 31, 2014"}, {"text": "Seems to be doing the job", "stars": 2, "date": "Mar 29, 2014"}, {"text": "Was great. Now, hideous.", "stars": 1, "date": "Mar 27, 2014"}, {"text": "very good", "stars": 5, "date": "Mar 24, 2014"}, {"text": "Worked perfectly, let creating a new tab open up the apps tab. Stop messing with Chrome Google!", "stars": 5, "date": "Mar 24, 2014"}, {"text": "Beware", "stars": 1, "date": "Mar 22, 2014"}, {"text": "OK, it's good. I think your ext is closest to my ideal one, but I have a problem: I can't find the bookmark bar provided by you. Where is it?", "stars": 5, "date": "Mar 22, 2014"}, {"text": "Works as expected!", "stars": 5, "date": "Mar 21, 2014"}, {"text": "Sorry, too much permission access needed now.", "stars": 2, "date": "Mar 20, 2014"}, {"text": "If you hate Google's \"New New Tab Page\", you will love this. This brings some sanity back to the Chrome browser.\n\n1) Download this incredible thing!\n2) I went to chrome://extensions/\n3) Click options under Tab Redirect\n4) Under \"My new tab page should show this URL:\", type chrome://apps\n5) Profit\n\nTHANK YOU JIM SCHUBERT!!!!!!!!!", "stars": 5, "date": "Mar 20, 2014"}, {"text": "Thank the Gods, and Jim.  \nNever again do I have to view that nexus of technical malfunction known as a New Tab Page.", "stars": 5, "date": "Mar 15, 2014"}, {"text": "Just a comical idea, why not make the header of the tab editable, instead of new tab redirect. I could change it to \"contacting server: Area 51\" :)", "stars": 5, "date": "Mar 15, 2014"}, {"text": "Now it wants to manage my apps, extensions and themes, disabled and removed.", "stars": 1, "date": "Mar 12, 2014"}, {"text": "It would be really great if this didn't keep disabling itself every couple of days.", "stars": 2, "date": "Mar 11, 2014"}, {"text": "It was just awful. Poor design and absolutely no customization ability.", "stars": 1, "date": "Mar 10, 2014"}, {"text": "It has been a very useful app but concerned as to why the new version needs so many extra permissions and extra access to your browser set up. Hopefully the developer will address this asap.", "stars": 2, "date": "Mar 10, 2014"}, {"text": "very good", "stars": 4, "date": "Mar 9, 2014"}, {"text": "Uninstalled as per other users", "stars": 1, "date": "Mar 8, 2014"}, {"text": "It used to be a simple extension that does exactly what it supposed to. Now, with the new permissions it demands, I'm not even gonna give it a chance - REMOVED!", "stars": 2, "date": "Mar 8, 2014"}, {"text": "This extension is too nosy!", "stars": 1, "date": "Mar 8, 2014"}, {"text": "I do not like the New Tab Redirect having more permissions to regulate my personal choices. I will not be re-enabling this new version. I will be removing it.  I really enjoyed it the way it was--simple and great at doing a simple task. This is far too much access wanted that I do think a tab redirect should have. I am suspicious of the purpose needed for that many permissions to access my personal choices such as web history, bookmarks, etc.", "stars": 1, "date": "Mar 8, 2014"}, {"text": "Used to love this extension; deleting it now because of all the new intrusive permissions required. HACKER!\n\nHopefully someone will create an extension that does the same thing withOUT all the intrusion", "stars": 1, "date": "Mar 8, 2014"}, {"text": "As of the last update, uninstalling and looking for a replacement.", "stars": 1, "date": "Mar 7, 2014"}, {"text": "Who the hell are you to ask all these unnecessary permissions? \n\nReading my web history? LOL\n\nBye bye New Tab Redirect!", "stars": 1, "date": "Mar 7, 2014"}, {"text": "A simple and effective tool.  All I wanted was to be able to select a specific page for new tabs.  This does that without trying to be a front page of a browser.", "stars": 5, "date": "Mar 7, 2014"}, {"text": "I came here to read reviews explaining why a simple redirect app would need all the new permissions. Oh, it does not? I don't want any new functionality. Uninstalling.", "stars": 1, "date": "Mar 7, 2014"}, {"text": "Permision to access everything is nonsense.", "stars": 1, "date": "Mar 7, 2014"}, {"text": "Asking for too many permissions, disabled, threw away.", "stars": 1, "date": "Mar 7, 2014"}, {"text": "I removed it after getting a notice of new permissions needed.\n\nEven after reading the authors web page, I uninstalled this app.\nIt's  basically spyware now.  \nDid the author get a job at the NSA or do you just want to read and modify bookmarks,read and modify browsing history, manage apps, extensions and themes?\n\nIt's up to me to modify and change what I want, not you!\n\nOn his web page it shows how to re-install ver 2.2, but honestly, I no longer trust this developer.", "stars": 1, "date": "Mar 7, 2014"}, {"text": "I liked being able to remove the additional permissions. Thanks dev.", "stars": 5, "date": "Mar 7, 2014"}, {"text": "way to lose users JIM, NO just no", "stars": 1, "date": "Mar 6, 2014"}, {"text": "Wow... what once was a great little utility for simply making sure a \"new Tab\" opened up on a page that was useful and required by the user has sadly now became yet another \"app\" that does stuff most people don't want or require, not too mention it can now make unwanted changes to your browsers set-up...\n\nPlease get rid of this \"extra\" nonsense and change it back to simply do the task it was created for or release a separate version without all the clutter and unwanted changes it now seems to... Show more", "stars": 1, "date": "Mar 6, 2014"}, {"text": "Far too many permissions required now, so I have had to disable it.\n\nBring back the earlier version as a choice please.\n\nOK, read why they are needed and loaded 2.2, thank you.", "stars": 3, "date": "Mar 6, 2014"}, {"text": "I really enjoyed the simple task that this app did before, but now it performs a bunch of tasks that I don't need/want and asks for permissions that I don't want to give up.", "stars": 2, "date": "Mar 6, 2014"}, {"text": "I observed unwanted bandwidth usage (mostly data upload) when I used this plugin.\nI want this feature but not at the cost of security risk.\nUninstalled.", "stars": 1, "date": "Mar 6, 2014"}, {"text": "I dont like this with lots of permissions!!! i made one extension that only redirect to apps new tab page with just one permission.\n\nI really dont get why to much permission????", "stars": 1, "date": "Mar 6, 2014"}, {"text": "Following the gitbug link, I have just read the author's excuses regarding the new version 3 permissions.\n\nWell, Jim, when most of your users have uninstalled your extension, you might want to focus on their needs and not your ego.", "stars": 1, "date": "Mar 6, 2014"}, {"text": "I only came here to rate this with one star after it suddenly required massive intrusion into my browsing activity. I uninstalled this extension. Was great before he modified it. Beware of developers like this. Their only real intent is to pry into your personal life and in worse case even cause fraudulent activity including stealing your identity and other information. Extensions like this should be banned.\n\nIf you're looking for another extension with minimal permissions, search for \"New Ta... Show more", "stars": 1, "date": "Mar 6, 2014"}, {"text": "This is 2nd extension in a week trying to add ridiculous permissions.\n\ni really liked this extension, but will now uninstall and recommend others to do same. Hence why giving it one star, no need for greater intrusion when the extension worked just fine before.", "stars": 1, "date": "Mar 6, 2014"}, {"text": "I too, like another person who recently commented am giving it one star, as the need for even greater intrusion when the extension worked just fine before is intolerable.  \n\nI will no longer use this extension, and highly recommend others do not either.  \n\nThere is absolutely NO reason for you to need more information with such a simple extension, which worked just fine before whatever changes you made.  I will never find out what the changes were, because I will NOT allow the type of intrusi... Show more", "stars": 1, "date": "Mar 6, 2014"}, {"text": "I installed this a week ago because I wanted to get the apps page back. Today it was disabled because it suddenly requires far more permissions than it did before.\n\nIt worked fine before without all these insane permissions. Therefore, it gets a one star rating. I don't know if this is about stealing our information and selling it to advertisers, but I strongly suspect this is the case.\n\nThere is an extension called \"Show apps in new tab page\" that requires far fewer permissions. Does the sam... Show more", "stars": 1, "date": "Mar 6, 2014"}, {"text": "This was working great as a workaround for Google's removal of the New Page Tab with application icons... at least it was until this latest revision which asks for too much permission (ability to read browsing history, for example).  Please reduce the permission requirements.", "stars": 4, "date": "Mar 5, 2014"}, {"text": "This would be greatly improved if when redirecting to a photo, it had the option to fill the space with that photo, rather than sticking it in the left corner, leaving the rest of the space white. Due to that problem, it's not useful for personalized photos. Still, redirecting to the Apps page is an improvement over Chrome's mandatory, uncustomizable new tab page.", "stars": 3, "date": "Mar 5, 2014"}, {"text": "The new conditions are just really unnecessary.\n I do not know how to uninstall?", "stars": 1, "date": "Mar 5, 2014"}, {"text": "This extension is great, but I'm going to uninstall it.  The newest version requires A LOT unnecessary permissions. Seems fishy.", "stars": 3, "date": "Mar 5, 2014"}, {"text": "These new permissions are weird. Please explain why they are needed or remove them.\nUntill then I will not use the extention.\n..Ok, they have been explaned, thanks.", "stars": 5, "date": "Mar 5, 2014"}, {"text": "I have been using this tab for a while; it is very useful for loading a page whenever you start-up Chrome, and for when you open a new tab.\n\nHowever, the new permissions for this extension make me wary.  I can not understand why it would require permission to MODIFY browsing history, bookmarks, as well as access your bookmarks, browsing history, and other extensions/applications.\n\nUntil the permissions change, or a feasible explanation as to why it would need this level of access, I won't use... Show more", "stars": 3, "date": "Mar 5, 2014"}, {"text": "Why on Earth do you now need to change the permissions to such crazy stuff?", "stars": 3, "date": "Mar 5, 2014"}, {"text": "Very helpful, makes it easier to use Chrome.", "stars": 5, "date": "Mar 5, 2014"}, {"text": "Thank you for correcting Google's horrible automatic \"update\".", "stars": 5, "date": "Mar 5, 2014"}, {"text": "Please add the ability to automatically select the new tab's url so I can instantly start typing, and I'll add another star to the review.", "stars": 4, "date": "Mar 5, 2014"}, {"text": "really glad there is a workaround now that Google has nixed the developer flag!  my only request is the URL be highlighted as i now realize a habit I've formed is sometimes typing a URL into a new tab (thus it would type over chrome://apps in my case) - this enhancement would make this 5 stars!", "stars": 4, "date": "Mar 4, 2014"}, {"text": "now I can directly load my favourite website through a new tab page!", "stars": 5, "date": "Mar 4, 2014"}, {"text": "This saved me from switching browsers in disgust/frustration.  Thank you!  Does EXACTLY what Chrome should do out of the box - give us an option.", "stars": 5, "date": "Mar 4, 2014"}, {"text": "Thank god this brings back the old new tab page. Works as advertised!", "stars": 5, "date": "Mar 3, 2014"}, {"text": "crash at crome 33", "stars": 1, "date": "Mar 3, 2014"}, {"text": "meh, it does what it says it's supposed to do, but when my computer runs out of charge and the \"would you like to restore your previous session\" comes up when i reopen chrome, it automatically disappears before i get the chance to click \"yes\". Disappointing...", "stars": 3, "date": "Mar 2, 2014"}, {"text": "Thank you thank you thank you. This gives me back what I used a new tab for...the list of apps I have. Not sure what google devs of chrome are thinking...but not letting the users of your browser use it the way they want, is a terrible idea.", "stars": 5, "date": "Mar 2, 2014"}, {"text": "hit apps when you download it! brings you the better new tab page!!  LOVE IT!", "stars": 5, "date": "Mar 1, 2014"}, {"text": "New update is broken. It used to clear the address bar after loading about:blank. I can no longer hit ctrl-t and just begin typing.", "stars": 2, "date": "Mar 1, 2014"}, {"text": "This is what I need - but could you set it up to clear the address bar once a new tab is opened? I hate having to clear out the text to enter something new.", "stars": 3, "date": "Mar 1, 2014"}, {"text": "wish there was a way to have this use both the new tabs page and apps page like chrome had privously did by default till the dumb new update , either way thank you for your hard work.", "stars": 3, "date": "Mar 1, 2014"}, {"text": "Must have!\n\nSpecially after Google decided to force the \"search box\" new tab display.", "stars": 5, "date": "Feb 28, 2014"}, {"text": "I like the new custom new tab page for putting bookmarks and apps on the same page. However, the bookmarks bar doesn't show folders, and my bookmarks are almost all organized into folders. Additionally, the app names are a little too small, and there doesn't seem to be a way to reorder them.  Please fix!  I really like what you've done with this otherwise!\n\nAs for the permissions, perhaps the dev could release a \"lite\" version that doesn't include the permissions that so many object to?  I'm ... Show more", "stars": 3, "date": "Feb 28, 2014"}, {"text": "Just a few seconds and I have my Apps page back for new tabs! Huzzah!", "stars": 5, "date": "Feb 28, 2014"}, {"text": "I like it, though I wish I could hate it open a new tab and show my history bar without having to enable my history bar. Like how Extended API use to do it.", "stars": 4, "date": "Feb 28, 2014"}, {"text": "Love it ;-)\nPurrrrrfect", "stars": 5, "date": "Feb 28, 2014"}, {"text": "It used to work just fine, but now I can't save any \"New Tab Page\" URLs. I try to save it under the options, it confirms \"Options Saved\", but when I try to open a new tab, it just sits on a blank \"Redirecting\" screen. I reopen the options, and the \"New Tab Page\" URL box is empty.", "stars": 3, "date": "Feb 27, 2014"}, {"text": "put the bookmarks bar back with the apps please! it'll be 1000 times better", "stars": 3, "date": "Feb 27, 2014"}, {"text": "Hate it. I want it gone from my apps, but I can't find a way to delete it. How can I delete it?", "stars": 1, "date": "Feb 27, 2014"}, {"text": "Love it, but it would be even better if the address bar could be cleared after loading the desired page, so we can just start typing without having to hit F6 first.", "stars": 4, "date": "Feb 27, 2014"}, {"text": "Good, but I wish when you clicked on the address bar it removed the chrome:apps text.  I find myself typing before removing the text when I search.", "stars": 4, "date": "Feb 26, 2014"}, {"text": "Well done for fixing a major annoyance Google arrogantly introduced by removing Instant Extended API flag.  At least Microsoft makes an effort with backward compatibility.", "stars": 5, "date": "Feb 26, 2014"}, {"text": "Dunno about all this new permission stuff, but new tabs should open with blank URLs. Currently I open chrome://apps but I have to delete that every time i open a newtab", "stars": 3, "date": "Feb 26, 2014"}, {"text": "Given back the new tab without browsing history for all in the workplace to see! Fail to understand why you can't turn that off in chrome anyway, but this app does the job!", "stars": 5, "date": "Feb 26, 2014"}, {"text": "Another thank you- this is a great extension!", "stars": 5, "date": "Feb 26, 2014"}, {"text": "It was good at first but as of updates it is now worse that the standard 'new tab' page", "stars": 1, "date": "Feb 25, 2014"}, {"text": "awesome", "stars": 4, "date": "Feb 25, 2014"}, {"text": "Fixed my issues with Google's change-THANKS!", "stars": 5, "date": "Feb 25, 2014"}, {"text": "I just tried a few other new tab page extensions and had to uninstall all of them because they took way too long to load. This one, on the other hand, loads up a new page lightning fast! It also looks exactly like the Chrome apps page that I used to use as my new tab page. This extension is exactly what I was looking for, so kudos to the developer!", "stars": 5, "date": "Feb 25, 2014"}, {"text": "It's nice to have the apps page back.\nBut manually selecting address bar every time is  frustrating.", "stars": 3, "date": "Feb 25, 2014"}, {"text": "chrome update to 32 and can't work now.Any improvement?", "stars": 1, "date": "Feb 25, 2014"}, {"text": "Google messed up the NTP, and this extension is what exactly I was looking for.", "stars": 5, "date": "Feb 25, 2014"}, {"text": "LOVE THIS! Thank you so much!\n\nDoes exactly what it says!", "stars": 5, "date": "Feb 25, 2014"}, {"text": "Does exactly what it says on tin, I've set my new tab back to chrome://apps like it always was.", "stars": 5, "date": "Feb 25, 2014"}, {"text": "Only work-around I could find for the overly redundant giant google search bar you are forced to use in the new tab after chrome 33. Not sure why Google needs to fix things that are not broken with chrome.", "stars": 5, "date": "Feb 25, 2014"}, {"text": "Good things. Google chrome is a great browser, however my 'new tab' page went kaput after chrome 33. This was the only thing that fixed my problem. Google should really get on board with this otherwise they may lose a lot of business.", "stars": 5, "date": "Feb 25, 2014"}, {"text": "This WAS great, until today when for some reason it stopped working. I had to change chrome-internal://newtab for chrome://newtab and now it works again, but the chrome://newtab is up in the search bar and has to be selected before I can write anything new in there. So, bit pointless now really. Will go searching for an alternative.", "stars": 4, "date": "Feb 24, 2014"}, {"text": "very usefull..loved it ..back to OG", "stars": 5, "date": "Feb 24, 2014"}, {"text": "It works! \nChrome version 33.xxx, having the application as new-tab page or any other page for new-tab. \nIt simply works!\nRight in time for the mess of Google;\nSimple and very useful extension.\nWell done +++", "stars": 5, "date": "Feb 24, 2014"}, {"text": "Good thing you exist for times when Google messes with what people like.", "stars": 5, "date": "Feb 24, 2014"}, {"text": "LOVE IT!", "stars": 5, "date": "Feb 24, 2014"}, {"text": "Works perfectly. To clear the address bar, just hit Ctrl+l", "stars": 5, "date": "Feb 24, 2014"}, {"text": "I want apps as default new tab page, but I also DON'T want to hit ctrl-l to type in the address bar like before. This extension needs to get an option to clear or select everything in the address bar so we can just start typing.", "stars": 3, "date": "Feb 24, 2014"}, {"text": "For some odd reason, I'm just getting \"Redirecting...\" loop, it never actually loads any page I set, no matter what it is.", "stars": 1, "date": "Feb 24, 2014"}, {"text": "As usual... As soon as Google messes up (most of the new things seem to be that way), someone comes and makes a very functional extension to counter it. Thank you! Google... LEARN from this and stop \"fixing\" what works!", "stars": 5, "date": "Feb 24, 2014"}, {"text": "<3 It. Searching for kinda extension few days before and got today :)", "stars": 5, "date": "Feb 24, 2014"}, {"text": "Good", "stars": 5, "date": "Feb 24, 2014"}, {"text": "Have tried this on two different computers and it just doesn't work.  I set it to open Google's search but it only opens the New Tab Redirect Options page every time.  Looking for another option.", "stars": 1, "date": "Feb 23, 2014"}, {"text": "Works too s l o w l y...", "stars": 2, "date": "Feb 23, 2014"}, {"text": "Besides being quite slow, I can't type url immediately after opening new tab, first I have to select the one being redirected to.", "stars": 1, "date": "Feb 23, 2014"}, {"text": "Clear url field after opening page, are u kidding me? Its unusable now", "stars": 1, "date": "Feb 23, 2014"}, {"text": "easy and clean!!", "stars": 5, "date": "Feb 23, 2014"}, {"text": "You need this extension, if you want your \"Apps\" page back after the latest update of Google Chrome.\n\n@Google: STOP FIDDLING WITH THE DESIGN. JUST LEAVE IT BE!", "stars": 5, "date": "Feb 23, 2014"}, {"text": "New Tab Redirect is supposed to do one job, and it does it. <3", "stars": 5, "date": "Feb 23, 2014"}, {"text": "Absolutely love this extension, especially now that Google broke the Chrome New Tab page.\n\nI currently have my new tab set to open on the Apps page.\n\nIs there any possibility that we can get an option to only show the bookmarks bar on our new tab page as well?\n\nThanks!", "stars": 5, "date": "Feb 23, 2014"}, {"text": "Love this extension. Have it redirecting to a HTML page that contains links to places I  may wanna go. Stupid that we had to install this application in the first place, but hey, we gotta do what we gotta do.", "stars": 5, "date": "Feb 22, 2014"}, {"text": "Permissions fixed. Awesome!", "stars": 5, "date": "Feb 22, 2014"}, {"text": "Fantastic!  I got my \"chrome://apps\" page back for new tabs!", "stars": 5, "date": "Feb 22, 2014"}, {"text": "That we have to install this at all is ridiculous, but it works like a charm! Thank you very much!", "stars": 5, "date": "Feb 22, 2014"}, {"text": "Used it for a while, but no longer works.", "stars": 3, "date": "Feb 22, 2014"}, {"text": "Not really this dev's fault, but latest Chrome update has done SOMETHING to their New Tab function. Again.\n\nSo now this extension cannot redirect at all. It freezes on a blank tab with the word \"Redirecting\" stuck on the tab name.\n\nNone of the options work currently.", "stars": 2, "date": "Feb 22, 2014"}, {"text": "Just what i needed after chrome screwed it all up. thanks so much!", "stars": 5, "date": "Feb 22, 2014"}, {"text": "Thank you for this.\nGoogle just chnaged the default behaviour to open apps in new tab. and this just saved it.", "stars": 5, "date": "Feb 22, 2014"}, {"text": "very helpful \ngood app", "stars": 5, "date": "Feb 22, 2014"}, {"text": "Beautiful, now that Chrome keeps trying to force its awful New Tab page.", "stars": 5, "date": "Feb 22, 2014"}, {"text": "Thank you <3", "stars": 5, "date": "Feb 21, 2014"}, {"text": "The perfect remedy after upgrading to Chrome 33 and that awful new 'New Tab' page. Thanks!", "stars": 5, "date": "Feb 21, 2014"}, {"text": "Overtakes my cursor from omnibar, slow to load.", "stars": 1, "date": "Feb 21, 2014"}, {"text": "Yay!  Finally a fix for UPromise's hijacking of my new tab page without having to uninstall UPromise!", "stars": 5, "date": "Feb 21, 2014"}, {"text": "Although I love this extension, it's just stupid you can't change this in the chrome settings. Fear of yet another keylogger is immenent", "stars": 5, "date": "Feb 21, 2014"}, {"text": "Incredible, thank you for creating this! you just saved me!", "stars": 5, "date": "Feb 21, 2014"}, {"text": "Now I can have my new tabs open to chrome://apps/ and work the way I want it to, and not how Microso... er... Google forces it to.", "stars": 5, "date": "Feb 21, 2014"}, {"text": "Took just a few seconds, works as expected.", "stars": 5, "date": "Feb 21, 2014"}, {"text": "Very useful on windows.\nOn Mac OS there's an annoying bug: every new tab you open, the cursor is placed at the end of the url (the url is not selected) and this forces me to delete the url before starting to write a new one or a search term.", "stars": 4, "date": "Feb 20, 2014"}, {"text": "Doesn't work.", "stars": 1, "date": "Feb 20, 2014"}, {"text": "doesnt do anything!", "stars": 1, "date": "Feb 20, 2014"}, {"text": "If there was an option to active auto-focus on the omnibox, i'd give it 5 Stars.", "stars": 4, "date": "Feb 11, 2014"}, {"text": "I hated it it was nothing like I expected it to be it is just a dull boring new tab page that you cant get rid of, so do yourself a favor and dont download it", "stars": 1, "date": "Feb 10, 2014"}, {"text": "It did what it was supposed to do, but it was rather slow (even for loading nothing - which is about:blank) it always shows 'redirecting'", "stars": 3, "date": "Feb 7, 2014"}, {"text": "I have a problem on a computer, cause on my laptop it works fine. Stuck at redirecting...any help please?", "stars": 4, "date": "Feb 6, 2014"}, {"text": "Doesn't work. Read reviews, said it worked, tried it, tried resaving, resetting, restarting, nothing worked. Not happy- loads with same page I've been trying to get rid of.", "stars": 1, "date": "Feb 5, 2014"}, {"text": "Excellent app, Works for me fine.", "stars": 5, "date": "Feb 1, 2014"}, {"text": "It is the only way to remove delta search from my new tab.", "stars": 5, "date": "Jan 28, 2014"}, {"text": "Simple, and just what I needed.", "stars": 5, "date": "Jan 27, 2014"}, {"text": "The extension can't override the \"Conduit Search\" malware I'm stuck with, so 2 stars is generous.", "stars": 2, "date": "Jan 25, 2014"}, {"text": "Pros: Allows chrome://apps to be a new tab page again\nCons: Does not highlight the redirect in the address bar, and doesn't always hit immediately, so usage is: ctrl-N, type address, swear, select and delete redirect address, finish typing new address.", "stars": 1, "date": "Jan 25, 2014"}, {"text": "I have it set to open my apps on the new tab, but when I do, it's just a blank page.  Not sure how to get them to show...otherwise it works with every other setting.", "stars": 3, "date": "Jan 23, 2014"}, {"text": "Simple and beautiful!\nExactly what I need.", "stars": 5, "date": "Jan 23, 2014"}, {"text": "It's pretty good, as advertised.\n\nBig minus to me: does not provide an option to force-focus to the address bar when opening a new tab!", "stars": 3, "date": "Jan 21, 2014"}, {"text": "This isn't helping me at all. Even when I type the URL in and save it, I'm still not seeing the address I put in when I save it.", "stars": 2, "date": "Jan 20, 2014"}, {"text": "its not working for me! im having trouble with a virus from search.conduit and was told this app would override it... it doesnt, can anyone help?!", "stars": 1, "date": "Jan 20, 2014"}, {"text": "Exactly what I was looking for.  Can't understand why chrome will let you change your home page but not the new tab page.\n\nThank you!", "stars": 5, "date": "Jan 18, 2014"}, {"text": "Thank you! I really needed this simple feature.", "stars": 5, "date": "Jan 18, 2014"}, {"text": "Brilliant!! Simple and easy to use. Thank you!", "stars": 5, "date": "Jan 17, 2014"}, {"text": "This was all I want. Just Bravo!", "stars": 5, "date": "Jan 16, 2014"}, {"text": "Doesn't work, stuck on Bing.", "stars": 1, "date": "Jan 13, 2014"}, {"text": "Does not work. I have it enabled, yet when I open a new tab it is still the unmarked search page that  says \"Results by Bing\" in the upper right hand corner.", "stars": 1, "date": "Jan 12, 2014"}, {"text": "This extension is an easy way to fix the broken \"new window\" and \"new tab\" default behavior in recent Chrome releases.", "stars": 5, "date": "Jan 12, 2014"}, {"text": "Works as designed & gave me back my apps new tab functionality - many thanks!", "stars": 5, "date": "Jan 12, 2014"}, {"text": "I set it to open Google's main search page in new tabs, but for some reason, it doesn't react quickly enough, so where I was used opening a new tab and typing my search terms very quickly, I now have to wait a moment, or it loses the first several characters. I uninstalled as this makes it less useful than the default new tab.", "stars": 2, "date": "Jan 8, 2014"}, {"text": "Does what it says on the can. Thanks", "stars": 5, "date": "Jan 7, 2014"}, {"text": "Works as it should. Allows you to specify the url of the New Tab.", "stars": 5, "date": "Jan 7, 2014"}, {"text": "Exactly what I needed.  I like my home page when I open a tab, not some other thing and this enabled me to get it. Thanks!!", "stars": 5, "date": "Jan 7, 2014"}, {"text": "easily done, no hassle and no hocus-pocus funny steps JUST to CHANGE YOUR NEW TAB LINK.", "stars": 5, "date": "Jan 4, 2014"}, {"text": "didn't work. still gets redirected to bing everytime. this is my only extension.", "stars": 1, "date": "Jan 4, 2014"}, {"text": "the new tab does not have the focus/cursor in the address bar; I usually open a new tab using the keyboard (Ctl-t) and immediately start typing my search or the address of the web page I want to go, but with this extension I would have to take the mouse and click in the address bar. It doesn't sound as too much trouble, but it is!!!, it is really annoying. Uninstalling right away ...", "stars": 1, "date": "Jan 2, 2014"}, {"text": "i didn't like the new changes Google made to the new tabs page where i had to click on the button to view my apps, so this works :)", "stars": 4, "date": "Dec 28, 2013"}, {"text": "Awesome is all I can say. works exactly as expected!:)", "stars": 5, "date": "Dec 25, 2013"}, {"text": "Love this! No more of the crummy default google tab page. Everything i want in my new tab.", "stars": 5, "date": "Dec 21, 2013"}, {"text": "Works well!", "stars": 5, "date": "Dec 19, 2013"}, {"text": "After upgrade to Version 33.0.1750.3 dev-m the extension doesn't work anymore. Please fix it if possible.", "stars": 4, "date": "Dec 18, 2013"}, {"text": "doesn't work after upgrade to 33.0.1750.3 dev-m\nplz fix it,THX!", "stars": 3, "date": "Dec 18, 2013"}, {"text": "It's awesome! Just work nicely!", "stars": 5, "date": "Dec 17, 2013"}, {"text": "awesome. i love the old design.", "stars": 5, "date": "Dec 17, 2013"}, {"text": "awesome is all I can say.  works exactly as expected", "stars": 5, "date": "Dec 15, 2013"}, {"text": "Ok, I am only disliking this at the moment because it's not working for me. Since my computer updated, the Bing search engine has been harassing the hell out of me. I fixed it once, but not it's back and I can't get rid of it! Someone please help...", "stars": 2, "date": "Dec 15, 2013"}, {"text": "Tried it on two computers, it worked on one and not on the other. Now it does not work on either.\n\nEdit: Seems to work again on one computer after I disabled/reenabled.", "stars": 3, "date": "Dec 9, 2013"}, {"text": "This is what I was looking for. It lets me have on the 'new tab' what I want, great!", "stars": 5, "date": "Dec 7, 2013"}, {"text": "Thank you!", "stars": 5, "date": "Dec 6, 2013"}, {"text": "This is perfect to fix Google's inability to leave the new tab page alone. Now I can view my apps again!", "stars": 5, "date": "Dec 5, 2013"}, {"text": "With Speed Dials shady service and Googles horrid looking new tab page.. I decided I would design and code my own home/new tab page. This extension is a life savor as it is a feature chrome is severely lacking! I can direct the new tab page to any html file on my hard drive or any link on the web. It runs very smoothly and setup was quick and simple. Thank you guys!", "stars": 5, "date": "Dec 5, 2013"}, {"text": "it works like charm.", "stars": 5, "date": "Dec 4, 2013"}, {"text": "used to work, doesn't work any longer, intermittent at best", "stars": 1, "date": "Nov 30, 2013"}, {"text": "When I open a new tab, I want my home page, not some other page. Love this extension, works perfectly.", "stars": 5, "date": "Nov 29, 2013"}, {"text": "Great works!", "stars": 5, "date": "Nov 29, 2013"}, {"text": "awesome, just the customization i was looking for!", "stars": 5, "date": "Nov 29, 2013"}, {"text": "Awesome. Fixed that nonsense Google had pushed thru and set things back to the way I like them. TY so much!", "stars": 5, "date": "Nov 27, 2013"}, {"text": "pithy and great！！", "stars": 5, "date": "Nov 26, 2013"}, {"text": "Great tool.", "stars": 5, "date": "Nov 23, 2013"}, {"text": "I had a fix that no longer worked. The option was no longer in Chrome's settings to disable this annoying 'feature'. This extension worked like a charm! Thank you so much! I did send a donation. It was very much worth it! :)", "stars": 5, "date": "Nov 20, 2013"}, {"text": "Awesome, all I wanted was to show my choice of start page and this delivers", "stars": 5, "date": "Nov 20, 2013"}, {"text": "This Extention makes Chrome barable again...\n\nI set it to point to \"chrome://apps/\"\n\nI like to be able to find things where i left them. This retarded New tab that google  pushed thru lately makes me feel that whenever i open the fridge, everything got reorganized and sorted based on what i ate yesterdayz...", "stars": 5, "date": "Nov 19, 2013"}, {"text": "Finally!  A way to set your very own specific New Tab page.  Too bad it was not configured into the Chrome settings as setting a home page is...  Bad Google Chrome Bad!  Jim Schubert deserves a corner office at Google corporate.  They could use brilliance like his.\nThanks a million Jim!", "stars": 5, "date": "Nov 18, 2013"}, {"text": "Not bad", "stars": 4, "date": "Nov 13, 2013"}, {"text": "Super !", "stars": 4, "date": "Nov 13, 2013"}, {"text": "Bingo - instant fix after trying numerous other options. Awesome. Thank you.\n\nIt would get a five star if the page url didn't show so I could just type in my search.", "stars": 4, "date": "Nov 8, 2013"}, {"text": "It was working ok. Now it doesn't do anything. Still getting the stupid Google new tab.", "stars": 3, "date": "Nov 7, 2013"}, {"text": "Good extension, but that the omnibox isn't auto focused after opening a new tab is a little bummer :/", "stars": 3, "date": "Nov 6, 2013"}, {"text": "I lOve it!!! But it stopped working for some reason.", "stars": 5, "date": "Nov 6, 2013"}, {"text": "Exelent recomend", "stars": 5, "date": "Nov 3, 2013"}, {"text": "where is it saved??? i cant find it in my apps or in my computer files can you help?\n\nthanks", "stars": 4, "date": "Nov 3, 2013"}, {"text": "I wanted to use New Tab Redirect and Awesome New Tab Page together but it doesn't work (Redirect's fault) Sure it's good if you want to open a certain webpage, just doesn't work with the webpage I want! :'(", "stars": 2, "date": "Nov 3, 2013"}, {"text": "Thank you so much for this. No idea why the Google minds considers this (new tab) an upgrade but I'm grateful an actual user came up with a fix.", "stars": 5, "date": "Nov 1, 2013"}, {"text": "great extension to redirect to the apps screen.", "stars": 5, "date": "Oct 31, 2013"}, {"text": "Works perfect!", "stars": 5, "date": "Oct 30, 2013"}, {"text": "I like this extension, but I have to reinstall it every time i restart my computer. Every \"new tab\" exension that I try  (five so far) has the same problem... it only works for one day. I just wish that google would stop making the new tab go to the apps page... I don't like the omnibox, i like the full fledged google search... so I guess I just have to reinstall a new extension every day.", "stars": 3, "date": "Oct 29, 2013"}, {"text": "Does exactly what it says, no more and no less. Perfect the way it is.", "stars": 5, "date": "Oct 27, 2013"}, {"text": "It works everywhere except on my Windows (8.1) machine :'(\nPlease fix it!", "stars": 1, "date": "Oct 26, 2013"}, {"text": "I found it frustrating that google hadn't thought it should have such a simple capability as allowing the user to set what was presented when a new tab was created.  This extension solves what was, to me, an obvious lack of foresight on their part.  Does what it says and in a simple, helpful manner.", "stars": 5, "date": "Oct 23, 2013"}, {"text": "helped .!\nthanks", "stars": 5, "date": "Oct 21, 2013"}, {"text": "Thank You, so much :D Thank you for your help.", "stars": 5, "date": "Oct 19, 2013"}, {"text": "Not work anymore", "stars": 1, "date": "Oct 19, 2013"}, {"text": "Had to stop using this great extension because each time Google Chrome crashes the extension hides the \"Restore\" button making sessions \"unrestorable\" after a crash. Until this major bug is fixed I have to stop using this to avoid losing my session.", "stars": 2, "date": "Oct 18, 2013"}, {"text": "Thank you!\nNow it's my favorite extension!\nMuch faster to load, not social notification for the new tab - ideal new tab page!\nThanks a lot!", "stars": 5, "date": "Oct 15, 2013"}, {"text": "Yay! Undid Google's UI mistake.", "stars": 5, "date": "Oct 13, 2013"}, {"text": "the problem is that i type more quicker in url bar  that the site loads, so its overwrites my first typed letters... its not confortable.\nBut the plugin is good. thanks .", "stars": 4, "date": "Oct 12, 2013"}, {"text": "Thank goodness for this extension - this fixed what I hated about the new Chrome update.", "stars": 5, "date": "Oct 11, 2013"}, {"text": "Works fine for those who want to start with a specific page in a new tab.\nHowever for those who just like to start with a blank new tab, the only option is to specify about:blank and the cursor will be placed after the text \"about:blank\", which prevents you from start typing an URL straight away.", "stars": 4, "date": "Oct 10, 2013"}, {"text": "Thanks, the new Chrome \"New Tab\" page is awful. I like the old \"New Tab\" page and this let me change it back.", "stars": 5, "date": "Oct 9, 2013"}, {"text": "excellent to fix stupid Google official update", "stars": 5, "date": "Oct 8, 2013"}, {"text": "Works exactly as described! I set my new tabs to go to chrome://apps/ and it works just like it did before the update.", "stars": 5, "date": "Oct 7, 2013"}, {"text": "Has everything Chrome just took away that I loved, awesome app!", "stars": 5, "date": "Oct 7, 2013"}, {"text": "Works perfectly. Now I can go to google instantly in a new tab rather than having to go through the stupid chrome most visited crap. Thanks!", "stars": 5, "date": "Oct 6, 2013"}, {"text": "Cool!", "stars": 5, "date": "Oct 6, 2013"}, {"text": "Returned my new tab page back to its original glory. Thanks for that. \n\nI don't need Google slapping me in the face with a new search bar, I can use the omnibox for that.", "stars": 5, "date": "Oct 6, 2013"}, {"text": "Exactly what I needed since the new update ... thank you!", "stars": 5, "date": "Oct 6, 2013"}, {"text": "Great, need to add chrome://apps button.", "stars": 4, "date": "Oct 5, 2013"}, {"text": "This is exactly what I'm looking for. \nChrome should do something like this.\nThanks a lot.", "stars": 5, "date": "Oct 4, 2013"}, {"text": "Thank you very much for developing this, It is very very useful for setting in new tab", "stars": 5, "date": "Oct 4, 2013"}, {"text": "Perfect.. Just what I wanted when Google removed the apps page and put it into a button on the tool bar!!", "stars": 5, "date": "Oct 4, 2013"}, {"text": "This is awesome it does exactly what it says and works flawlessly.", "stars": 5, "date": "Oct 2, 2013"}, {"text": "Thank you for adding in the original New Tab page to replace the updated (atrocious) New Tab page.\n\nI was on the brink of uninstalling Google Chrome entirely. When I spot something wrong,no matter how small, I get angry about it. I still don't forgive Google for replacing the Options button's Wrench icon with three bars (which makes no bloody sense compared to the original).", "stars": 5, "date": "Oct 1, 2013"}, {"text": "5 HUGE stars.  Thanks to this extension, I have the old 'New Tab' page back with my apps right where I want them.  No unnecessary extra clicks to get to them.  \n\nThanks!", "stars": 5, "date": "Oct 1, 2013"}, {"text": "So far so good. I was also able to reset my Apps page to open as a new tab, which is a feature I loved about the old chrome.", "stars": 5, "date": "Oct 1, 2013"}, {"text": "Thank you very much for developing and sharing this extension!\nWorks great for me and I got my Apps back on my new Tab page which I was really missing after the last Chrome update.", "stars": 5, "date": "Oct 1, 2013"}, {"text": "Thank you! This works perfectly.", "stars": 5, "date": "Oct 1, 2013"}, {"text": "I installed this extension, following Chrome recent update, to have my apps on my new page . It does exactly what I need.", "stars": 4, "date": "Oct 1, 2013"}, {"text": "Nice, Goggle`s New Tab page is more like Malware! \n\nRedirect is a little slow but a good workaround.\n\nI was also about to drop chrome as my default browser.", "stars": 5, "date": "Oct 1, 2013"}, {"text": "Thank you ! I hate the latest Chrome New Tab version, now I can get something close to what I customized before : apps. \n\nSet chrome://apps/ as your new tab address, and it's done. \n\nThanks a lot !", "stars": 5, "date": "Sep 30, 2013"}, {"text": "Brilliant! Just what I needed since Google Chrome decided to force their ANNOYING new tap menu/search box on us!!!", "stars": 5, "date": "Sep 30, 2013"}, {"text": "Great fix for the newest chrome update.", "stars": 5, "date": "Sep 29, 2013"}, {"text": "im using the this redirect to get my old: chrome://apps/\n\nThis is hopefully just an temporary solution for the bad idea google had with the new tab.", "stars": 5, "date": "Sep 29, 2013"}, {"text": "Works great! The other extension, New Tab Behavior, stopped working recently. Glad this exists.", "stars": 5, "date": "Sep 29, 2013"}, {"text": "Does what vanilla Chrome can't, and is easy to use.  THANK YOU!", "stars": 5, "date": "Sep 28, 2013"}, {"text": "Great! New Tab page from latest Chrome update was really annoying. I do not want to see Google logo and search box every time when I open new tab. What is the point to have search box in new tab if I can write search expression in address bar?\nI'm happy to have \"about:blank\" instead of annoying New tab page :)", "stars": 5, "date": "Sep 28, 2013"}, {"text": "Works perfect,", "stars": 5, "date": "Sep 28, 2013"}, {"text": "feeling good", "stars": 5, "date": "Sep 28, 2013"}, {"text": "YES THANK UOU everytime I open a tab it opens to snapado(really annoying)", "stars": 5, "date": "Sep 28, 2013"}, {"text": "I was about to stop using Chrome. Then I found this extension. Thankyou so much!", "stars": 5, "date": "Sep 27, 2013"}, {"text": "Functional and simple.  Allows you to set your new tab to the simple display before Google changed it.", "stars": 5, "date": "Sep 26, 2013"}, {"text": "This is a \"must have\" for the new Chrome!", "stars": 5, "date": "Sep 26, 2013"}, {"text": "Very useful !! merci", "stars": 5, "date": "Sep 26, 2013"}, {"text": "Thank you SO MUCH", "stars": 5, "date": "Sep 26, 2013"}, {"text": "Changed the new tabs page back to the apps list after Google took it away. Does exactly what it claims to, perfect.\n\nChrome is getting more like Firefox. You need half a dozen extensions just to fix all the UI changes that broke your workflow.", "stars": 5, "date": "Sep 26, 2013"}, {"text": "worked perfectly ! fixe the update made by google\nredirect to :\nchrome://apps/", "stars": 5, "date": "Sep 25, 2013"}, {"text": "I love you Jim Schubert. Marry me.", "stars": 5, "date": "Sep 25, 2013"}, {"text": "This fixes what Chrome team has goofed up. Message to Chrome team : Don't try to push your services to me. I am using it when I want to... More such attempts are likely to see mass dumping of Chrome.", "stars": 5, "date": "Sep 25, 2013"}, {"text": "Great, almost drop Chrome after the new tab page update without this app. Hope to have the option to have bookmark bar enabled only for new tab page.", "stars": 5, "date": "Sep 25, 2013"}, {"text": "Thanks!  This gives me back that list of Apps that I have on the new tab page, instead of me needing to use Google's new App Launcher thing.", "stars": 4, "date": "Sep 24, 2013"}, {"text": "worked perfectly till now. suddenly takes ages to redirect to the new tab-site. (it's a local site & didn't change it)", "stars": 4, "date": "Sep 24, 2013"}, {"text": "very good !", "stars": 5, "date": "Sep 22, 2013"}, {"text": "GREAT! Thank you so much! This fixed the latest update that Google did to Chrome. I don't know why they try and reinvent the wheel every single day but I lost my new tab options and this extension fixed it!\n\nTHANK YOU THANK YOU!", "stars": 5, "date": "Sep 22, 2013"}, {"text": "It seems to be causing chrome to stall it's bandwidth. Flash movies and downloads will drop to 0 B/s every few minutes for a few seconds. Disabling new tab stops the problem. This only started happening recently. Otherwise I would give it 5 stars.", "stars": 2, "date": "Sep 22, 2013"}, {"text": "It works great.  Simple and does what Chrome should have offered by default.", "stars": 5, "date": "Sep 20, 2013"}, {"text": "WHY THE HECK isn't this a default feature in chrome is just BEYOND me.", "stars": 4, "date": "Sep 18, 2013"}, {"text": "Mixi-delta redirect had made my life hell. Fixed the redirect using this tool.\nThank you!", "stars": 5, "date": "Sep 15, 2013"}, {"text": "This is an awesome extension for chrome. This completely solved my problem. Haven't had any problems yet.", "stars": 5, "date": "Sep 14, 2013"}, {"text": "Congratulations perfect solution!!!", "stars": 5, "date": "Sep 6, 2013"}, {"text": "This worked perfect!  I needed my apps to be my homepage and this did the trick!  Thanks.", "stars": 5, "date": "Sep 6, 2013"}, {"text": "helped remove a bugging problem with the new tab page where it used t open some qv06 nonsense...", "stars": 5, "date": "Sep 5, 2013"}, {"text": "Chrome keeps defaulting but this history tabs app lets me go back to what I want.", "stars": 5, "date": "Sep 1, 2013"}, {"text": "Good application. Easy to use. Good Job !", "stars": 5, "date": "Aug 29, 2013"}, {"text": "does what it says it does", "stars": 5, "date": "Aug 29, 2013"}, {"text": "5 stars...real GOOOOOOD", "stars": 5, "date": "Aug 19, 2013"}, {"text": "Keeps going back to the original New Tab Page instead of the one I want it too. Completely useless.", "stars": 1, "date": "Aug 19, 2013"}, {"text": "I CANT SWITCH MY THEME BACK!!!!!!!!!!!!!!!!!!", "stars": 1, "date": "Aug 19, 2013"}, {"text": "Amazing， it's really useful,I can set whatever I need to show on the new page! :-)", "stars": 5, "date": "Aug 18, 2013"}, {"text": "Thank you so much for this. Chrome 29 sets the new tab page to Google search with no options to change it back to the apps list (now chrome://apps/). This fixed that.", "stars": 5, "date": "Aug 12, 2013"}, {"text": "I had this extension before Chrome started crashing constantly and I had to uninstall and reinstall Chrome (fixed that problem, nothing to do with this extension). I love this extension, it gives me EXACTLY what I want, works seamlessly and THANK YOU!!", "stars": 5, "date": "Aug 11, 2013"}, {"text": "This thing does not work at all it never redirects the tab and its just causing a headache I am Uninstalling this thing immediatly", "stars": 1, "date": "Aug 7, 2013"}, {"text": "very good", "stars": 4, "date": "Aug 6, 2013"}, {"text": "Tried Replace New Tab and Google Search page would open but the cursor would be in the URL field. Have to TAB 3 times or use mouse which defeated the purpose.\n\nThanks New Tab Redirect. Now Google opens and the cursor is in the search field.", "stars": 5, "date": "Aug 4, 2013"}, {"text": "Brilliant !!!", "stars": 5, "date": "Jul 29, 2013"}, {"text": "i dont like this new tap", "stars": 5, "date": "Jul 28, 2013"}, {"text": "Superb..... i have only one word thanks a lot", "stars": 5, "date": "Jul 26, 2013"}, {"text": "Great after some programs hijacked my original newtab page", "stars": 5, "date": "Jul 16, 2013"}, {"text": "Excellent for jumping to home page :)", "stars": 5, "date": "Jul 15, 2013"}, {"text": "When you open a new tab now, it'll go straight to the URL bar, I preferred it when it would type in the search engine search bar (I use Google). Would it be possible to have it as an option?", "stars": 2, "date": "Jul 11, 2013"}, {"text": "Perfectly simple.  It does what it says it and nothing more.  Excellent!", "stars": 5, "date": "Jul 10, 2013"}, {"text": "i Want to take this off i hate it", "stars": 2, "date": "Jul 7, 2013"}, {"text": "I love this it finally got rid of my stupid avg new tab problem", "stars": 5, "date": "Jun 22, 2013"}, {"text": "super great app it helped me alot becose i had broblems whit default app", "stars": 5, "date": "Jun 12, 2013"}, {"text": "it works", "stars": 5, "date": "Jun 10, 2013"}, {"text": "Have deleted this extension multiple times and yet it continues to reload itself to the URL of it's choosing.", "stars": 1, "date": "Jun 8, 2013"}, {"text": "This helped me SOOO much because my search engine and new tab page kept going to SEARCH ENGINE which i hated this was the perfect solution", "stars": 5, "date": "Jun 5, 2013"}, {"text": "Awesum Extension :)\n\nBefore i was using FIREFOX but it causes systems too slow.\n\nNow switch to CHROME with best features & app.", "stars": 5, "date": "Jun 2, 2013"}, {"text": "Great extension for always opening new tabs. I just wished there was an option or button to open the Chrome default new tab with Chrome's Most Visited/Apps in order to access my \"Other Devices\" tabs.", "stars": 5, "date": "May 31, 2013"}, {"text": "its so hard to change", "stars": 1, "date": "May 26, 2013"}, {"text": "The best ever on\n planet earth", "stars": 5, "date": "May 24, 2013"}, {"text": "Works perfectly. Had avg search before and could not get rid of it. This did the job! :)", "stars": 5, "date": "May 14, 2013"}, {"text": "How to remove", "stars": 1, "date": "May 9, 2013"}, {"text": "Removes focus from address bar / omnibar. Thus rendering it useless.", "stars": 2, "date": "May 8, 2013"}, {"text": "it sucks", "stars": 1, "date": "May 8, 2013"}, {"text": "thanks! chrome changed its new tab page from apps to search and there was no option to change it back! now there is with this.", "stars": 5, "date": "May 5, 2013"}, {"text": "HORRIBLE", "stars": 1, "date": "May 5, 2013"}, {"text": "Brilliant, love it. I use it on a custom html file. It really let's my minimalistic nature thrive.\nAt first, cursor not going to omnibar automatically was a problem, but I got used to it quickly. Another thing is that a much better shortcut for that is Alt - D. Alt - L, for me, is much more cumbersome.", "stars": 5, "date": "May 1, 2013"}, {"text": "DO NOT ADD", "stars": 1, "date": "Apr 29, 2013"}, {"text": "its great , but i do not know how i can enter in this. Please help", "stars": 5, "date": "Apr 27, 2013"}, {"text": "love it! why didnt google think of this to start with?", "stars": 5, "date": "Apr 19, 2013"}, {"text": "awesome!!! does exactly what i wanted it to!", "stars": 5, "date": "Apr 19, 2013"}, {"text": "The new tab set from a download started to irritate me! This helped a lot!", "stars": 5, "date": "Apr 14, 2013"}, {"text": "Total shite. It does nothing", "stars": 1, "date": "Apr 13, 2013"}, {"text": "Nice!", "stars": 5, "date": "Apr 12, 2013"}, {"text": "The most amazing little app there is!\n\nThank-you Jim!", "stars": 5, "date": "Apr 5, 2013"}, {"text": "Finally! This does exactly what it says on the tin.", "stars": 5, "date": "Mar 30, 2013"}, {"text": "Nice and simple! It's crazy this isn't included in Chrome anyway", "stars": 5, "date": "Mar 27, 2013"}, {"text": "Does what it says.", "stars": 5, "date": "Mar 14, 2013"}, {"text": "I'd give this five stars if it did not keep defaulting back to opening its own options page -- does it often, such as whenever Google Chrome updates itself.\n\nUninstalling meanwhile ---", "stars": 3, "date": "Mar 8, 2013"}, {"text": "Just what I was looking for. Does exactly what it says on the tin!", "stars": 5, "date": "Mar 7, 2013"}, {"text": "cool", "stars": 5, "date": "Feb 22, 2013"}, {"text": "Works 95% of the time. But sync options doesn't work.  I keep seeing the options page, but for me - Once installed, I never want to see it again. So many buttons in the options page, it only needs one - my chosen page. Uninstalling this one and using a simpler one instead (there are a few of these in the app store now). The one I'm using now has just one setting - my chosen URL. :)", "stars": 3, "date": "Feb 19, 2013"}, {"text": "usefull and easy", "stars": 5, "date": "Feb 18, 2013"}, {"text": "super", "stars": 5, "date": "Feb 12, 2013"}, {"text": "This was the perfect solution for me to put my to-do list (Any.DO using the Chrome extension) right there in my face every time I open a new tab.\n\nTwo thumbs (and two toes) up!", "stars": 4, "date": "Feb 6, 2013"}, {"text": "EXTREMELY GOOD", "stars": 5, "date": "Feb 6, 2013"}, {"text": "Omg i love it! I had stupid incredibar because of downloading something i regret downloading now and this got rid of it. nothing else would! love this.", "stars": 5, "date": "Jan 31, 2013"}, {"text": "It's very useful, think that it is practical because of 2 reasons: you don't have to go manually to each page each time, and when you open a new tab it doesn't appear the sites you've visited...", "stars": 5, "date": "Jan 27, 2013"}, {"text": "Works ok but every time Chrome is updated I have to re-install this New Tab Redirect.", "stars": 3, "date": "Jan 23, 2013"}, {"text": "Works great!", "stars": 5, "date": "Jan 22, 2013"}, {"text": "It works fine, until I switch off/restart the computer. Then I need to re-install it, dunno if anyone else gets this or if it's just me!", "stars": 4, "date": "Jan 5, 2013"}, {"text": "Perfect app !!!", "stars": 5, "date": "Dec 31, 2012"}, {"text": "It is good but it is better to have a random webpage in a entered webpage.\nHope you will improve it.\nThx!", "stars": 4, "date": "Dec 25, 2012"}, {"text": "doesn't always work", "stars": 3, "date": "Nov 25, 2012"}, {"text": "Works perfectly", "stars": 5, "date": "Nov 22, 2012"}, {"text": "Simple idea, but falls down in execution. It would be great if the focus was automatically moved to the URL bar. Also there is a slight delay when loading the page, even if it is a locally stored page, where there should be no delay at all.", "stars": 3, "date": "Nov 17, 2012"}, {"text": "Used to work, but now all I get is \"redirecting...\" Other older redirect extensions still work.", "stars": 2, "date": "Nov 12, 2012"}, {"text": "This extension is really helpful, and it does exactly what it says on the... tin?", "stars": 5, "date": "Nov 11, 2012"}, {"text": "stupid", "stars": 1, "date": "Nov 5, 2012"}, {"text": "Perfect!  Does just what I wanted.  The inability to specify 'new tab' behavior has been a small but constant annoyance to me since switching from Firefox.", "stars": 5, "date": "Nov 5, 2012"}, {"text": "Perfect, does exactly as i wanted!", "stars": 5, "date": "Oct 30, 2012"}, {"text": "I want to sign any bookmark of bookmark manager inside the new tab page , can you add this function?", "stars": 5, "date": "Oct 20, 2012"}, {"text": "works fantastic, however now i have no idea how to get to my apps that were located on my new tab page...", "stars": 4, "date": "Oct 18, 2012"}, {"text": "Simple yet powerful.\nSmall yet mighty!\nInvisible but easily seen.\nI love.\n<3", "stars": 5, "date": "Oct 17, 2012"}, {"text": "Very Good App.", "stars": 5, "date": "Oct 4, 2012"}, {"text": "simple yet effective", "stars": 5, "date": "Oct 3, 2012"}, {"text": "I liked it at first then it kept on crashing my browser. Time to look for something new.", "stars": 2, "date": "Sep 30, 2012"}, {"text": "works", "stars": 5, "date": "Sep 9, 2012"}, {"text": "I don't know which extension or app, the \"Yeppo.Net\" search page came from, but this \"new TAB redirect\" extension solved the problem completely!!! thanks to whom ever did it so that what I want is easily applicable, and my use of g-chrome stays a smoth experience!!! =)", "stars": 5, "date": "Sep 8, 2012"}, {"text": "Easy to use and did exactly what i wanted it to.", "stars": 5, "date": "Sep 2, 2012"}, {"text": "Chrome will auto-focus the omnibar (URL bar) if you put in \"//\" as your new tab page URL. You will, however, not be able to also load a page - it'll be blank. \n\nJust found out through trial and error.", "stars": 5, "date": "Aug 31, 2012"}, {"text": "Works.", "stars": 5, "date": "Aug 27, 2012"}, {"text": "It was working fine till chrome version 19. But after updating chrome to version 20 (I am on Mac OS Lion), it crashes randomly. This is a very nice app but it need to be fixed for the latest version of chrome.", "stars": 3, "date": "Jun 30, 2012"}, {"text": "My problem was that when I opened a new tab it would not load the page I wanted.  Also the Home button would not go to my home page in a new tab.  This extension fixed it.  Thank you for doing what Google wouldn't!", "stars": 5, "date": "Jun 30, 2012"}, {"text": "This should be built in!", "stars": 5, "date": "Jun 29, 2012"}, {"text": "Sucks.", "stars": 1, "date": "Jun 22, 2012"}, {"text": "Why do none of these extensions work in incognto? Piece of crap! Checked allow in icognito!", "stars": 1, "date": "Jun 21, 2012"}, {"text": "Installed easily and does exactly what I wanted - opens a specific page for a new tab. Why Chrome doesn't allow this option natively is beyond me, but I'm glad Jim has provided it with this extension.", "stars": 5, "date": "Jun 9, 2012"}, {"text": "Does just what I needed.", "stars": 5, "date": "Jun 7, 2012"}, {"text": "works very well", "stars": 5, "date": "Jun 5, 2012"}, {"text": "Exactly what I needed. Does what it says it does quickly, quietly and efficiently.  This kind of setting should be a part of the core Chrome options, but lacking that this seems the perfect solution.  Thanks!", "stars": 5, "date": "May 21, 2012"}, {"text": "1 word \"perfection\" :)", "stars": 5, "date": "May 20, 2012"}, {"text": "Without this extension I would have uninstalled Chrome..  Pay attention Google!", "stars": 5, "date": "May 14, 2012"}, {"text": "Awsome now I can get my home page when I open a new tab , this should be default without question.", "stars": 5, "date": "May 14, 2012"}, {"text": "Perfortuna esisti New Tab Redirect", "stars": 5, "date": "May 5, 2012"}, {"text": "Would it be possible to auto focus the omnibox, only thing that annoys me", "stars": 4, "date": "May 5, 2012"}, {"text": "Does what it says does and that's all that I ask.", "stars": 5, "date": "May 2, 2012"}, {"text": "Works great, however there should be an option for the keyboard to automatically start off on the omnibar like with the default new tab.", "stars": 4, "date": "Apr 29, 2012"}, {"text": "Good Extension. :D Thnx", "stars": 5, "date": "Apr 16, 2012"}, {"text": "WOW!\nJust Great! I hated the new tab page because it was unorganised. So i tried this app out, I loved it! You can get it to redirect to any page you want, not only the Google Page. Sick as!", "stars": 5, "date": "Apr 14, 2012"}, {"text": "BE CAREFUL! - this extension added a malware/spam pop-up in the lower right of my browser screen.", "stars": 1, "date": "Apr 11, 2012"}, {"text": "5 stars when this plugin focuses address bar when you set new tab as your bookmarks. Now it's pretty annoying as the focus goes to the search field of bookmarks.", "stars": 4, "date": "Mar 30, 2012"}, {"text": "Works perfectly. Why this isn't built-in setting in Chrome I don't know.", "stars": 5, "date": "Mar 23, 2012"}, {"text": "Works exactly as advertised, and does a fine job.\n\nAs it is, the homepage used is in the extension's own options, and is thus not copied by Sync. It'd be nice if they'd just use whatever you've filled in as Chrome's \"Homepage\".", "stars": 4, "date": "Mar 20, 2012"}, {"text": "Why is this not already a standard option in Google Chrome? We're on version 17 of the browser already and you still have to use an extension to set your new tab's initial page. One of the few things that IE has over Chrome (there's not many!). Thanks to you Jim for sorting this out for us! You're a hero.", "stars": 5, "date": "Mar 6, 2012"}, {"text": "It works great, and I love this addon, but I wish it did not have so many features.\n\nAll I need is addon which redirects the new tab page to a custom URL.  This one does that, but it is also filled with quick settings, letting you redirect to other 'popular' pages.\n\nTo me, this is bloat that really isn't necessary.", "stars": 4, "date": "Feb 26, 2012"}, {"text": "This is excellent.", "stars": 5, "date": "Feb 8, 2012"}, {"text": "Great stuff. Does just what it says on the tin.", "stars": 4, "date": "Feb 5, 2012"}, {"text": "Does what it says.", "stars": 5, "date": "Jan 17, 2012"}, {"text": "It does what I need it to, lets me customize my new tab experience to be any page I desire.\n\n1 problem: It doesn't keep the keyboard focus in the omnibox. I want to hit a new tab and instantly begin typing in the omnibox. but with this extension installed I have to use the keyboard shortcut or click into the omnibox to get its focus.", "stars": 3, "date": "Jan 14, 2012"}, {"text": "Awesome, just can't wait till/if Chrome adds functionality so you can make it so that when I open a new tab it automatically highlights the url bar. thanks", "stars": 5, "date": "Jan 10, 2012"}, {"text": "It would be nice if you have the about:blank selected, the omnibar should have auto-focus and clear the about:blank text on it.", "stars": 4, "date": "Nov 26, 2011"}, {"text": "works great, except typing in a url when opening a new tab (a common, nearly always? occurrence) is a pain because the omnibar is not focused in the new tab.\n\ni've found a quick Tab press after ctrl+T for the new tab focuses the omnibar.  if you don't type fast enough, the selection is removed, but you can still re-select (and then overwrite) the default url with ctrl+A.\n\nkeyboard control 4eva.\n\nps. thanks jim!", "stars": 4, "date": "Nov 18, 2011"}, {"text": "This is great but I get a little annoyed that when I hit tab it doesn't automatically highlight the address bar so I can begin typing a url.  That adds an extra click to make focus in the address bar.  With the extension disabled new tab will automatically focus on the address bar so that you can click new tab and begin typing a URL immediately if what you want isnt on your new tab page.  Please change this one thing!", "stars": 4, "date": "Nov 12, 2011"}, {"text": "Would give it one more star if one of the options was just \"homepage\" so that I didn't have to change my homepage in two locations.\n\nWould give it the other star if it put the cursor back in the address bar after loading the selected page.", "stars": 3, "date": "Nov 8, 2011"}, {"text": "Why this isn't built in to Chrome, I'm not sure - but this great extension does exactly what is promised and took away one of the very few frustration points I have with Chrome.", "stars": 5, "date": "Nov 7, 2011"}, {"text": "URL is focused, but not selected. Slow redirection, title blinking.", "stars": 2, "date": "Nov 3, 2011"}, {"text": "This provides a capability that should have been built into Chrome but is not.  I rely on it.  It works well without you even knowing it is there.", "stars": 5, "date": "May 19, 2011"}, {"text": "Works really well and does what should be a default feature(waiting to see if Google coders ever get their heads out of their lower digestive tracts and do this.)\n\nIn the meantime, thanks for helping to make Chrome functional.", "stars": 5, "date": "Mar 12, 2011"}, {"text": "Crash for no reason recently,Please check,many thanks!", "stars": 3, "date": "Jan 24, 2011"}]