[{"date": "Mar 7, 2024", "text": "Vimium 2.0.5\nChrome 122.0.6261.111 (Build oficial) (64 bits)\nin web.whatsapp.com not work yf", "stars": 5}, {"date": "Mar 6, 2024", "text": "Amazing stuff", "stars": 4}, {"date": "Feb 23, 2024", "text": "This is a very stable piece of software, been using for years, works as advertised.", "stars": 5}, {"date": "Feb 22, 2024", "text": "THIS IS COOL", "stars": 5}, {"date": "Feb 16, 2024", "text": "Without vimium I can't browse", "stars": 5}, {"date": "Feb 5, 2024", "text": "That's what I was looking for!", "stars": 5}, {"date": "Jan 25, 2024", "text": "Mostly awesome.", "stars": 5}, {"date": "Jan 23, 2024", "text": "I feel so lazy using this, it feels great.", "stars": 5}, {"date": "Jan 20, 2024", "text": "Wow I love the customizability of this plugin! Really embodies the spirit of vim. Absolutely phenomenal extension!", "stars": 5}, {"date": "Jan 17, 2024", "text": "Rating 5 in my terminal using Vim.", "stars": 5}, {"date": "Jan 15, 2024", "text": "it is huge, get is if you don't like to move you hands to the mouse", "stars": 5}, {"date": "Jan 9, 2024", "text": "For anyone who loves working with Keyboards and loves to be pro!", "stars": 5}, {"date": "Dec 30, 2023", "text": "No mouse day is finally possible.", "stars": 5}, {"date": "Dec 30, 2023", "text": "Fingers gonna die without this extension<3", "stars": 5}, {"date": "Dec 28, 2023", "text": "To be honest, it time saves a lot but I don't understand why it is called the \"hackers\" browser!", "stars": 5}, {"date": "Dec 13, 2023", "text": "Time saver for keyboard based navigation. I use \"f\" all the time to \"click\" on buttons I see.", "stars": 5}, {"date": "Dec 10, 2023", "text": "I like extension quite a lot, it is useful when working side-by-side with Neovim.\nI like the fact that this version of the plugin does not deny the fact that Taiwan is a sovereign country.", "stars": 4}, {"date": "Dec 6, 2023", "text": "Perfect", "stars": 5}, {"date": "Dec 1, 2023", "text": "This extension gave me anxiety. I have to guess for which site I disabled this extension and for which I didn’t. I disabled it on YouTube and Twitch, otherwise their shortcuts (fullscreen, etc.) do not work. You also won’t be able to play online games; so you have to add them to exceptions. Yes, it’s cool and convenient for programmers. But not for casual browsing. I’m afraid to press a key or to start entering text, because maybe I will press a key that will close the tab or do some other st... Show more", "stars": 1}, {"date": "Nov 27, 2023", "text": "This extension is exactly what I was looking for. It covers all my needs and helps me on a regular basis. \nIt is worth mentioning that it boosts productivity as Vim does. Thanks to the authors for this.", "stars": 5}, {"date": "Nov 25, 2023", "text": "After getting carpal tunnel syndrome I found moving from keyboard to mouse very painful. This Extension has really improved my working day!", "stars": 5}, {"date": "Nov 25, 2023", "text": "I'm brand new to vim-like navigation and its a very fun experience! One thing I would like to see is a key to disable shortcuts temporarily. Like a toggle. For example on YouTube I would still like to use the shortcuts for video playback, but also have the ability to interact with the page via vimium. \nAwesome tool none-the-less! Really like it", "stars": 5}, {"date": "Nov 14, 2023", "text": "This used to be perfect, but the latest update seems to have introduced some issues? The last-used tabs don't get listed anymore when I press 'T'.", "stars": 2}, {"date": "Nov 8, 2023", "text": "This is one of the best and most useful extensions ever made. Love it.", "stars": 5}, {"date": "Nov 6, 2023", "text": "nice thought and great work!", "stars": 5}, {"date": "Nov 4, 2023", "text": "Amazing tool that I use everyday.", "stars": 5}, {"date": "Oct 21, 2023", "text": "It's pretty well on my computer. But as a Nvim connoisseur, I wonder whether it can be improved. For example, I don't need to remember the position of tabs to switch among them, just a partial name as in Nvim. Also it lacks the ability of moving the current bar to the rightmost, close all the tabs except this tab, close all the tabs right to the current tab, et cetera. I think it's good, but it absolutely can be perfect.", "stars": 4}, {"date": "Oct 5, 2023", "text": "Absolutely love it. Doesn't get in the way, makes it very easy to disable it in the places you don't want it, and really does speed up navigation. Sometimes I forget that shortcuts I use aren't just part of chrome when I use someone elses laptop! \n\nTo the reviews saying it recently broke (and for the devs): there is an error in the console around trying to parse the config file and failing. Inspecting the code, it looks like you tried to migrate from a different config format to a new one, an... Show more", "stars": 5}, {"date": "Oct 5, 2023", "text": "If you love vim, you'll love vimium.", "stars": 5}, {"date": "Oct 5, 2023", "text": "Not sure what the devs did... but absolutely DOES NOT work anymore. See \"All Vimium keys are enabled on this page.\" message but it's just completely broken. Uninstalled.", "stars": 1}, {"date": "Sep 21, 2023", "text": "Thank you for this fantastic extension. I would just like to request an option for enabling the HUD in normal mode instead of only in insert mode, as I'd rather show normal mode and hide insert mode.", "stars": 5}, {"date": "Sep 11, 2023", "text": "Numbers 1~9 is not working in \"Google remote desktop\" application.", "stars": 5}, {"date": "Sep 3, 2023", "text": "it is very helpful.", "stars": 5}, {"date": "Aug 31, 2023", "text": "Awesome, thank you!", "stars": 5}, {"date": "Jul 29, 2023", "text": "Amazing keyboard helper for the Chromium-based, I can't live without it!", "stars": 5}, {"date": "Jul 28, 2023", "text": "Incredible!", "stars": 5}, {"date": "Jul 15, 2023", "text": "Amazing!", "stars": 5}, {"date": "Jul 11, 2023", "text": "Best plugin for Chrome,very usefull. But hotkeys dont work on google home page.", "stars": 5}, {"date": "Jul 7, 2023", "text": "based", "stars": 5}, {"date": "May 26, 2023", "text": "Wow, Amazing. This is a must for every developer out there. It really removes pressure of always needing to use mouse. Like you have option to navigate faster with Vim keybindings, as natural way of using this. \nYou can code faster, and check browser, if you just need simple scroll here and there on your docs etc. You don't need to reach mouse like a maniac, so you can save your hand and wristles from RSI as It really helps to remove hands from mouse when not needed (or keyboard as well, but ... Show more", "stars": 5}, {"date": "May 26, 2023", "text": "Love it so far", "stars": 5}, {"date": "May 25, 2023", "text": "One of the most useful extensions in Chrome.", "stars": 5}, {"date": "May 20, 2023", "text": "Works well, improves my productivity and flexible customizations to chome. I just need help finding where I can pay or donate, it's well deserved.", "stars": 5}, {"date": "May 13, 2023", "text": "I've been using it for almost a day now, I mainly use the f key, and I'm pretty much satisfied with it, however, there's one small thing I wish you could fix. When using Google Keep, hitting \"f\" assigns letter combinations to everything except the notes themselves! So I had to exclude the letters j and k for Google Keep in my Vimium settings to get Keep's hotkeys back working correctly. Thanks.", "stars": 3}, {"date": "May 11, 2023", "text": "Its awesome!", "stars": 5}, {"date": "Apr 27, 2023", "text": "Speeds up browsing when you can navigate links without taking your hands off the keys.", "stars": 5}, {"date": "Apr 24, 2023", "text": "I still use classic win keybindings in the editor but can't imagine life without vim layout in browser. Awesome experience.\nMoreover it can be considered as a productive path to jump into Vim.", "stars": 5}, {"date": "Apr 20, 2023", "text": "I can use my editor with just my keyboard, and my terminal, and my desktop, this just completes things.", "stars": 5}, {"date": "Apr 7, 2023", "text": "This thing is amazing. Saves you time and your hand! After using it, I've noticed my hands don't hurt/feel as uncomfortable as they did. Makes me wonder if I've been using the mouse wrong since I don't even need it as much anymore. I only wish there was a version that worked on programs other then chrome. Other then that, what are you waiting for? You won't regret using it! Unless you like using the mouse, then it might not be for you.", "stars": 5}, {"date": "Mar 25, 2023", "text": "This extension is incredible!", "stars": 5}, {"date": "Mar 22, 2023", "text": "This used to be fantastic, but recently hitting \"f\" shows less keyboard shortcut labels on the screen than what it used to show in the past. It's not that the links are not available, it's just that the labels are somehow hidden. Would be happy if they could fix it, since this is the main feature I've been using...", "stars": 3}, {"date": "Mar 17, 2023", "text": "It's good, but I wish there was a way to customize what shows up with the Vomnibar. I do not like my history popping up every time I type in an url. I have the feature disabled from my browser, but this extension still insists on showing me my history every time.", "stars": 4}, {"date": "Mar 17, 2023", "text": "It's really cool. Thanks for your great work!", "stars": 5}, {"date": "Mar 1, 2023", "text": "So useless for me ;-; it make harder to see and use also not usefull it too much latency", "stars": 3}, {"date": "Feb 28, 2023", "text": "One of the most important commands is the f command, I use it to navigate the page without having to use the mouse. But looking at the help, the explanation for the f command is incorrect, f doesn't open a link. It should say \"find all links on the current page\"", "stars": 5}, {"date": "Feb 27, 2023", "text": "It's damn good! Thank you!", "stars": 5}, {"date": "Feb 16, 2023", "text": "Awsome!!!!!!", "stars": 5}, {"date": "Feb 3, 2023", "text": "I don't know how I lived so long without it but I am never going back. Top tier extension!", "stars": 5}, {"date": "Jan 29, 2023", "text": "best extension so far for shortcuts", "stars": 5}, {"date": "Jan 25, 2023", "text": "Vimium became indispensable in my day to day. It makes my browsing experience incredibly fast and efficient.", "stars": 5}, {"date": "Jan 12, 2023", "text": "Vimium gives me a further universe :D\nNow i really learn to use the keyboard for easier and faster surfing, working. :)\n\nI used Letter Keyboard Shortcuts since years especially for navigation through tabs and centered all around the left ctrl key with y,y tab left,right and a last tab etc.\nIn Vimium i had to deactivate its own * y, * x shortcuts though.\nThe remapping, changing could be easier.\n\nQ:\n1. How is the search layer called with letter o ?\nThis could be extended or also get a separate ... Show more", "stars": 4}, {"date": "Dec 14, 2022", "text": "What a hack! I was hesitated a bit whether I should try it. After giving it a shot, I instantly realized the power of this tool, despite not a vim user (yet).", "stars": 5}, {"date": "Dec 2, 2022", "text": "It's awesome!", "stars": 5}, {"date": "Dec 1, 2022", "text": "Very helpful!", "stars": 5}, {"date": "Nov 12, 2022", "text": "Steep learning curve but incredibly useful and quick once you get the hang of it! Using other peoples browsers with a mouse feels so awkward now.", "stars": 5}, {"date": "Nov 11, 2022", "text": "Not sure why, but on Brave, whenever I copy text manually and try to paste it (whether using p - for the current page, or P - for a new page). It doesn't automatically work like on Chrome, I have to try to get the focus on the browser (click on the page/press esc multiple times though doesn't work consistently) before pressing p or P in order for the paste command to take effect. On Chrome, this doesn't happen :/", "stars": 4}, {"date": "Oct 23, 2022", "text": "I like this extension but i unmapped 'z' key from vimium options wrriten by 'unmap z'. it doesn't working.\nvimium extension snatch 'z' input buffer, so my other extension doesn't work", "stars": 3}, {"date": "Oct 18, 2022", "text": "How do I use it on Google Translate?\nI basically need two commands:\n1. Clear text from the source area.\n2. Paste the translation from the target area.\n\nIf someone can kindly help, it would be great!\nThanks.", "stars": 5}, {"date": "Oct 15, 2022", "text": "super easy extension and super effiecent too, it will boost your productivity if you use browser on daily basis like i do", "stars": 5}, {"date": "Oct 10, 2022", "text": "I'm using chrome with the extension **vimium** and set **duckduckgo** as my default search engine.It's really useful to get search results with duckduckgo bangs.But I can't use that through vimium's vomnibar.Is it possible to combine?", "stars": 4}, {"date": "Oct 10, 2022", "text": "Loved it", "stars": 5}, {"date": "Sep 28, 2022", "text": "TOP TIER EXTENSION!\n\nIf you are a power user that prefers typing on a keyboard over a mouse, this is for you! It will take time to get familiar, but once you are, so many things you can do in half the time! 10/10 HIGHLY RECOMMEND!", "stars": 5}, {"date": "Sep 27, 2022", "text": "Fantastic! Can't live without it now :)", "stars": 5}, {"date": "Sep 27, 2022", "text": "cool", "stars": 5}, {"date": "Sep 24, 2022", "text": "The only reason I used qutebrowser on linux was for the vimlike bindings until someone told me I could do the same on brave with Vimium I WOULD BE LOST WITHOUT THIS EXTENSION! once you get used to this you literally can't go back it's impossible! I already use a tiling wm and practically don't touch my mouse anymore! THANK YOU VIMIUM", "stars": 5}, {"date": "Sep 20, 2022", "text": "LOVE IT <3", "stars": 5}, {"date": "Sep 3, 2022", "text": "wonderful!", "stars": 5}, {"date": "Sep 1, 2022", "text": "excellent plugin, thank you very much.\nbtw, i found it not work on an element of Quora: the element of expand the whole text (more). can you please fix it? thank you again dude.", "stars": 5}, {"date": "Aug 30, 2022", "text": "Excellent!!!", "stars": 5}, {"date": "Aug 26, 2022", "text": "🐦: @teel0ck", "stars": 5}, {"date": "Aug 22, 2022", "text": "Bad works for Notion => buttons stick together => hard to figure out which one to press.", "stars": 3}, {"date": "Aug 16, 2022", "text": "I need a hot key to enable/disable the extension.\nCould you add it", "stars": 5}, {"date": "Aug 14, 2022", "text": "This is the first chrome extension I install on every profile. great work", "stars": 5}, {"date": "Jul 24, 2022", "text": "Totally loved it!!\nGreat work.", "stars": 5}, {"date": "Jul 16, 2022", "text": "Awesome!", "stars": 5}, {"date": "Jul 16, 2022", "text": "I wish this plugin had the visual mode to select and yank a text. Everything else it's perfect", "stars": 4}, {"date": "Jul 13, 2022", "text": "Top!", "stars": 5}, {"date": "Jul 12, 2022", "text": "Although it is great, but it will conflict when I using the [webssh](https://github.com/huashengdun/webssh).", "stars": 2}, {"date": "Jun 27, 2022", "text": "This is awesome.", "stars": 5}, {"date": "Jun 18, 2022", "text": "vomnibar feature is awesome!!!", "stars": 5}, {"date": "Jun 18, 2022", "text": "I love this extensions, so much so that I have developed a companion ext. called Tabbber! Check it out you will love it!\n\nBasically now with Vimium you don't have anymore the limit that you had before on new tabs :)", "stars": 5}, {"date": "May 27, 2022", "text": "Can't live without it", "stars": 5}, {"date": "May 23, 2022", "text": "Thank you, thank you, thank you!", "stars": 5}, {"date": "May 19, 2022", "text": "Perfect!", "stars": 5}, {"date": "May 4, 2022", "text": "Must have extension", "stars": 5}, {"date": "Apr 18, 2022", "text": "Exactly what I didn't know I needed!", "stars": 5}, {"date": "Apr 14, 2022", "text": "hail vim. thanks for this awesome utility.", "stars": 5}, {"date": "Apr 10, 2022", "text": "Amazing!", "stars": 5}, {"date": "Apr 1, 2022", "text": "Installing this was the best thing I've ever done in my life. Don't even try to argue this isn't #1", "stars": 5}, {"date": "Mar 7, 2022", "text": "Simply awesome. After I learned how to use Vim I tend to go for Vim mode on every other softwares and this exists. This one totally changes user experience on the web (especially for developers) and It cannot be replaced by others.\nBut the only flaw of this one is Vimium is not really consistent when it's on MacOS Monterey with M1 based processors. It crashes Chrome entirely upon you input commands sometimes. This especially happens a lot when creating new tab with `t`.", "stars": 4}, {"date": "Mar 3, 2022", "text": "Doesn't work on some pages (e.g. chrome web store :P), this is acceptable.\nBreaks other pages, not acceptable. When I'm writing in overleaf vim mode, even after marking this plugin to be inactive on this page, the escape key is broken so I can't actually use it.", "stars": 2}, {"date": "Feb 21, 2022", "text": "Recently it became scrolling down infinitely after pressing j... Can't stand this.", "stars": 2}, {"date": "Feb 16, 2022", "text": "love it", "stars": 5}, {"date": "Feb 10, 2022", "text": "This extension is a productivity booster, so much saved kepresses/scrolls etc. 10/10 saves my life everyday", "stars": 5}, {"date": "Feb 7, 2022", "text": "For anyone who has every used Qutebrowser and are familiar with quickmarks (typing a letter or string to open a webpage fast) You can replicate that here by creating a folder with your most used bookmarks and replacing the title with a single character or multiple (ex. for google i use g ) then if you press b on any webpage and then the letter or letters you assigned to your bookmark ,  it  will replicate the functionality of quickmarks", "stars": 5}, {"date": "Feb 4, 2022", "text": "i love it", "stars": 5}, {"date": "Jan 25, 2022", "text": "This is the single most amazing chrome add-on I've ever used. 5 stars cannot express my gratitude enough.\n\nOne suggestion: There are button-like objects that can be clicked with a mouse pointer, but not with Vimium.\n\nFor example, in the following page, there are buttons with a text 'Copy'.\nhttps://atcoder.jp/contests/dp/tasks/dp_s\nIf you click that with your mouse pointer, some texts are copied to your clipboard.\nApparently Vimium cannot 'click' this button. \nCould this problem be resolved?\nI... Show more", "stars": 5}, {"date": "Jan 23, 2022", "text": "Excellent extension to keep the user on the keyboard during web browsing.", "stars": 5}, {"date": "Jan 6, 2022", "text": "Floored by how good this extension is. The moment I stumbled across it I realized I've wanted this for years!!! Thank you for creating such a work of art!", "stars": 5}, {"date": "Jan 5, 2022", "text": "I like this. its a practice on using vim on linux terminal.\n\nbut my problem is how do you search a word and try to go to the next search result?", "stars": 4}, {"date": "Dec 23, 2021", "text": "Best for Vimer", "stars": 5}, {"date": "Dec 8, 2021", "text": "Awesome", "stars": 5}, {"date": "Dec 2, 2021", "text": "Excellent chrome plugin!!!", "stars": 5}, {"date": "Dec 1, 2021", "text": "Do you love it? I love it! Do you love it? Yes I do love it! -Me talking with myself", "stars": 5}, {"date": "Nov 18, 2021", "text": "I'm Lovin' it", "stars": 5}, {"date": "Nov 18, 2021", "text": "Very usefull", "stars": 5}, {"date": "Nov 16, 2021", "text": "Thank you very much!", "stars": 5}, {"date": "Nov 12, 2021", "text": "The best extension for Google Chrome ever.", "stars": 5}, {"date": "Nov 5, 2021", "text": "I felt compelled to write a review for this app; it's that good. enough said.\nIf you're a VIM geek, or a power user, you need this extension.", "stars": 5}, {"date": "Nov 3, 2021", "text": "Can't use Chrome w/out it. \n\nThis is how indispensable this extension is for me - I tried Vivaldi, and though I liked the browser, since it didn't properly work w/ Vimium, I am still using Chrome. This should be built into Chrome IMO! \n\nThank you for making such an awesome extension to make Chrome more helpful! 🙏🏽", "stars": 5}, {"date": "Nov 3, 2021", "text": "The most useful browser extension ever hands-down, can use my keyboard on the bed without the need for ever using the mouse. Just super comfortable and also productive as you continue using vim not only in the command line.", "stars": 5}, {"date": "Oct 29, 2021", "text": "One of the coolest thing I found in internet, I just started learning vim and learned some basics navigations in vim and immediately I fall in love with it. After that I was surfing web in chrome and navigating tabs using CTRL+TAB and CTRL+SHIFT+TAB, this was too much work for me after I saw what I can do in vim so I thought to make a chrome extension to introduce vim in browser, But before doing it searched on the web about this type of feature and I came across \"VIMIUM\". and guess what it i... Show more", "stars": 5}, {"date": "Oct 28, 2021", "text": "thanks for this. it would be cool if there would be a shortcut to deactivate vimium when running a website specific hotkey without having to add an exception rule.", "stars": 5}, {"date": "Oct 27, 2021", "text": "the best chrome extension for productivity , one of the best addon of any of the browser", "stars": 5}, {"date": "Oct 19, 2021", "text": "LOVE THIS!", "stars": 5}, {"date": "Oct 19, 2021", "text": "Absolutely essential for keyboard-loving power users. The ability to navigate URLs with the keyboard alone would make it a must-have for me, but it does so much more! Using other people's browsers now feels like having to move piles of gravel around with a pair of chopsticks.", "stars": 5}, {"date": "Oct 14, 2021", "text": "Would really love if this added support for creating and manipulating tab groups! I've been using the extension for years and its the best thing thats ever happened to my browsing experience. Now I use Tab groups daily though and I need to find a way to work that into my Vim habits!", "stars": 5}, {"date": "Oct 10, 2021", "text": "Thanks a lot! Life changing tool", "stars": 5}, {"date": "Oct 3, 2021", "text": "Vimium has been my browser companion for over 2 years!", "stars": 5}, {"date": "Sep 27, 2021", "text": "For those who are proficient or try to be proficient in vim, this is a must-have extension👏", "stars": 5}, {"date": "Sep 4, 2021", "text": "This extension is the best thing to happen to humanity.\nI've been using it for a while now and I really love.\nI have one suggestion that might make it actually better, sometimes I find my self stuck in some pages and in some other pages I can't put the focus where I want it, so I have to resort the mouse, it would be so awesome if theres a command similar to focusInput command that would draw horizontal and vertical lines on the screen and give every line a 'hint letter' and if you type the h... Show more", "stars": 5}, {"date": "Sep 1, 2021", "text": "very powerful !!!!   essencial for my work now.", "stars": 5}, {"date": "Aug 20, 2021", "text": "I came across this extension today and it's incredible.  It's allowed me to disable at least 5 others if not closer to 10.  I wish I would have found it sooner!", "stars": 5}, {"date": "Aug 20, 2021", "text": "Very Helpful", "stars": 5}, {"date": "Aug 17, 2021", "text": "Saves my wrist! Love this extension.", "stars": 5}, {"date": "Aug 12, 2021", "text": "this is a very nice extension,you've done an amazing job!", "stars": 5}, {"date": "Aug 6, 2021", "text": "And now I'm returning the mouse I ordered from amazon", "stars": 5}, {"date": "Aug 4, 2021", "text": "Vimium is the ideal of what an extension should be. Simple functionality, well supported, and not sketchy. A+", "stars": 5}, {"date": "Jul 31, 2021", "text": "Love it! I should have known this extension earlier!", "stars": 5}, {"date": "Jul 31, 2021", "text": "Amazing for keyboard lovers!", "stars": 5}, {"date": "Jul 25, 2021", "text": "Terrible.\nI keep reinstalling every six months to see if it has improved and the answer is always no.\n\nThe disable function doesn't work, so it's impossible to use default Youtube shortcuts.\nIt's impossible to have links activated by default. You have to hit \"f\" every single time you load a page and want to click a link.\nYou cannot hit a link by typing its innerText. You have to use the random string that the extension generates every time.\n\nBasically this app just creates more problems and w... Show more", "stars": 1}, {"date": "Jul 20, 2021", "text": "Loving it! Time saver! And mouse killer. Was confused about the Shift+T shortcut for a couple of years, but once I figured that out, it's all smooth sailing.", "stars": 5}, {"date": "Jul 18, 2021", "text": "I just love it!", "stars": 5}, {"date": "Jul 15, 2021", "text": "It's especially useful on large screens :)", "stars": 5}, {"date": "Jul 14, 2021", "text": "Must have on my every computer!", "stars": 5}, {"date": "Jul 10, 2021", "text": "Have used Vimium for 8 years, The best extensions, thanks a lot.", "stars": 5}, {"date": "Jul 1, 2021", "text": "Wow! This has increased my productivity by many folds.. Thanks a lot for creating this. Love....", "stars": 5}, {"date": "Jun 21, 2021", "text": "LOVE", "stars": 5}, {"date": "Jun 18, 2021", "text": "Breaks controls in dropdowns, e.g. sites menus or volume control in native video.", "stars": 2}, {"date": "Jun 14, 2021", "text": "This is a great extension but... There is an issue - I don't know where to post it. The various \"popups\" \"menu dialogs\"  just disapear when i click on them when using this extension. Please fix :(", "stars": 2}, {"date": "Jun 14, 2021", "text": "Dude you rock!", "stars": 5}, {"date": "Jun 10, 2021", "text": "Love it", "stars": 5}, {"date": "Jun 5, 2021", "text": "Awesome! I love it!", "stars": 5}, {"date": "May 25, 2021", "text": "Its the best extension i found in life. This makes browsing so easy.", "stars": 5}, {"date": "May 23, 2021", "text": "it's a excellent extension, but if it supports regular expression or posix regular expression.", "stars": 4}, {"date": "May 19, 2021", "text": "best extension ever! 😁👍🏻", "stars": 5}, {"date": "May 18, 2021", "text": "Can not ask for anything more.", "stars": 5}, {"date": "May 14, 2021", "text": "Has anyone tried Vimium C - All by Keyboard and can tell me the differences?\nhttps://chrome.google.com/webstore/detail/vimium-c-all-by-keyboard/hfjbmagddngcpeloejdejnfgbamkjaeg?hl=en", "stars": 5}, {"date": "May 1, 2021", "text": "Thanks guys! Extremely useful extension!", "stars": 5}, {"date": "Apr 27, 2021", "text": "Quickly one of my favourite extensions. This program combined with TalonVoice has allowed me to navigate the internet without forearm pain! Amazing extension, thank you very much!!", "stars": 5}, {"date": "Apr 24, 2021", "text": "My favorite extension! Thanks to developers.", "stars": 5}, {"date": "Apr 22, 2021", "text": "The more I use it, the more I love it.  Best thing since sliced bread.  Keep up the great work! and thank you!!", "stars": 5}, {"date": "Apr 22, 2021", "text": "fantastic extension, one feature I would love to see is a continuously on mode that doesn't open in new tabs. I understand this would have limited use but would be useful for me in specific situations like chatting on Facebook", "stars": 5}, {"date": "Apr 15, 2021", "text": "If you add \"ctrl + c\" command to exit from input mod, it make me happy (:", "stars": 5}, {"date": "Mar 20, 2021", "text": "Loving every minute with it!", "stars": 5}, {"date": "Mar 18, 2021", "text": "OMG just discovered this - thank you!", "stars": 5}, {"date": "Mar 9, 2021", "text": "Genius", "stars": 5}, {"date": "Mar 4, 2021", "text": "If you love the text editor vim(optional) and want to feel home in your chromium based browser like vivaldi or just chromium. this is what you need. fantastic! Im jumping around like a efficient mountain goat. five stars from me.", "stars": 5}, {"date": "Feb 19, 2021", "text": "the fact that it has no problem whatsoever with using mouse instead of keyboard is great", "stars": 5}, {"date": "Feb 14, 2021", "text": "Smooth flows, streamlines routine events requiring complex shortcuts or the trackpad.", "stars": 5}, {"date": "Feb 13, 2021", "text": "That's absolutely wonderful extension, and it's only unfortunate it's impossible to use it from \"New Tab\". I know it's some limitations of Chrome, not the extension, so I give it 5 stars anyway. Chrome team should provide some additional yet safe API to run such things like Vimium in new tabs too!", "stars": 5}, {"date": "Feb 13, 2021", "text": "Amazing extension, thanks a lot!", "stars": 5}, {"date": "Feb 11, 2021", "text": "I needed an extension that quickly places the focus in the first input field. A couple of default shortcuts do it in all contexts I've tested: 'gg' to scroll to top, followed by 'gi' to focus on input. Disabling/enabling mappings is remarkably simple; so that to start with I'm just using a few scrolling shortcuts together with the find-in-page shortcuts.\nI've even found out that you can suffix a search string with '\\r' to launch a regex search. This is really great!", "stars": 5}, {"date": "Feb 10, 2021", "text": "Amazing plugin. It makes Chrome feel as much an extra limb as vim. You will toggle between editing and StackOverflow with frightening speed, commanding the respect of your friends and colleagues.", "stars": 5}, {"date": "Feb 10, 2021", "text": "so cool ！！！i love it so much", "stars": 5}, {"date": "Feb 9, 2021", "text": "I love it! I used it for 5 minutes and already don't like my second browser that doesn't have it!\n\nI have a feature request: A checkbox to process links in the background when website loads up so I don't have to wait 1-2 seconds after pressing \"f\". If you accept PRs then a link to the github repo will do. :)", "stars": 5}, {"date": "Feb 6, 2021", "text": "This is the holy grail of Chrome plugins. Freaking thank you. I'm so happy with this plugin.", "stars": 5}, {"date": "Feb 2, 2021", "text": "awesome", "stars": 5}, {"date": "Jan 30, 2021", "text": "Straight in my top 3 extensions, up there with uBlock origins and dark reader.\nP.S. does it override < & > for playback speed on youtube videos? I can get to it in a more convoluted vimium way. I'd like to disable the binding that overrides this but not sure how.", "stars": 5}, {"date": "Jan 30, 2021", "text": "This extension is a must-have for a VIM user. I have been using it on Chrome for a very long time and it works perfectly. It even has the option to map keys which, in my opinion, is a great feature. Kudos to the developers.", "stars": 5}, {"date": "Jan 25, 2021", "text": "love this app so much!\n\nmy keyoard remap idea shared here below:\nmap a LinkHints.activateMode\nmap ; LinkHints.activateMode\nmap gk goPrevious\nmap gd goPrevious\nmap gj goNext\nmap gd goNext\nmap . removeTab\nmap x removeTab\nmap f scrollDown\nmap d scrollUp\nmap <backspace> goBack\nmap gn goBack\nmap <tab> goForward\nmap gp goForward\nmap s scrollLeft", "stars": 5}, {"date": "Jan 21, 2021", "text": "So useful", "stars": 5}, {"date": "Jan 19, 2021", "text": "Best extention for my productivity.", "stars": 5}, {"date": "Jan 17, 2021", "text": "The extension is perfect for me, but lastly it stop worked, I'll reinstall it because I'm much faster with it, But I don't know why, It is'n working", "stars": 4}, {"date": "Jan 13, 2021", "text": "Absolutely amazing extension for productivity. Very easy to learn using, and very easy to open up the settings window in case some feature was forgotten. \n\nHuge plus to not have to use the touchpad/mouse when browsing", "stars": 5}, {"date": "Jan 10, 2021", "text": "top", "stars": 5}, {"date": "Jan 6, 2021", "text": "I simply LOVE it!\nIt is a joy browsing with it, every day, every page. Thank you!", "stars": 5}, {"date": "Jan 3, 2021", "text": "Brilliant extension! Makes chrome feel like ~.", "stars": 5}, {"date": "Jan 2, 2021", "text": "It works really well and it is fantastic!", "stars": 5}, {"date": "Dec 29, 2020", "text": "epic", "stars": 5}, {"date": "Dec 24, 2020", "text": "FANTASTIC!!!", "stars": 5}, {"date": "Dec 21, 2020", "text": "This plugin is fantastic. Definitely deserves 5 stars.", "stars": 5}, {"date": "Dec 20, 2020", "text": "It's like everyone's walking and your riding a bike", "stars": 5}, {"date": "Dec 12, 2020", "text": "I LOVE IT", "stars": 5}, {"date": "Dec 2, 2020", "text": "this is a must! I love this add-on so so much =)", "stars": 5}, {"date": "Nov 21, 2020", "text": "thissss is amaaazing duddde thanksss", "stars": 5}, {"date": "Nov 21, 2020", "text": "#1 used plugin on my desktop. It takes chrome experience to the next level. I wanted to donate some money for it, but I could not find out where and how to do it. Please contact me and let me know how can I pay.", "stars": 5}, {"date": "Nov 6, 2020", "text": "If two hyperlink is nearby, their link-hint will overlap.", "stars": 5}, {"date": "Nov 2, 2020", "text": "Very useful for those who are used to Vim or that wants to navigate with their keyboard", "stars": 5}, {"date": "Nov 2, 2020", "text": "My new favorite extension. Fantastic work!", "stars": 5}, {"date": "Oct 31, 2020", "text": "This is the extension I have been looking for...   Found it about 5 years too late.   Thank you for making this", "stars": 5}, {"date": "Oct 31, 2020", "text": "This is literally the best thing I thought of searching for on Google, I feel like crying of happiness.", "stars": 5}, {"date": "Oct 29, 2020", "text": "Very good extension.\nPlease consider a option for integration with org mode. Something like a capturing option that can have tags and a optional description. That way, the bookmarks will be history.", "stars": 5}, {"date": "Oct 28, 2020", "text": "Never going back to using the mouse in Chrome :)", "stars": 5}, {"date": "Oct 25, 2020", "text": "Singlehandedly saved my wrist! Getting over the Initial learning curve pays off tenfold. Remap the keys if they don't work for you. I personally use wasd to scroll pages and switch tabs (apologies to the purists).", "stars": 5}, {"date": "Oct 24, 2020", "text": "As someone who sometimes has pain using a mouse, this extension is a job-saver", "stars": 5}, {"date": "Oct 20, 2020", "text": "best browsing experience ever", "stars": 5}, {"date": "Oct 19, 2020", "text": "the best i ever saw", "stars": 5}, {"date": "Oct 16, 2020", "text": "The one place you may get suck and have to use your mouse with this extension is when Ctlr + L into the address bar. Here is a really nice fix someone found. \n\nhttps://xavierchow.github.io/2016/03/07/vimium-leave-address-bar/", "stars": 5}, {"date": "Oct 8, 2020", "text": "Just loved It. Not a single word the first thing one should do after installing chrome.Feels like a keyboard ninja.", "stars": 5}, {"date": "Oct 6, 2020", "text": "Really enjoying this extension, very useful! 😀👍", "stars": 5}, {"date": "Oct 5, 2020", "text": "This should've been built in by default in all browsers ^.^", "stars": 5}, {"date": "Sep 29, 2020", "text": "This extension is pure awesomeness, Can the developer also implement the same concept for chrome devtools. I would surely Love to donate if the developer can also have this working for devtools too.", "stars": 5}, {"date": "Sep 18, 2020", "text": "love this extension", "stars": 5}, {"date": "Sep 10, 2020", "text": "love this plugin !!", "stars": 5}, {"date": "Sep 6, 2020", "text": "amazing extension for not using the keyboard", "stars": 5}, {"date": "Aug 27, 2020", "text": "great work, you guys have made something possible which I could not have even fathom of, as otherwise most extensions are hacks; and hence not so efficient.\nAnyways, I feel sometimes  I want to toggle disable vimium to use some rare thing on a page(might vary from person to person, but internet is random) and hence instead of complete disable should make me fall in love with this even more.", "stars": 4}, {"date": "Aug 22, 2020", "text": "Fantastic extension! Guys you really did great job \"mostly\" for programmers. Thanks!", "stars": 5}, {"date": "Aug 20, 2020", "text": "Fantastic!", "stars": 5}, {"date": "Aug 4, 2020", "text": "First thing I install when setting up a new Chrome browser.", "stars": 5}, {"date": "Aug 2, 2020", "text": "it's only been 2 minutes, since I've discovered this extension. I'm in love! I have everything I need.", "stars": 5}, {"date": "Jul 31, 2020", "text": "very productive,very expressive", "stars": 5}, {"date": "Jul 27, 2020", "text": "Best plugin I used!!!\nCould you add 2 feature to make it more brilliant?\n- triggeri Vimium commands on keyboard keys without relation to language (not only English). Use case: no need to switch language while typing on non-English languages\n- leave address bar on `Escape` key: when the focus is on address bar, there is no Vimium way to leave it, needs to use mouse or other workarounds. I did not found better way than `Command`+`F` and search something :(", "stars": 5}, {"date": "Jul 27, 2020", "text": "Vimium changes my life forever =)))", "stars": 5}, {"date": "Jul 23, 2020", "text": "This is the best thing since sliced bread...  maybe even better than that!", "stars": 5}, {"date": "Jul 23, 2020", "text": "That's what I am after for a long time!!!", "stars": 5}, {"date": "Jul 21, 2020", "text": "This is REALLY useful for me. Thx sir.", "stars": 5}, {"date": "Jul 20, 2020", "text": "just amazing!", "stars": 5}, {"date": "Jul 17, 2020", "text": "make life easier", "stars": 5}, {"date": "Jul 15, 2020", "text": "As of this writing this extension doesn't work out of the box. According to this bug report: \n\nhttps://github.com/philc/vimium/issues/3617\n... it's a bug with Chrome.\n\nAny idea if this will ever get fixed?", "stars": 2}, {"date": "Jul 5, 2020", "text": "Simply incredible <3", "stars": 5}, {"date": "Jun 25, 2020", "text": "great", "stars": 5}, {"date": "Apr 12, 2020", "text": "New Feature Request: add a shortcut to show a popup window with a table of contents generated from h1 - h6 headers of the current page like implemented in the other \"Smart TOC\" Chrome extension.", "stars": 5}, {"date": "Apr 6, 2020", "text": "Great extension! Would love to see the ability to zoom via shortcut and use regex while searching though.", "stars": 5}, {"date": "Apr 6, 2020", "text": "My Productivity goes up. Thanks", "stars": 5}, {"date": "Apr 1, 2020", "text": "It's awesome, especially the quick help (?). Thank you!", "stars": 5}, {"date": "Mar 31, 2020", "text": "Absolutely love it. vim for the victory", "stars": 5}, {"date": "Mar 29, 2020", "text": "hi, thank you for this tremendous extension. One thing I wondered was, how to redefine the escape key? If it's not yet in place, could we get that in the future?", "stars": 5}, {"date": "Mar 20, 2020", "text": "Absolute beast of a plugin", "stars": 5}, {"date": "Mar 15, 2020", "text": "amazing!", "stars": 5}, {"date": "Mar 8, 2020", "text": "I am much to lazy to move my hand 4 inches to the right to grab my mouse which is one of the many reasons I started using Vim. The only time I found myself using it was when I had to access some website to reads docs or something and now my laziness can be satiated with this wonderful extension!!!", "stars": 5}, {"date": "Mar 8, 2020", "text": "I getting some repetitive strain injury in my should because of using the mouse. So I'm try to go mouse less. Vim, tiling window manager. This extension just fits into this perfectly.", "stars": 5}, {"date": "Mar 4, 2020", "text": "Great extension. I'd give it 10 stars if it were possible!", "stars": 5}, {"date": "Mar 4, 2020", "text": "Fantastic, now I only need to replace all editors with Neovim :D", "stars": 5}, {"date": "Mar 4, 2020", "text": "Without this extension I wouldn't use Chrome at all. Works perfectly, many customisation options available.\n\nWell done!", "stars": 5}, {"date": "Feb 28, 2020", "text": "how do i go back in new tab like middle clicking back icon?", "stars": 4}, {"date": "Feb 24, 2020", "text": "I love how smooth the scrolling of J/K is.", "stars": 5}, {"date": "Feb 20, 2020", "text": "This changes everything. Makes browsing faster and better.", "stars": 5}, {"date": "Feb 18, 2020", "text": "Much faster and enjoyable than mouse. I have bad problems with visual mode, but even this won't make me rate Vimium with less than 5 stars", "stars": 5}, {"date": "Feb 16, 2020", "text": "Ah vimium, where have you been all my life?", "stars": 5}, {"date": "Feb 14, 2020", "text": "This is actualy very good. very efficiant and a modern way to nagivate the web without using the mouse all the time.\nThank you very much. you deserve 5/5", "stars": 5}, {"date": "Feb 14, 2020", "text": "Thx! Can you add reader mode for webpages something as plugin Reader View?", "stars": 5}, {"date": "Feb 11, 2020", "text": "This is the best extension. This functionality should be standard.", "stars": 5}, {"date": "Feb 11, 2020", "text": "I used to love this extension, but I see no reason why would it need to read all the data I copy and paste, as well as read my browsing history. I am uninstalling it, as it allows to collect too much information about users of this extension.", "stars": 2}, {"date": "Feb 11, 2020", "text": "Love this extension. Very useful!!!", "stars": 5}, {"date": "Feb 11, 2020", "text": "Been using and loving it for years. Eliminates the need for the mouse in most circumstances.", "stars": 5}, {"date": "Feb 10, 2020", "text": "Perfect, for real.", "stars": 5}, {"date": "Feb 10, 2020", "text": "Strange permission request! Why since today the extension requires me to enable 'modify data that you copy and paste' ?", "stars": 4}, {"date": "Feb 10, 2020", "text": "A can't think how I'd be able to surf the net without vimium anymore.", "stars": 5}, {"date": "Feb 10, 2020", "text": "A must have extension. It saves my shoulder.", "stars": 5}, {"date": "Feb 7, 2020", "text": "great plugin", "stars": 5}, {"date": "Feb 6, 2020", "text": "Great so far. One confusing thing: to open links you use f for current tab, & F for new tab. The labels show up capitalized suggesting to some people that you should press shift+letter, but that will open the link in a current tab. You simply type the letter without shift. One question for the developer: Is there a list of specific key mappings for visual mode?", "stars": 5}, {"date": "Jan 30, 2020", "text": "BEST extension!! Only one suggestion: since we need to use key f/F to launch it, can we only use those 15 keys on the left to click on the links? That means we can use it by only one hand (left hand). There are 15 keys, so you have 210 permutations. It should be enough for the links on the pages. If not, then use the right hand.", "stars": 5}, {"date": "Jan 30, 2020", "text": "My browser is all grown up now, it's such a neat experience. Full keyboard control, and powerful! I need this everywhere.", "stars": 5}, {"date": "Jan 29, 2020", "text": "Fantastic Extension!", "stars": 5}, {"date": "Jan 22, 2020", "text": "Maybe add an option to reload all tabs, please, then I wouldn't have an extension for doing such a negligible task that you should have implemented long ago.\nEdit:\nI'm sorry, I didn't read the documentation, all I had to do was to press something like „99r“ for all the tabs to reload. Easily the best extension in the whole Chrome store.", "stars": 5}, {"date": "Jan 17, 2020", "text": "Awesome!!", "stars": 5}, {"date": "Jan 7, 2020", "text": "That's exactly what I need for improving productivity.", "stars": 5}, {"date": "Dec 27, 2019", "text": "hello,I like using the Vimium very much,but now,it may be have some issue.The Vimium icon isn't highligth,it's always gray.And it supports fewer pages than before.", "stars": 5}, {"date": "Dec 25, 2019", "text": "Man, as a vim fanboy, this extension puts all together.\nThank you.", "stars": 5}, {"date": "Dec 23, 2019", "text": "Can't beat it. I rarely need to lift my hands from keyboard. \nIs it possible to add Zoom functionality like : zi / zo for zoom in / out ?", "stars": 5}, {"date": "Dec 19, 2019", "text": "Amazing productivity app. I do think the 'f' character should be excluded from the option since it could cause some extra mental awareness not to use. I tend to want to use f again when I am in selection mode in order to get it restarted", "stars": 5}, {"date": "Dec 14, 2019", "text": "I can not imagine my life without vimium", "stars": 5}, {"date": "Dec 13, 2019", "text": "Fantastic!", "stars": 5}, {"date": "Dec 7, 2019", "text": "One key \"x\" to close current tab immediately！What a fool design! \nWithout a tip, what I wrote so hard is gone!\n\nFunk！", "stars": 1}, {"date": "Dec 5, 2019", "text": "cool", "stars": 5}, {"date": "Nov 18, 2019", "text": "It worked fine before, but now every time I turn on the short cuts, they only show up at the bottom of the page", "stars": 1}, {"date": "Nov 15, 2019", "text": "Fantastic extension. Wish I'd known about it longer. \n\nMy one frustration is that I can't seem to quickly copy the *address* of a link on the page. I can *follow* a link with f/F, but I want to have the same little popup interface where each link has a tag associated with it so I can quickly copy the link address. That would be fantastic! Still a 5-star extension though. Fast, has integrated help. Really well thought out.", "stars": 5}, {"date": "Nov 6, 2019", "text": "I really don’t have enough address allocation after clicking \"ge\", because I want to enter a new address, but I need to erase the previous one.", "stars": 4}, {"date": "Nov 6, 2019", "text": "cool", "stars": 5}, {"date": "Nov 5, 2019", "text": "Great app but doesnt work on youtube anymore It seems.", "stars": 5}, {"date": "Nov 5, 2019", "text": "Love search suggestions in vomnibox. Everything fine except occasionally doesn't work. I'll try Vimium C because of that", "stars": 3}, {"date": "Nov 4, 2019", "text": "If I could only have one chrome extension, this would be it. Even over Adblock! It makes navigating the internet like 30% faster. (It's also helpful for building muscle memory for using vim)", "stars": 5}, {"date": "Nov 1, 2019", "text": "Major productivity boost! This extension is the gold standard of how all chrome extensions should be developed. No bugs, and just the right amount of functionality!", "stars": 5}, {"date": "Oct 31, 2019", "text": "LOVE it. This is the better app than every other apps.", "stars": 5}, {"date": "Oct 27, 2019", "text": "installed in second from switching to vi in ubuntu. Just fine. All praise to the God! \nThank you, developers.", "stars": 5}, {"date": "Oct 24, 2019", "text": "I really really love it!!!", "stars": 5}, {"date": "Oct 24, 2019", "text": "Looooove it really~", "stars": 5}, {"date": "Oct 21, 2019", "text": "Very cool", "stars": 5}, {"date": "Oct 19, 2019", "text": "The best extension ever.", "stars": 5}, {"date": "Sep 27, 2019", "text": "The best extension for this purposes! I use it for bookmark ( [b] key) like rofi-menu in Linux :)", "stars": 5}, {"date": "Sep 25, 2019", "text": "Absolutely loving it. This should come default with Chrome so more people can discover the power of vi", "stars": 5}, {"date": "Sep 6, 2019", "text": "It's greatest thing that I ever seen!", "stars": 5}, {"date": "Sep 5, 2019", "text": "Absolutely loved it. Thank you for creating this extension.", "stars": 5}, {"date": "Aug 28, 2019", "text": "2020/3/28\nToday, I find \"Vimium\" offered a \"Hovering over links using LinkHints\" in version 1.66. Thanks for that. Alough I have to \"map\" it by myself for using it.  :D:D\n\nthanks for this tool. I want to get a feature in this tool. \"f\" can open a url and \"yf\" can copy a url, but sometime I want to copy a describing text of url. eg:the \"W3School\" in \" <a href=\"http://www.w3school.com.cn\">W3School</a>\". I want to a feature can foucus a URL like \"f\", but only focusing not openning, then can use ... Show more", "stars": 5}, {"date": "Aug 27, 2019", "text": "One more here..... once you use this tool, you can never go back. Genius!", "stars": 5}, {"date": "Aug 23, 2019", "text": "Very cool", "stars": 5}, {"date": "Aug 16, 2019", "text": "It deserves a five star if ·Excluded URLs· could work properly on pop-up standalone windows(with unchangable address bar)", "stars": 4}, {"date": "Aug 11, 2019", "text": "Until you use this, it's hard to appreciate how slowly you've been surfing all along.", "stars": 5}, {"date": "Aug 9, 2019", "text": "this is insanely amazing. i recently started having to work off site (aka not on my computer/laptop) and i sincerely wish the functionality it provides was built into chrome.\n\nmad props to the dev.", "stars": 5}, {"date": "Aug 8, 2019", "text": "vim is an lanuage, learn once, use where.", "stars": 5}, {"date": "Jul 31, 2019", "text": "This is the best extension to chromium. Period.", "stars": 5}, {"date": "Jul 29, 2019", "text": "Unbelievably AMAZING!!! Best extension ever", "stars": 5}, {"date": "Jul 17, 2019", "text": "Not maintained anymore.", "stars": 1}, {"date": "Jul 15, 2019", "text": "It is useful tool for me, thanks a lot. Save time,time is monkey,change life mode", "stars": 5}, {"date": "Jul 15, 2019", "text": "lovin it and starting to get used to it. It makes clocking links, switching between tabs, and overall page navigation much smoother and easier. One thing I find annoying is that when there are many many links on the page and you press f, some links overlap, it would be convenient to include a toggle such as pressing shift so that some yellow boxes underneath are switched with the ones on top. Please fix!", "stars": 5}, {"date": "Jul 9, 2019", "text": "not bad!", "stars": 5}, {"date": "Jul 6, 2019", "text": "This extension is sick! Wish the developers all the best!", "stars": 5}, {"date": "Jun 25, 2019", "text": "Refuses to run on any page.", "stars": 1}, {"date": "Jun 24, 2019", "text": "I love this one. I have a suggestion though. When I open the bookmarks list for example, I would like to be able to hit ctrl+c to copy the currently selected bookmark link. I hope you implement it because I use it a lot. Cheers", "stars": 5}, {"date": "Jun 18, 2019", "text": "Loving it <3", "stars": 5}, {"date": "Jun 17, 2019", "text": "It's good. However I met a problem, I can not use ctrl+e to search when using it. A few days ago, It still works well.", "stars": 5}, {"date": "Jun 15, 2019", "text": "Love it! The most used extension I have.", "stars": 5}, {"date": "Jun 2, 2019", "text": "love this soooo muchhh, once you know it, ,there's no way back ^^ , hope there would be a version for Desktop", "stars": 5}, {"date": "May 30, 2019", "text": "Perfect for Vim users. Satisfied :) Thanks", "stars": 5}, {"date": "May 24, 2019", "text": "why  my browser can not use it.follow is the message:\nVimium is not running on this page.\nYour browser does not run web extensions like Vimium on certain pages, usually for security reasons.\nUnless your browser's developers change their policy, then unfortunately it is not possible to make Vimium (or any other web extension, for that matter) work on this page", "stars": 5}, {"date": "May 23, 2019", "text": "Great extension. It works in Chrome but it has issues in Brave.", "stars": 4}, {"date": "May 23, 2019", "text": "This is one of the critical extenstions you must have\nand must be the 2nd one to install right after you installed chrome on your device.", "stars": 5}, {"date": "May 16, 2019", "text": "This was great until the latest version of chrome broke a couple key features (search and copying the url)\nThe maintainers are no longer active on this project.", "stars": 1}, {"date": "May 10, 2019", "text": "Why can I not copy the current url by pressing yy anymore?", "stars": 5}, {"date": "May 8, 2019", "text": "I give 2 stars only because as long as I remove it from chrome, my laptop keyboard's shift  keys(both left and right) will not work(not just on chrome, it is globally on Windows), but all the external keyboard' shift keys work fine! Could you please tell me why?", "stars": 2}, {"date": "May 6, 2019", "text": "Absolutely my #1 extension across Chromium browsers and FF! Cannot express my gratitude enough to the author(s).", "stars": 5}, {"date": "May 1, 2019", "text": "It's always my friend, but when my tendinitis flares up, it's indispensable.", "stars": 5}, {"date": "Apr 27, 2019", "text": "Vimium's search function , the \"/\", is not working on Version 74.0.3729.108 (Official Build) Arch Linux (64-bit). \nForm shows up while hitting the \"/\", but i can't type any words in it.\nthe previous chromium version can works.", "stars": 5}, {"date": "Apr 26, 2019", "text": "The best extension ever!", "stars": 5}, {"date": "Apr 12, 2019", "text": "good,", "stars": 5}, {"date": "Apr 4, 2019", "text": "The best extension for chrome", "stars": 5}, {"date": "Apr 2, 2019", "text": "I don't have the words to describe how amazing this extension is. THANK YOU!", "stars": 5}, {"date": "Apr 1, 2019", "text": "Best thing people invited    * * * * *", "stars": 5}, {"date": "Mar 30, 2019", "text": "This extension is amazing. Must have.", "stars": 5}, {"date": "Mar 29, 2019", "text": "Great extensions for vi nerds <3", "stars": 5}, {"date": "Mar 13, 2019", "text": "Superb plugin. It's a must for every Vim user. Just Love it <3.", "stars": 5}, {"date": "Mar 13, 2019", "text": "Incredible!", "stars": 5}, {"date": "Mar 10, 2019", "text": "I have reasons to not use the mouse.   This extension improves chrome's accessibility for mouse challenged people.  It is truly amazing.", "stars": 5}, {"date": "Mar 9, 2019", "text": "Best Thing Ever Made!! LOVE IT ❣", "stars": 5}, {"date": "Mar 3, 2019", "text": "Really good extension, keeps the intuitive commands of vim and creates new intuitive commands for browsing the internet.", "stars": 5}, {"date": "Feb 17, 2019", "text": "The best extension for google chrome ever <3", "stars": 5}, {"date": "Feb 16, 2019", "text": "Very good for practising \"Kaizen\" when your browsing on the web.", "stars": 5}, {"date": "Feb 14, 2019", "text": "The best extension I've ever seen!!!! OMG so good for vim user. Why didn't I search for this earlier?", "stars": 5}, {"date": "Feb 14, 2019", "text": "Works great. Makes it much more efficient to browse the web.", "stars": 5}, {"date": "Feb 12, 2019", "text": "No matter where you come from, \nNo matter what your languages are, \nAs long as you use Vimium, \nYou are my dear friend !", "stars": 5}, {"date": "Feb 2, 2019", "text": "Love this extension! so easy to navigate the web from the keyboard, and works well with apps that already have shortcuts by letting me decide which shortcut key I want (either vimium's or the web apps)", "stars": 5}, {"date": "Jan 30, 2019", "text": "wonderful!!", "stars": 5}, {"date": "Jan 27, 2019", "text": "This extension makes web browsing so much easier and more enjoyable.  \n\nHas anyone noticed that bookmarklets no longer can be opened via the omnibar?", "stars": 5}, {"date": "Jan 12, 2019", "text": "Best plugin ever made. I'm a Vim user, alway thought of having something like Vim for browser and finally I found it. Feel awesome to use. Thank you so much for such great effort. I owe you a beer.", "stars": 5}, {"date": "Jan 9, 2019", "text": "lovely!!", "stars": 5}, {"date": "Jan 8, 2019", "text": "The best extension I've ever came across. I love this for productivity and often prefer it over my mouse.", "stars": 5}, {"date": "Jan 7, 2019", "text": "I love this one. If 'cw', 'caw', 'yy' and 'yap' operations are possible, it will be way beyond perfect.", "stars": 5}, {"date": "Jan 6, 2019", "text": "I love it", "stars": 5}, {"date": "Dec 28, 2018", "text": "Great extension, very useful. it takes time to practice, but once you got it, it seems unnatural to live without that. great+++", "stars": 5}, {"date": "Dec 26, 2018", "text": "There's no going back, and I wouldn't even consider changing to another browser if they can't also support this extension. It's incredible.", "stars": 5}, {"date": "Dec 21, 2018", "text": "despite the limitations induced by Google in the Chromium browser this extension is an excellent productivity enhancement", "stars": 5}, {"date": "Dec 21, 2018", "text": "Please let us change style and position of the notification tip (Yanked something...).", "stars": 5}, {"date": "Dec 5, 2018", "text": "Excellent application. Works flawlessly, the Vomnibar is simply brilliant, it is highly tunable... I cannot think of any improvement. Hats off. If you like Vi, you definitely NEED this.", "stars": 5}, {"date": "Nov 30, 2018", "text": "great! it even allows you to simulate mouse click events on buttons. the best plugin for keyboard navigation so far. not perfect, but pretty good.", "stars": 5}, {"date": "Nov 27, 2018", "text": "Great plugin! Less time wasted to move hand to the mouse, more productivity!", "stars": 5}, {"date": "Nov 26, 2018", "text": "It's perfect!  Thank you for this amazing extension. :-)", "stars": 5}, {"date": "Nov 15, 2018", "text": "Heads up to any Vivaldi users - having this plugin enabled in Vivaldi (2.1) frequently causes websites to lock up and also freeze the Vivaldi interface a small bit, making it impossible to close out of tabs. Able to replicate on 5 devices across the spectrum - seems to cause the most problems on very JS-heavy sites like new Reddit/Prismic editor. I'm not sure if the blame for this goes to Vimium or Vivaldi, so I'm going to remove that from the rating. \n\nThat aside - Absolutely love it in Chro... Show more", "stars": 5}, {"date": "Nov 5, 2018", "text": "Great plugin! Throw the mouse away!", "stars": 5}, {"date": "Nov 5, 2018", "text": "The most important extension I have. Thanks so much! Works beautifully!", "stars": 5}, {"date": "Nov 4, 2018", "text": "can't live without this plugin", "stars": 5}, {"date": "Oct 29, 2018", "text": "Exactly what I was looking for. Thx!", "stars": 5}, {"date": "Oct 27, 2018", "text": "Thanks. It's dope.", "stars": 5}, {"date": "Oct 27, 2018", "text": "As a full time vim user, having vim in the browsers is wonderfully amazing!\n\nDon't think, just use this!", "stars": 5}, {"date": "Oct 24, 2018", "text": "Nice extension but I think it tries to do more than necessary", "stars": 4}, {"date": "Oct 8, 2018", "text": "Dude, could you make `:set hls` a default option? We really need this. Or could you make `/` the same as `ctrl+f`.", "stars": 4}, {"date": "Oct 5, 2018", "text": "I hope 'F' could not be a link shortkey.", "stars": 4}, {"date": "Sep 30, 2018", "text": "Definitely deserves a 5 star rating, in my opinion this is the best extension for chrome i tried till now\ngreatly enhances your browsing experience", "stars": 5}, {"date": "Sep 29, 2018", "text": "while pressing the \"b\", I can see the input box, but the bookmarks won't show, please check out this matter", "stars": 3}, {"date": "Sep 21, 2018", "text": "This is a wonderful extension! Many thanks to the authors! I especially enjoy the productivity benefits of having tab navigation shortcuts, search functionality similiar to Vim/NeoVim and the ability to search in bookmarks. Excellent from gg to G!", "stars": 5}, {"date": "Sep 21, 2018", "text": "So so cool!", "stars": 5}, {"date": "Sep 21, 2018", "text": "A must have to your daily work (entertainment), A true companion to Chrome", "stars": 5}, {"date": "Sep 19, 2018", "text": "Super cool and boost my productivity.", "stars": 5}, {"date": "Sep 18, 2018", "text": "Great!\nDoesn't work in all pages (new tab in chrome, acrobat pdf viewer, etc.) but still really helpful.", "stars": 5}, {"date": "Sep 11, 2018", "text": "Thanks for the great work! It is really the faster vim layer for chrome", "stars": 5}, {"date": "Sep 7, 2018", "text": "like this page not work .new label and special page.keep going", "stars": 5}, {"date": "Aug 30, 2018", "text": "Great extension! Love it! Is it possible to do vimium  can define as link elements with \"style cursor: pointer\"?", "stars": 5}, {"date": "Aug 28, 2018", "text": "This is the hands-down the best Chrome extension and the primary reason why I still use Chrome. It's a tremendously efficient way to browse the web and the author has struck just the right balance between intuitive and deep.\n\nMy only wish is that it had a shortcut for \"Close other tabs\", which I think you can currently only get to by right clicking a tab or installing another extension.\n\nUpdate: You can add your own mapping for \"Close other tabs\" in Vimium's options. Example: map <c-o> closeO... Show more", "stars": 5}, {"date": "Aug 19, 2018", "text": "I want to be able to change the hotkeys for this addon. Make it possible and it's a 5/5.", "stars": 2}, {"date": "Aug 10, 2018", "text": "is very good for my work", "stars": 5}, {"date": "Aug 9, 2018", "text": "Seems great, except unfortunately it seems to mess-up my youtube controls even though youtube is excluded.", "stars": 4}, {"date": "Aug 8, 2018", "text": "fantastic extension!", "stars": 5}, {"date": "Aug 7, 2018", "text": "unusable.  works initially then just randomly stops working at all.", "stars": 1}, {"date": "Aug 4, 2018", "text": "Awesome extension! I use it daily and cannot imagine not having this.", "stars": 5}, {"date": "Jul 31, 2018", "text": "Super awesome, will be a part of my daily workflow. Please consider adding a full-screen shortcut.", "stars": 5}, {"date": "Jul 29, 2018", "text": "I can't live without it anymore.", "stars": 5}, {"date": "Jul 20, 2018", "text": "My productivity is of the charts with this plugin.\nRespect", "stars": 5}, {"date": "Jul 19, 2018", "text": "Amazing plugin. I hate using a mouse (and trackpads are worse), and have configured my system to be able to do almost anything without one, but I was always pained by the need to break out the trackpad for using the web.\n\nNo longer!", "stars": 5}, {"date": "Jul 17, 2018", "text": "Amazing productivity booster for a keyboard fanatic.", "stars": 5}, {"date": "Jul 9, 2018", "text": "Single best extension I have ever used. I struggle to use any browser that doesn't have this installed!", "stars": 5}, {"date": "Jul 9, 2018", "text": "This is a very good extension, however; I normally use the DVORAK keyboard layout so if I want to use the extension, I need to switch from DVORAK to QWERTY constantly. Other than this small problem, this is great!", "stars": 4}, {"date": "Jul 4, 2018", "text": "AMAZING extension. I didn't think that the concept of having Vim here was possible", "stars": 5}, {"date": "Jul 4, 2018", "text": "Must-have.  Actually start using your web browser as a tool, like a text editor but for browsing, without needing to constantly grab the mouse and drag it to the top or side.\n\nAs an added bonus, helps remember Vim commands!  (Just press '?')", "stars": 5}, {"date": "Jun 29, 2018", "text": "Works like a charm!", "stars": 5}, {"date": "Jun 20, 2018", "text": "I can't live without this plugin, it's amazing", "stars": 5}, {"date": "Jun 17, 2018", "text": "4,5 stars\nWhy not allow injection? But an oh-soo amazing app either way !", "stars": 4}, {"date": "Jun 14, 2018", "text": "This is really understandable and extremely convenient. For this time I can't find much more suitable for me. But there are still a few changes are desirable. Hangin over of element, right click, and improvements for finding links on page.", "stars": 5}, {"date": "Jun 9, 2018", "text": "if you're looking for a way to browse without the mouse and you are somewhat familiar with vim (although that is not necessary at all), Vimium is what you're after", "stars": 5}, {"date": "Jun 8, 2018", "text": "Love it, use it all day, everyday.", "stars": 5}, {"date": "Jun 7, 2018", "text": "cool, but, any way to open a context menu? i mean, to download images and all that stuff, just having a function to download images would do the trick for me.", "stars": 3}, {"date": "Jun 7, 2018", "text": "This is great! Thank you!!!", "stars": 5}, {"date": "May 18, 2018", "text": "Could you please implement a function to temporarily disable the extension or to ignore the next few keystrokes.", "stars": 3}, {"date": "May 17, 2018", "text": "It's a must-have. Is it possible to repeat the last action using period \".\"? Please implement that and it'd be 5 stars! It's useful for when you need to press a button (e.g. a sound play button) repeatedly without having to type 3 letters.", "stars": 4}, {"date": "May 15, 2018", "text": "Super love it, the most amazing extension I have ever used!!", "stars": 5}, {"date": "May 11, 2018", "text": "So cool extension,love it best!Amazing!", "stars": 5}, {"date": "May 9, 2018", "text": "Awesome idea, thanks for making this.", "stars": 5}, {"date": "May 3, 2018", "text": "good to have such app", "stars": 5}, {"date": "Apr 30, 2018", "text": "Fantastic. Fantastic. Fantastic. The best plugin I've ever used.", "stars": 5}, {"date": "Apr 20, 2018", "text": "Would love an easy way to remap to have the same physical locations, in Colemak.", "stars": 4}, {"date": "Apr 17, 2018", "text": "Really lovely!", "stars": 5}, {"date": "Apr 14, 2018", "text": "Idea: Add option to hover \n.over a link\nAnother idea: Add key to disable and enable (faster than adding rule via GUI). Would be really useful for sites like youtube which have their own keyboard shortcuts.", "stars": 5}, {"date": "Apr 12, 2018", "text": "]] shortcut does not work at bing.com", "stars": 5}, {"date": "Apr 9, 2018", "text": "this plugin is awesome.", "stars": 5}, {"date": "Apr 3, 2018", "text": "addict to this plugin. install it to every instance i can access. most of the time can surf without mouse. Great job!", "stars": 5}, {"date": "Mar 22, 2018", "text": "It appears that some key mappings are not working in local address (nextTab and previousTab are working while scrollDown, scrollUp, scrollPageDown and scrollPageUp are not working) and even not automatically run in a local path when I need to open my locally saved webpage. So I suggest to test the functionality in a local address and in local path when opening a webpage like html, still this is a great extension. I hope to fix the issue and add the functionality to local address and local pat... Show more", "stars": 4}, {"date": "Mar 16, 2018", "text": "Addictive extension. I cannot imagine work on Chrome without it.", "stars": 5}, {"date": "Mar 7, 2018", "text": "Couldn't use a browser w/o it.", "stars": 5}, {"date": "Mar 2, 2018", "text": "this is brilliant. I use it every day.", "stars": 5}, {"date": "Feb 23, 2018", "text": "I believe some features from this extension should be built-in in chrome by default, especially that fuzzy search bar which appears in the center. Great job.", "stars": 5}, {"date": "Feb 21, 2018", "text": "Fantastic!", "stars": 5}, {"date": "Feb 20, 2018", "text": "perfect for the keyboard user", "stars": 5}, {"date": "Feb 19, 2018", "text": "always loved that in luakit, thanks!", "stars": 5}, {"date": "Feb 17, 2018", "text": "Brilliant!", "stars": 5}, {"date": "Feb 14, 2018", "text": "it is really time saving", "stars": 5}, {"date": "Feb 14, 2018", "text": "A hotkey for \"Select All\" would be great for when we have to delete the old text from an input field. By the way you have changed my life.", "stars": 5}, {"date": "Feb 13, 2018", "text": "I'd like to switch on/off using shortcut key", "stars": 5}, {"date": "Feb 8, 2018", "text": "Favorite one.", "stars": 5}, {"date": "Feb 6, 2018", "text": "clears console at random time. \nhad to go turn off extensions one by one to find who does this.", "stars": 2}, {"date": "Feb 4, 2018", "text": "This is an AWESOME extension. Love from a vim user. However, I find it sometimes not working suddenly. Need to refresh the page to fix it.", "stars": 5}, {"date": "Feb 1, 2018", "text": "Fantastic but with little imperfection.\n\nI find that chrome will automaticlly clean the console messages when Vimium were enabled.\n\nHope you can solve it. :)", "stars": 4}, {"date": "Jan 31, 2018", "text": "I love VIM so this is must have for actual \"hacker\" joke", "stars": 5}, {"date": "Jan 27, 2018", "text": "Fantastic in nearly every way.", "stars": 5}, {"date": "Jan 26, 2018", "text": "Best. Extension. Ever.", "stars": 5}, {"date": "Jan 14, 2018", "text": "Excellent, makes it very easy to set up custom shortcuts to sites, as well as the default commands being great! Developer is responsive on GitHub.", "stars": 5}, {"date": "Jan 8, 2018", "text": "It is a good tool,I'm learning it now,I want to have a chinese version.", "stars": 5}, {"date": "Jan 1, 2018", "text": "Best extension in chrome", "stars": 5}, {"date": "Dec 28, 2017", "text": "I will just repeat what other people have said before me, but this is extension is simply amazing. Excellent especially as a way of committing a few basic commands to memory when learning Vim. And the 'f' + link command is absolutely stunning. It single handedly makes your mouse pretty much useless. 5 stars, thanks for making this extension", "stars": 5}, {"date": "Dec 28, 2017", "text": "Thanks developers for this cool tool", "stars": 5}, {"date": "Dec 19, 2017", "text": "I'm learning VIM and I installed this just to get used to the basic movement keys. Turns out the extension is amazing. My favourite feature is using 'f' to assign letter combinations to all links on a page, which can then be followed with the keyboard.", "stars": 5}, {"date": "Dec 16, 2017", "text": "awesome extension ever for chrome", "stars": 5}, {"date": "Dec 14, 2017", "text": "Love it!\n\nFor a long time I thought that it is missing a feature and disliked moving from VimFx to Vimium (the feature was editing the url and I was used to having it at \"o\", in Vimium it is achieved by \"ge\" and \"gE\") but after finding it- I started loving this add-on and I definitely recommend it to everyone :D", "stars": 5}, {"date": "Dec 13, 2017", "text": "An obvious 5 star extension. Thank you for making it.", "stars": 5}, {"date": "Dec 13, 2017", "text": "This is plugin ARE VERY GOOD!!!\n\nwhile (true) {\n    Thanks!!!\n}", "stars": 5}, {"date": "Dec 12, 2017", "text": "I can't ever go back from this, I love it! \nBefore, scrolling with the keyboard was limited to space and shift+space, which was always way too much and would make me lose my place. Scrolling, tab navigation, closing and opening tabs, going to a URL, copying a URL, going back or forward in history, all with one or two keys is absolutely amazing!", "stars": 5}, {"date": "Dec 9, 2017", "text": "https://microsoftedge.microsoft.com/addons/detail/aibcglbfblnogfjhbcmmpobjhnomhcdo?hl=zh-CN\n\nHow does this extension is it plagiarism？？", "stars": 5}, {"date": "Dec 6, 2017", "text": "Good Coding, Good Implementation. Mostly this extension used for Students, Net Browsers etc.", "stars": 5}, {"date": "Dec 3, 2017", "text": "I can't live without vimium PERIOD", "stars": 5}, {"date": "Nov 27, 2017", "text": "Can't believe I took this long to install it. Fell in love!", "stars": 5}, {"date": "Nov 25, 2017", "text": "All browsers need this.", "stars": 5}, {"date": "Nov 22, 2017", "text": "Keyboard-centric navigation rules. *Thank you so much.*", "stars": 5}, {"date": "Nov 21, 2017", "text": "Could not have gotten any better. I used multiple extensions in the past to get similar behaviours; however, with this I can farewell the other extensions.", "stars": 5}, {"date": "Nov 20, 2017", "text": "I feel lucky today because of finding out about this ext even so late. Many thanks to the creators.", "stars": 5}, {"date": "Nov 20, 2017", "text": "I could get rid of my mouse!", "stars": 5}, {"date": "Nov 19, 2017", "text": "No more moving to and from the mouse! Great extension for those who like Vim paradigm", "stars": 5}, {"date": "Nov 15, 2017", "text": "amazing\ncan make shotcut for disable on page because when typing get some crash \nthank", "stars": 5}, {"date": "Nov 14, 2017", "text": "<f> and <F> were reversed on install.", "stars": 4}, {"date": "Nov 14, 2017", "text": "not working on medium.com", "stars": 5}, {"date": "Nov 13, 2017", "text": "Brilliant plugin. This is how people ought to browse the web.", "stars": 5}, {"date": "Nov 6, 2017", "text": "How this is not widely known, best plugin EVER!", "stars": 5}, {"date": "Nov 1, 2017", "text": "Awesome! Why didn't I try this before?", "stars": 5}, {"date": "Oct 29, 2017", "text": "great", "stars": 5}, {"date": "Oct 28, 2017", "text": "Excellent implementation of Vim for using Chrome like a professional. Thank you very much! It would be a great addition to be able to move tabs around. For example: \nCtrl + Shift + h or l instead of Ctrl + Shift + PageUp or PageDown\n\nand Go back/next in current tab with Alt + h or l instead of Alt + left or right\n\nShift + h or l instead of Ctrl + Tab (or Shift + Tab) to switch between tabs.\n\nI know tabs are not used that much in VIM, but Google Chrome has a different purpose ;).", "stars": 5}, {"date": "Oct 21, 2017", "text": "it's good", "stars": 5}, {"date": "Oct 19, 2017", "text": "Superb", "stars": 5}, {"date": "Oct 16, 2017", "text": "Speeds up browsing greatly!", "stars": 5}, {"date": "Oct 11, 2017", "text": "Coolest Chrome plugin I've ever used!!!", "stars": 5}, {"date": "Oct 4, 2017", "text": "I use this everyday to accelerate my browsing and save my poor wrists from switch between keyboard and mouse.", "stars": 5}, {"date": "Oct 1, 2017", "text": "So far just Amazing. Exactly what I am looking for.", "stars": 5}, {"date": "Sep 26, 2017", "text": "I love this Phil Stephen and llya great work you made my day I love this plugin I am a vim user and it makes chrome experience even better.", "stars": 5}, {"date": "Sep 25, 2017", "text": "This extension allowed me to unplug my mouse for a day. I now know many shortcuts so I'm definitely using the mouse a lot less.\n\nIf I could add one thing it'd be to add a shortcut so I can right click on words while typing without using my mouse.", "stars": 5}, {"date": "Sep 22, 2017", "text": "My wrists don't hurt anymore.", "stars": 5}, {"date": "Sep 21, 2017", "text": "very good perfect", "stars": 5}, {"date": "Sep 20, 2017", "text": "Vimium is very good so far. Need save image shortcut and some more. Some elements are not detected as links. Cant throw mice away yet ))", "stars": 5}, {"date": "Sep 16, 2017", "text": "after the lastest 1.6.0.3, chromium on linux no working,before was all good.", "stars": 4}, {"date": "Sep 11, 2017", "text": "Awful - I'm a vi power user of 30+ years (so don't claim that I can't use vi).  It interferes annoyingly on various sites - try to enter a field, and the vi keys work. Horrible and removed.", "stars": 1}, {"date": "Sep 11, 2017", "text": "Really useful!\nEspecially if you use vim.", "stars": 5}, {"date": "Sep 3, 2017", "text": "I am learning vim and now appreciate the efficiency of vim keys, and this is just what I was looking for.", "stars": 5}, {"date": "Sep 1, 2017", "text": "nico", "stars": 5}, {"date": "Aug 28, 2017", "text": "Sooo much better than mousing around.", "stars": 5}, {"date": "Aug 24, 2017", "text": "Speeds up browsing if you already know vim shortcuts.", "stars": 5}, {"date": "Aug 24, 2017", "text": "Awesome!", "stars": 5}, {"date": "Aug 17, 2017", "text": "Very Cool!", "stars": 5}, {"date": "Aug 14, 2017", "text": "This is a must have if you want to use less mouse/touchPad", "stars": 5}, {"date": "Aug 11, 2017", "text": "Its superb.But the only thing concerns me is security. Is it secure?", "stars": 5}, {"date": "Aug 9, 2017", "text": "I love you", "stars": 5}, {"date": "Aug 6, 2017", "text": "I LOVE this app.", "stars": 4}, {"date": "Aug 5, 2017", "text": "As a heavy vim user, can't live without it.\nSeriously... I go insane. Scrolling with Vimium is something you have to experience, it's just much smoother than anything else\n\nOnly webpage I don't use it on is YouTube and Google Inbox which have excellent keybindings that are Vim-ish. \n\nAlso, if you find yourself on Linux with i3 installed, this plugin is a must.", "stars": 5}, {"date": "Aug 4, 2017", "text": "This is what the internet should be.\nfor everyone.\nfor ever.", "stars": 5}, {"date": "Aug 3, 2017", "text": "very good", "stars": 5}, {"date": "Aug 2, 2017", "text": "Best choice!", "stars": 5}, {"date": "Aug 1, 2017", "text": "This is so useful if you have a background in vim (or otherwise, I imagine).\n\nThere's one feature request I might add: documentation regarding the CSS of the link hints. What classes are there that need styling? Thank you.", "stars": 5}, {"date": "Jul 27, 2017", "text": "Simply amazing. I absolutely adore the link navigation and tab search features.\n\nAnother incredible game changing feature that should be more advertised: regex search by including \\r in the search box.", "stars": 5}, {"date": "Jul 27, 2017", "text": "super best!", "stars": 5}, {"date": "Jul 24, 2017", "text": "Not touching my mouse\nbut touching my heart.", "stars": 5}, {"date": "Jul 19, 2017", "text": "Amazing!", "stars": 5}, {"date": "Jul 16, 2017", "text": "Work OK on some stuff but on my work stuff ESC clears the form. Is there a way to change ESC key?", "stars": 4}, {"date": "Jul 15, 2017", "text": "It has been a perk for me, but in Chrome Dev 61 the \"open link in tab\" doesn't work. The labels are all messed up.", "stars": 3}, {"date": "Jul 13, 2017", "text": "very good!", "stars": 5}, {"date": "Jul 5, 2017", "text": "The best chrome extension", "stars": 5}, {"date": "Jul 3, 2017", "text": "it doesn't support global shortcut", "stars": 5}, {"date": "Jun 28, 2017", "text": "Love this extension. But could you please add hotkey to toggle it without the need to go to settings? You don't even know how hard it annoys me. I'm a developer (I think all who uses Vimium are too) and often need to test different projects at localhost. So for one project I need hotkeys and for other I don't. If you add the toggle feature - it will be perfect. Thank you for your time.", "stars": 5}, {"date": "Jun 26, 2017", "text": "It's should be built into browser", "stars": 5}, {"date": "Jun 24, 2017", "text": "amazing", "stars": 5}, {"date": "Jun 22, 2017", "text": "Now my awful touchpad won't ruin internet surfing anymore! Thank you A LOT!", "stars": 5}, {"date": "Jun 22, 2017", "text": "Awesome!", "stars": 5}, {"date": "Jun 16, 2017", "text": "Invaluable extension! Once you learn the shortcuts there is no turning back.", "stars": 5}, {"date": "Jun 15, 2017", "text": "My mouse stopped working, so I installed Vimium. Now I'm not even missing my mouse. ;)\n\nIf you are interested in good alternatives:\n- cVim: https://chrome.google.com/webstore/detail/cvim/ihlenndgcmojhcghmfjfneahoeklbjjh\n- Surfingkeys: https://chrome.google.com/webstore/detail/surfingkeys/gfbliohnnapiefjpjlpjnehglfpaknnc", "stars": 5}, {"date": "Jun 14, 2017", "text": "Thanks so much!", "stars": 5}, {"date": "Jun 12, 2017", "text": "replaced mouse in many cases. it would be better if vim could work on extensions pages too", "stars": 5}, {"date": "Jun 9, 2017", "text": "This is the only reason why I'm still using Chrome :)", "stars": 5}, {"date": "Jun 7, 2017", "text": "This extension is simply awesome!", "stars": 5}, {"date": "Jun 7, 2017", "text": "I think the content's width of options page should increase, and should also let textareas' width changeable.", "stars": 5}, {"date": "Jun 6, 2017", "text": "I hate mice and would go crazy without this wonderful extension!\n\nIt would be even more awesome to have an option to randomize the key combos though... To stay sane during many repeated tasks.", "stars": 5}, {"date": "Jun 5, 2017", "text": "In find mode, after pressing enter, there is no indication of how many matches there are, where the matches are, and which match (x out of x) is currently being viewed.", "stars": 4}, {"date": "Jun 1, 2017", "text": "This extension is really great. the only problem is that u can't customize your own shortcuts.\nI would give it 5 stars if that was possible.", "stars": 3}, {"date": "Jun 1, 2017", "text": "really love it", "stars": 5}, {"date": "Jun 1, 2017", "text": "Awesome!", "stars": 5}, {"date": "May 23, 2017", "text": "Thanks for the great extension!\nI cannot imagine browsing without this  extension.", "stars": 5}, {"date": "May 21, 2017", "text": "Wonderful extension that is very helpful to those of us who prefer to use the keyboard!", "stars": 5}, {"date": "May 16, 2017", "text": "Even when you're not VIM geek. This plugin is still very useful and helps you navigate better :)", "stars": 5}, {"date": "May 14, 2017", "text": "excellent and brilliant, I love it.", "stars": 5}, {"date": "May 14, 2017", "text": "I am not able to run the vim commands when I am reading pdf on chrome tab.\n\nnot sure what is the issue?\nCan someone help me out here?", "stars": 4}, {"date": "May 12, 2017", "text": "It is so amazing o_o'!", "stars": 5}, {"date": "May 11, 2017", "text": "Awsome! No need to take my hands off from keyboards!!", "stars": 5}, {"date": "May 11, 2017", "text": "Very good extension, thank you", "stars": 5}, {"date": "May 8, 2017", "text": "Vimium will definitely improve my productivity", "stars": 5}, {"date": "May 3, 2017", "text": "brutal", "stars": 5}, {"date": "May 2, 2017", "text": "Excellent extension", "stars": 5}, {"date": "Apr 28, 2017", "text": "It's kind of weird how this extension got me using Vim instead of the other way around.\n10/10 cannot live without it now.", "stars": 5}, {"date": "Apr 28, 2017", "text": "Practically seamless vim-like browser control. What is there not to like?", "stars": 5}, {"date": "Apr 25, 2017", "text": "THIS HAS CHANGED MY LIFE", "stars": 5}, {"date": "Apr 22, 2017", "text": "This extension should be built into Chrome.  It has fundamentally changed the way I experience the web. Much faster and more efficient browsing.  I cannot live without it.  It is time to kill the mouse, kill the track pad and kill the arrow keys.  Fingers should never leave home row.  Vim lives! Long live Vim!", "stars": 5}, {"date": "Apr 22, 2017", "text": "Awesome!", "stars": 5}, {"date": "Apr 20, 2017", "text": "This is Awesome!", "stars": 5}, {"date": "Apr 19, 2017", "text": "OMG SO GOOD", "stars": 5}, {"date": "Apr 19, 2017", "text": "Begone wicked mouse!\n\nWeb browsing is much more efficient.\n\nTab searching is great!\n\nIf you get RSI this will help you reduce the strain on your wrist from moving to the mouse.\n\nA must for any chrome instance.", "stars": 5}, {"date": "Apr 16, 2017", "text": "Every now and then I'm on a browser without this extension, and it's like someone chopped of my arms and one leg. It's so essential!", "stars": 5}, {"date": "Apr 15, 2017", "text": "Just amazing! \n\nA little feedback: would be nice show the favicon when searching in the hystory/tabs\n\nIt would help to visually filter options", "stars": 5}, {"date": "Apr 12, 2017", "text": "I've been using this for probably at least a year now. Can't live without it!", "stars": 5}, {"date": "Apr 9, 2017", "text": "I've been using this for a while now, and I love it. I'm stoked about the new PDF support.", "stars": 5}, {"date": "Apr 5, 2017", "text": "This extension is the personification of beauty", "stars": 5}, {"date": "Apr 5, 2017", "text": "Incredible extension. Death to the mouse!!!", "stars": 5}, {"date": "Apr 1, 2017", "text": "this is the best extension ever", "stars": 5}, {"date": "Mar 23, 2017", "text": "Can't believe I only just discovered this. Amazing.", "stars": 5}, {"date": "Mar 22, 2017", "text": "The most useful chrome extension ever!", "stars": 5}, {"date": "Mar 21, 2017", "text": "Amazing, this make your life more productive.", "stars": 5}, {"date": "Mar 19, 2017", "text": "Amazing app.", "stars": 5}, {"date": "Mar 18, 2017", "text": "nice work", "stars": 5}, {"date": "Mar 8, 2017", "text": "shift + t sorting tabs should correspond to visual order with current tab highlited in it's place, please look at:\n\nppmkmdianhgppfjciekeiodmgdppglno\n\nthat is the only reason I keep that other extension, I cannot browse with tabs in no order, TY.", "stars": 5}, {"date": "Mar 5, 2017", "text": "good", "stars": 5}, {"date": "Feb 28, 2017", "text": "This stands next to uBlock Origin as one of the best extensions of all time.", "stars": 5}, {"date": "Feb 25, 2017", "text": "I have been using this extention for roughly a month and I totally love it! I rediscovered comfortable internet browsing with Vimium!", "stars": 5}, {"date": "Feb 24, 2017", "text": "Incredible! Recommend for everyday use.", "stars": 5}, {"date": "Feb 22, 2017", "text": "Great plugin that makes it so much more pleasant to use my browser!  My only complaint is to google Chrome itself for not allowing the plugin to work inside google.com domains...", "stars": 5}, {"date": "Feb 19, 2017", "text": "ggggggggggggggggggg", "stars": 5}, {"date": "Feb 15, 2017", "text": "Loved it from the moment I added this to my chrome browser. Brilliant extension. Devs are genius.", "stars": 5}, {"date": "Feb 15, 2017", "text": "nice", "stars": 5}, {"date": "Feb 14, 2017", "text": "Doesn't work well on slow internet connections because it doesn't let you use the keyboard shortcuts if you are on a page that hasn't loaded. For example, if I open a webpage with \"f\" and then it's taking a while to load, I want to switch back to my previous tab until it's finished. But I can't do that, because my keyboard shortcuts are frozen or something. Very annoying.", "stars": 2}, {"date": "Feb 14, 2017", "text": "I have been using this extension for well over a year now and I must say this extension is amazing. Like vim, you start with just a few hotkeys, and suddenly all the terrible websites around the internet that would be completely impossible to navigate otherwise.\n\nI use this in my IT job at a university with several websites that require you to press on a tiny login link buried in other links. Wtih the 'f' command navigating around link heavy websites like youtube and any amount of news articl... Show more", "stars": 5}, {"date": "Feb 11, 2017", "text": "I hate touchpad. Thanks!", "stars": 5}, {"date": "Feb 10, 2017", "text": "simply genius!\nintegrates well with chrome, I would even recommend this for non-vimmers, as it is easy to learn and makes your workflow so much more efficient, especially when working on a laptop.\nOnly drawback still is that it foes not work quite everywhere - I'd especially be very happy if it would be possible wo integrate into PDF reading using Chrome. Still, one if not the best extension available for Chrome. Very well done, thank you so much!", "stars": 5}, {"date": "Feb 9, 2017", "text": "Explanation on using visual mode would've been really helpful..Besides that, this is one of the best extensions for chrome if not the best", "stars": 5}, {"date": "Feb 8, 2017", "text": "Loved it.. @ first sight :)", "stars": 5}, {"date": "Feb 5, 2017", "text": "Best!", "stars": 5}, {"date": "Jan 27, 2017", "text": "The most productive chrome extension for vi/vim users.", "stars": 5}, {"date": "Jan 26, 2017", "text": "Learn Vim and make Chrome more efficient. Awesome!", "stars": 5}, {"date": "Jan 25, 2017", "text": "I love it! Brilliant and thank you", "stars": 5}, {"date": "Jan 23, 2017", "text": "I'm just starting to use this extension and already it's blowing me away.  Global marks across open windows and tabs???  Wow.  Brilliant.  And fast like Vim :)", "stars": 5}, {"date": "Jan 20, 2017", "text": "amazing", "stars": 5}, {"date": "Jan 14, 2017", "text": "love it", "stars": 5}, {"date": "Jan 11, 2017", "text": "I'm out of the words to describe how fantastic this extension is!! I had no idea such browsing experience was even possible, navigating is so much faster and so much more convenient now!\n\nThank you devs for the best extension ever!", "stars": 5}, {"date": "Jan 5, 2017", "text": "wonderful!", "stars": 5}, {"date": "Jan 2, 2017", "text": "Awesome.", "stars": 5}, {"date": "Dec 26, 2016", "text": "Five stars although default styles aren't pretty exciting...\nBeing able to change the default yellowish hint markers would be awesome!", "stars": 5}, {"date": "Dec 24, 2016", "text": "simle, and awesome extention", "stars": 5}, {"date": "Dec 23, 2016", "text": "hope to add sync or backup feature.\nIt's tedious to map all the keys again after reinstallation.", "stars": 4}, {"date": "Dec 21, 2016", "text": "nothing can be better", "stars": 5}, {"date": "Dec 13, 2016", "text": "works great!!", "stars": 5}, {"date": "Dec 12, 2016", "text": "10/10, this extension completes me", "stars": 5}, {"date": "Dec 10, 2016", "text": "One of my top 3 chrome extensions.\n\nNice help menu.  Nice configurability.  Excellent reliability.\nI only wish it provided a command line mode.", "stars": 5}, {"date": "Dec 6, 2016", "text": "I embraced vim and tmux several years ago, to the point where the muscle memory is good enough I'm not even really aware sometimes what keys I actually use. I've gotten to the point where I hate having to take my fingers off the home row, have invested in good mechanical keyboards, and feel a bit of annoyance now when using applications what don't at least support the j and k keys for scrolling. Needless to say, I think vimium is an awesome and must-have extension for me. Props to the develop... Show more", "stars": 5}, {"date": "Dec 5, 2016", "text": "very good!!!", "stars": 5}, {"date": "Dec 4, 2016", "text": "Worth installing just for x!\nBut the rest is fantastic.\nJust working my way through learning the the most useful shortcuts.\n[edit] alt-m oh my thats nice! Mute.\n[edit] Excluded URLs: https://feedly.com/i/index Keys: r\n[edit]https://feedly.com/i/subscription/feed/* Keys: gh", "stars": 5}, {"date": "Dec 3, 2016", "text": "Absolutely brilliant. Now I can have the reliability of Chrome with the usability of Uzbl.\n\nIt's particularly useful when the laptop is on your lap making use of the touchpad less than ideal (is it ever ideal?!)\n\nThe browser was one of the last places were I primarily use the mouse to navigate and that frustrated me. Now everything is better.\n\nIt seems fast, not resource hungry. Quite clean, not hit any bugs. Decent features.\n\nMassive kudos to the devs.", "stars": 5}, {"date": "Nov 29, 2016", "text": "so cool~~~", "stars": 5}, {"date": "Nov 23, 2016", "text": "Awesome!", "stars": 5}, {"date": "Nov 15, 2016", "text": "I love it. But why the chrome often crash by the plugin recently.\n\nos: maxOS 10.12\nchrome version: 54.0.2840.98 (64-bit) \nvimium version: 1.57\n\nHope someone can answer this question", "stars": 4}, {"date": "Nov 13, 2016", "text": "Awesome extension I love it.\n\nI would like a setting where I can position the \"commandline\" bar in the middle of the screen and make the font bigger :)", "stars": 5}, {"date": "Nov 12, 2016", "text": "Thank you a lot for this plugin. Now I can finally throw out my mouse.", "stars": 5}, {"date": "Nov 7, 2016", "text": "Literally amazing", "stars": 5}, {"date": "Nov 7, 2016", "text": "Looked it up out of the blue and it was exactly what I was hoping for. The functionality is super nice and I like how you can disable it on pages with other useful hotkeys (like youtube).", "stars": 5}, {"date": "Nov 7, 2016", "text": "The best plugin for Chrome.", "stars": 5}, {"date": "Nov 7, 2016", "text": "It is very very cooooool!!!", "stars": 5}, {"date": "Nov 5, 2016", "text": "awesome", "stars": 5}, {"date": "Oct 29, 2016", "text": "Thanks! This is awesome!", "stars": 5}, {"date": "Oct 29, 2016", "text": "Amazing work, I just hope google will consider removing anyoing limitation so this extension can kick it.", "stars": 5}, {"date": "Oct 27, 2016", "text": "Great tool!\nHowever it seems to be corrupted in my new version of chrome: Version 53.0.2785.143 (64-bit);\n\nAnyone can help to fix it?\n\nThanks!", "stars": 5}, {"date": "Oct 24, 2016", "text": "I have only been using this extension for a few days now and I already feel confident in giving it a glowing review. I try to avoid using the keyboard whenever possible, and this fills the largest remaining gap in my workflow where I have to unnecessarily reach for the mouse. As a regular user of Vim, I generally am not a fan of Vim keybinding plugins for various GUI programs. I find they tend to fall down on the implementation. Either they are incomplete, or they are clunky and obtrusive, or... Show more", "stars": 5}, {"date": "Oct 19, 2016", "text": "awesome!", "stars": 5}, {"date": "Oct 18, 2016", "text": "that's what i want", "stars": 5}, {"date": "Oct 17, 2016", "text": "Annoying sometime. Many site listen for hotkeys that are also used by it so it get very annoying on those sites", "stars": 3}, {"date": "Oct 16, 2016", "text": "It does work at handy! the mouse is nearly useless now.", "stars": 5}, {"date": "Oct 16, 2016", "text": "It synchronizes my workspace :)", "stars": 5}, {"date": "Oct 16, 2016", "text": "Love the vim like interface on my browser", "stars": 5}, {"date": "Oct 14, 2016", "text": "Thanks for creating this!!", "stars": 5}, {"date": "Oct 14, 2016", "text": "It's amazing, just like that.", "stars": 5}, {"date": "Oct 12, 2016", "text": "nice thing to try ! <3", "stars": 5}, {"date": "Oct 12, 2016", "text": "Great app, helps me a lot.", "stars": 5}, {"date": "Oct 6, 2016", "text": "Very nice and handy. Still a little bit confusing when I try to close a tab or navigate tabs when I'm on a one that's still loading and I have to wait some time before I can use the shortcuts.", "stars": 5}, {"date": "Oct 5, 2016", "text": "very good app", "stars": 5}, {"date": "Oct 5, 2016", "text": "Definitely my favorite chrome extension. I can't use any other browser unless it has vim shortcuts.\n\nRequest: could you add vim shortcuts to manage bookmarks? I might have to make this one myself as it's the only time I switch to a mouse.", "stars": 5}, {"date": "Oct 4, 2016", "text": "I've been using the extension for a month and is now the extension I use the most. It's a gem! Using it made me comfortable with using Vim as well.\nThanks for creating and maintaining it!", "stars": 5}, {"date": "Sep 30, 2016", "text": "Scrolling is easy now.", "stars": 5}, {"date": "Sep 27, 2016", "text": "very quick！", "stars": 5}, {"date": "Sep 26, 2016", "text": "very good for speed use chrome.", "stars": 5}, {"date": "Sep 25, 2016", "text": "A must-have for every keyboard-shortcut-addict out there. An amazing piece of software.", "stars": 5}, {"date": "Sep 22, 2016", "text": "This is exactly what I was looking for,\n  Thank you so much and the team for the wonderful work!!", "stars": 5}, {"date": "Sep 21, 2016", "text": "It's awesome!!! improved my workflow. Thanks", "stars": 5}, {"date": "Sep 21, 2016", "text": "Awesome extension", "stars": 5}, {"date": "Sep 21, 2016", "text": "Great!!!", "stars": 5}, {"date": "Sep 16, 2016", "text": "Thank you!", "stars": 5}, {"date": "Sep 16, 2016", "text": "Love this extension! It takes me back to the days of using unix terminal managers like 'screen' but in a web environment which is where I spend most of my time on computers these days. Speed and efficiency superimposed on a modern web browsing experience......", "stars": 5}, {"date": "Sep 15, 2016", "text": "I love it! Hard to live without Vimium.", "stars": 5}, {"date": "Sep 14, 2016", "text": "loved it <3", "stars": 5}, {"date": "Sep 14, 2016", "text": "Awesome", "stars": 5}, {"date": "Sep 14, 2016", "text": "Perfect", "stars": 5}, {"date": "Sep 13, 2016", "text": "amazing extension. recommended to anyone who wants to lower his mouse use.", "stars": 5}, {"date": "Sep 8, 2016", "text": "Used it for 10 minutes and loved it. It isn't perfect, but for what it is trying to do, this thing deserves the 5 stars it has.\n\nCon - Complex websites fight Vimium the whole way. This plugin really shines on websites and pages that are browsed casually.", "stars": 5}, {"date": "Sep 6, 2016", "text": "would be cool if the default setting doesn't use j, k, and l as they are used to skip and stop/play on youtube. i know you can rebind them but the process is kind of a pain. good product thou", "stars": 5}, {"date": "Sep 6, 2016", "text": "Awesome! *-*", "stars": 5}, {"date": "Sep 4, 2016", "text": "Wow!", "stars": 5}, {"date": "Aug 29, 2016", "text": "cool", "stars": 5}, {"date": "Aug 23, 2016", "text": "Vimium has become an essential tool.\nVery, very good.\n\nFeature Request: Include Keys as well as Exclude Keys\nSometimes I just want to allow the 'f' key, e.g. on Github.", "stars": 5}, {"date": "Aug 22, 2016", "text": "How am I just discovering this now", "stars": 5}, {"date": "Aug 21, 2016", "text": "I need a hot key to enable/disable the extension\n\nThanks for your dedication!", "stars": 3}, {"date": "Aug 19, 2016", "text": "absolutely great extension..  customize any keys you like with this extension..  life got a lot easier.  forget your mouse, use this extension instead.  you will have speed and ease-of-mind surfing the net :)\n\n*****sadly, it's not possible to use \"shift\".. that means shift+fn keys/non-atoz-keys are impossible.", "stars": 5}, {"date": "Aug 18, 2016", "text": "This extension is awesome for satisfied vim users!", "stars": 5}, {"date": "Aug 11, 2016", "text": "very good app!", "stars": 5}, {"date": "Aug 11, 2016", "text": "It's awesomen but knocking of 1 star for not supporting Chrome's built in search shortcuts. \n\nLike typing a \"search term\" to search Amazon, or w <searchterm> to search wikipedia.", "stars": 4}, {"date": "Aug 9, 2016", "text": "Wish I could know this earlier", "stars": 5}, {"date": "Aug 9, 2016", "text": "Wow, just wow. I can't believe I went so long without this extension 😍", "stars": 5}, {"date": "Aug 6, 2016", "text": "really convenient, helpful. thank you very much :D", "stars": 5}, {"date": "Aug 4, 2016", "text": "Fantastic ! Congrats for the developers. This is a great extension.", "stars": 5}, {"date": "Jul 27, 2016", "text": "very good", "stars": 5}, {"date": "Jul 25, 2016", "text": "I love it!", "stars": 5}, {"date": "Jul 23, 2016", "text": "The best plugin in the universe. Hands down... on the keyboard ;)", "stars": 5}, {"date": "Jul 21, 2016", "text": "So far i like it better than Qutebrowser, as a dev i cherish not leaving the keyboard as much as possible and this extension keeps me flowing without losing momentum.", "stars": 5}, {"date": "Jul 20, 2016", "text": "This is the first thing I install with chrome. Every time I wish it had a feature I find it already does. Over time this will probably save me years of my life that I can use for writing code and browsing dank memes.", "stars": 5}, {"date": "Jul 18, 2016", "text": "Awesome extension!!But sometimes I need to pause it to use some websites that contain shortcuts themselves. So I think, a pause/unpause shortcut key might be helpful (just disable all vimium shortcuts except the pause/unpause).", "stars": 5}, {"date": "Jul 14, 2016", "text": "Great tool to use chrome w/o mouse!", "stars": 5}, {"date": "Jul 10, 2016", "text": "SHIFT+F best combo ever.", "stars": 5}, {"date": "Jul 9, 2016", "text": "This is just what I wanted! Awesome work dev!", "stars": 5}, {"date": "Jul 8, 2016", "text": "I was getting a bit annoyed with the way that 'o'/'O' don't autocomplete like the omnibar does. I was moving my hand to the arrow keys when I wanted to select something.\n\nWell, I should have known since this is the best written chrome extension in the history of forever, that I can just use <C-n> instead.\n\nA+++", "stars": 5}, {"date": "Jul 6, 2016", "text": "Awesome plugin. Must try atleast once", "stars": 5}, {"date": "Jul 3, 2016", "text": "Best plugin I've used so far!", "stars": 5}, {"date": "Jul 1, 2016", "text": "Very Good!", "stars": 5}, {"date": "Jun 29, 2016", "text": "Amazing extension!", "stars": 5}, {"date": "Jun 29, 2016", "text": "Since it is optional, I am just gonna say it is wonderful.", "stars": 5}, {"date": "Jun 29, 2016", "text": "pretty nice extension...", "stars": 5}, {"date": "Jun 28, 2016", "text": "Amazing extension. I cannot use chrome without vimium.", "stars": 5}, {"date": "Jun 24, 2016", "text": "Best vim-like navigator. Throw away your mice and remember - never leave home row. GJ dev.", "stars": 5}, {"date": "Jun 21, 2016", "text": "Awesome!!!", "stars": 5}, {"date": "Jun 19, 2016", "text": "Phantastic extension that does exactly what I want. The configuration is so pleasantly KISS that it makes me wonder why anyone would want a touchscreen on a laptop when this thing exists.\n\nThe only things I would humbly request is an integration of Youtube controls and being able to chose the \"Link characters\" myself (I use a non-QWERTY layout), I can't seem to figure it out if there's a way to do it. If there isn't I unfortunately can't code to make it happen, I'd try myself if I could.", "stars": 5}, {"date": "Jun 18, 2016", "text": "Hi, I really love the extension.... however it seems to stop my Roboform password manager from working ( when launching logins from the tray icon ) . \n\nAny suggestions on how I could get this to work? \n\nThanks very much!", "stars": 5}, {"date": "Jun 14, 2016", "text": "Great addon, but options wouldnt be applied untill page reload.", "stars": 4}, {"date": "Jun 14, 2016", "text": "I just wanna say it is totally awesome!", "stars": 5}, {"date": "Jun 9, 2016", "text": "There are some gliches here and there (when pages are not fully loaded the behavior is a bit unpredictable, and it has some interactions with gmail.com shortcuts even when I have disabled it under that domain), but overall this is a great boost to my productivity! Finally, I'm no longer missing Opera with its configurable keyboard shortcuts.", "stars": 5}, {"date": "Jun 3, 2016", "text": "Extremely powerful and flexible.\nTime to forget Gleebox", "stars": 5}, {"date": "Jun 2, 2016", "text": "I love it! This extension eliminates the last good reason for w3m, lynx, and such. And cheat sheet (?) is very helpful! Thank you!", "stars": 5}, {"date": "Jun 2, 2016", "text": "amazing!", "stars": 5}, {"date": "Jun 2, 2016", "text": "this is the most amazing extension EVER.", "stars": 5}, {"date": "May 30, 2016", "text": "very good", "stars": 5}, {"date": "May 30, 2016", "text": "Simply great.", "stars": 5}, {"date": "May 29, 2016", "text": "absolutely wonderful! Everyone should at least try this extension, it has drastically improved my workflow. It's also a great way to get into VIM editing.I'd suggest making the / search only search for text on the part of the page you are currently viewing, that way its easier to select text and ctrl+f has the same functionality anyways. I don't usually rate 5 stars or give reviews but this plug-in is just perfection!", "stars": 5}, {"date": "May 27, 2016", "text": "An Extension So Good , I might have lost money buying a mouse.\n\nI started with Vim just days ago and was amazed how awesome text editing was , then this extension came along and redefined how awesome web browsing is .\n\nKeep Up the Good Work Guys !! :D", "stars": 5}, {"date": "May 27, 2016", "text": "Fantastic implementation with constant useful updates. Highly recommended.", "stars": 5}, {"date": "May 27, 2016", "text": "Oh My Vim, this is really great extension. When compared to keyboard, mouse is now second class citizen in Chrome for me.", "stars": 5}, {"date": "May 25, 2016", "text": "Being a developer and VIM devote I'm sad that I did not find this extension earlier.\n\nVery intuitive design and integrates perfectly with the function of chrome\n\n5+ and could not recommend this extension enough to the VI* user\n\n:)))))))", "stars": 5}, {"date": "May 24, 2016", "text": "best chrome extension", "stars": 5}, {"date": "May 23, 2016", "text": "What an amazing extension for chrome.\n\nHowever, I wonder if the Vimium can add some short keys for the cursor rolling and text selection. So the user can easily select the text and copy it, then search the text with short key (p or P) in the default Search Engine.\n\nStill many thanks for the great extension.", "stars": 5}, {"date": "May 19, 2016", "text": "It's cool extension. I think it will be in chrome by default. :)", "stars": 5}, {"date": "May 19, 2016", "text": "The idea is great and most of the things work really nice, however, I noticed two issues:\n\n1. on some pages it doesn't work (chrome pages, like the extension page, new tab page and download page)\n\n2. it uses HUGE amounts of resources, browsing is lagging, desktop performance slows down on Linux Mint 17\n\nI had to remove it, because of the second issue.", "stars": 2}, {"date": "May 18, 2016", "text": "Cool stuff, but doesn't really work when you use multiple languages because you constantly need to switch.", "stars": 4}, {"date": "May 18, 2016", "text": "Simple and useful.", "stars": 5}, {"date": "May 18, 2016", "text": "In some website, i want to enable Vimium, beacuse it will \nhave conflict with the website's keyboard, how can i solve the problem?", "stars": 4}, {"date": "May 17, 2016", "text": "doesn't work when viewing a pdf\n\ndoesn't overwrite all chrome bindings (like the chrome binding to close a window)\n\ngreat app, but not feature complete", "stars": 4}, {"date": "May 13, 2016", "text": "Love it -- saves a lot of time by avoiding unnecessary mouse use when using Chrome.", "stars": 5}, {"date": "May 11, 2016", "text": "excellent!", "stars": 5}, {"date": "May 10, 2016", "text": "Very good but with minor bugs.", "stars": 5}, {"date": "May 10, 2016", "text": "I've been looking for this all my life! It's perfect, thank you.", "stars": 5}, {"date": "May 9, 2016", "text": "Great extension! I can't imagine using Chrome without it. Absolutely must-have.", "stars": 5}, {"date": "May 5, 2016", "text": "Big time fan of vim and now realizing the power of home row keyboard commands.  My one gripe is I can't figure out what the \"go left one tab\" command is so I can remap it to gr", "stars": 5}, {"date": "May 3, 2016", "text": "Beautifully Thought out and executed. Almost eliminated the need to touch the mouse in most occasions.", "stars": 5}, {"date": "May 3, 2016", "text": "Very, very help", "stars": 5}, {"date": "May 2, 2016", "text": "I am an emacs user. Now I can do everything in a browser without ever reaching for the mouse. I have been using Vimium for about 3 years, no complaints whatsoever. Awesome. It would be good to add macro recording capability.", "stars": 5}, {"date": "Apr 29, 2016", "text": "This makes using a browser so much more direct.  It is like adding a mode on-top of Chrome, great stuff!", "stars": 5}, {"date": "Apr 29, 2016", "text": "Great plugin!\n\nPerfect for using in full screen with a hidden toolbar for a nice clean browsing experience BUT I have to use the mouse if i want to glance at what my tabs are.\n\nAlso seems to be a bug where if Chrome crashed tabs have to be manually reloaded for Vimium to work. \n\nAlso does not work in the chrome PDF viewer.\n\nNot sure if there's anything you can do about the later 2, but it would be nice if there was a way to bring up some sort of quicklook list of open tabs!\n\nThanks for the gr... Show more", "stars": 4}, {"date": "Apr 26, 2016", "text": "Very useful. I miss selecting form elements like you do select links. Also, I haven't found a way to open private tabs with vimium bindings. That would be nice.", "stars": 5}, {"date": "Apr 24, 2016", "text": "write a review, optional. I loved it ;)", "stars": 5}, {"date": "Apr 21, 2016", "text": "Great! Must-have!!", "stars": 5}, {"date": "Apr 17, 2016", "text": "Works shockingly well", "stars": 5}, {"date": "Apr 17, 2016", "text": "The most useful extension I have found yet.", "stars": 5}, {"date": "Apr 12, 2016", "text": "great to switch from vimperator to vimium seamlessly!", "stars": 5}, {"date": "Apr 9, 2016", "text": "This is one I am looking for!!  Thanks guys!", "stars": 5}, {"date": "Apr 7, 2016", "text": "great app - exactly what I was looking for!", "stars": 5}, {"date": "Apr 7, 2016", "text": "Coming from vimFX for Firefox i noticed a few shortcomings. The search engines are not available with 'o' and the search '/' did only highlight the first match. It is also NOT possible to navigate these matches. The shortcuts sometimes just don't work at all (e.g. on the 'Downloads' Site) which is very annoying because the I have to reach over to the mouse again just to change tabs! Other than that it works performant and as expected.", "stars": 3}, {"date": "Apr 7, 2016", "text": "Amazing!", "stars": 5}, {"date": "Apr 6, 2016", "text": "useful, configurable, & well supported.  Saves me tons of time in mouse movements!", "stars": 5}, {"date": "Apr 6, 2016", "text": "i just install it and try to leanrn how to use in my chrome", "stars": 4}, {"date": "Mar 31, 2016", "text": "49.0.2623.108 (64-bit)\nj,k can't work", "stars": 5}, {"date": "Mar 30, 2016", "text": "great except high memory usage(according to built-in stats for nerds)", "stars": 3}, {"date": "Mar 30, 2016", "text": "Great extension!", "stars": 5}, {"date": "Mar 28, 2016", "text": "This extension makes the vim users feel the chrome just as home. Thank you very much for creating this wonderful piece of excellence.", "stars": 5}, {"date": "Mar 27, 2016", "text": "Coool. In fact, \"vim\" makes many people afraid to use :D some other name should be better =)))", "stars": 5}, {"date": "Mar 25, 2016", "text": "Makes me about 1000x more productive because MY HANDS NEVER LEAVE THE KEYBOARD OMG I LOVE IT!\n\nSorry for screaming.", "stars": 5}, {"date": "Mar 24, 2016", "text": "Would it be possible to make vimium work on new tab?", "stars": 5}, {"date": "Mar 23, 2016", "text": "Memory usage is a bit high so I uninstalled it.. and reinstalled it by the next morning when I realized I couldn't live without it...", "stars": 4}, {"date": "Mar 21, 2016", "text": "Thanks for your great works!", "stars": 5}, {"date": "Mar 21, 2016", "text": "Takes chrome/browsing experience to a whole new level, not only for vim lovers but also for people who want to eliminate unnecessary movement and keep it minimal but still so much productive!", "stars": 5}, {"date": "Mar 15, 2016", "text": "This is simply great. Wish I saw it before.", "stars": 5}, {"date": "Mar 10, 2016", "text": "This is cool. man.", "stars": 5}, {"date": "Mar 3, 2016", "text": "2 annoying use cases:\n\n- Make Vimium work on the new tab page.\nCurrently it forces me to use the mouse to open a bookmark which is what I wanted to prevent with Vimium in the first place.\nI know there are extensions that customize the new tab page so you can surely fix that.\n(maybe there are different solutions, I have no idea.)\n\n- Make pages load with no focused object.\nSometimes a page loads with a focused object (usually a search bar) and I can't use Vimium commands without pressing ESC li... Show more", "stars": 4}, {"date": "Mar 2, 2016", "text": "This is a great plugin for anyone who uses vim regular. One of the features that I cannot believe isn't mentioned as one of the key features is the regex search option. I have wanted to use regex to search the web for so long, it's amazing!! (It uses Perl regex not vim's)", "stars": 5}, {"date": "Feb 28, 2016", "text": "The best thing which i uses after vim.", "stars": 5}, {"date": "Feb 24, 2016", "text": "Love it!!! Such a great tool to navigate the internet through the use of simple and easy to use shortcuts.", "stars": 5}, {"date": "Feb 24, 2016", "text": "Such a great add on for vim users! thanks!", "stars": 5}, {"date": "Feb 21, 2016", "text": "I am a Vim novice and I really appreciate the consistency of keyboard navigation and control.\n\nI keep discovering well-thought features in Vimium, such as the insert-mode ('i', then type something, then <esc>) that lets you send characters directly to the page (without Vim interfering). This is great for sites that already have their own keyboard shortcuts.\n\nThanks Vimium crew!", "stars": 5}, {"date": "Feb 20, 2016", "text": "I´m in love again. This extension is absolutely vital for people who want to save time by eliminating unnecessary mouse movements. Very intuitive commands with an extremely practical help popup. I don´t ever see myself going back to the older and slower ways. Thanks so much for this!", "stars": 5}, {"date": "Feb 11, 2016", "text": "Lovely, like training wheels to tackling Vim/Emacs-evilmode. \n\nAny way to customize Help screen with github hosted commands?", "stars": 4}, {"date": "Feb 9, 2016", "text": "Amazing!\n\nFeature requests:\n\n- Leader key support (e.g., the comma)\n- Ignore keys for a fraction of a second immediately after opening a link. I use the link name for hinting; if I type more letters of the link than necessary, the extra letters are translated to commands after the link is opened.", "stars": 5}, {"date": "Feb 5, 2016", "text": "Great!!!!!!!! It's the best keyboard navigation plugin I've ever experienced!!", "stars": 5}, {"date": "Feb 5, 2016", "text": "Wow, is this for real ?", "stars": 5}, {"date": "Feb 2, 2016", "text": "Absolutely awesome. If I was responsible for Google Chrome in its current state I'd be thoroughly embarrassed by how much better Vimium makes the browsing experience. I have no idea why this isn't built into Chrome but that doesn't matter anymore because now it is. This makes browsing 10 times faster so I'd give it 50 stars if I could.", "stars": 5}, {"date": "Jan 30, 2016", "text": "This is great... having gotten so used to navigating around with a vim context, I couldn't be happier to be able to do this with chrome.\n\nFantastic work!!", "stars": 5}, {"date": "Jan 27, 2016", "text": "The best thing that ever happened to any keyboard shortcut lover!\n\nI would like a couple of options or enhanced features:\n\nWhen you allow to choose from a list of links to be copied to the clipboard or opened in a new tab, there should be a way to select multiple links instead of getting the list of key combinations over and over for each link that we need to copy or open in a different tab.\n\nThanks for all the great work you have done!", "stars": 5}, {"date": "Jan 22, 2016", "text": "F****ing awesome!!! I love it, it's life changing.", "stars": 5}, {"date": "Jan 22, 2016", "text": "lovely", "stars": 5}, {"date": "Jan 21, 2016", "text": "Awesome and very useful. Used it for about a year now and I've loved it", "stars": 5}, {"date": "Jan 19, 2016", "text": "Nice, thanks. I am enjoying to use it.", "stars": 5}, {"date": "Jan 18, 2016", "text": "I would have liked the extention to work in pdfs that open in chrome as well.\n\nThe extention does not work with gmail also which causes some discomfort. Other than that the extention is great.", "stars": 3}, {"date": "Jan 18, 2016", "text": "This extension is really helpful, the idea with links opening is just brilliant. That is what i needed to stop using mouse in browser.", "stars": 5}, {"date": "Jan 18, 2016", "text": "Powerful, life Saver", "stars": 5}, {"date": "Jan 16, 2016", "text": "wonderful,no mouse", "stars": 5}, {"date": "Jan 12, 2016", "text": "It's great, thank a lot.", "stars": 5}, {"date": "Jan 11, 2016", "text": "Highly recommended, especially to those who use vim.", "stars": 5}, {"date": "Jan 11, 2016", "text": "amazing!!!", "stars": 5}, {"date": "Jan 10, 2016", "text": "I love u", "stars": 5}, {"date": "Jan 9, 2016", "text": "Helpful for when youre too tired to switch to mouse\n\nOverall, a smooth experience, a quality software that you can't live without on Chrome.", "stars": 4}, {"date": "Jan 5, 2016", "text": "WARNING: If you use this, you'll become addicted. By far the best Chrome extension in existence. A must have for any power user, even if you don't use vim. Navigating without the mouse is awesome. Check out the command list in their github readme! https://github.com/philc/vimium", "stars": 5}, {"date": "Jan 2, 2016", "text": "I'm in love with it!\n\nOne thing, would be nice if alt + motion in Insert mode works.", "stars": 5}, {"date": "Dec 25, 2015", "text": "One of the best chrome plugins ever used. GJ!", "stars": 5}, {"date": "Dec 24, 2015", "text": "Robust and awesome.", "stars": 5}, {"date": "Dec 23, 2015", "text": "Amazing!\n\nIt would be nice to  have a shortcut to move the cursor to a link in the page, without navigating to it. In some websites you need to move the cursor to an option in the menu so it shows all the \"suboptions\". Right now the only way I could find was to keep using the mouse.", "stars": 5}, {"date": "Dec 22, 2015", "text": "I really love it, I don't use the mouse anymore keep maintaining it guys thanks.", "stars": 5}, {"date": "Dec 21, 2015", "text": "Awesome plugin for vim users. Saves me a ton of time when browsing.", "stars": 5}, {"date": "Dec 18, 2015", "text": "Extension #1\n\nVery useful extension rendering the mouse nearly useless. If you like vim you'll love this extension.", "stars": 5}, {"date": "Dec 14, 2015", "text": "Guys that is awesome", "stars": 5}, {"date": "Dec 12, 2015", "text": "This is the greatest thing that I've ever used in chrome. By installing it, I also made 2 other extensions redundant. I thought it would be novelty when I searched for a vim chrome plugin, but the shortcuts established and the slick UI actually increase my workflow.\n\nI would only ask for new commands for managing windows (i.e. move tab to different window or select different window).", "stars": 5}, {"date": "Dec 10, 2015", "text": "AWESOME AWESOME AND AWESOME!!!!", "stars": 5}, {"date": "Dec 9, 2015", "text": "Keyboard shortcuts for all the hyperlinks and scrolling, too?! Woot!", "stars": 5}, {"date": "Dec 4, 2015", "text": "great productive extension...", "stars": 5}, {"date": "Dec 3, 2015", "text": "very good! easy", "stars": 5}, {"date": "Dec 3, 2015", "text": "Great extension, surfing became waay easier", "stars": 5}, {"date": "Nov 29, 2015", "text": "Awesome, still learning new features.", "stars": 5}, {"date": "Nov 29, 2015", "text": "why can't use at chrome://* pages. and some other page?", "stars": 5}, {"date": "Nov 29, 2015", "text": "Loved it. Now it's a lot more fun to use chrome in full screen mode.", "stars": 5}, {"date": "Nov 20, 2015", "text": "A-MA-ZING. Matchless, and couldn't do without it, allows you to do all your browsing by keyboard, the open link/ open link in new tab feature (mapping every clickable item to one or two letters when you invoke it) is so dope, makes browsing way faster. \nThank you very much@", "stars": 5}, {"date": "Nov 17, 2015", "text": "Unbelievably useful", "stars": 5}, {"date": "Nov 16, 2015", "text": "I have some questions using vimium. It`s switch off when I open new tab or if I press F5, also in settings/extensions page. Is this could be fixed?", "stars": 4}, {"date": "Nov 14, 2015", "text": "Nothing can be better then this app to enhance your productivity.", "stars": 5}, {"date": "Nov 14, 2015", "text": "Amazing", "stars": 5}, {"date": "Nov 12, 2015", "text": "This converted me from Firefox/Pentadactyl to Chrome.  The main draw was the responsiveness.  It's a pleasure flicking around between google searches whilst barely moving my fingers from home on the keyboard.  Biggest drawback is with applications like feedly and its fixed set of keyboard shortcuts.  I'd love to be able to map some feedly specific shortcuts from within vimium.", "stars": 4}, {"date": "Nov 10, 2015", "text": "I LOVE VIMIUM THIS IS AMAZING", "stars": 5}, {"date": "Nov 9, 2015", "text": "Do you want to be a ninja?", "stars": 5}, {"date": "Nov 4, 2015", "text": "FEATURE REQUEST:\nmake the J and K tab-change commands work for PDF tabs as well. When I try to scan through my tabs and I have a PDF open I get stuck on it :P\n\nWould rate 5 stars otherwise.", "stars": 4}, {"date": "Nov 3, 2015", "text": "This is the best thing that happened to my fingers in last couple of month. Love the extension it makes me fly all over the Internets", "stars": 5}, {"date": "Nov 2, 2015", "text": "Wow this is FANTastic!\nI've Been getting used to\nKeyStrokes base,for a while now on my os with awesome wm. So this fits perfect with browsing.Ty!", "stars": 5}, {"date": "Oct 31, 2015", "text": "amazing", "stars": 5}, {"date": "Oct 30, 2015", "text": "Awesome. 1337", "stars": 5}, {"date": "Oct 29, 2015", "text": "good job !", "stars": 5}, {"date": "Oct 28, 2015", "text": "Great keybindings! Would like a key to place cursor in next insert field, unless I'm missing something something.", "stars": 5}, {"date": "Oct 27, 2015", "text": "Amazing. Chrome is now usable with speech input. You prince among men, you've saved my life!", "stars": 5}, {"date": "Oct 25, 2015", "text": "awesome!!!!!!!", "stars": 5}, {"date": "Oct 24, 2015", "text": "These days, Marks.activateCreateMode\nand Marks.activateGotoMode don't work", "stars": 3}, {"date": "Oct 23, 2015", "text": "Greatest app that I always install anywhere I use", "stars": 5}, {"date": "Oct 23, 2015", "text": "How can i force open a 'target=\"_blank\"' link in current tab?", "stars": 5}, {"date": "Oct 22, 2015", "text": "Awesome tool extension.", "stars": 5}, {"date": "Oct 17, 2015", "text": "Scrolling shortcuts are broken.", "stars": 4}, {"date": "Oct 16, 2015", "text": "It's a great extension for vim funs. But it doesn't work when page can't load. it doesn't work on gmail.", "stars": 4}, {"date": "Oct 15, 2015", "text": "f command, mind blown! This is like the most insanely useful tool.. made my week", "stars": 5}, {"date": "Oct 10, 2015", "text": "hh", "stars": 3}, {"date": "Oct 7, 2015", "text": "Brilliant tool for every Vim user :)", "stars": 5}, {"date": "Oct 6, 2015", "text": "powerful if you love vim", "stars": 5}, {"date": "Oct 2, 2015", "text": "Good stuff!!!", "stars": 5}, {"date": "Sep 26, 2015", "text": "Awesome stuff!", "stars": 5}, {"date": "Sep 24, 2015", "text": "So Awesome!! You need this extension.", "stars": 5}, {"date": "Sep 17, 2015", "text": "just awesome!", "stars": 5}, {"date": "Sep 16, 2015", "text": "It was working wonderfully great till the update 1.52. Added a HUD text field and 2 panel on the bottom left of my browser. There is \"no\" documentation on how to remove this. Very annoying. Sadly I have to disable/remove this till this is fixed.", "stars": 4}, {"date": "Sep 15, 2015", "text": "Indispensable, expecially when coding, you can keep your hands on the keyboard during web navigation.", "stars": 5}, {"date": "Sep 15, 2015", "text": "a very very ... good tool", "stars": 5}, {"date": "Sep 11, 2015", "text": "Outstanding extension that's been very helpful.", "stars": 5}, {"date": "Sep 11, 2015", "text": "simply love it...", "stars": 5}, {"date": "Sep 10, 2015", "text": "+Erick Barron, i got the same problem, you can click the page with mouse, or press TAB.\n\nThis extension is rock.", "stars": 5}, {"date": "Sep 8, 2015", "text": "Love it very much", "stars": 5}, {"date": "Sep 6, 2015", "text": "it is not work in the chrome version 46+", "stars": 4}, {"date": "Sep 5, 2015", "text": "It's great, I use it every day.", "stars": 5}, {"date": "Aug 30, 2015", "text": "I really loved this extension. Using mouse for browsing was such a pain. Being a vim user I love the vim bindings !!", "stars": 5}, {"date": "Aug 27, 2015", "text": "1 thing,\n2 do,\n3 words,\n4 this plugin, \nI love it.", "stars": 5}, {"date": "Aug 26, 2015", "text": "Great extension i've ever meet.", "stars": 5}, {"date": "Aug 26, 2015", "text": "He put the 'awe' back in awesome.\n\nI almost switched to firefox because of the missing '/' shortcut. It was there in Chrome, but was removed for no apparant reason.\n\nThat's just one of the keys... If you use VI at all anywhere, you will want this. Hit 'Install' now. Life is good now.", "stars": 5}, {"date": "Aug 25, 2015", "text": "This is everything I ever needed. Please make it as a standard package in every Chrome or any other browser. Great!", "stars": 5}, {"date": "Aug 22, 2015", "text": "Very powerful extension. \n\nSmall request, can you add an option to quickly disable the extension in a drop down menu. In case someone else is on my computer and I dont want to have to keep typing 'I'.\n\nCheers", "stars": 5}, {"date": "Aug 18, 2015", "text": "Perfect for quick navigation", "stars": 5}, {"date": "Aug 17, 2015", "text": "exactly what I was looking for, thank you very much", "stars": 5}, {"date": "Aug 17, 2015", "text": "Perfect for power users, thank you for your effort", "stars": 5}, {"date": "Aug 16, 2015", "text": "Very smooth commands that allow me to improve my work speed.", "stars": 5}, {"date": "Aug 15, 2015", "text": "One of the best extension in Chrome ! thank you so much.", "stars": 5}, {"date": "Aug 14, 2015", "text": "This extension really boosted my browsing productivity", "stars": 5}, {"date": "Aug 5, 2015", "text": "Cool~ No more mouse navigation when using the browser.", "stars": 5}, {"date": "Aug 3, 2015", "text": "Thank you very much. My mouse usage just dropped to 2%, leaving 3D modelling the only task.", "stars": 5}, {"date": "Jul 30, 2015", "text": "userful!", "stars": 5}, {"date": "Jul 30, 2015", "text": "Very good", "stars": 5}, {"date": "Jul 29, 2015", "text": "Perfect for vimmers, if it can record a macro it will be amazing.", "stars": 5}, {"date": "Jul 27, 2015", "text": "Perfect Tool", "stars": 5}, {"date": "Jul 24, 2015", "text": "I like it!", "stars": 5}, {"date": "Jul 23, 2015", "text": "scrolling with jk is something i'm really used to..", "stars": 5}, {"date": "Jul 23, 2015", "text": "very nice app. \nthank you", "stars": 5}, {"date": "Jul 22, 2015", "text": "very cool", "stars": 5}, {"date": "Jul 21, 2015", "text": "LoveIt!", "stars": 5}, {"date": "Jul 16, 2015", "text": "Does exactly what it claims, never experienced any problem. A must have if you sometimes like to use the keyboard and not be dependent on your mouse.", "stars": 5}, {"date": "Jul 16, 2015", "text": "It's a must have for me now. Vim scrolling for ever! \nI love this! Awesome! Thank you pals!", "stars": 5}, {"date": "Jul 15, 2015", "text": "perfect for laptop use.", "stars": 5}, {"date": "Jul 14, 2015", "text": "Its great for my produtium. Thanks.", "stars": 5}, {"date": "Jul 12, 2015", "text": "Awesome!", "stars": 5}, {"date": "Jul 12, 2015", "text": "My best favorite extension!! So much love it. And thing gets improved and improved. Best of its kind! Thanks!!", "stars": 5}, {"date": "Jul 5, 2015", "text": "Huge disappointment when coming from Pentadactyl on Firefox. Doesn't work on most websites (e.g. here) or in private browsing mode (incognito). Doesn't have visual cursor for text highlighting. There's no way to edit textarea in vim. Doesn't have command line.", "stars": 2}, {"date": "Jul 3, 2015", "text": "I think it is nice.", "stars": 5}, {"date": "Jul 2, 2015", "text": "Incredibly powerful and accurate scraping for keyboard based browsing. Combined with speech recognition tools, browsing hands free is achieved with ease. Great!", "stars": 5}, {"date": "Jul 1, 2015", "text": "Vimium is awesome!", "stars": 5}, {"date": "Jun 29, 2015", "text": "Thanks!", "stars": 5}, {"date": "Jun 28, 2015", "text": "Extremly good!", "stars": 5}, {"date": "Jun 28, 2015", "text": "Great extension!", "stars": 5}, {"date": "Jun 26, 2015", "text": "Awesome!", "stars": 5}, {"date": "Jun 25, 2015", "text": "Very well made.", "stars": 5}, {"date": "Jun 23, 2015", "text": "this is amazing. love it.", "stars": 5}, {"date": "Jun 23, 2015", "text": "great idea and implementation!!!", "stars": 5}, {"date": "Jun 12, 2015", "text": "It's simply awesome :)", "stars": 5}, {"date": "Jun 12, 2015", "text": "This needs to be incorporated by default in chrome.", "stars": 5}, {"date": "Jun 10, 2015", "text": "you guys are genius.", "stars": 5}, {"date": "Jun 10, 2015", "text": "Start chrome in kiosk mode to fully enjoy the powers.", "stars": 5}, {"date": "Jun 8, 2015", "text": "I just wanna sit back and relax with my palms on the table and my fingers on the keyboard, without any of that difficult arm motion.  Now I can do that.", "stars": 5}, {"date": "Jun 7, 2015", "text": "Great add-on saves me a lot of time and really comfort!", "stars": 5}, {"date": "Jun 7, 2015", "text": "save me so much time. Love it", "stars": 5}, {"date": "Jun 6, 2015", "text": "great extension, even if you are not familiar with vi/vim you get used to it fast, give it a try!", "stars": 5}, {"date": "Jun 6, 2015", "text": "Absolutely great! Without a doubt my favorite Chrome plugin.", "stars": 5}, {"date": "Jun 5, 2015", "text": "Must have for vim users!", "stars": 5}, {"date": "Jun 2, 2015", "text": "If you used to use Vim, it will be nice life hack :}", "stars": 5}, {"date": "May 27, 2015", "text": "change my life.  \n\nToo bad not based on emacs", "stars": 5}, {"date": "May 21, 2015", "text": "The extension is quite good.\n\nBut if I type some words using the \"O\" command, the resulting google search page is confused.\n\nIt looks like \"xxx?q= xxx\" ranther than \"xxx\".\n\nHope this problem can be solved.", "stars": 5}, {"date": "May 20, 2015", "text": "Use it for 4 months now, and it has become more and more useful, especially with dual/trio monitors. I can navigate faster than using mouse.", "stars": 5}, {"date": "May 19, 2015", "text": "10/10 would vim again.", "stars": 5}, {"date": "May 18, 2015", "text": "Makes mouse-less browsing possible. Laptops are useless without this.", "stars": 5}, {"date": "May 16, 2015", "text": "I have been using this add on for a long quite a while now and I love it.  It works flawlessly! It makes browsing the web so much better especially on a laptop.", "stars": 5}, {"date": "May 16, 2015", "text": "Great!", "stars": 5}, {"date": "May 13, 2015", "text": "Quoting another review:\n\n\"So well done and so useful. Can't praise this enough. Can't believe for how long I operated in the cave man era using mouse.\"\n\nSo true, I've been a cave man for so long, finally started using this.", "stars": 5}, {"date": "May 12, 2015", "text": "Can finally ditch the mouse for checking documentation on the web.", "stars": 5}, {"date": "May 12, 2015", "text": "Exceptionally useful, by far my favorite chromium app.", "stars": 5}, {"date": "May 10, 2015", "text": "To scrolling PDF everyday on Chromebook, Vimium is more competent.", "stars": 5}, {"date": "May 9, 2015", "text": "There are very few extensions that improve my life and career. Vimium is one of them. Make a donation.", "stars": 5}, {"date": "May 9, 2015", "text": "most time is good,but there're some bugs", "stars": 5}, {"date": "May 8, 2015", "text": "This is the best keyboard navigation for Chrome I have ever used. Will feel very natural to all vim users.", "stars": 5}, {"date": "May 8, 2015", "text": "it seems we all love it, 5 stars average", "stars": 5}, {"date": "May 4, 2015", "text": "If you are familiar with vi, you'll never browse again without it. If not, there is your chance ;)\nI simply love it.", "stars": 5}, {"date": "May 4, 2015", "text": "I think firefox vimperator is better than vimium, because vimium sometimes can not use.", "stars": 3}, {"date": "May 4, 2015", "text": "Awesome!\nAll I need is scroll up/down and follow links but this extensions does so much more.\nNext/previous page is one of my favorites :-)", "stars": 5}, {"date": "May 4, 2015", "text": "perfect extension for programmers !", "stars": 5}, {"date": "May 1, 2015", "text": "Thank you. For this. I'm bout to do some mad web browsing with this.\n\nSO MUCH PRODUCTIVITY.", "stars": 5}, {"date": "Apr 28, 2015", "text": "This is my favorite extension.", "stars": 5}, {"date": "Apr 28, 2015", "text": "I love it. I like the new visual mode too!", "stars": 5}, {"date": "Apr 27, 2015", "text": "It's pretty good.\nEven though Chrome restricted many functionality it can have.\nVim wrappers in Firefox are so much better than these in Chrome.", "stars": 5}, {"date": "Apr 27, 2015", "text": "Super high efficiency", "stars": 5}, {"date": "Apr 27, 2015", "text": "1.50 release is amazing!:\n  visual mode\n  search(/) history\n  `gi`", "stars": 5}, {"date": "Apr 22, 2015", "text": "Have to use this!!!", "stars": 5}, {"date": "Apr 22, 2015", "text": "My favourite ext. Boosts productivity", "stars": 5}, {"date": "Apr 20, 2015", "text": "If there's something better I wanna know. But this one has been great so far", "stars": 5}, {"date": "Apr 19, 2015", "text": "Does what it says on the tin. Acts weird with inputs but that is no fault of the plugin and more a fault of browser design.", "stars": 5}, {"date": "Apr 17, 2015", "text": "[open tab in background] works again on Chrome 42", "stars": 4}, {"date": "Apr 2, 2015", "text": "z best", "stars": 5}, {"date": "Mar 30, 2015", "text": "Awesome extension for power users to improve efficiency of using Chrome.", "stars": 5}, {"date": "Mar 29, 2015", "text": "Have to give 3 stars, I don't know what happened but when I do the \"F\" it does not open the tabs in background.", "stars": 3}, {"date": "Mar 29, 2015", "text": "So awesome.  I am one with the web.  All the worlds information at the speed of thought.", "stars": 5}, {"date": "Mar 29, 2015", "text": "A good plugin to control browser via keyboard", "stars": 4}, {"date": "Mar 28, 2015", "text": "I haven't had this much fun browsing since yesterday!", "stars": 5}, {"date": "Mar 26, 2015", "text": "nice !", "stars": 5}, {"date": "Mar 24, 2015", "text": "Amazing app! It increases 100% productivity.", "stars": 5}, {"date": "Mar 15, 2015", "text": "I've been using it for almost a year and can't be happier. But it seems that the \"open link in background tab\" shortcut is broken, it moves focus to the new tab", "stars": 4}, {"date": "Mar 13, 2015", "text": "That's just Amazing! Really what I was looking for.\n\nMakes Chrome next to perfect.\n\nWhole new experience, can't think browsing with it anymore!", "stars": 5}, {"date": "Mar 10, 2015", "text": "I can't live without it", "stars": 5}, {"date": "Mar 9, 2015", "text": "So well done and so useful. Can't praise this enough. Can't believe for how long I operated in cave man era using mouse. Thank you!", "stars": 5}, {"date": "Mar 9, 2015", "text": "can someone tell me how to add custom shortcuts. \n\nfor example if I want to make the character g take me to a specified link??", "stars": 5}, {"date": "Mar 6, 2015", "text": "I love it much.", "stars": 5}, {"date": "Mar 4, 2015", "text": "This is such a fantastic extension!\n\nNot only does it make getting around websites with the keyboard better - it also improves navigation in general.\n\nHere's hoping for an expedient fix to Chrome v41's aggressive popup blocker.", "stars": 5}, {"date": "Mar 4, 2015", "text": "Great for vimer!", "stars": 5}, {"date": "Feb 16, 2015", "text": "Excellent extension. The zoom in/out functions are not supported (yet), so I use it in conjunction with the other extension shortkeys.", "stars": 5}, {"date": "Feb 14, 2015", "text": "I use vim many years, now still use it, so this extension offers me a really great help!\n\nI hope the author can add \"move mouse to the link\", because there are many page utilizing \"hover\" now. It will be more helpful then ^__^", "stars": 5}, {"date": "Feb 13, 2015", "text": "wonderfull", "stars": 5}, {"date": "Feb 8, 2015", "text": "good job", "stars": 5}, {"date": "Feb 7, 2015", "text": "This is great.", "stars": 5}, {"date": "Feb 5, 2015", "text": "Good!\n\nWould u add \"selected text\" funcs ? such as use it to find on the page, or search by google directly.\n\nWould u add \"Diable this/All\"? it will help those who want to close vinium shortly.\n\nthanks.\n\nplus, \"Custom search\nengines\" is not available", "stars": 5}, {"date": "Feb 2, 2015", "text": "How did I live my life until now without this?", "stars": 5}, {"date": "Feb 2, 2015", "text": "well it uses for me lot helpful. thanks for providing this extension", "stars": 4}, {"date": "Feb 1, 2015", "text": "Goddammit I can't use chrome without this extension anymore.", "stars": 5}, {"date": "Jan 23, 2015", "text": "Revolutionising!", "stars": 5}, {"date": "Jan 22, 2015", "text": "nice tool", "stars": 5}, {"date": "Jan 22, 2015", "text": "vimperator is better than this", "stars": 3}, {"date": "Jan 21, 2015", "text": "Absolutely love it.", "stars": 5}, {"date": "Jan 19, 2015", "text": "Great for RSI relief", "stars": 5}, {"date": "Jan 17, 2015", "text": "One of the best extension out there, specially if you are used to linux like keyboard shortcuts. Thanks for creating this.", "stars": 5}, {"date": "Jan 5, 2015", "text": "Options before installing Vimium Chrome extension. Using shortcut key \"?\"\n\nVimium - The Hacker's Browser \n\nQuick keystrokes for Advanced browsing skills! Quick Shortcuts are something most advanced Techies have used for years! \n\nThis extension is basicly what kinda quick access we all have been wishing/dreamed of having with chrome!\n\nUse it now to unlock it full potential\n\nI do not recommend for the non-adventurous type or basic users at all!\n\nHi5 and thanks #Vimium Creator!\n\nJustin Cram\nDyin... Show more", "stars": 3}, {"date": "Jan 4, 2015", "text": "I love it.", "stars": 5}, {"date": "Jan 4, 2015", "text": "I really wish I had the option of hlsearch.  Give me that, and you get another shiny star from me.  :)", "stars": 4}, {"date": "Jan 4, 2015", "text": "Fantastic extension! I just learn of many options and features I had been ignoring too, so it's even more useful to me now.\n\nVery very well done.", "stars": 5}, {"date": "Dec 30, 2014", "text": "love it!!!", "stars": 5}, {"date": "Dec 29, 2014", "text": "very useful app! RECOMENDED!", "stars": 5}, {"date": "Dec 29, 2014", "text": "Going Commando - Put Down That Mouse!", "stars": 5}, {"date": "Dec 25, 2014", "text": "I can't use the shortcut x to close the tab when the tab is loading.do me a favor.Thank you.", "stars": 5}, {"date": "Dec 25, 2014", "text": "One suggestion: It's better to support Regex.", "stars": 3}, {"date": "Dec 23, 2014", "text": "It's really awesome. But one feature I'm looking forward is the visual mode in vim. So we will be able to select text with keyboard.", "stars": 5}, {"date": "Dec 22, 2014", "text": "I've been using vim for years so the key maps are engrained in my fingers. It feels right navigating the browser with vimium! I wish I had found this sooner.", "stars": 5}, {"date": "Dec 22, 2014", "text": "Fantastic!\nBut just one little problem: When I open a new tab, vimium doesn't work.", "stars": 4}, {"date": "Dec 20, 2014", "text": "wow works like magic", "stars": 5}, {"date": "Dec 19, 2014", "text": "Smooth scrolling FTW!\n\nSeriously though, can't imagine life without this plugin now.", "stars": 5}, {"date": "Dec 19, 2014", "text": "freaking awesome", "stars": 5}, {"date": "Dec 19, 2014", "text": "vv", "stars": 4}, {"date": "Dec 19, 2014", "text": "Great extension; however, in some pages the j/k scrolling either doesn't work or requires me to focus on the main page's frame to get it started. A good example is opengrok's source code pages.", "stars": 4}, {"date": "Dec 18, 2014", "text": "Hi, using this for several months now. Can't imagine live without it. Were is the donate button?\n\nps.: love the new smooth scrolling!", "stars": 5}, {"date": "Dec 18, 2014", "text": "I've used this plugin for over a year. Now that it has smooth scrolling, I felt I needed to contribute a well-deserved glowing review!", "stars": 5}, {"date": "Dec 17, 2014", "text": "Cool !", "stars": 5}, {"date": "Dec 17, 2014", "text": "One of the most useful extensions. \n\nLatest update worth 6 stars!", "stars": 5}, {"date": "Dec 17, 2014", "text": "Great gift for vimer!", "stars": 5}, {"date": "Dec 17, 2014", "text": "This extension is extremely useful!", "stars": 5}, {"date": "Dec 17, 2014", "text": "I love that you've added most of the features I loved about Vimperator and missed when I moved to Chrome. The only ones I am missing now are quickmarks for pages (typing \"gof\" to instantly spawn a facebook tab and \"gom\" for quick access to gmail and so forth) and link following by link text (\"fhello\" to follow whichever link has \"hello\" in it).", "stars": 5}, {"date": "Dec 17, 2014", "text": "Nice one.", "stars": 5}, {"date": "Dec 17, 2014", "text": "until the new update it was working awesome, but after the new update vimium just stops working on the tabs that are open in the background.", "stars": 3}, {"date": "Dec 17, 2014", "text": "If your fingers are trained to vim around everywhere, this is a must-have extension.", "stars": 5}, {"date": "Dec 17, 2014", "text": "it's great for engineer to surfing the internet", "stars": 5}, {"date": "Dec 17, 2014", "text": "the great plugin", "stars": 5}, {"date": "Dec 17, 2014", "text": "kidding,update twice a day.", "stars": 4}, {"date": "Dec 17, 2014", "text": "New update is awesome", "stars": 5}, {"date": "Dec 16, 2014", "text": "Awsome! If you use vim on normal base try this and you will never stop!", "stars": 5}, {"date": "Dec 16, 2014", "text": "Hi,\nafter new update \"gg\" or \"G\" stopped work. After browser restart it started working, but then after some time it stopped.\n\nBeside this works awesome", "stars": 4}, {"date": "Dec 16, 2014", "text": "Invaluable. Probably one of my most relied upon chrome apps. It's like wearing shoes - but online.", "stars": 5}, {"date": "Dec 16, 2014", "text": "Love Vimium, can't imagine going back to non-Vimium browsing or work world.\n\nThat said, latest updates do not play nice with increased font size on pages. (CMD)+(=) a few times on pages, and all the page up/page down commands misbehave. This used to only effect u and d, but now affects j, k, even gg, and G. Up/down increment now seems random, and very very low. Those guys are hard-wired into my fingers, and working without them is a bit of a pain. Chrome 39.0.2171.95 on OS X 10.9.5\n\nThat said... Show more", "stars": 4}, {"date": "Dec 16, 2014", "text": "awesome, huge time saver when coding web...", "stars": 5}, {"date": "Dec 16, 2014", "text": "This is awesome!\nYou guys have done a wonderful job at this. I never look back at browsing the old way again.", "stars": 5}, {"date": "Dec 16, 2014", "text": "Make me feel at home.", "stars": 5}, {"date": "Dec 16, 2014", "text": "This extension is fantastic. Tremendously speeds up browser interaction. A necessity if your workflow includes web apps.", "stars": 5}, {"date": "Dec 16, 2014", "text": "the interwebs should be just like this ... goodbye mouse", "stars": 5}, {"date": "Dec 16, 2014", "text": "couldn't live without it", "stars": 5}, {"date": "Dec 16, 2014", "text": "only one word, awesome extension", "stars": 5}, {"date": "Dec 16, 2014", "text": "Great extension", "stars": 5}, {"date": "Dec 16, 2014", "text": "Just perfect!", "stars": 5}, {"date": "Dec 16, 2014", "text": "Great! But I can't scroll with j and k anymore since the last update :(", "stars": 5}, {"date": "Dec 16, 2014", "text": "just fantastic!", "stars": 5}, {"date": "Dec 16, 2014", "text": "Really Nice Plugin,", "stars": 5}, {"date": "Dec 16, 2014", "text": "j/k still not work...\n\nversion:Chrome/39.0.2171.95\nMac OS X :10.9.5", "stars": 4}, {"date": "Dec 16, 2014", "text": "Since the new update the function *restore previous tab on X not working pls fix this.", "stars": 1}, {"date": "Dec 16, 2014", "text": "Used it for almost two years. Can't be better.", "stars": 5}, {"date": "Dec 16, 2014", "text": "I am addicted to this app.", "stars": 5}, {"date": "Dec 16, 2014", "text": "great, my hands needn't leave keyboard from now on!!", "stars": 5}, {"date": "Dec 16, 2014", "text": "New version is a little strange that I can not use ctrl + u like before and command gg, GG also do not works well. J and K scroll a very small part of the page. I also need to press them many times to scroll down or up. I can not just press them to trigger the scroll up or down repeatedly.", "stars": 3}, {"date": "Dec 16, 2014", "text": "nice feature!", "stars": 5}, {"date": "Dec 16, 2014", "text": "Awesome!", "stars": 5}, {"date": "Dec 16, 2014", "text": "Chrome 39.0.2171.95\n\ngg and G, j k are not working, please fix it soon.", "stars": 5}, {"date": "Dec 16, 2014", "text": "how about add the function about save the bookmark.", "stars": 5}, {"date": "Dec 16, 2014", "text": "Why did you switch it to smooth scrolling without implementing an option for users to choose if they want it or not? smooth scrolling wastes cpu cycles. That was a turn off for me.\n\n/edit Thanks for listening to the users and for the quick fix. It's great again.", "stars": 5}, {"date": "Dec 16, 2014", "text": "awesome", "stars": 5}, {"date": "Dec 4, 2014", "text": "Vim everywhere! Just started with it but looks promising.", "stars": 5}, {"date": "Dec 2, 2014", "text": "Awesome, cant wait to see more features from Phil and Ilya", "stars": 5}, {"date": "Dec 1, 2014", "text": "Hoooray :)\nCool.", "stars": 5}, {"date": "Nov 30, 2014", "text": "Just awesome!", "stars": 5}, {"date": "Nov 30, 2014", "text": "shift+ j and k is used to switch tabs left and right instead of h and l, which would be the obvious choice. otherwise I'm loving it.", "stars": 4}, {"date": "Nov 28, 2014", "text": "what a great app! my mouse is gathering dust!", "stars": 5}, {"date": "Nov 27, 2014", "text": "quite helpful", "stars": 5}, {"date": "Nov 27, 2014", "text": "WHoever added the <gi> shortcut, U DA REAL MVP", "stars": 5}, {"date": "Nov 26, 2014", "text": "change my life", "stars": 5}, {"date": "Nov 26, 2014", "text": "Actually allows you to create custom, sane keybindings!\n\nMy only suggestion is a way to run a script from a keybinding. That would make this a must-have extension for any power user.", "stars": 5}, {"date": "Nov 17, 2014", "text": "Made me ninja fast with surfing.. Awesome :)", "stars": 5}, {"date": "Nov 14, 2014", "text": "One of the most essential extensions besides a good adblocker.", "stars": 5}, {"date": "Nov 7, 2014", "text": "Amazing extension.", "stars": 5}, {"date": "Nov 7, 2014", "text": "awesome", "stars": 5}, {"date": "Nov 6, 2014", "text": "Once you're used to it, it's hard to go back to browsing without Vimium.", "stars": 5}, {"date": "Nov 3, 2014", "text": "Incredible Plugin with many advantages, including quicker navigation, easier navigation, and you look like a hacker.", "stars": 5}, {"date": "Nov 2, 2014", "text": "great - simply great. Finally there is a way to navigate with the keyboard only. Also great on mobile computers where the mousepad often sucks :-)", "stars": 5}, {"date": "Oct 30, 2014", "text": "Awesome ~ love it .", "stars": 5}, {"date": "Oct 30, 2014", "text": "Awesome extension. But experiencing a problem with the latest chrome version on ubuntu 14.04. Certain keys simply fail to work when Vimium is enabled.", "stars": 4}, {"date": "Oct 29, 2014", "text": "awesome!", "stars": 5}, {"date": "Oct 28, 2014", "text": "saves me so much time when I am doing major browsing!", "stars": 5}, {"date": "Oct 27, 2014", "text": "cool", "stars": 5}, {"date": "Oct 25, 2014", "text": "Everything is fine. The only problem is when I open a new tab and the focus is on the browser address bar, so I can't use vimimum shortcuts and I have to click on the page to remove focus from the it.", "stars": 4}, {"date": "Oct 21, 2014", "text": "This plugin works awesome without any problems.\n\nI only miss one option: disable automatically turning into insert mode if loaded page includes text box. \n\nOn some portals there's text box on every page and every time I need to exit enter mode to continue browsing.\n\nIt is possible to allow changing this behavior ?", "stars": 5}, {"date": "Oct 20, 2014", "text": "Gooooood! I feel free from my mouse. I expect that I will ABSOLUTELY be free from the mouse if the vimium has some functions such as \"right click on an html-element\" or \"select an html-element\".", "stars": 5}, {"date": "Oct 19, 2014", "text": "First used VI in about 1987, loved it instantly and have used VI, VIM and GVIM ever since. First used Vimium today and it's marvellous, absolutely wonderful. Just like VI it is intuitive, logical and a pleasure to use. Thank you!", "stars": 5}, {"date": "Oct 17, 2014", "text": "Thanks so much for writing this plugin.  I love vim + chrome so this is like a dream come true :)", "stars": 5}, {"date": "Oct 17, 2014", "text": "ok", "stars": 5}, {"date": "Oct 15, 2014", "text": "Genius ! Just Genius !", "stars": 5}, {"date": "Oct 9, 2014", "text": "Awesome Plugin.I love it!", "stars": 5}, {"date": "Oct 7, 2014", "text": "Awesome extension.", "stars": 5}, {"date": "Oct 6, 2014", "text": "very good tool", "stars": 5}, {"date": "Oct 5, 2014", "text": "Simply the best extension. I have gotten so used to it that I get annoyed when am on a different browser than chrome. I remapped almost all keys and my dear mouse is history now.", "stars": 5}, {"date": "Oct 3, 2014", "text": "Just Awesome", "stars": 5}, {"date": "Oct 1, 2014", "text": "Overall pretty useful, but i wish it would warn me when i accidentally type a large number then try to open a tab...  just got through closing 900k tabs after crashing my computer several times.\n\nStill, good plugin - would recommend.", "stars": 4}, {"date": "Oct 1, 2014", "text": "So good", "stars": 5}, {"date": "Sep 28, 2014", "text": "update my chrome,and now it doesn't work...\nVersion 37.0.2062.124 m", "stars": 5}, {"date": "Sep 23, 2014", "text": "Makes using Chrome a civilised experience.", "stars": 5}, {"date": "Sep 22, 2014", "text": "Awesome !! love vim navigation !!", "stars": 5}, {"date": "Sep 20, 2014", "text": "I cannot believe how long I have been living without this extension. I am forever grateful.", "stars": 5}, {"date": "Sep 19, 2014", "text": "This is amazing, please keep up the updates.", "stars": 5}, {"date": "Sep 18, 2014", "text": "Fantastic!", "stars": 5}, {"date": "Sep 18, 2014", "text": "This is the best and most powerful extension ever!  It even replaces a few other shortcut extensions   in my Chrome toolbox.", "stars": 5}, {"date": "Sep 17, 2014", "text": "if you like vi/vim, it is best plug-in", "stars": 5}, {"date": "Sep 15, 2014", "text": "Revolutionary plugin. (y)", "stars": 5}, {"date": "Sep 10, 2014", "text": "This is a great plug-in. I'm really enjoying the ability to keep my hands on the keyboard when swapping back and forth from terminal to browser.", "stars": 5}, {"date": "Sep 9, 2014", "text": "This was an awesome extension untill recently. Any idea why it would stop working on all pages except the vimium options page?", "stars": 5}, {"date": "Sep 7, 2014", "text": "Amazing.", "stars": 5}, {"date": "Sep 3, 2014", "text": "My new favourite plugin! Executed really well :)", "stars": 5}, {"date": "Aug 30, 2014", "text": "Wonderful. Absolutely brilliant app. I never thought browsing web would be so fast.", "stars": 5}, {"date": "Aug 25, 2014", "text": "Perfect!! Thanks!", "stars": 5}, {"date": "Aug 21, 2014", "text": "simply awesome!!! thx to the developers, great work!", "stars": 5}, {"date": "Aug 19, 2014", "text": "Amazing plugin. I'm quite new to vim, but I've enjoyed Vimium very much. It allows to navigate much more efficiently. I found it much more friendlier and convenient than Vimperator for firefox.", "stars": 5}, {"date": "Aug 17, 2014", "text": "The custom commands are just awesome !! Thanks for this great Plugin!", "stars": 5}, {"date": "Aug 16, 2014", "text": "Amazing piece of s/w. \n\nReally enjoying using it.", "stars": 5}, {"date": "Aug 15, 2014", "text": "That's totally awesome! So creative and brilliant idea about this.", "stars": 5}, {"date": "Aug 14, 2014", "text": "Awesome and simple extension.", "stars": 5}, {"date": "Aug 14, 2014", "text": "Awesome!", "stars": 5}, {"date": "Aug 13, 2014", "text": "Awesome. I love it.", "stars": 5}, {"date": "Aug 11, 2014", "text": "Big thanks for making this plugin. I have RSI and this makes browsing much easier.", "stars": 5}, {"date": "Aug 11, 2014", "text": "amazing the best. great. can't live without it.", "stars": 5}, {"date": "Aug 10, 2014", "text": "i have a suggestion.\nso far, we can't use vimium very well when focus lies in the input controls, why not add some combination-keys to control whether to force the vimium work or not.\nthanks for your good work!", "stars": 5}, {"date": "Aug 8, 2014", "text": "i love this", "stars": 5}, {"date": "Aug 8, 2014", "text": "Perfect with Chrome", "stars": 5}, {"date": "Aug 7, 2014", "text": "Absolutely fantasic.", "stars": 5}, {"date": "Aug 5, 2014", "text": "Game Changer!\n \nThis extension cannot be overemphasized in either productivity or ease of use. \n\n Do yourself a favor and try it, nuff sed.\n\n -D", "stars": 5}, {"date": "Aug 1, 2014", "text": "best extension ever.\nhad to remap almost all keys...\nPlease add \"toggleFullScreen\" command !", "stars": 5}, {"date": "Aug 1, 2014", "text": "awesome", "stars": 5}, {"date": "Jul 28, 2014", "text": "Awesome.", "stars": 5}, {"date": "Jul 28, 2014", "text": "Nice plugin! Love it!", "stars": 5}, {"date": "Jul 27, 2014", "text": "It is really awesome!", "stars": 5}, {"date": "Jul 24, 2014", "text": "Awesome Pluggin, love it.", "stars": 5}, {"date": "Jul 22, 2014", "text": "Great extension. One request, please: allow user to specify a per-site prefix for all commands so that I can use the extension on sites with overlapping keyboard shortcuts.", "stars": 4}, {"date": "Jul 21, 2014", "text": "The single best plugin have ever used in Chrome!", "stars": 5}, {"date": "Jul 21, 2014", "text": "open tab in background not worked?", "stars": 5}, {"date": "Jul 21, 2014", "text": "Couldn't live without it.", "stars": 5}, {"date": "Jul 21, 2014", "text": "Awesome plugin! I like it!", "stars": 5}, {"date": "Jul 21, 2014", "text": "Could have more keys, but this is awesome nonetheless. Thank you!", "stars": 5}, {"date": "Jul 21, 2014", "text": "Great!!!", "stars": 5}, {"date": "Jul 21, 2014", "text": "vim everywhere!", "stars": 5}, {"date": "Jul 21, 2014", "text": "Hope the author adds the visual mode. thanks for your contributions.", "stars": 5}, {"date": "Jul 21, 2014", "text": "very nice tool!", "stars": 5}, {"date": "Jul 18, 2014", "text": "This is incredible", "stars": 5}, {"date": "Jul 17, 2014", "text": "perfect", "stars": 5}, {"date": "Jul 16, 2014", "text": "Keep your hands in the home row. You can do a lot without touching the rodent. Vim user? Get this.", "stars": 5}, {"date": "Jul 12, 2014", "text": "Couldn't live without this plugin. Every time I use chrome without this plugin I notices how useful it is.", "stars": 5}, {"date": "Jul 11, 2014", "text": "I really love it. I had a few small gripes with it, but I can configure those away. To configure, hit the question mark to bring up the options button, and then remap stuff or whatever you need.", "stars": 5}, {"date": "Jul 11, 2014", "text": "I guess it is time to start learning vim (-:", "stars": 5}, {"date": "Jul 9, 2014", "text": "no visual mode. some mappings is weird e.g.: \"u\" and \"d\" for scrolling by page", "stars": 4}, {"date": "Jul 8, 2014", "text": "Just amazing!", "stars": 5}, {"date": "Jul 7, 2014", "text": "And when you think: 'I'd like to style the link hints, let's see where it's in the source' – It's already in the options! Absolutely awesome!", "stars": 5}, {"date": "Jul 7, 2014", "text": "One of my favorite chrome extension!", "stars": 5}, {"date": "Jul 4, 2014", "text": "amazing", "stars": 5}, {"date": "Jul 3, 2014", "text": "This is a masterpiece. Good god, thank you.", "stars": 5}, {"date": "Jul 3, 2014", "text": "enough features for browsing without keyboard", "stars": 5}, {"date": "Jun 29, 2014", "text": "If there was command mode which could be invoked by ':', like Vimperator, then this plugin will be even better.\n\nAnyways, it saves me a lot of time while browsing the Net.", "stars": 4}, {"date": "Jun 23, 2014", "text": "Great for heavy vim users :)", "stars": 5}, {"date": "Jun 18, 2014", "text": "Awesome. Awesome, awesome, awesome! Really I'm not kidding: this extension is awesome.", "stars": 5}, {"date": "Jun 17, 2014", "text": "Excellent extension! You can navigate in chrome without mouse most of the time. Very handy.", "stars": 5}, {"date": "Jun 14, 2014", "text": "All these keys that just sit there and do nothing otherwise.  Unacceptable to a vim user!", "stars": 5}, {"date": "Jun 14, 2014", "text": "amazing!", "stars": 5}, {"date": "Jun 13, 2014", "text": "Great extension!", "stars": 5}, {"date": "Jun 9, 2014", "text": "Life changing extension.", "stars": 5}, {"date": "Jun 7, 2014", "text": "Fantastic plugin!!! I love it so much! It is very convenient and greatly improves web browsing efficiency, especially when I don't have a mouse with me.", "stars": 5}, {"date": "May 31, 2014", "text": "Absolutely Stunning!", "stars": 5}, {"date": "May 30, 2014", "text": "This is an awesome plugin. One suggestion to make it even more useful is to implement the 'buffer' functionality like what Vimperator does to Firefox. It allows the user to switch tabs very easily. This essentially solves one of Chrome's worst disadvantage against Firefox that is tab management.", "stars": 4}, {"date": "May 30, 2014", "text": "that's what every vimer should have", "stars": 5}, {"date": "May 27, 2014", "text": "Excellent extension! Searching for open tabs with 'T' is invaluable alone.", "stars": 5}, {"date": "May 26, 2014", "text": "very nice", "stars": 5}, {"date": "May 26, 2014", "text": "couldn't be better", "stars": 5}, {"date": "May 26, 2014", "text": "Things get AWESOME when you hit the \"f\" key! :)", "stars": 5}, {"date": "May 21, 2014", "text": "I had custom CSS for link hints but it's been reset back to the default one for some reason. Hinders a bit but I don't care that much.", "stars": 5}, {"date": "May 11, 2014", "text": "perfect", "stars": 5}, {"date": "May 7, 2014", "text": "can't live without anymore!!", "stars": 5}, {"date": "May 5, 2014", "text": "The extension i install first and will never do without.  As a heavy vim user, this extension is a godsend.", "stars": 5}, {"date": "Apr 30, 2014", "text": "This is an awesome plugin  that implements the most useful features of vim in a web browser. \n\nIf I could ask for more, it would be a cursor that allows you to move between texts and  objects, along with a visual selection allowing you to copy bits of text and images to the clipboard.", "stars": 5}, {"date": "Apr 30, 2014", "text": "Perfect!", "stars": 5}, {"date": "Apr 26, 2014", "text": "it's bomb :) senks", "stars": 5}, {"date": "Apr 24, 2014", "text": "really nice thing!", "stars": 5}, {"date": "Apr 19, 2014", "text": "I was looking for just this!! thanks a lot", "stars": 5}, {"date": "Apr 18, 2014", "text": "I\"ve dreamed about such thing! Superb", "stars": 5}, {"date": "Apr 14, 2014", "text": "it's awesome!", "stars": 5}, {"date": "Apr 12, 2014", "text": "Can you add support for RELOAD ALL TABS?", "stars": 5}, {"date": "Apr 11, 2014", "text": "Amazing and I expect to appreciate it even more on a laptop while commuting. \n\nDisclaimer: I'm a user of gVim/MacVim/Vim on Windows, Mac and Linux console already.", "stars": 5}, {"date": "Apr 11, 2014", "text": "Just Amazing!", "stars": 5}, {"date": "Apr 11, 2014", "text": "YES!\n\n1. Maybe there is another way without Vimium, but I use Vimium to copy the URL of a web page with one click.  I mapped the Vimium yy shortcut to one of my mouse keys. \n\n2. Then I discovered that Vimium shortcut b opens a search box for all my bookmarks. As I start to type a list of bookmarks with those letters are displayed. \n\nThank you to the developers and I do apologize for still using my mouse.", "stars": 5}, {"date": "Apr 6, 2014", "text": "Love this. I was using Vimprobable before. It way worth jumping to this stuff. Great job, guys.", "stars": 5}, {"date": "Apr 6, 2014", "text": "Thank Vimium developers for inventing this extension.  This is so nice tool to use chrome browser without using mouse. Even using basic functionality of this extension makes user's web surf easy.", "stars": 5}, {"date": "Apr 5, 2014", "text": "If you are a keyboard-junkie, this is totally THE tool to use. Simply great.", "stars": 5}, {"date": "Apr 3, 2014", "text": "can not load with 33.0.1750.154m", "stars": 1}, {"date": "Apr 2, 2014", "text": "Excellent extension!\n\nI really appreciate that you guys create this, it has improved a lot my experience/speed/usability in the browser.", "stars": 5}, {"date": "Apr 2, 2014", "text": "Probably the most universally useful Chrome extension. With this, navigating any page not only becomes easy without a mouse, but even faster!", "stars": 5}, {"date": "Apr 1, 2014", "text": "my vote is 5", "stars": 5}, {"date": "Mar 31, 2014", "text": "is there a key for bookmark a page?", "stars": 5}, {"date": "Mar 26, 2014", "text": "I've found a bug!\nWhen the page can't be loaded, the extension can't work at all!", "stars": 4}, {"date": "Mar 26, 2014", "text": "Super awesome tool for chrome shortcuts. have been longing for something on these line.\n\nHaving option to navigate between iFrames would be helpful. Links with multiple iFrames is a pain to handle.", "stars": 4}, {"date": "Mar 25, 2014", "text": "This is great! Another piece of software for my project to control everything on my computer using hjkl.", "stars": 5}, {"date": "Mar 25, 2014", "text": "I wish its work was independent from keyboard layout.", "stars": 3}, {"date": "Mar 22, 2014", "text": "must have extension in chrome!", "stars": 5}, {"date": "Mar 20, 2014", "text": "Nice plugin！It doesn't work in some video website！How to get the focus on video for fast forward!", "stars": 5}, {"date": "Mar 15, 2014", "text": "Great!", "stars": 5}, {"date": "Mar 14, 2014", "text": "Restore closed tab (restoreTab), \nIt Does Not Work. \nsystem: windows7 64bit\nchrome  33.0.1750.149 m", "stars": 4}, {"date": "Mar 12, 2014", "text": "Please add mouse:hover func.", "stars": 5}, {"date": "Mar 11, 2014", "text": "Great Job", "stars": 5}, {"date": "Mar 9, 2014", "text": "excellent", "stars": 5}, {"date": "Mar 5, 2014", "text": "Very awesome. I love it. It would be even better if there was a way to reorder tabs. Like some key shortcut that would move the current tab left or right relative to all the other tabs.", "stars": 5}, {"date": "Mar 5, 2014", "text": "Can't imagine using the internet without this app. As soon as this plugin freezes I'm switching to elinks", "stars": 5}, {"date": "Mar 4, 2014", "text": "works perfectly!\nquite nice browsing experience\n\nthanks", "stars": 5}, {"date": "Feb 26, 2014", "text": "recently using key 'd','u',and some other shortcuts dosen't actually work as they should be.I tried Incognito window of chrome and enabled only Vimium to find possible conflicts,but truth is it didn't work either.", "stars": 4}, {"date": "Feb 24, 2014", "text": "As a Vimer, 5 starts are not enough, I want to give you 50!!!!!", "stars": 5}, {"date": "Feb 22, 2014", "text": "I love this and can't imagine a browser without it! Where it is used is a little inconsistent (most google sites don't work well and sometimes you have to re-select the page) Overall it works well! The one thing I hate the most is that J and K are used to change tabs, when I'm used to H and L in gvim. You can remap the controls so that makes it that much better. However, key remappings don't sync across your browsers so you have to remap it for each different computer you have this on. Overal... Show more", "stars": 5}, {"date": "Feb 18, 2014", "text": "just stopped working. no reason.", "stars": 1}, {"date": "Feb 17, 2014", "text": "amazing!", "stars": 5}, {"date": "Feb 15, 2014", "text": "Great idea, but some things are frustrating: plugin is not works on webstore site and other sites where chrome disables background.html so I cannot switch tabs with shift+k when I stay on webstore tab or on a new tab. And i think that transparent windows and rounded-corners is not nice!", "stars": 4}, {"date": "Feb 11, 2014", "text": "Vimium adds hotkeys that allow the user to switch between mouse and keyboard much less often.  This is a great productivity boost!\n\nVimium adds functionality, but doesn't change Chrome's interface or override any  existing functionality, so there's no learning curve.\n\nAlthough it's inspired by Vim, it doesn't require any familiarity with Vim.", "stars": 5}, {"date": "Feb 10, 2014", "text": "Awesome tool, using it every day!", "stars": 5}, {"date": "Feb 9, 2014", "text": "map is bépo friendly", "stars": 5}, {"date": "Feb 9, 2014", "text": "now i can not scroll the page use j and k", "stars": 5}, {"date": "Feb 6, 2014", "text": "Thank you for a wonderfull app!\nIs it possible to do the following: unmap some key for some url? For example I want to use some built in shortcuts in feedly and some shortcuts from vimium?", "stars": 5}, {"date": "Feb 5, 2014", "text": "Must have for vimer", "stars": 5}, {"date": "Feb 3, 2014", "text": "My only complaint is that it doesn't integrate with gmail and make my life wonderful there as well. I love everything else about the extension.", "stars": 5}, {"date": "Feb 3, 2014", "text": "awesome!\nthx!", "stars": 5}, {"date": "Feb 2, 2014", "text": "Definitely a liberation from mouse! Make searching content far more effective!Sadly this app doesn't support other language(like Chinese) when using /.A great way to master my vim skill.\n============================There is something weird after using Vimium for some time. It got uninstalled or disappeared from Chrome all of a sudden. I have to reinstall it for 3 or 4 times.", "stars": 3}, {"date": "Feb 2, 2014", "text": "I am really missing Opening link in new tab AND navigating there, kind of combo F <character of the link> K\nOtherwise cool stuff!", "stars": 5}, {"date": "Feb 1, 2014", "text": "NEWBIES!!   Huddle up over here! \n\nYOU NEED TO GET THIS!  Don't over think it just download it. NOW, SET IT UP!!  • Right click the VIMIUM ICON.  • click Options.   • select Advanced Settings..  Oh YEAH!  See that tiny empty box next to CUSTOM KEY MAPPING?  THAT's where all the magic happens, ignore everything else.  Nowclick *SHOW AVAILABLE COMMANDS\" for a copy of  Vimium's CheatSheet.  \n\nG : Scroll a full page down. (scrollFullPageDown)\n\nOn the Cheatsheet it shows G assigned to scroll DOWN.... Show more", "stars": 5}, {"date": "Jan 31, 2014", "text": "Love Vimium!\n\nI would like to be able to open downloads and manipulate pages with chrome:// protocol =)", "stars": 5}, {"date": "Jan 29, 2014", "text": "As a vim user this is totally intuitive. Love it.\n\nSuper easy to view the help window if you ever forget a command. Which I found really helpful at the beginning.\n\nKeep up the good work. ☺", "stars": 5}, {"date": "Jan 28, 2014", "text": "excellent", "stars": 5}, {"date": "Jan 26, 2014", "text": "thanks very good extensions", "stars": 5}, {"date": "Jan 24, 2014", "text": "HOW DID I NOT KNOW ABOUT THIS ALREADY??????", "stars": 4}, {"date": "Jan 23, 2014", "text": "Awesome extension!\n\nPlease add tab pin\\unpin\\move functionality if possible!\n\nThanks in advance.", "stars": 5}, {"date": "Jan 22, 2014", "text": "Super!", "stars": 5}, {"date": "Jan 21, 2014", "text": "Awesome!!!", "stars": 5}, {"date": "Jan 19, 2014", "text": "Real men don't click!\n\nThe only feature that I am missing is using some hotkey instead of F, so you could switch ti Vimium mode even when input box is selected (and use it with sites like Gmail).", "stars": 5}, {"date": "Jan 15, 2014", "text": "Amazing extension. I'm just wondering the formula for deciding which link is assigned which letter(s). I know 's' is the first one, but how does the rest get decided?", "stars": 5}, {"date": "Jan 13, 2014", "text": "I have no words for how awesome this is. Only feature missing is text selection and copying.", "stars": 5}, {"date": "Jan 12, 2014", "text": "very good!!!\nI like it very much", "stars": 5}, {"date": "Jan 12, 2014", "text": "I love vim let alone to use it to browse web page!", "stars": 5}, {"date": "Jan 11, 2014", "text": "Useful!", "stars": 5}, {"date": "Jan 9, 2014", "text": "It's a wonderfull extension. Makes browsing easier and allows to concentrate on what really matters. \nWhat this extension lacks (as far as I understand) is that it does not support local languages. It would be just superawesome if it automatically translated pressing certain key combination into english. E.g. russian \"д\" would mean \"l\", \"л\" - k, etc. Of course traditional layouts here apply. This feature is supported in a similar, although not nearly as functional extension here in the web-st... Show more", "stars": 5}, {"date": "Jan 9, 2014", "text": "Very useful!!", "stars": 5}, {"date": "Jan 8, 2014", "text": "Awesome if you are familiar with VIM.", "stars": 5}, {"date": "Jan 8, 2014", "text": "This is what I really wanted!!", "stars": 5}, {"date": "Jan 7, 2014", "text": "The best plugin!", "stars": 5}, {"date": "Jan 5, 2014", "text": "surp good. I like it.", "stars": 5}, {"date": "Jan 4, 2014", "text": "What a brilliant app! Works perfectly. \n\nCoolest part is the f- shortcut which allows you to click on any link on the page with 2-3 keystrokes.", "stars": 5}, {"date": "Jan 2, 2014", "text": "Very good. Not as good as pentadactyl on Firefox, but the best replacement for it so far. Would be nice to see a \"Passthrough/Ignore\" key shortcut to use on the fly. I use the blacklist with some pages, but on some sites I will just be able to disable Vimium for a bit, without using the mouse.", "stars": 4}, {"date": "Jan 1, 2014", "text": "Love it!  Habits are hard to break though, I still reach for the mouse way to much.  But when I remember to use this it is awesome.  I don't think the 'f' key should be used as a link key by default though, so you can toggle off by hitting f again. But I was able to remove it in the advanced options.  Keep up the great work.", "stars": 5}, {"date": "Dec 30, 2013", "text": "Have been searching for something like this for a while.\n\nThis is AWESOME!!!", "stars": 5}, {"date": "Dec 28, 2013", "text": "I can no longer imagine browsing the web without this plugin. It is absolutely essential for any power user!\n\nI really wish this could be added to the chromium source code itself so that I could use it in all sites.", "stars": 5}, {"date": "Dec 28, 2013", "text": "For vim lovers, this is absolutely stellar!\n\nEven without the Gmail capability, it is still a solid 5-star extension.", "stars": 5}, {"date": "Dec 21, 2013", "text": "Really fantastic tool!!!", "stars": 5}, {"date": "Dec 20, 2013", "text": "Its a great app,", "stars": 5}, {"date": "Dec 18, 2013", "text": "Makes web browsing via keyboard a joy!\n\nQuick and efficient.", "stars": 5}, {"date": "Dec 16, 2013", "text": "awesome!", "stars": 5}, {"date": "Dec 15, 2013", "text": "It's a pity it doesn't work in google tabs.", "stars": 4}, {"date": "Dec 9, 2013", "text": "good addon.\nit's a pity that it does not support gmail and chrome.*.com", "stars": 4}, {"date": "Dec 6, 2013", "text": "Very easy to use. Will cause hair to grow out of my ears and nose.", "stars": 5}, {"date": "Dec 4, 2013", "text": "cannot scroll down/up with chrome 33.0.1726.0. anyone with me ?", "stars": 4}, {"date": "Dec 4, 2013", "text": "One of the best  extensions I met, I love it.", "stars": 5}, {"date": "Dec 2, 2013", "text": "Frames still cannot be selected. +1 star if this is implemented.", "stars": 4}, {"date": "Nov 30, 2013", "text": "making everything FASTER !!!!!!!!!!!!!!!", "stars": 5}, {"date": "Nov 29, 2013", "text": "great one", "stars": 5}, {"date": "Nov 29, 2013", "text": "very good", "stars": 5}, {"date": "Nov 27, 2013", "text": "amazing", "stars": 5}, {"date": "Nov 27, 2013", "text": "Love it. Very powerful \"f\" command.", "stars": 5}, {"date": "Nov 27, 2013", "text": "Best app in chrome!", "stars": 5}, {"date": "Nov 25, 2013", "text": "Can't use it to play videos", "stars": 5}, {"date": "Nov 23, 2013", "text": "Very useful", "stars": 5}, {"date": "Nov 22, 2013", "text": "Awesome, I don't have to touch the mouse ever again!", "stars": 5}, {"date": "Nov 18, 2013", "text": "awesome.. The drawback is, i am trying to use HJKL everywhere after using vimium.. :)", "stars": 5}, {"date": "Nov 17, 2013", "text": "What do you think about modifying every textView of the webpage to support  vim modes and command ? Maybe not all of them but basic ? Like insert/move modes and navigation shortcuts like \"A\" \"dw\" \"r\" \"R\" and so on ?", "stars": 5}, {"date": "Nov 14, 2013", "text": "the best vimifier for Chrome!", "stars": 5}, {"date": "Nov 14, 2013", "text": "I haven't been so excited about browser extension", "stars": 5}, {"date": "Nov 11, 2013", "text": "Its awesome. Very productive for me.", "stars": 5}, {"date": "Nov 10, 2013", "text": "Great. I use it to open a bookmark all the time!", "stars": 5}, {"date": "Nov 10, 2013", "text": "Vim should be everywhere!", "stars": 4}, {"date": "Nov 8, 2013", "text": "Absolutely great. My internet productivity and  convenience increased.", "stars": 5}, {"date": "Nov 8, 2013", "text": "I really love this plugin, but links that are loaded through AJAX don't get a hint after you press f.", "stars": 4}, {"date": "Nov 7, 2013", "text": "Steep learning curve if you are not used to vim. But it is AWESOME!\n\nLike said before (by others) any computer not running Chrome with vimmium is just plain painful to use now.\n\nIt's that great. While full featured, I would love to see even more shortcuts.", "stars": 5}, {"date": "Nov 7, 2013", "text": "Intuitive mouseless navigation for vim users.", "stars": 5}, {"date": "Nov 7, 2013", "text": "Absolutely amazing! Finally mouseless browsing that works.\n\nIf it could be combined with Gmail it would be even better. Maybe with some hotkey.", "stars": 5}, {"date": "Nov 7, 2013", "text": "awesome! must have for every vim user or people who hate reaching to the mouse.", "stars": 5}, {"date": "Nov 7, 2013", "text": "It's a great extension making the everyday life of browsing much easier and faster. Especially for repeating tasks.", "stars": 5}, {"date": "Nov 7, 2013", "text": "Everytime I'm on someone else's computer, I feel restricted. No Vimium! I concur with Alex Shroyer. Any keyboard-centric person should use this.", "stars": 5}, {"date": "Nov 7, 2013", "text": "the most favorites plugin!thank you!!", "stars": 5}, {"date": "Nov 7, 2013", "text": "Excellent. I found that I usually use these keys:\ngg(to top) G(to bottom) d(dowm half a page) u->e(up half a page) r(reload) X(open last closed tab), ALL with my left hand. Great.", "stars": 5}, {"date": "Nov 7, 2013", "text": "When you have gotten used to this addon you can´t surf the web without it.\n\nGREAT addon! Especially if you are on a laptop with a touchpad but I use it on my workstation as well.", "stars": 5}, {"date": "Nov 7, 2013", "text": "Fantastic", "stars": 5}, {"date": "Nov 7, 2013", "text": "very very good", "stars": 5}, {"date": "Nov 7, 2013", "text": "Wow I haven't rated this 5 stars yet?  I've been using it for ages and it's always been awesome.  My bad.", "stars": 5}, {"date": "Nov 7, 2013", "text": "if Vimium can support chinese, I'll lovest it，tks", "stars": 4}, {"date": "Nov 7, 2013", "text": "I use vim and xmonad, and this makes web browsing much more natural. Kudos.", "stars": 5}, {"date": "Nov 7, 2013", "text": "Makes using a browser bearable.", "stars": 5}, {"date": "Nov 7, 2013", "text": "Have been using it from long ago. Good to see it's still updating.", "stars": 5}, {"date": "Nov 7, 2013", "text": "The main problem with this app is it completely ruins web browsing on anything that doesn't have Vimium.", "stars": 5}, {"date": "Nov 7, 2013", "text": "awesome!!\nI like it very much", "stars": 5}, {"date": "Nov 7, 2013", "text": "Very nice. Very fast. Love it.", "stars": 5}, {"date": "Nov 7, 2013", "text": "Nothing but love", "stars": 5}, {"date": "Nov 7, 2013", "text": "I absolutely love this plugin. It makes browsing the web feel as good as using vim.", "stars": 5}, {"date": "Nov 6, 2013", "text": "Great,love it", "stars": 5}, {"date": "Nov 6, 2013", "text": "the best thing to happen to my browser since the \"back\" button. so great. so, so great.\ni don't think i've lifted my fingers since installing it last week.", "stars": 5}, {"date": "Nov 5, 2013", "text": "Thank you. This is plug-in is awesome. Really speeds up surfing.", "stars": 5}, {"date": "Nov 4, 2013", "text": "excellent extension", "stars": 5}, {"date": "Nov 3, 2013", "text": "This is the most wonderful extensions I have ever used!", "stars": 5}, {"date": "Oct 31, 2013", "text": "Life just got faster.", "stars": 5}, {"date": "Oct 29, 2013", "text": "Very nice & useful tool!", "stars": 5}, {"date": "Oct 28, 2013", "text": "Do not work on xubuntu 13.10 and Chromium 29", "stars": 1}, {"date": "Oct 28, 2013", "text": "So much better than all the others out there: Fast, intuitive, inobtrusive, slick, ...\n\nI can't say enough good things about Vimium.\n\nTry it for yourself and see -- even if you don't use Vim, the keyboard control alone is worth it!", "stars": 5}, {"date": "Oct 26, 2013", "text": "A good implementation of a subset of Vim's features relevant for the browser.", "stars": 4}, {"date": "Oct 25, 2013", "text": "Perfect!", "stars": 5}, {"date": "Oct 24, 2013", "text": "Wow. This is a great plugin. Well done.\n\nI'd recommend this to everyone who is using Vim, and even if you're not using it.", "stars": 5}, {"date": "Oct 24, 2013", "text": "I really wish I can use this add-on in the new tab (where chrome probably disables the addon). But I guess I have to live with it since it's not likely to be changed by chrome.", "stars": 5}, {"date": "Oct 23, 2013", "text": "Why it does not work in some site", "stars": 4}, {"date": "Oct 23, 2013", "text": "When are you going to add the \"Save Link As\" option ? Everything about this plugin will be complete after that option and I will finally know enlightenment.", "stars": 5}, {"date": "Oct 16, 2013", "text": "very useful \nto surf the internet just by the keyboard", "stars": 5}, {"date": "Oct 11, 2013", "text": "chromium32 and chrome 32 lots of keys is not work now.", "stars": 5}, {"date": "Oct 10, 2013", "text": "Love it!", "stars": 5}, {"date": "Oct 8, 2013", "text": "Phenomenal!!! Absolutely love it! Life / web is so much better with Vimium.", "stars": 5}, {"date": "Oct 3, 2013", "text": "I wonder if it would be possible to search apps ?", "stars": 5}, {"date": "Oct 1, 2013", "text": "definitly better than vrome.", "stars": 5}, {"date": "Sep 30, 2013", "text": "Seriously, get this extension, especially if you have RSI and/or Carpal Tunnel, as it keeps me from having to reach over and use my mouse. I can comfortably navigate the web, do rapid data entry in Wordpress and Drupal, and just be all around more efficient. A lot of work and polish went into this and it shows.", "stars": 5}, {"date": "Sep 27, 2013", "text": "good tool,make my life easy,thank you.", "stars": 5}, {"date": "Sep 24, 2013", "text": "I love it.Some functions are very useful.Like 'yy'\ncan copy the link url.", "stars": 5}, {"date": "Sep 23, 2013", "text": "awesome plugin!!!!", "stars": 5}, {"date": "Sep 16, 2013", "text": "very good.\nmy own mapping \nmap d nextTab\nmap a previousTab\nmap s scrollDown\nmap w scrollUp\n\nvery convenient. the own problam is F,f. The UI can be improved.", "stars": 5}, {"date": "Sep 15, 2013", "text": "Fantastic extension that makes browsing via the keyboard fast and fun.", "stars": 5}, {"date": "Sep 13, 2013", "text": "Great extension. Some shortcuts are better disabled due to too many accidents (like x for close tab, etc)\n\nthe T and F features are extremely useful though", "stars": 4}, {"date": "Sep 9, 2013", "text": "I have been using Vim more and more lately and have finally started using this in my day to day workflow. AMAZING!!!\n\nI have PhpStorm Vim mode enabled as well and the combination of all three makes learning just get faster and faster!!\n\nLove the Regex search mode too, that is beautiful on it's own!", "stars": 5}, {"date": "Sep 9, 2013", "text": "very nice.", "stars": 5}, {"date": "Sep 8, 2013", "text": "That's awesome!!!", "stars": 4}, {"date": "Sep 4, 2013", "text": "I'm hoping to have a  tab mark functionality\ne.g\n>M*( mark the current to *)\nswitch to other tab\n>`* (back to the previous tab)", "stars": 5}, {"date": "Sep 3, 2013", "text": "brilliant smart toy!!\n\ncant live witihout it online surfing woooooha!!!!!!!!!!!!!!!!", "stars": 5}, {"date": "Aug 30, 2013", "text": "obviously the best plugin I ever installed. however, it has some glitches though", "stars": 5}, {"date": "Aug 29, 2013", "text": "j k  \"smoth scroll\" ?\nwe need it\n\nthanks", "stars": 4}, {"date": "Aug 26, 2013", "text": "Great extension!I hope you can add more shortcuts like\"close other tabs\"\"close tabs to the left/right\".", "stars": 5}, {"date": "Aug 26, 2013", "text": "suggestion: \n1. can you support input Chinese when press \"/\" for search! appreciated!\n2. i have to wait until each page loaded before i can vimium to switch each tab. is it possible to enable some feature before page loaded. such as, switch tab, bookmark.\n3. it's disable when browse local file or help. can you enable it for seamless experience?\n\nthanks very much!", "stars": 4}, {"date": "Aug 23, 2013", "text": "Good, but not as good as Vimperator in Firefox.", "stars": 4}, {"date": "Aug 21, 2013", "text": "Awesome ! fast , powerful. thank you .", "stars": 5}, {"date": "Aug 18, 2013", "text": "Would be a little better if you could customize the keybindings.", "stars": 4}, {"date": "Aug 17, 2013", "text": "solves all of my problem.. excellent development indeed\n\nwish there was a queue oriented approach to open multiple tabs at the same time in queuing", "stars": 5}, {"date": "Aug 15, 2013", "text": "Great extension", "stars": 5}, {"date": "Aug 14, 2013", "text": "I am impressed!\nThis plugin really improved my productivity!", "stars": 5}, {"date": "Aug 11, 2013", "text": "Wayyyy better than vrome, super fast, I never need to touch my mouse!", "stars": 5}, {"date": "Aug 8, 2013", "text": "Can you add such a utility: highlight search when search with \"/\"?\nThanks!", "stars": 4}, {"date": "Aug 5, 2013", "text": "must have! can't live without it! Can you add feature to allow bulk moving multiple tabs into a specific window? Or just start with moving current tab into a specific existing window, instead of opening a new window? that'll be extremely helpful. thanks!", "stars": 5}, {"date": "Jul 30, 2013", "text": "sinple fast I like it.", "stars": 5}, {"date": "Jul 26, 2013", "text": "cool! eventually,  not need touchpad any more", "stars": 5}, {"date": "Jul 24, 2013", "text": "I love it because mouse is the wicked wich slows our working.", "stars": 5}, {"date": "Jul 16, 2013", "text": "I love it. It works like a champ.", "stars": 5}, {"date": "Jul 11, 2013", "text": "Really lightweight and useful! Makes everything a lot faster!\n\nI'd love if it had smooth scrolling, at least as an option, but I'll keep using it, because I've never seen anything on par with it! It's awesome!", "stars": 5}, {"date": "Jul 9, 2013", "text": "really great, its one last thing holding me on chrome and not allowing me to get back to firefox", "stars": 5}, {"date": "Jul 9, 2013", "text": "When I open a PDF in chrome, pressing the jk keys won't work. However other keys such as t and x work just fine.\n\nGreatest chrome plugin! Thank you for the awesome work!", "stars": 5}, {"date": "Jul 6, 2013", "text": "A fabulous toolkit.\nThanks a lot!", "stars": 5}, {"date": "Jul 5, 2013", "text": "I love this plugin. But it would be great if there was a way to copy text from a page without having to use a mouse.", "stars": 5}, {"date": "Jul 4, 2013", "text": "Very nice job! By the way, Is \"scrollFullPageDown\" command equal to the pressing \"Page Down\" key? Seems a little longer movement distance than \"Page Down\".", "stars": 5}, {"date": "Jul 4, 2013", "text": "Not much of a vim user to be honest but these bindings are huge time savers.", "stars": 5}, {"date": "Jul 4, 2013", "text": "awesome extension,i love it so much,thank u", "stars": 5}, {"date": "Jul 3, 2013", "text": "This extension is awesome !! \n\nIt's very useful to have it.\n\nThe only default is to search only string and not basic regex in find mode.\n\nThanks you very much and congrats for the developper !!", "stars": 5}, {"date": "Jun 29, 2013", "text": "I have used Vimium for more than 4 years. I have witnessed its growth from basic features to such a powerful extension. I like almost all of the features provided by Vimium. Just like learning Vim, you'll keep learning new stuff year after year. I just realized Vimium has added <a-f> to let you open multiple links with two key strokes, which is great! Thank you guys for developing this feature. I also found the moving tab function is added. I like this design because it's just like indent a l... Show more", "stars": 5}, {"date": "Jun 27, 2013", "text": "Life  Changing!\nBut I find it doesn't work on some special pages.I known it's google's extension security policy to make this.But I like it so much that I want it to always work,how can I do?Or,when will it have the option to make", "stars": 5}, {"date": "Jun 25, 2013", "text": "Works really well most of the time.", "stars": 4}, {"date": "Jun 21, 2013", "text": "Love this plugin and use it all the time.  Here are my use cases for new features:\n\n1) I would like to select and copy text to clipboard w/o a mouse: 'v' or 'V' select block of text, 'y' to clipboard.\n\n2) mouse-less edit of gmail and html textareas in general. See (1) above.\n\nbest,\nJohn", "stars": 5}, {"date": "Jun 21, 2013", "text": "I can't use Chrome properly without it anymore.", "stars": 5}, {"date": "Jun 21, 2013", "text": "A great extension. Save a lot of time for me. Supporting macro will be quiet powerful.", "stars": 5}, {"date": "Jun 9, 2013", "text": "I would consider myself a 'power user' of Chromium, but Vimium has taken my browsing to another level: It makes browsing fast and easy, and it has heaps of useful features. Plus, it's 'secretly' teaching me (I generally use Emacs.) how to use Vi(m) ;~P", "stars": 5}, {"date": "Jun 8, 2013", "text": "its like having a few different shortcuts, nothing special", "stars": 1}, {"date": "Jun 8, 2013", "text": "good extension!!!!!!!!five stars", "stars": 5}, {"date": "Jun 7, 2013", "text": "Awesome!\n\nThank you!", "stars": 5}, {"date": "Jun 6, 2013", "text": "Great add-on!! Closest thing to Vimperator on Chrome, and has most of the functionality I miss from Vimperator. Key re-binding works great too. Highly recommended to all vim'ers.\n\nThe only thing I'd like to see is a key to temporarily disable Vimium (e.g. in Vimperator if you hit insert, all Vimperator keys will be disabled until you hit insert again).", "stars": 5}, {"date": "Jun 4, 2013", "text": "If you're a long-time vi/vim user, then you probably already have this plugin, and should drop everything and install it if you don't.\n\nIf you're just learning vim, then this plugin is a great way to make that easier, by letting you practice in the context of the browser, and prove to yourself how useful the keystrokes are (even if sometimes quite unintuitive).  \n\nBy using vim keystrokes everywhere, not just your editor, they'll more quickly seem to be hardwired into your gray matter, and bec... Show more", "stars": 5}, {"date": "Jun 3, 2013", "text": "Thank you!", "stars": 5}, {"date": "Jun 2, 2013", "text": "Wonderful. The less I need to use my mouse, the better.", "stars": 5}, {"date": "May 31, 2013", "text": "Great plugin.\n\nEssential for every VIM user.", "stars": 5}, {"date": "May 29, 2013", "text": "Great extension for vim lovers!", "stars": 5}, {"date": "May 29, 2013", "text": "Awesome plugin. Fast, simple, lightweight and extremely powerful.\n\nWhat's also important it does not collide with Developer Console.\n\nThank you very much.\nYou make my life easier.", "stars": 5}, {"date": "May 28, 2013", "text": "A bit annoying sometimes.", "stars": 4}, {"date": "May 27, 2013", "text": "Great tool!so convenient !", "stars": 5}, {"date": "May 24, 2013", "text": "aswesome job, free my mise.\n\nbut, a question, why sometimes, i use 'f' and click next step keys, still open link in a new tab. if i use mise to click that link, it redirect in current tab.", "stars": 5}, {"date": "May 24, 2013", "text": "Fabulous~", "stars": 5}, {"date": "May 24, 2013", "text": "Awesome extension I used for a couple of years. But after upgrade to last version, CPU utilization by chrome when this extension is enabled is always 100%.\n\nChrome 21.0.1180.83 m.\n\nTried in fresh profile, same behaviour.\n\nHow to solve?\n\nUPD 01-nov-2013: After updating to last version (1.43) CPU utilisation becomes normal. Using this extension again. 5 stars definetely.", "stars": 5}, {"date": "May 23, 2013", "text": "nice~~~", "stars": 4}, {"date": "May 21, 2013", "text": "Really handy addition to my daily browser. Especially looking forward to building finger memory to push it's speed benefits in my workflow.", "stars": 4}, {"date": "May 20, 2013", "text": "This is one of my favourites.\nThanks for updates.", "stars": 5}, {"date": "May 20, 2013", "text": "i love it.", "stars": 5}, {"date": "May 20, 2013", "text": "Using it everyday, awesome extension!", "stars": 5}, {"date": "May 20, 2013", "text": "I would like to say thanks very much for whoever brought the local marks feature to vimium in version 1.43. This is the one feature I had missed the most. Very cool guys!", "stars": 5}, {"date": "May 19, 2013", "text": "Could not imagine using a browser without Vimium.", "stars": 5}, {"date": "May 19, 2013", "text": "Extremely useful! I threw my mouse away. Must-have extension #1 as for me.", "stars": 5}, {"date": "May 19, 2013", "text": "Excellent for mouse-less browsing.\nI wonder if it would be possible to capture C-w in text fields to make it backwards-delete words instead of closing tabs?", "stars": 5}, {"date": "May 19, 2013", "text": "This extension is amazing.Yet I'v got some issues using it.\nIt's not working when reading pdf within Chrome.I'm just looking forward to it when people can navigate pdf like using vim,It will be so cool and efficient.\n \nIt's not working when a page is not fully opened either,or when a page failed to load.So people must use a mouse instead of JK to navigate between tabs.\nHope you can fix this.That would be an amazing job.", "stars": 5}, {"date": "May 19, 2013", "text": "Great extention!", "stars": 5}, {"date": "May 19, 2013", "text": "like it", "stars": 5}, {"date": "May 19, 2013", "text": "Very convenient!", "stars": 4}, {"date": "May 19, 2013", "text": "Not work with Chinese Input Method mode.(mac air md760)", "stars": 5}, {"date": "May 19, 2013", "text": "Excellent extension. I can't live without it :-)", "stars": 5}, {"date": "May 17, 2013", "text": "It was disabled in Chrome Dev\nhelp!!!", "stars": 4}, {"date": "May 16, 2013", "text": "awesome! any plan to add a status bar? it would be five stars", "stars": 4}, {"date": "May 15, 2013", "text": "Not as good as Vimperator on Firefox, but so far the best Vim-like extension found on Chrome", "stars": 3}, {"date": "May 13, 2013", "text": "Very useful plug-in.", "stars": 5}, {"date": "May 12, 2013", "text": "It deserves all the stars it possibly can get! Can't surf without it anymore :)", "stars": 5}, {"date": "May 12, 2013", "text": "cool!!!", "stars": 5}, {"date": "May 11, 2013", "text": "Can't live without it anymore.", "stars": 5}, {"date": "May 10, 2013", "text": "I really love this extension. Is there anyway to be able to lose focus on the URL box and back to the Document again?", "stars": 5}, {"date": "May 9, 2013", "text": "It's amazing to me, but not perfect. On some pages it doesn't work. And when chrome is updated to version 28, most of the commands don't work anymore.", "stars": 5}, {"date": "May 7, 2013", "text": "This is a must-have extension for me now and I use it all the time.\n\nP.S. am I the only one who thinks that hitting f twice should be another way to show and hide the buttons? This seems more intuitive to me than f - <Esc>", "stars": 5}, {"date": "May 6, 2013", "text": "This is amazing, and so well done. Very solid and useful extension. The only problems I have seen is that sometimes the link labels aren't updated. You have to scroll a bit and press f again. That rarely happens. Secondly, the next/previous buttons haven't worked for most of the sites I have tried. Everything else is superb.", "stars": 5}, {"date": "May 2, 2013", "text": "Love this app and all it does.\nWould love to see this feature added though: just like in vim with words, deleting, etc., i'd love to be able to use numbers. like g3t taking me 3 tabs over, instead of having to mash gt XD", "stars": 5}, {"date": "May 2, 2013", "text": "I may never clench a mouse again. Thank you.\n\nFeature request: Try to prioritise f/F link tags so that the more likely ones get the shorter tags. Perhaps have spatial assignment also? Where all the links in a block of the screen start with the same tag letter. e.g. eztv.it is just all over the place, understandably.", "stars": 5}, {"date": "May 2, 2013", "text": "This is a great extension for helping me to avoid using the mouse. People looking over my shoulder marvel at how fast I am.\n\nA feature request, however: I'd love a shortcut to take the current tab and split it off in to a new window. I use multiple monitors and this would be fantastic.", "stars": 5}, {"date": "Apr 29, 2013", "text": "That's the best plugin that i have ever seen", "stars": 5}, {"date": "Apr 26, 2013", "text": "thanks to the author! this is really an auesome extension! I really apprpreciate the work you have done!\n\nhope it keeping going and get better and better.\n\nhere I have some suggestion, can you add a shortcut key to diaplay current tab and enable switch it? this will be helpful when I'm in fullscreen mode, and added this, It would be an 100% perfect extension, hope you consider my suggestion.", "stars": 5}, {"date": "Apr 24, 2013", "text": "Good thing for a geek\n\nSome minor bugs", "stars": 5}, {"date": "Apr 19, 2013", "text": "Awesome, but some times can't click a picture or a text editor of wordpress.", "stars": 5}, {"date": "Apr 17, 2013", "text": "Amazing!\nFantastic!\nIncredible!", "stars": 5}, {"date": "Apr 14, 2013", "text": "Great! Only problem is the shortcuts don't work on new tabs page.", "stars": 4}, {"date": "Apr 13, 2013", "text": "GREAT!\none suggestion:\nAfter pressing F for open an URL - \nfor most-visited websites (depends on users), the most-probable-be-clicked-buttons should be labelled with single and fixed letter.\nFor example, on Google search result page, each result should have the fixed and single letter to be labelled, like A, B, C and S... for the 1st, 2nd, 3rd results and the search box everytime!!\n\nSome common buttons like Next and Previous, should be labelled in N and P after pressing F.", "stars": 5}, {"date": "Apr 13, 2013", "text": "nice!", "stars": 5}, {"date": "Apr 11, 2013", "text": "I got hooked on Vim and hate switching back to the mouse when I need to check something on Chrome.  This helps a ton.  Great extension.", "stars": 5}, {"date": "Apr 9, 2013", "text": "one word: awesome", "stars": 5}, {"date": "Apr 5, 2013", "text": "This is fantastic.But I wonder whether I can custom some keys to open a specific website in the current tab or a new one since there are several websites that I visit so much.", "stars": 5}, {"date": "Apr 3, 2013", "text": "This is my favorite extension! great job on this", "stars": 5}, {"date": "Mar 31, 2013", "text": "wow! It is great!Thx for your works!", "stars": 5}, {"date": "Mar 28, 2013", "text": "While it did make some navigation easier and smoother the Vim way, it would be nice to be able to open textboxes in an external editor (i.e. vim).", "stars": 3}, {"date": "Mar 27, 2013", "text": "Vimium requires that Javascript is enabled on every page. This is an absolute no-go, since I turn off Javascript by default. Maybe vimium does not pose a risk, but the webpage itself can take full advantage of javascript. Thanks, but other extensions such as Vimfx (not available for Chromium) work better - without Javascript.", "stars": 1}, {"date": "Mar 24, 2013", "text": "you should really change the x(close current tab) to some other one more complicated. Like the default command+w. There's a reason to make shortcut like this with two press.", "stars": 4}, {"date": "Mar 22, 2013", "text": "Vimium is awesome!  I love having vim bindings for essentially everything and now I never need to take my hands off the keyboard.\n\nOne this I think would be awesome would be to be able to toggle vimium on/off without doing exceptions.  Just the way you can temporarily disable adblock by clicking on the icon.", "stars": 5}, {"date": "Mar 21, 2013", "text": "This is brilliant! Vim is my text editor, and now this is my browser. Everything I was hoping for when I searched for Vim-style shortcuts for Chrome, plus a lot more than I was hoping for. Now my browser is perfect.", "stars": 5}, {"date": "Mar 20, 2013", "text": "This is fantastic. It has completely changed the way I browse the internet and fits in seamlessly to me development setup. Great work!", "stars": 5}, {"date": "Mar 19, 2013", "text": "awesome extension", "stars": 5}, {"date": "Mar 19, 2013", "text": "Great extension, but some search systems take a focus for search field, and this doesn't work, is it possible to fix in a new versions?\nThanks.", "stars": 4}, {"date": "Mar 16, 2013", "text": "A greate app!!\nIt helps me a lot.", "stars": 5}, {"date": "Mar 13, 2013", "text": "Overall, very cool and useful.\n\nWishlist:\n\n    - I wish ctrl-f and ctrl-b worked the same way they do in vim (up a screen and down a screen).", "stars": 4}, {"date": "Mar 12, 2013", "text": "Love this. I use VIM for all my code editing and this extension makes keeping my hands on the keyboard a breeze.", "stars": 5}, {"date": "Mar 12, 2013", "text": "Excellent extension for chrome", "stars": 5}, {"date": "Mar 7, 2013", "text": "short quick hit to browse the webpage without to catche the mouse, wonderful extension", "stars": 5}, {"date": "Mar 7, 2013", "text": "This is crazy, just yesterday I was unconvinced about Vim in general (having just expended a significant amount of time learning emacs) and now I download Vimium and love it.\n\nJust a little hint, after the extension is installed you'll have to restart browser (at least with Chromium).", "stars": 5}, {"date": "Mar 6, 2013", "text": "Everything an extension can be. And more.", "stars": 5}, {"date": "Mar 6, 2013", "text": "I Love it!!", "stars": 5}, {"date": "Mar 3, 2013", "text": "Thank you, thank you, thank you! As a die-hard emacs user I've been searching for an extension allowing easy navigation combined with regex searching capabilities, but unfortunately nothing out there satisfied me; so I decided to just try this even though I've used Vim itself only occasionally. But Vimium has been a revelation. The cherry on top is that Vimium also has more comprehensive help documentation than any of the others I tried. Congrats on a great extension!", "stars": 5}, {"date": "Mar 1, 2013", "text": "Very useful, looking forward to learning more and getting better at it.", "stars": 4}, {"date": "Mar 1, 2013", "text": "interesting", "stars": 5}, {"date": "Feb 26, 2013", "text": "The tool is good,but the find feature is not usable if my searching content is chinese.", "stars": 4}, {"date": "Feb 25, 2013", "text": "amazing, super useful!", "stars": 5}, {"date": "Feb 25, 2013", "text": "Great extension! been using it all the time.", "stars": 5}, {"date": "Feb 25, 2013", "text": "I have only used it for a couple of days, but so far it's really great.", "stars": 5}, {"date": "Feb 25, 2013", "text": "Brilliant.", "stars": 5}, {"date": "Feb 24, 2013", "text": "Awesome.  Can't use chrome without it!  Default is perfect.  No mouse is actually needed so long as you are in chrome :)", "stars": 5}, {"date": "Feb 24, 2013", "text": "Prolly the best extension I have ever seen!!", "stars": 5}, {"date": "Feb 16, 2013", "text": "Guys, that is it! One of the awesomest extensions here!", "stars": 5}, {"date": "Feb 14, 2013", "text": "This is fantastic. I was not expecting such a brilliant implementation. Great job!!", "stars": 5}, {"date": "Feb 11, 2013", "text": "One of my favourite extensions! I would only like to see a mode indicator (normal/insert), perhaps in the bottom left corner of the page, as simple as \"N\" or \"I\".", "stars": 4}, {"date": "Feb 9, 2013", "text": "I so love it~ What a wonderful extension~", "stars": 5}, {"date": "Feb 6, 2013", "text": "It Doesn't Work!\n\nI can't open the help page using the \"?\" button, not even after holding the Shift key.\n\nI Also can't use J and K to scroll, and nothing comes up! The help guides aren't working, and I can't even open up the menu for the shortcuts. What kind of extension is this supposed to be?", "stars": 1}, {"date": "Feb 2, 2013", "text": "Great! Vim in chrome.\n\nOne request : please include the ability to sync the user preferences (and excluded urls) across my different machines.", "stars": 4}, {"date": "Feb 1, 2013", "text": "Not bad!!\nBut I'm dying to know can you add a hotkey to bind the pin/unpin tab function? It's really useful!", "stars": 4}, {"date": "Jan 30, 2013", "text": "So far I like it. Makes browsing much more fun.", "stars": 5}, {"date": "Jan 30, 2013", "text": "I'm in love.", "stars": 5}, {"date": "Jan 22, 2013", "text": "You wouldn't think that keyboard shortcuts would be that compelling until you use it.\n\nOne suggestion: A keyboard shortcut to duplicate current tab.", "stars": 5}, {"date": "Jan 19, 2013", "text": "It's good.", "stars": 5}, {"date": "Jan 18, 2013", "text": "That really should be a native extension - not just a JS workaround.", "stars": 4}, {"date": "Jan 14, 2013", "text": "Love the convenient shortcuts, it was intuitive for me to use and I don't have that much experience with Vim.  As other users have noted, it does seem that it can stop working when certain elements are selected.  It's still a very worthwhile extension to me and one I highly recommend. Here's hoping further updates improve the functionality even more.", "stars": 5}, {"date": "Jan 14, 2013", "text": "Close to amazing.\nCRUCIAL MISS: regex search!!!", "stars": 4}, {"date": "Jan 13, 2013", "text": "I love it!!! It works better than vimperator in   Firefox!", "stars": 5}, {"date": "Jan 13, 2013", "text": "Been using this for a few weeks now. Never used Vim, but I've fell right into the groove with this extension. Perfect for power users", "stars": 5}, {"date": "Jan 10, 2013", "text": "I love this!!\nThank you so much!!", "stars": 5}, {"date": "Jan 8, 2013", "text": "Amazing.\nI download vim because of this extension.", "stars": 5}, {"date": "Jan 8, 2013", "text": "It would be great if scrolling was smooth!", "stars": 4}, {"date": "Jan 4, 2013", "text": "Really really good.\nIncrase the productivity", "stars": 5}, {"date": "Jan 3, 2013", "text": "Awesome!\n\nI came for the history/bookmarks fuzzy matching (vomnibar) and stayed for the vim shortcut keys.", "stars": 5}, {"date": "Jan 2, 2013", "text": "Amazing plugin. With Vimium, tmux, vim, and Alfred, I never have to leave the keyboard.\n\nOne thing I would like to see implemented is for Vimium to avoid clashing with website keyboard shortcuts. For example, Github uses 't' to search for folders, but this clashes with Vimium's new tab short cut. I'm sure theres a workaround, so hopefully someone can enlighten me!\n\nExcellent work!", "stars": 5}, {"date": "Dec 31, 2012", "text": "Now we're talking. Back to being efficient.", "stars": 5}, {"date": "Dec 30, 2012", "text": "love it!", "stars": 5}, {"date": "Dec 27, 2012", "text": "need a select mode", "stars": 5}, {"date": "Dec 26, 2012", "text": "A great extension that will make browsing saner, faster, more convenient and comfortable for the people who make extensive use of their keyboards.", "stars": 5}, {"date": "Dec 23, 2012", "text": "LIFE-CHANGING. This is awesome, especially for living room setups where you just want a keyboard and don't want to hassle with a mouse.", "stars": 5}, {"date": "Dec 21, 2012", "text": "Its a awesome extension. Please watch the overview  video. And after install dont forget to type =>\n? OR Shift + /", "stars": 5}, {"date": "Dec 19, 2012", "text": "Absolutely what for a (relatively) keyboard-less browsing experience.", "stars": 5}, {"date": "Dec 14, 2012", "text": "Excellent App! It has made my browsering so fluent. Thank you!", "stars": 5}, {"date": "Dec 10, 2012", "text": "It's just awesome. Just like Vim. Perfect, and convenient follow links mode too.", "stars": 5}, {"date": "Dec 10, 2012", "text": "I can't leave Chrome for other browsers because I got so used to this extension. Thanks a lot!", "stars": 5}, {"date": "Dec 9, 2012", "text": "Thank you for this wonderful extension! It turns Chrom(ium) from a web-browser into a web-weapon!", "stars": 5}, {"date": "Dec 8, 2012", "text": "Works awesome.", "stars": 5}, {"date": "Dec 7, 2012", "text": "It's like Quicksilver (a Mac app) for Chrome. Stable and fast. I love it.", "stars": 5}, {"date": "Dec 5, 2012", "text": "Fantastic extension!", "stars": 5}, {"date": "Nov 24, 2012", "text": "It's good and works perfect.However , I'd wondering how can I erase the highlight after a successful search?\nI know it could be done by searching a string which is not valid; yet it is quite stupid......", "stars": 5}, {"date": "Nov 23, 2012", "text": "I love the simplicity of this extension. It works much faster than vimperator for firefox. also, it works on both firefox and google-chrome.Many thanks to developers of this extension.", "stars": 5}, {"date": "Nov 22, 2012", "text": "Really helpful, well done, efficient, and speeds up my browsing a ton.", "stars": 5}, {"date": "Nov 20, 2012", "text": "So awesome!! It would be great if it searched inside iframes of the current tab. For example JIRA loads all their widgets as iframes, so you can't easily navigate to an issue. Neither 'f' command nor '/' will search those iframes.", "stars": 5}, {"date": "Nov 16, 2012", "text": "It takes some time to get used to it, but it works really nice.\nI look forward to the visual mode.", "stars": 5}, {"date": "Nov 15, 2012", "text": "This is really cool. It is for super vim fan.", "stars": 5}, {"date": "Nov 13, 2012", "text": "Excellent except it can't work in chrome system pages like new tab page and history page. (I know it's Google's limitation, though.)", "stars": 5}, {"date": "Nov 11, 2012", "text": "Nice, though not quite a replacement for Pentadactyl/Vimperator (firefox)\n\ni.e. Not as powerful; no command line, no plugins, no config/rc file.", "stars": 3}, {"date": "Nov 10, 2012", "text": "Super", "stars": 5}, {"date": "Nov 10, 2012", "text": "About as good as you could hope for. There are some limitations, especially as compared to the Firefox equivalents, Vimperator and Pentadactyl, but those are limitations of the Chrome permission system, not the extension itself.", "stars": 5}, {"date": "Nov 10, 2012", "text": "Dude like i really made it let the fun begin.", "stars": 5}, {"date": "Nov 9, 2012", "text": "It was a nice attempt.  Lacks way to many vim features to be very useful.  No support for editing in a text area at all.  \n\nCertainly nowhere close to Vimperator (firefox)\n\nVrome (Chrome) is better than this plugin, imho.", "stars": 2}, {"date": "Nov 8, 2012", "text": "Few thing I like to see in future releases:\n\n* Ability to disabled key bindings for site so that Vimium bindings are not overwritten (or make Vimium bindings overwrite default, but not disable defaults),\n* Ability to make own key bindings or at least bind Ctrl + C to Escape key;\n\nThanks! I hope the developer will read this! :)", "stars": 4}, {"date": "Nov 2, 2012", "text": "This is freaking awesome!!!", "stars": 5}, {"date": "Oct 29, 2012", "text": "I have been really happy with this extension.", "stars": 5}, {"date": "Oct 29, 2012", "text": "Fantastic plugin! Awesome job and quick updates/bugfixes! Keep doing excellent work", "stars": 5}, {"date": "Oct 28, 2012", "text": "Great extension nice work! Additional awesome feature would be a shortcut for image url :)", "stars": 5}, {"date": "Oct 28, 2012", "text": "very good", "stars": 5}, {"date": "Oct 28, 2012", "text": "Been using this for a couple weeks now and I can't imagine life without it anymore. Well done.", "stars": 5}, {"date": "Oct 25, 2012", "text": "How could I have lived without it for so long?", "stars": 5}, {"date": "Oct 25, 2012", "text": "Sometimes doesn't work but most time fine...\nPlease support input method in searching!! And is it possible to highlight all matches? Is it possible to just use the original search box which supports both??", "stars": 2}, {"date": "Oct 25, 2012", "text": "I can not use it in my local webpage, just like starting with \"file:/// \".", "stars": 4}, {"date": "Oct 21, 2012", "text": "Vimium is very efficient. But you  guys certainly can make it more efficient. In vi I can map <ESC> to some keys like jk. Can you give the option to map <ESC> key?", "stars": 5}, {"date": "Oct 20, 2012", "text": "Great extension for keyboard lovers. I hope it keeps getting extended like Vimperator for Firefox.", "stars": 5}, {"date": "Oct 20, 2012", "text": "Nice tool!", "stars": 5}, {"date": "Oct 20, 2012", "text": "Like some others said, a <esc>-mapping would be great for breaking insert- or choose-link-mode.\n\n2nd a hover-simulation could be helpful by keyboard, eg:\nmap m mouseOverLink\nmap M mouseOverElement", "stars": 4}, {"date": "Oct 13, 2012", "text": "The extension is completely awesome. The work with the browser has become much faster, simplier and more efficient. Thanks.", "stars": 5}, {"date": "Oct 12, 2012", "text": "This extension is simply awesome.", "stars": 5}, {"date": "Oct 11, 2012", "text": "Works great. Love it.", "stars": 5}, {"date": "Oct 11, 2012", "text": "my most favorite chrome plugin which provides the same user experience as vim. Thanks a lot~", "stars": 5}, {"date": "Oct 9, 2012", "text": "LOVE LOVE LOVE this plugin!", "stars": 5}, {"date": "Oct 9, 2012", "text": "Some small suggestions:\n1. press f will show the finder, f again will turn it off. Usually the 2nd f is not what everyone wants. Instead, let's make it shift the character of links. For eg: I press f and find a link marked \"GP\", then I have to press GP to open that link. It would be better if I press f->\"GP\"->f again->it becomes single a char \"B\". So instead of fgp, it's now ffb, which is much easier!\n2.Please show different color for f and F.\n3.search for text through all tabs.", "stars": 5}, {"date": "Oct 9, 2012", "text": "The first thing i did after re-install the chrome is installing and rating this extension, it works very well!", "stars": 5}, {"date": "Oct 7, 2012", "text": "It's a neat extension, but could have been a lot better with more features thrown in.", "stars": 4}, {"date": "Oct 6, 2012", "text": "Awesome work! Thanks. :)", "stars": 5}, {"date": "Oct 2, 2012", "text": "This is want I need for Chrom. Mostly it's work very well. There is issue that annoy me a bit. \n\nWhen I open a new tap, it's open the new chrome tab page, the one that include all extension icons. Unfortunately, Vimium doesn't work there. I can not use \"o\" to input the address. Specially, in full screen, you won't have the URL bar to put address on.\n\nJust wondering, for key \"t\", instead of open chrome tab, can vimium popup the url input, as \"o\" does, and then open the new tab for that address... Show more", "stars": 4}, {"date": "Sep 28, 2012", "text": "Works fantastically, cannot fault it a bit, really speeds up navigating the web", "stars": 5}, {"date": "Sep 27, 2012", "text": "Super!", "stars": 5}, {"date": "Sep 25, 2012", "text": "This extension works quit good and release me from firefox+vimperator addiction, thx for good job Ilya.\n\nIt would be nicer, when\n - the search dialog be longer/better visible\n - possible hide location bar\n - some useful keys (x,shift+X, etc) works only in regular website tabs, not in option, extension tabs, error messages tabs etc.", "stars": 5}, {"date": "Sep 20, 2012", "text": "It seems that the \"previous pattern\" and \"next pattern\" can only support English words?\n\nHey, I really appreciate the new version that it is able to support multiple languages. But now I've meet another problem: Sometimes I want to mark something in the website with another plugin, however the shortcuts conflict with each other. So it could be better if this \"vimium mode\" can be toggle with some shortcut key.", "stars": 5}, {"date": "Sep 19, 2012", "text": "awsme!", "stars": 5}, {"date": "Sep 15, 2012", "text": "I would switch to Firefox and Vimperator without it.", "stars": 5}, {"date": "Sep 14, 2012", "text": "Coool!", "stars": 5}, {"date": "Sep 14, 2012", "text": "Compact & well design. Default shortcuts easy to remember, maybe even to non Vim user.", "stars": 5}, {"date": "Sep 14, 2012", "text": "The link letters could be a bit more intuitive. If there are only five links on a page, why use double letters for them? For example, five links could be represented by \"a d g h j\", but instead, Vimium represents them by something along the lines of \"zj mm mj j av\".\n\nBesides that insignificant problem, this extension is amazing.", "stars": 5}, {"date": "Sep 13, 2012", "text": "Problem of the focus lost inside of a text field or a flash application can be solved with AutoHotKey (Win).\n\nIt probably can be done better, but that's how I did it:\n\n!n::\n  MouseGetPos, xpos, ypos\n  MouseMove 13, 110\n  Send {Click}\n  MouseMove xpos, ypos\n  return\n\nWhich makes pressing Alt+n regain focus.", "stars": 5}, {"date": "Sep 11, 2012", "text": "Just plain awesome, you never have to take your hands off the keyboard again.", "stars": 5}, {"date": "Sep 10, 2012", "text": "nice app!", "stars": 5}, {"date": "Sep 10, 2012", "text": "The best keyboard browsing tool I've seen to date.  Everything seems reachable by keyboard.  Mouse control seems obsolete.", "stars": 5}, {"date": "Sep 10, 2012", "text": "I love it!  It gives the same level of usability that Gmail keyboard shortcuts provides to every web page!", "stars": 5}, {"date": "Sep 10, 2012", "text": "Awesomeness\n\nCould it have a vim-help-file-esque special \"new tab\" page, one that would first of all allow the vimium bindings to operate on it, and secondly add to the vimfect (tm)?", "stars": 5}, {"date": "Sep 10, 2012", "text": "good job man!!!!", "stars": 5}, {"date": "Sep 9, 2012", "text": "the best and most useful browser extension ever, all browsers should have vim mode.", "stars": 5}, {"date": "Sep 9, 2012", "text": "This is the sane way to use Chrome for a Vim user!", "stars": 5}, {"date": "Sep 9, 2012", "text": "This extension is very very useful. Thanks :x.", "stars": 5}, {"date": "Sep 9, 2012", "text": "I wish I could have this for every application on my computer!", "stars": 5}, {"date": "Sep 9, 2012", "text": "Can't live without Vimium!! Really excellent extension :)", "stars": 5}, {"date": "Sep 6, 2012", "text": "Excellent. Can't believe I lived without it.\n\nWould love bindings for un/pinning tabs and zooming.\n\nAlso would be good to have some sort of more advanced domain-specific controls, such as unmapping certain bindings for domains, or even just opening certain domains in insert mode.", "stars": 5}, {"date": "Sep 6, 2012", "text": "Awsome!!", "stars": 5}, {"date": "Sep 3, 2012", "text": "Very good when it works.  I find, though, that quite often it simply stops and I have to go to the Chrome extension page, bring up Vimium, make a gratuitous change, undo it, then save re-save the options, in order to get the keyboard shortcuts working. \n\nI have no idea what is triggering this loss of control, but it is quite frustrating.", "stars": 3}, {"date": "Sep 1, 2012", "text": "It's really great. Wish it had one more feature: ability to define custom commands with javascript", "stars": 5}, {"date": "Aug 28, 2012", "text": "Perfect. Vimium improved my workflow, nice work keep it going", "stars": 5}, {"date": "Aug 25, 2012", "text": "only using it for regex search e.g. /piano|violin\\r \nwill find you either piano or violin on a page. \nuse n for next. shift n for prev\n\nThis extension actually makes the regexp search work without bugs (unlike the other 4 I tried)\n\nmight have a read about the other vimium features.", "stars": 5}, {"date": "Aug 22, 2012", "text": "modifire + key binding does want ot work for me", "stars": 5}, {"date": "Aug 20, 2012", "text": "My missing from mouseless browing in FF pluggin is officially put into an end until I found this tools. Great job!", "stars": 5}, {"date": "Aug 16, 2012", "text": ":wq to save the page (or image, or text file, or whatever) would be really awesome.\n\nOtherwise, no complaints whatsoever. Thanks.", "stars": 4}, {"date": "Aug 13, 2012", "text": "cool!", "stars": 5}, {"date": "Aug 12, 2012", "text": "It would be nice if \"T\" let you start off seeing a list of all your open tabs that would be parsed down as it auto completed what you typed. At that point, I could go into \"Presentation Mode\" to remove the unnecessary tabs and url bar to get some more viewing space on my laptop.", "stars": 5}, {"date": "Aug 3, 2012", "text": "I think you just changed my life.", "stars": 5}, {"date": "Aug 3, 2012", "text": "love it :)", "stars": 5}, {"date": "Jul 30, 2012", "text": "Awesome! Vimium finally has evolved enough to make me switch from firefox/pentadactyl to chrome.\n\nOne shortcut I miss though is Ctrl-^ for toggling the alternate tab.\n\nNice work!", "stars": 4}, {"date": "Jul 29, 2012", "text": "It is the I like it the Best.", "stars": 5}, {"date": "Jul 28, 2012", "text": "This is the only chrome extension that consistently gets disabled. A few times chrome explained to me that some permissions changed and that was the reason. Okay. But now it  was disabled again and without reason.\nMaybe you need to check your settings.\nIf it is a problem with my account, I'm sorry.", "stars": 3}, {"date": "Jul 25, 2012", "text": "Very useful extension, but I am missing the ability to re-map the Esc key :(.", "stars": 5}, {"date": "Jul 22, 2012", "text": "This is amazing! How about support for zooming?", "stars": 5}, {"date": "Jul 22, 2012", "text": "The most useful extension for chrome. Would be better if there was preset profiles for dvorak and other keyboard layouts so that we don't need to remap everything to get productive.", "stars": 5}, {"date": "Jul 20, 2012", "text": "I can't browse without it. \nWithout it it feels slow.", "stars": 5}, {"date": "Jul 19, 2012", "text": "This is a great extension that I feel saves me time . I don't need to use the mouse anymore!\n\nI have spotted a very minor issue, though.\n\n-When using \"Shift+X\" to restore a previously closed tab, the back button (or \"Shift-X\") cannot be used to access that tab's specific history. It can be done when using \"Ctrl+Shift+T\" to restore a closed tab.\n\nGreat otherwise, though!", "stars": 4}, {"date": "Jul 19, 2012", "text": "please add key to select and edit the edit box on the page! that can be really swwwwweeeeeeeeeet!:)", "stars": 5}, {"date": "Jul 19, 2012", "text": "An indispensable add-in for Google Chrome", "stars": 5}, {"date": "Jul 19, 2012", "text": "Any chance to make AltGr works well? right now AltGr+[ will blur any input field.\n\nOtherwise, this is a very, very nice and useful extension!", "stars": 4}, {"date": "Jul 18, 2012", "text": "Awesome extension!  I'm a Vim user and I love this :).", "stars": 4}, {"date": "Jul 18, 2012", "text": "With this extension installed, chrome never loads my homepage. I have to click refresh before the page loads.\n\nDefinitely this extension causing the problem.\n\nDevs contact @gurpsone for more info on this bug.", "stars": 2}, {"date": "Jul 17, 2012", "text": "This is great, \n\nIn the follow links mode i would like to type the links text instead of some random letters.. just like vim.", "stars": 5}, {"date": "Jul 15, 2012", "text": "feature suggestion: keys for zooming in and out, and to show the history of the selected tab.\n\notherwise perfect.", "stars": 5}, {"date": "Jul 14, 2012", "text": "Not nearly as powerful as Pentadactyl for FireFox, but if you're an original vi, or Vim user, this makes surfing on Chrome sweeeeet.", "stars": 5}, {"date": "Jul 14, 2012", "text": "Occasionally buggy, but overall a good way to reduce mouse usage.", "stars": 5}, {"date": "Jul 13, 2012", "text": "Very convenient, though I wish it had easier access to changing keybindings and occasionally stops working on some pages.", "stars": 4}, {"date": "Jul 13, 2012", "text": "Awesome extension. I use this every day and have saved so much time.\n\nIf I didn't have to back out of chrome every once in a while I would have no use for my mouse anymore.\n\nOne feature that I would like to see though is the ability to use meta+f to hover over links. Lots of fancy websites these days thing hover is the best thing since sliced bread and become unusable without hovering over part of the page.", "stars": 5}, {"date": "Jul 12, 2012", "text": "Collides with too many chrome shortcuts. Not very useful.", "stars": 1}, {"date": "Jul 12, 2012", "text": "I like the extension but the ability to select text is missing.", "stars": 4}, {"date": "Jul 10, 2012", "text": "Fantastic XD", "stars": 5}, {"date": "Jul 9, 2012", "text": "I have a hard time *not* using this extension at this point. Nice work.", "stars": 5}, {"date": "Jul 9, 2012", "text": "awesome for chrome <3", "stars": 5}, {"date": "Jul 8, 2012", "text": "Best extension ever made. Thanks.", "stars": 5}, {"date": "Jul 8, 2012", "text": "As someone who pretty much lives in Vim, this makes the mental context switch between hacking and browsing that much easier.", "stars": 5}, {"date": "Jul 7, 2012", "text": "Great extension :)\nplease make it work on the gmail and the chrome web store pages too.\nThen it would be indispensable.", "stars": 4}, {"date": "Jul 7, 2012", "text": "What it does, it does great. I do wish there were more features though. Most importantly: mouseless bookmarks management! \n\nCurrently, the \"o\" key opens a dialogue for browsing, bookmarks, and history... which is useless. \"o\" should ONLY show browsing options (such as autocomplete), and another key (\"b\" possibly?) should open a bookmarks dialogue so that one can easily navigate bookmarks. \n\nOther than lack of features, it works great. I hope future releases can incorporate even more vim-like ... Show more", "stars": 5}, {"date": "Jul 6, 2012", "text": "Greate!!!!\n Thanks for your work!", "stars": 5}, {"date": "Jul 6, 2012", "text": "Fantastic. A few quirks but performs brilliantly", "stars": 5}, {"date": "Jul 6, 2012", "text": "the old B button function returned but t changed from a new tab with the homepage to a new default tab. I would really like the option to at least remap buttons like t to their old function.", "stars": 4}, {"date": "Jul 5, 2012", "text": "Extremely useful and regularly updated and improved, I use this constantly.  Really like this extension, especially now the b function has been restored :) Thanks Ilya!\n\nIt would be very nice to be able to scroll through *all* matches to the o and b commands; currently you only get the first 10 - keeping my fingers crossed for the next update.", "stars": 5}, {"date": "Jul 5, 2012", "text": "Been using this for quite a while and it's been great. Almost never have to touch the mouse when surfing. \n\nBut you must bring back the 'b' key for bookmarks. Calling javascript bookmarks like \"Read later on Instapaper\" or \"Save to delicious\" etc.  don't work anymore. It searches for the snippet code on Google with the 'o' key, which is less than helpful.\n\nEDIT: The 'o'-Javascript-issue has been fixed in version 1.3.5", "stars": 4}, {"date": "Jul 4, 2012", "text": "This is an amazing plugin, it really changed the way I use chrome although the latest version changed `b` key mapping, and is now using `o` which searches history google and bookmarks, which I don't find as efficient I may be using it wrong (trying to use it as I used to use `b`) any tips would be helpful.\n\nIf there was one update I'd bring the old `b` mapping back just for bookmark searching.\n\nEDIT: `b` is back! :) Best plugin for chrome! Hands down.", "stars": 5}, {"date": "Jul 4, 2012", "text": "the best chrome extension all vim lovers should equip!", "stars": 5}, {"date": "Jul 4, 2012", "text": "Great idea. I am familiar with vim navigation and this extension replicates it perfectly. I love how intuitive it is, especially the `gt` part <3", "stars": 5}, {"date": "Jul 4, 2012", "text": "I can't\nShow available commands", "stars": 5}, {"date": "Jul 4, 2012", "text": "The update, change the CSS is no longer reflect", "stars": 1}, {"date": "Jul 3, 2012", "text": "As a Vim fanboy, I can only thank the developer for this great extension!", "stars": 5}, {"date": "Jul 3, 2012", "text": "Really like this extension!\n\nHere's some suggestions though:\n- refresh in new tab\n- move back in history in new tab\n- move forward in history in new tab\n- map keys to more than one action in succession\n- way to escape the chrome omnibar (always annoying to have to manually click out)\n- better way to open from bookmark bar (only the visible bookmarks)\n\nAnyway, I really like this extension, just thought I'd give a few suggestions for the future\n\nEDIT: YAY for b!", "stars": 5}, {"date": "Jul 3, 2012", "text": "Been using this extension for quite a while now and thoroughly recommend it. \n\nThe most useful feature for me is using 'f' to navigate through links. It means I can basically do without a mouse.", "stars": 5}, {"date": "Jul 3, 2012", "text": "Love the extension. Can I just make the suggestion that the 'O' (capital-O) binding be used for 'open in new tab' for consistency and usability's sake? There doesn't seem to be a replacement for the 'B' binding that I used quite a lot.", "stars": 5}, {"date": "Jul 3, 2012", "text": "Update about \"o\" is great. I hate chrome's omnibox because it prohibit me to search in history from adress bar.\n\nThx you!", "stars": 5}, {"date": "Jul 3, 2012", "text": "Great extension. Vimium literally saves the planet! My wireless mouse consumption rate is much slower thanks to Vimium.\n\nI wish I could merge Vimium capabilities with Gmail, which takes control over the keyboard, whether you enable shortcuts or not.", "stars": 5}, {"date": "Jul 3, 2012", "text": "very good", "stars": 5}, {"date": "Jul 3, 2012", "text": "All works fine without ScriptNo extension. This is bug of Vimium or ScriptNo?", "stars": 4}, {"date": "Jun 29, 2012", "text": "Hm doesn't work so well for me. The shortcuts often do not work and there are way to less features.\n@Ryan, did you try Pentadactyl (former Vimperator) for Firefox?\nThis is the only true vim browser in my eyes and the lack of such an addon is more or less the reason why I stick to Firefox although i really like Chrome.", "stars": 3}, {"date": "Jun 25, 2012", "text": "Great extension, can't live without it.\n\nI'm missing how Insert mode is supposed to be working though.\n\nAnother feature I'd like to see is to open selected text in a new tab. This is same as copying it into clipboard and then using P, but better have a single key for that.", "stars": 5}, {"date": "Jun 24, 2012", "text": "I think you can add such shortcuts as opening a new url(not link) in current tab o r in a new tab", "stars": 4}, {"date": "Jun 24, 2012", "text": "Your extension changed my life. Thank you for this great tool.\n\nI would like to be able to zoom in/out with the 'z/Z' key for example. I don't like having to move from the home row for that.", "stars": 5}, {"date": "Jun 21, 2012", "text": "Just started using it.\nSearching with '/' is probably my favorite feature until now. It would be great to be able to search regexp!\nNavigation with vi key bindings is also really helpful.", "stars": 4}, {"date": "Jun 19, 2012", "text": "Vimium is awesome because of the Vim-like shortcuts, which work pretty well, I must say. However, the only problem for me is that it stops working on the tab where a page fails to load.\n\nOther than that its pretty slick.", "stars": 4}, {"date": "Jun 6, 2012", "text": "I am not sure if anyone has already mentioned this: press x to close tab sometimes closes all my tabs. It happened at least 3 times.", "stars": 4}, {"date": "Jun 2, 2012", "text": "Pretty good tool. \n\nI wish gt (move to next tab) currently I am unable to use gt command when gmail tab is on.", "stars": 4}, {"date": "Jun 1, 2012", "text": "All in all, pretty excellent extension. It is totally awesome how you can remap things!\n\nMy only issue is the several DOM elements that get injected at the top of the body for each page.. Makes inspecting a little annoying. I wish that it came after everything in the body instead of before..\n\nOther than that, great job.", "stars": 5}, {"date": "May 23, 2012", "text": "I no longer have any need to use a different browser - thanks to Vimium! :)", "stars": 5}, {"date": "May 21, 2012", "text": "This extension is quite well done. I really like being able to navigate the web without moving my hands off of the home keys. j,k,d,u are a little useful because my hands are more comfortable on the keyboard then on the arrow keys.\n\nThe real magic comes in at going to urls (like using f or ]]) and being able to close tabs with an x", "stars": 5}, {"date": "May 20, 2012", "text": "my second favorite extension (after adblock plus).\nthe only problem is that it has some stability issues", "stars": 5}, {"date": "May 10, 2012", "text": "Excellent.", "stars": 5}, {"date": "May 9, 2012", "text": "I'm not sure why I didn't think to look for this before, but now that I've found Vimium it'll be the  second thing I install on any system... Chrome -> Vimium -> Vim (If I'm unfortunate enough to be on Windows).\n\nExtremely well thought out, and getting better each release.\n\nExcellent job!", "stars": 5}, {"date": "May 6, 2012", "text": "Love it! But I have a suggestion wrt to link hinting! Can you make it somehow set link priority and use single letters for high priority links. What i mean is highest priority is visited links (or links which are clicked often). Then font size, like on reddit the news stories are bigger font than other links, so it will make it easy to give more priority to links in bigger fonts, etc", "stars": 5}, {"date": "May 5, 2012", "text": "Yet to come across an extension more useful than this. I just installed it in the morning and wow I'm totally blow away by how useful this is! Kudos on such great work!\n\np.s. how difficult is it to add a Google search popup (similar to the bookmark find popup)? It would be really useful if we can do inline google search (pref in a new tab) similar to the bookmark search of vimium.", "stars": 5}, {"date": "May 3, 2012", "text": "I love you for making this. I don't think I can live without it now.", "stars": 5}, {"date": "May 2, 2012", "text": "This extension is absolutely necessary for anyone suffering from RSI due to too much mouse use in a GUI environment.\n\nExcellent extension. I don't see how I can browse the web without it.", "stars": 5}, {"date": "Apr 26, 2012", "text": "Works really well. But it would be a great if it had a way to disable it and enable it again on a site.", "stars": 4}, {"date": "Apr 26, 2012", "text": "Nice extension! Would love it if there was a binding to duplicate the current tab, though.", "stars": 4}, {"date": "Apr 12, 2012", "text": "Thing is, I thought that this would add editing functionality to all text boxes and stuff, and it doesn't do that. For most thing that this defines, there are already keyboard shortcuts, you just have to find them.", "stars": 3}, {"date": "Mar 25, 2012", "text": "Great extension! Thanks :)", "stars": 5}, {"date": "Mar 25, 2012", "text": "can i use f/F to reach my favorite websites in favorite bar?", "stars": 5}, {"date": "Mar 24, 2012", "text": "Vimium has changed how I interact with the internet, amazing job!", "stars": 5}, {"date": "Mar 23, 2012", "text": "Makes browsing a breeze", "stars": 5}, {"date": "Mar 17, 2012", "text": "Hi there. no chance you can make keybindings disabled on specified sites can you? For example, I use j/k on google reader but I'd love to use the \"f\" binding to activate link hint on it. Right now, I disable all keybindings for GReader altogether so to use j/k on it.\n\nThanks!", "stars": 5}, {"date": "Mar 15, 2012", "text": "Thank you for this! It is  really valuable.\n\nSome suggestion:\n- add \".\" for repeated action (just like in vim). Useful when clicking on one buttom more times (e.g. ajax paging)\n- shortcuts did not work in new tab or source view (probably Google API did not support this, but it is quite annoying and non-intuitive)\n- what is \"<a-f>\"? I see it near \"open multiple links\" but didn't know what shortcut it represents.", "stars": 5}, {"date": "Mar 15, 2012", "text": "Thanks for extension. Only one issue: on linux we can use Vimium only with US keyboard layout. \n\nThat would be great to use extension regardless of the keyboard layout, like Key Binder.", "stars": 4}, {"date": "Mar 13, 2012", "text": "This extension works like vimperator and pentadactyl for firefox, but it is much less \"vim-like\" and less bloated. I would like to clarify a few things though. This extension works by injecting a bunch of JavaScript into a page when it loads, and that's what makes the extension work. Some iFrames, especially those that run applets (like Flash, Java, or other plugin-specific content) almost always \"steal focus\" away from similar content, such as the JS injected by Vimium. That's what causes Vi... Show more", "stars": 4}, {"date": "Mar 10, 2012", "text": "This is great!\nCould we get regular expression search though?", "stars": 5}, {"date": "Mar 9, 2012", "text": "it's a excellent thing.\nbut it doesn't work all the time, specially when entering a new page,I need to click on the page once to make it work!", "stars": 4}, {"date": "Mar 9, 2012", "text": "Wow! this is awesome. I was about to build my own extension for an internal site and this gives me all the functionality I needed and tons more. Can't believe I'm just stumbling across this. You guys rock!", "stars": 5}, {"date": "Mar 7, 2012", "text": "Brilliantly done. First extension I've liked enough to review.", "stars": 5}, {"date": "Mar 6, 2012", "text": "Nothing like Vim everywhere possible!", "stars": 5}, {"date": "Mar 6, 2012", "text": "Without this, I won't use Chrome at all.", "stars": 5}, {"date": "Mar 3, 2012", "text": "One of my fav. Even though, some key doesn't work exactly like vim due to chrome shortcut but this one is still the best on the market :)\nI love it !", "stars": 4}, {"date": "Mar 3, 2012", "text": "I love this extension but I can't use it anymore due to the fact that it now needs permission to access much more than is warranted.", "stars": 1}, {"date": "Mar 2, 2012", "text": "Works well. Not as feature complete as the firefox extensions yet but shows very good progress. Feature request: key passthrough mode(s). like if i press ctrl-v the next keypress is passed through to the site without being handled.", "stars": 4}, {"date": "Mar 2, 2012", "text": "Why on earth would you need access to my bookmarks? The data I copy/paste? How is that in any way needed to provide this functionality?\n\nRemoving as of today. \n\nReal shame too.", "stars": 1}, {"date": "Mar 1, 2012", "text": "I have been very pleased vimium for at least a year now.  In particular, it has been extremely helpful in letting me easily navigate link-heavy sites like Outlook Web Access, through which  I often get at my work email.\n\nHowever, a recent change has randomized the assignment of link shortcuts, which greatly reduces the utility of vimium.  This means, for example, that as I move around through various pages in OWA, the major navigation links get different shortcuts on each different page.\n\nVim... Show more", "stars": 4}, {"date": "Feb 29, 2012", "text": "I love this plugin, but a recent update changed the characters used for link hints. The purpose of this plugin is to control websites with the keyboard, and key patterns become memorized for sites. I know that f-ds gets me to the activity stream of one website, so I don't have to think about it.\n\nCold changing that is like plopping me down in front of a Dvorak keyboard and telling me good luck. Yes, I can look at the keys for reference, but it kills the productivity that I've grown accustomed... Show more", "stars": 5}, {"date": "Feb 29, 2012", "text": "I Love VIM ... and with your plugin, browsing feels like walk in the park and mouse less :)", "stars": 5}, {"date": "Feb 29, 2012", "text": "Easily my favourite Chrome extension. Many thanks for making it available.", "stars": 5}, {"date": "Feb 24, 2012", "text": "it's so cool .\nbut when i into the find mode .i can't input chinese.", "stars": 5}, {"date": "Feb 21, 2012", "text": "Well, so far i'm loving this extension, seriously, although i dont want to be too dependent on certain macros/plugins/extensions and so on, even in vim i use only 3-5 plugins usually.\n\nAgain, great so far, maybe added \"zz\"/\"zt\"/\"b\" feature would be great, as well as switching tabs like \"4gt\" to the fourth tab; this does actually work sometimes, and sometimes it bugges completely around.\n\nkeep it up!", "stars": 5}, {"date": "Feb 16, 2012", "text": "Nice extension.\nBut useless without support of non-latin keyboard layouts.", "stars": 4}, {"date": "Feb 16, 2012", "text": "Amazing, saves lots of time.", "stars": 5}, {"date": "Feb 6, 2012", "text": "Wow! This is excellent. I love keybindings, and staying fast and productive. I don't use vi much, but I really like the application of (largely unmodified) keybindings to my normal browsing. Thanks so much.", "stars": 5}, {"date": "Feb 5, 2012", "text": "Great tool. Vim is the best!", "stars": 5}, {"date": "Jan 26, 2012", "text": "Very Good!", "stars": 5}, {"date": "Jan 13, 2012", "text": "A fantastic extension which is similar in spirit to vimperator and pentadactyl for firefox. The main difference between those and this extension is that vimium doesn't have the bar at the bottom like you find in the actual vim, but I think this is better because it helps preserve  chrome's minimal appearance.", "stars": 5}, {"date": "Jan 11, 2012", "text": "My favourite extension in Chrome. I use it all the time.\n\nI would love to have a way to navigate between tabs (the same as bookmarks) for the times I use Chrome in fullscreen mode.\nThat's the only feature that I would ask for.\n\nThanks,\nMaikel", "stars": 5}, {"date": "Jan 10, 2012", "text": "I am loving this extension. The only problem I have is the fact that I can't use it on the Gmail Page. This is probably not something that you can fix though. I would also love to be able to use this on chrome's new tab page, but now I am just nitpicking. I just love never having to leave the keyboard.", "stars": 5}, {"date": "Dec 28, 2011", "text": "Beautiful! If only I could map the rest of my keyboard to clear history or chrome's task manager or open the options of a particular extension, etc.", "stars": 5}, {"date": "Dec 28, 2011", "text": "I really like it but I had to disable on Google+ since j&k move from post to post.  It would be excellent if I could use the Google+ specific functions but keep the rest of Vimium's features in tact.", "stars": 4}, {"date": "Dec 22, 2011", "text": "One of the greatest extensions available for Google Chrome. It significantly increases surfing speed by freeing you from mouse usage.", "stars": 5}, {"date": "Dec 19, 2011", "text": "Awesome extension ! \n\nThx a bunch\n\nFeatures suggestion:\n\nInstead of gf to cycle between frames, add number to select frame. Its not very usable now, IMO.\n\n- I don't like how \"folloow links\" is implemented. The screen becomes full of garbage... you should perhaps color the text of links as it is typed or something.\n\n- If possible, consider adding key to focus page, as it is currently absent in Chrome (You must multi F6 atm).\n\n- Consider adding an shortcut key to \"disable current page/domain\" i... Show more", "stars": 5}, {"date": "Dec 19, 2011", "text": "This is a great extension, and I highly recommend it to anybody looking to sharpen their tools.\n\nI tried it when it first came out because I love the idea of being able to browse the web from the keyboard, but it just didn't work that well for me. I recently gave it another shot, though, and found it to be greatly improved.\n\nOne of the best additions is the quick bookmark navigation (bound to \"b\" and \"B\" by default). Just press it and start typing, and it finds all matching bookmarks. It tend... Show more", "stars": 5}, {"date": "Dec 13, 2011", "text": "You could further improve this, by using keybindings like vimperator, because they're running their project longer and have therefore had more time to elaborate theirs :)", "stars": 3}, {"date": "Dec 13, 2011", "text": "Takes some getting used to but its fantastic!", "stars": 4}, {"date": "Dec 13, 2011", "text": "This has forever changed GitHub browsing for me.  Very much appreciated.", "stars": 5}, {"date": "Dec 12, 2011", "text": "Love the extension. Thanks for your hard work.", "stars": 5}, {"date": "Dec 11, 2011", "text": "The extension is nice but it lacks a few things:\n* Regular Expressions support for search,etc\n* Marks with the classical M \n* Record.\n* Sometimes the marker is still at the address bar and you don't quite understand why nothing is responding.\n* No \\( or \\) % etc which lack imho and could be neat when viewing code.\n* The motion of left/right is considered \"advanced\" and is not like the classical VIM, which sucks imho.", "stars": 3}, {"date": "Dec 9, 2011", "text": "good", "stars": 4}, {"date": "Dec 7, 2011", "text": "nice~", "stars": 5}, {"date": "Dec 6, 2011", "text": "I'm using this very usefully. Thank you for nice add-on!\n\nBut just one thing.. Do you have any plan to support multiple language such as Korean, Japanese, or Chinese? with the 'b' or '/', I cannot use my language..(Korean)\n\nIt will be very, very helpful if you support these extra languages.\n\nAnyway, very nice!", "stars": 5}, {"date": "Dec 5, 2011", "text": "Vimium is indispensable for me now :).", "stars": 5}, {"date": "Dec 5, 2011", "text": "This increased my productivity by about 100% and made my penis grow 2 inch.", "stars": 5}, {"date": "Dec 5, 2011", "text": "Really Cool!", "stars": 5}, {"date": "Dec 5, 2011", "text": "good!", "stars": 5}, {"date": "Dec 5, 2011", "text": "very good", "stars": 5}, {"date": "Dec 5, 2011", "text": "Thank you so much! This is what i've always wanted. I love controlling my computer with just a keyboard.", "stars": 5}, {"date": "Dec 2, 2011", "text": "Vimium is one of my favorite extensions!!", "stars": 5}, {"date": "Nov 17, 2011", "text": "Nice tool, but it doesn't work in the privacy mode.", "stars": 4}, {"date": "Nov 17, 2011", "text": "If the search function can support regexp, it would be better.", "stars": 5}, {"date": "Nov 10, 2011", "text": "It is so good on my netbook with poor touchpad!", "stars": 5}, {"date": "Nov 8, 2011", "text": "Best Chrome/Chromium extension, I've ever tried. \n\nBut I found couple of issues:\n- Follow links mode doesn't handle frames as well. I should focus in the frame with a mouse click first. \n- Follow links mode doesn't send change signal in dropdown menus.\n- Follow links mode loses focus after using type=\"file\" inputs.\n\nBut still, this is hell of a extensions.", "stars": 5}, {"date": "Nov 4, 2011", "text": "Just love it.", "stars": 5}, {"date": "Oct 30, 2011", "text": "Does not work with Clearly.", "stars": 5}, {"date": "Oct 27, 2011", "text": "Can't live without this now. I used to float between Chrome, Safari, and Firefox, but it's all chrome now thanks to Vimium.\n\nThe u/d functionality to jump down the page in larger increments than j/k switched up on me the other day, but now it's back. I greatly prefer that. Not sure what happend.\n\nThanks for a great extension.", "stars": 5}, {"date": "Oct 26, 2011", "text": "Very nice extension (despite the \"restoreTab\" bug) :-)\n\nLike the previous comment, I first wanted to type the text to follow likns but then found it is possible in the advanced options (\"filter link hints\") and now I am fully pleased :-)", "stars": 5}, {"date": "Sep 30, 2011", "text": "I've been using this for many years now and I can't work without this anymore. Every time I sit down at someone else's computer, I find myself missing it. This is a power-user's dream and increases your productivity by factors of magnitude. I believe this should be a built into Chrome.", "stars": 5}, {"date": "Jul 1, 2011", "text": "it would be better if add an option of going to HomePage in current page or new tab like 'gh' and 'gH'", "stars": 5}, {"date": "Jun 30, 2011", "text": "Awesome extension that is updated frequently. I love it!", "stars": 5}, {"date": "Apr 19, 2011", "text": "After return of 'B' option - perfect! 5+", "stars": 5}, {"date": "Feb 24, 2011", "text": "Bless you for the Chrome 28 API updates, and the new features in 1.43 like go to mark are welcome additions as well.", "stars": 5}, {"date": "Feb 17, 2011", "text": "In vim hitting \"``\" takes you back to your last position, so if I was on the middle of the page, hit \"G\" to go to the bottom, then hit \"``\" I would be back where I came from...\n\nThat'd be nice : )", "stars": 5}, {"date": "Nov 10, 2010", "text": "Goodbye keyconfig, hello vimium. Great solution for custom keybindings, love the link thingy and the quick search.", "stars": 5}, {"date": "Nov 10, 2010", "text": "Why it does not work in Chrome Mac environment??\nOnly shortcut 'X' works. The most important 'F' does not work.", "stars": 4}, {"date": "Oct 25, 2010", "text": "Love the new hints look. This is the only thing that keeps me using Chrome.\n\nThanks a lot for the great extension!", "stars": 5}]