[{"text": "Automatic line breaks.. to center align paragraphs.  I want a variety of fonts.", "stars": 4, "date": "Aug 15, 2023"}, {"text": "very good. it will better if user can choose whether show the pic in the article", "stars": 5, "date": "Jun 27, 2023"}, {"text": "simple smooth", "stars": 4, "date": "Oct 8, 2022"}, {"text": "very lazy extension. uncomfortable", "stars": 1, "date": "Sep 25, 2022"}, {"text": "Simply elegant . Simply the best\nThis is so gooooooooood ! It's become great", "stars": 5, "date": "Apr 30, 2022"}, {"text": "Speed Reading mode doesn't work", "stars": 2, "date": "Nov 19, 2021"}, {"text": "Yes, pretty simple.. I like that it calls it like it is, however, I think there should always be the option to remove images.\nI like the simplified speed reader view.. cuts out \"filler words\" ..I wish that I could copy/paste like that too.\nI like that it works with my Auto Copy extension.\nLast updated February 16, 2020", "stars": 4, "date": "Oct 30, 2021"}, {"text": "I love this! It's super helpful. Although right now I'm confused because it says I need to setup an account in order to read a book online, except I can't find anywhere to do that.", "stars": 5, "date": "Sep 19, 2021"}, {"text": "Loved it", "stars": 5, "date": "Aug 3, 2021"}, {"text": "The best reader extension you can get.!", "stars": 5, "date": "May 26, 2021"}, {"text": "Just what I need!!\nIntegrate well with Weava. Love it!", "stars": 5, "date": "May 25, 2021"}, {"text": "I've tried a bunch of famous extensions so far, non of them can give me the simplicity and useful functions like this one do", "stars": 5, "date": "Jan 24, 2021"}, {"text": "Elegant and simple, just how it's supposed to be! Also includes simple controls for changing background/text color and text size.\n\nThank you mate for making such an amazing open source extension. You rock 😎", "stars": 5, "date": "Nov 27, 2020"}, {"text": "I love how minimal it is. It doesn't remove the url when you enter reading mode and the layout is elegant as well.", "stars": 5, "date": "Nov 12, 2020"}, {"text": "In right to left languages, the menus are cluttered", "stars": 3, "date": "Jun 28, 2020"}, {"text": "The best reading tool ever! It magically speeds up my reading pace and makes everything so easy to read with just enough amount of functions. Hope it can be built on or worked with other devices and apps too.", "stars": 5, "date": "Apr 16, 2020"}, {"text": "I agree with others that simplicity is good, but maybe a few more font would be better. This kind of speed reading feature is wanted out there, it shouldn't be limited by a lack of customizability!", "stars": 3, "date": "Mar 28, 2020"}, {"text": "Well done, thank you. One small suggestion to make it better. Please make the background of your dark mode black rather than murky gray.", "stars": 5, "date": "Feb 17, 2020"}, {"text": "Great", "stars": 5, "date": "Jan 31, 2020"}, {"text": "Nice extension, the resulting pages look good! Two bugs:\n\n1) after the extension brings up the optimized view of the current page, I also have to click on the page to focus the Reeader view - if I don't do that, I can't use the space bar or PgUp/down keys to navigate on the page. A similar extension that I've tried in the past didn't need that extra click, please change this.\n\n2) when an article like https://krebsonsecurity.com/2019/12/inside-evil-corp-a-100m-cybercrime-menace/ contains emoti... Show more", "stars": 4, "date": "Jan 5, 2020"}, {"text": "Please implement choose column width, text/background color functionality. \nAlso I like compatibility with translation extensions!", "stars": 4, "date": "Oct 21, 2019"}, {"text": "Simple extension that I need. \nIt will be perfect if you allow user to customize their own font color and background color.\nLooking forward to your update.", "stars": 4, "date": "Oct 11, 2019"}, {"text": "Love it", "stars": 5, "date": "Sep 16, 2019"}, {"text": "Love that it requires no permissions.", "stars": 5, "date": "Aug 14, 2019"}, {"text": "The User experience of this extension is amazing.", "stars": 5, "date": "Jun 27, 2019"}, {"text": "Really goood", "stars": 5, "date": "Jun 22, 2019"}, {"text": "Thank to author! It's a cool extension! I've specially searched open source reader extension, that wont require unnecessary permissions.", "stars": 5, "date": "Feb 10, 2019"}, {"text": "minimal function and open source. perfect", "stars": 5, "date": "Dec 29, 2018"}]