[{"text": "Awesome! Thank you!", "stars": 5, "date": "Mar 3, 2024"}, {"text": "Should include the disclaimer: Additional US$70 purchase required to use", "stars": 1, "date": "Jan 29, 2024"}, {"text": "Do not buy, the full width page (which is free version included) is no longer working and the creator does not respond to any enquiries. It was good when things worked. I liked that feature overall.", "stars": 1, "date": "Dec 12, 2023"}, {"text": "Outline works perfectly for me immediately after installation.  I do hope the dev could listen to some of the users here said and make this an official feature.", "stars": 5, "date": "Dec 9, 2023"}, {"text": "Please add extension shortcuts to show / hide outline section. I don't always want to see that section. But when I do and I'm in full screen, a KS would be great to easily show it right away without having to exit full screen and click on the extension.\n\nBut the idea is great. It's a sad think to see Notion not supporting a plug-in ecosystem, like Obsidian does. It would make the experience much better.", "stars": 4, "date": "Dec 3, 2023"}, {"text": "Do not buy, the full width page (which is free version included) is no longer working and the creator does not respond to any enquiries. It was good when things worked. I liked that feature overall. ", "stars": 1, "date": "Nov 13, 2023"}, {"text": "Free version is almost useless.", "stars": 3, "date": "Oct 19, 2023"}, {"text": "Perfect extension!", "stars": 5, "date": "Sep 15, 2023"}, {"text": "I tried using notion via their app instead of my browser (since they've made their web interface so slow) but then I realized I was missing the sticky outline from this extension and had to go back to using the web page.  Just couldn't get by without that sticky outline feature!", "stars": 5, "date": "Jul 31, 2023"}, {"text": "outline doesn't work", "stars": 1, "date": "Jul 24, 2023"}, {"text": "Doesn't work suddenly", "stars": 4, "date": "Jul 24, 2023"}, {"text": "Doesn't work suddenly", "stars": 4, "date": "Jul 23, 2023"}, {"text": "Doesn't work suddenly", "stars": 3, "date": "Jul 21, 2023"}, {"text": "The TOC doesn't work suddenly", "stars": 4, "date": "Jul 21, 2023"}, {"text": "It doesn't work suddenly. I have no idea what is wrong!", "stars": 3, "date": "Jul 21, 2023"}, {"text": "Of 4 features that I'm using, 2 don't work. It's not clear where to get a refund. Don't buy it.", "stars": 1, "date": "Jun 15, 2023"}, {"text": "I don't know if you've made changes but it's been a few days now that since it started freezing the website I was using Notion Boost for. I'm getting \"Page Unresponsive\" error.", "stars": 1, "date": "Jun 14, 2023"}, {"text": "Really useful extension. Could you possibly add a darker sidebar in light mode, similar to what ClickUp offers? To me, Notion is ultra-fast compared to ClickUp, but I like their dark sidebar, which is also found in other top apps like slack. If you could develop this feature in your plugin, that would be awesome. \n\nTo simplify, what I need is for the sidebar to have a dark theme like this one.\nhttps://prnt.sc/LHl9--wKo6n8", "stars": 5, "date": "Jun 14, 2023"}, {"text": "Awesome!", "stars": 5, "date": "May 6, 2023"}, {"text": "Awesome function to add the sticky outline...Just wonder if it could also capture the date that I included with the @tag?", "stars": 5, "date": "May 4, 2023"}, {"text": "Very useful!!!", "stars": 5, "date": "Apr 5, 2023"}, {"text": "The floating table of content is amazing!", "stars": 5, "date": "Mar 21, 2023"}, {"text": "Absolutely amazing extension!!!", "stars": 5, "date": "Mar 6, 2023"}, {"text": "Hello, the switching button of sticky outline on the header disappear in the newest version :'-( I need it", "stars": 5, "date": "Feb 28, 2023"}, {"text": "You have to pay to use features.", "stars": 1, "date": "Jan 28, 2023"}, {"text": "Perfect extension!", "stars": 5, "date": "Jan 19, 2023"}, {"text": "The extension is great. But apparently the developer hasn't paid the online storage fee. Looks like the extension is out of commission until he does.", "stars": 2, "date": "Jan 10, 2023"}, {"text": "I used it only for Show code line numbers, but it almost never works. Lines are out place most of the time, sometimes fixed by page refresh but mostly not. I would not recommend for this feature.", "stars": 2, "date": "Jan 2, 2023"}, {"text": "it‘s great！Thanks！", "stars": 5, "date": "Dec 22, 2022"}, {"text": "Surprisingly helpful add-on for notion for the TOC view on the side! Love it!", "stars": 5, "date": "Dec 16, 2022"}, {"text": "nice!", "stars": 5, "date": "Dec 2, 2022"}, {"text": "Please add RTL (Right to Left) languages support.", "stars": 5, "date": "Nov 28, 2022"}, {"text": "Excellent component!!", "stars": 5, "date": "Nov 10, 2022"}, {"text": "Perfect extension for Notion power users—and regular users will really appreciate lots of the Quality of Life updates like the Outline. No more having to use the ToC block! Notion should absolutely be rolling these into their main product. Thank you for this extension!", "stars": 5, "date": "Nov 9, 2022"}, {"text": "Thank you for this wonderful extension. So great!!!", "stars": 5, "date": "Oct 28, 2022"}, {"text": "Beautiful! This is exactly what I needed to combine other note taking apps features with notion's.", "stars": 5, "date": "Oct 24, 2022"}, {"text": "I had to move back to the desktop app because Notion was running slow in the browser for long pages. I could not find the \"outline\" anywhere which is such a needed tool.\nI realized many great features I have been using on a daily basis were thanks to this add-on I installed long ago!\n\nPlease push this to Notion because you are doing a good if not better job! :)", "stars": 5, "date": "Oct 11, 2022"}, {"text": "Excellent, but it's better if the pdf exported has outlines (bookmarks).", "stars": 5, "date": "Sep 20, 2022"}, {"text": "This is a truly a gift to the world, side-outline for Notion page headers is a game changer. And instead of adding a paypal link or whatever in the \"support\" section he only tags a Github page to further improve the product -- not to mention this extension does not collect/send data so everyone sleeps better at night.  I'm sure one day it would be great if Notion simply implements these great ideas to their core product.", "stars": 5, "date": "Sep 11, 2022"}, {"text": "This was a great Notion extension. Maybe if I may suggest, can you add the thread lines to toggle blocks as well, thanks. :)", "stars": 5, "date": "Sep 2, 2022"}, {"text": "Awesome! Thank you!", "stars": 5, "date": "Aug 31, 2022"}, {"text": "love it", "stars": 5, "date": "Aug 16, 2022"}, {"text": "sadly some functions are not working anymore. This extension needs an update.", "stars": 5, "date": "Jul 21, 2022"}, {"text": "So great I hope all the features will be integrated in the desktop app :)", "stars": 5, "date": "Jul 6, 2022"}, {"text": "what notion should be", "stars": 5, "date": "Jun 29, 2022"}, {"text": "Loving this cool new tool! Gourav, it would be awesome if you could create an alternative for \"save to notion\" extension too. That extension is really awesome too but the fact that it recently asks \"gmail\" permission is a turn off.\n\nThank you,\n-Swadhin", "stars": 5, "date": "Jun 20, 2022"}, {"text": "Great!", "stars": 5, "date": "May 28, 2022"}, {"text": "Love the ease of integration added with this extention.  I find myself using it more and more often.  Thanks Notion.", "stars": 5, "date": "May 23, 2022"}, {"text": "Thank you for this extension !", "stars": 5, "date": "Apr 29, 2022"}, {"text": "Great! It's very useful for me, especially for the sticky outline.", "stars": 5, "date": "Apr 7, 2022"}, {"text": "This extension not only added a doced TOC (as I was hoping), but it also added a Go To Top button, which I had envisioned but not asked for. Impressive!", "stars": 5, "date": "Apr 4, 2022"}, {"text": "Super helpful(: thank you", "stars": 5, "date": "Apr 1, 2022"}, {"text": "Awesome\nAlways felt the need for something like this", "stars": 5, "date": "Apr 1, 2022"}, {"text": "very good", "stars": 5, "date": "Mar 26, 2022"}, {"text": "Lots of great features here - some I didn't even know I needed until I installed them! This extension is a must.", "stars": 5, "date": "Mar 26, 2022"}, {"text": "Why in the world hasn't notion implemented these features in their base offering? Things like sticky outline, full width pages, better bold for dark mode, small text mode etc. are so helpful I can't believe I need an addon for them. Kudos on building an amazing addon. Takes notion to the next level, you can't use it without this addon.", "stars": 5, "date": "Mar 24, 2022"}, {"text": "the small text and full width all are of no use now，dkw", "stars": 4, "date": "Feb 13, 2022"}, {"text": "Cannot hide icons", "stars": 3, "date": "Feb 1, 2022"}, {"text": "Just downloaded the extension and I immediately fell in love with it. I have a simple suggestion tho, can you please add an option to resize the sticky outline tab? Some of my headings are too long so I can't really tell which is which. Thanks!", "stars": 5, "date": "Jan 18, 2022"}, {"text": "I rarely, if ever, leave reviews for chrome extensions (or anything else, honestly) but this extension has taken a product I thought was great and turned it into an amazing productivity tool. Upgrading to pro was a no-brainer after using it for just a few minutes. I cannot rave about it enough! Awesome extension -- thank you!", "stars": 5, "date": "Jan 14, 2022"}, {"text": "Nice", "stars": 5, "date": "Dec 18, 2021"}, {"text": "Hi there, nice extension! did the basic  scroll to Top button go to paid feature? cant see it now.", "stars": 3, "date": "Dec 16, 2021"}, {"text": "outline plugin is GREAT!!!", "stars": 5, "date": "Dec 3, 2021"}, {"text": "Amazing!", "stars": 5, "date": "Nov 16, 2021"}, {"text": "Nice tool!", "stars": 5, "date": "Nov 8, 2021"}, {"text": "Excellent extension which makes a great product even better! \nYou've made a fantastic job, Gourav! Thank you 🙌", "stars": 5, "date": "Oct 22, 2021"}, {"text": "Very useful!", "stars": 5, "date": "Oct 17, 2021"}, {"text": "Great extension. I love outline is helpful", "stars": 5, "date": "Oct 7, 2021"}, {"text": "I really like this and all the nice QoL features it brings but I have to toggle a lot of them off and on again to make them work when I come back to the page? Things like add height to page and full width every page.", "stars": 4, "date": "Oct 5, 2021"}, {"text": "Just amazing!", "stars": 5, "date": "Sep 18, 2021"}, {"text": "This makes Notion much easier to use.", "stars": 5, "date": "Sep 18, 2021"}, {"text": "It provides me with function boost and customization that makes Notion even better for me. The features might seem basic but they really make my life so much easier.", "stars": 5, "date": "Sep 14, 2021"}, {"text": "Another ‘saved my life' add-on. Thanks a lot.", "stars": 5, "date": "Sep 6, 2021"}, {"text": "Nice！", "stars": 5, "date": "Sep 4, 2021"}, {"text": "Awesome, thank you so much for this cool function.", "stars": 5, "date": "Aug 22, 2021"}, {"text": "Great Extension. Can you implement a separate option to show the outline button, so that you can optionally view the Outline even if you have 'Show Outline' off. I hope you understand my point. Thanks!", "stars": 5, "date": "Aug 21, 2021"}, {"text": "Nice extension! Just want to mention that full width for all pages won't work with grammarly. Hope you can fix this :)", "stars": 5, "date": "Aug 9, 2021"}, {"text": "love you\nNow I realized how it was painful to use notion without these wonderful and convinient functions.\nreally thank you!", "stars": 5, "date": "Aug 4, 2021"}, {"text": "The outline disappears when the header is a link.", "stars": 5, "date": "Jul 30, 2021"}, {"text": "Fantastic extension. It works like a charm. You save me tons of time navigating in page.", "stars": 5, "date": "Jul 27, 2021"}, {"text": "Great extension, especially the outline feature is amazing. Thanks for all the work!", "stars": 5, "date": "May 11, 2021"}, {"text": "One of the best power ups you need to really get the best out of Notion with out question.", "stars": 5, "date": "May 2, 2021"}, {"text": "Full width for all pages worked like a charm, a great time saver", "stars": 5, "date": "Apr 17, 2021"}, {"text": "awesome!", "stars": 5, "date": "Feb 14, 2021"}, {"text": "Fantastic!", "stars": 5, "date": "Feb 1, 2021"}, {"text": "Much needed Notion features. Thank you! Also open source, no bs", "stars": 5, "date": "Jan 16, 2021"}, {"text": "Super helpful!", "stars": 5, "date": "Jan 15, 2021"}, {"text": "Thank you for your work.\n\nCould you please add handling for long titles?  \nscreenshot with problem https://prnt.sc/wlwvyx\n\nFor example with title attribute or tooltips like google docs?\nscreenshot with example https://prnt.sc/wlwwp8", "stars": 5, "date": "Jan 12, 2021"}, {"text": "Fantastic extension. Any chance of implementing Full width page and Smaller text as separate options. I always wanted the global Smaller text but not Full-width.\n\nThank you", "stars": 5, "date": "Jan 7, 2021"}, {"text": "The table of content on the side is super helpful, I bet it will make to the Notion team's roadmap :)", "stars": 5, "date": "Dec 27, 2020"}, {"text": "fantastic!", "stars": 5, "date": "Dec 18, 2020"}, {"text": "Thanks for this extension, works really nice !\nWould be great if we could select \"small text\" option and \"full width\" option separately :)", "stars": 5, "date": "Dec 2, 2020"}, {"text": "This was very helpful - thank you! I would love if you woudl add a feature to have line numbers in code blocks. It is pain for me with using code in notion.", "stars": 5, "date": "Nov 18, 2020"}, {"text": "An outline thats always there! Notion should support this officially. Thank you.", "stars": 5, "date": "Nov 5, 2020"}, {"text": "This is genuinely cool and works fine, can`t wait for more on this!", "stars": 5, "date": "Oct 16, 2020"}, {"text": "For every article i write, I'd always include the Table of contents block, now i don't necessarily have to do that anymore. I love this sticky block. Thank you", "stars": 5, "date": "Oct 16, 2020"}]