[{"date": "Mar 7, 2024", "text": "It stucks on login. I used login with google and the extension stopped at page one. Didn't go to next settings page and extension remains useless.", "stars": 1}, {"date": "Mar 6, 2024", "text": "This really helpful, you guys should have a try! :)", "stars": 5}, {"date": "Dec 5, 2023", "text": "can you help me with today's leetcode?", "stars": 5}, {"date": "Sep 26, 2023", "text": "The extension is really good, but I have a problem when I make a lot of new prompts. They go outside of the box where they're supposed to be. Can you change it so that the new prompts go down in the box instead?", "stars": 5}, {"date": "Sep 5, 2023", "text": "Please give us the option to use this without a Google account.", "stars": 5}, {"date": "Jun 24, 2023", "text": "Awesome! So glad to see such an amazing tool and it is open source. Hope you can develop it even more", "stars": 5}, {"date": "May 24, 2023", "text": "It's perfect, free-form interaction with ChatGPT will also free your hands. but there is a problem when your prompts get more and more, so add favorites and search function is a good choice:)\n\nWhy it only support up to four prompts? Do you guys think about adding more?", "stars": 5}, {"date": "Apr 18, 2023", "text": "This Chrome extension is incredibly convenient and efficient for those who frequently use ChatGPT", "stars": 5}, {"date": "Apr 18, 2023", "text": "I want to express my gratitude to the team behind Webpilot for creating such a useful tool. Webpilot is a free, open-source \"Copilot for web\" that allows you to have free-form conversations with web pages or engage in automatic arguments with other users. Unlike other similar tools, there is no need to switch pages or constantly copy and paste back and forth\n\nThank you, Webpilot team, for your hard work and dedication!", "stars": 5}, {"date": "Apr 6, 2023", "text": "This app is amazing, I use it to complete chatGPT responses if they disconnect midway, or to quickly find misinformation in articles as I read them! \n\nMy only wish is that there were more buttons with pre-filled prompts, or more custom buttons, that would be the best! \n\nPlease keep developing this app, its great!", "stars": 5}]