[{"date": "Apr 14, 2023", "text": "It works only half of the time. It seems that some buffer doesn't get cleared between page refreshes and I get \"ghost\" logs from previous logging, or it doesn't work at all.\nAlso, the infamous \"Headers too big\" error, where it doesn't even try show at least part of the messages.\nLooking for a new extension, or enough time to write my own.\nStay away from it", "stars": 2}, {"date": "Jul 14, 2021", "text": "Liked, however it does not show the logs from POST requests which respond with redirect header (location: URL), so it misses logs.", "stars": 4}, {"date": "Apr 21, 2021", "text": "It would be very handy to add autoexpand to a plugin configuration (or in plugin switch).\n\nIt's very annoying to keep clicking and clicking to expand, such as the contents of an array", "stars": 3}, {"date": "Jan 3, 2019", "text": "This is extension has been unmaintained for years and has serious issues. Overall, this has done more harm than good for our team - we've tried to address several issues (we've sent several pull-requests to fix and enhance it) but the developer is completely unresponsive on all channels. Suggest you stay away - or be prepared for a lot of failure and frustration.", "stars": 2}, {"date": "Aug 24, 2018", "text": "Have no clue how to get the report.  Looks like others have the same issue, but no one replies to them.\nYou'd get a lot more users if you could explain how to get to the report.", "stars": 1}, {"date": "Aug 23, 2018", "text": "Awesome!!", "stars": 5}, {"date": "Apr 10, 2018", "text": "Not working as of version 65.0.3325.181 (Compilação oficial) (64 bits) (cohort: Stable).", "stars": 2}, {"date": "Dec 11, 2016", "text": "- Debugging of PHP objects seems not to work in this version (\"Error in event handler for runtime.onMessage: TypeError: Cannot read property 'match' of null\")\n\n- Grouping seems not to work\n\nBoth of these things worked previously.", "stars": 3}, {"date": "Aug 10, 2016", "text": "I have no clue how to use it what so ever... any help?", "stars": 2}, {"date": "Apr 20, 2016", "text": "We can help you to monetize your browser extension. \n\n****For better users experience and higher revenue!***\n\n\n*Earn from $15000 per month from every 100k users.\n\n*Shorter payment term! High revenue share!\n\n*24/7 customer support\n\n*GEOs: All countries, the whole world\n\n\n*My email/skype: molly@adonads.com\n\n*website: http://goo.gl/7KLHDC", "stars": 5}, {"date": "Apr 12, 2016", "text": "Works perfectly! Would recommend it to any dev!", "stars": 4}, {"date": "Apr 9, 2016", "text": "Perfect, thank you, very helpful to get messages in one console for php and client side JS.", "stars": 5}, {"date": "Feb 22, 2016", "text": "Great extension with simple setup techniques.", "stars": 5}, {"date": "Jan 8, 2016", "text": "Great extension, and now I don't have to var_dump behind blocks of visual elements, etc.\n\nWorks great for a WordPress Dev by including in wp-config.php and logging throughout the project.\n\nGreat work, no bugs, works great!", "stars": 5}, {"date": "Oct 2, 2015", "text": "Excellent tool. Locks up on occasions but simple page refresh solves it. Love it!", "stars": 5}, {"date": "Aug 14, 2015", "text": "easy setup and work properly.", "stars": 5}, {"date": "Mar 26, 2015", "text": "Superb extension. So much easier than having to use XDebug for PHP", "stars": 5}, {"date": "Mar 18, 2015", "text": "very helpful and easy. Thanks.", "stars": 5}, {"date": "Nov 1, 2014", "text": "Nothing happen when I use this extension coulnd't even think how to get this working.", "stars": 1}, {"date": "Oct 15, 2014", "text": "fantastic!", "stars": 5}, {"date": "Oct 13, 2014", "text": "Really a useful and easy to use extension.", "stars": 5}, {"date": "May 13, 2014", "text": "Good extension, it's very useful.", "stars": 5}, {"date": "May 7, 2014", "text": "Fantastic extension, simple and easy to install and use.\n\nThank you so much.", "stars": 5}, {"date": "Apr 1, 2014", "text": "This is super great. I have a minor gripe. The plugin needs to be switched on for each domain you want to use it with, which is fine, but it sometimes switches off again. It would be great if the options allowed you to set a list of domains where it would be on by default. \nYes, I'm holding the 5th star hostage until this gets added.", "stars": 4}, {"date": "Feb 17, 2014", "text": "This is a useful extension, but there is a problem with some Ngnix and apache server due big header data sent by ChromePhp json, you can skip this issue by only using when really need it, with no abuse.", "stars": 4}, {"date": "Feb 5, 2014", "text": "does not work.", "stars": 1}, {"date": "Jan 9, 2014", "text": "insane cozy stuff", "stars": 5}, {"date": "Jan 7, 2014", "text": "Excellent extension!", "stars": 5}, {"date": "Dec 24, 2013", "text": "loved it", "stars": 5}, {"date": "Dec 11, 2013", "text": "Easy to use, great time saver", "stars": 5}, {"date": "Sep 5, 2013", "text": "Great tool", "stars": 5}, {"date": "Jul 31, 2013", "text": "Great idea and I'm sure if I had another 2 hours to mess with it, I could figure out why headers aren't being emitted despite including the PHP files every way conceivable, but it doesn't and I don't have time to debug a debugging tool.", "stars": 3}, {"date": "Jul 29, 2013", "text": "nice and simple to use", "stars": 5}, {"date": "Jul 27, 2013", "text": "I love this extension.  Just some more learning and this will be very very useful to me.", "stars": 5}, {"date": "Aug 28, 2012", "text": "make sure to check out the site so you can download the php class. it actually works!!", "stars": 5}, {"date": "Jun 15, 2012", "text": "I use it every day in my professional development. It's an indispensable tool that makes my job so much easier to do. Thanks so much for a fantastic extension!", "stars": 5}, {"date": "Jun 14, 2012", "text": "Great :)", "stars": 5}, {"date": "Jun 7, 2012", "text": "Is there a way to expand items automatically? I'm printing out SQL queries and trying to display a number of parameters, like time it took to run, the number of returned rows, the query itself, etc. As there's no way to print text as a table, I was trying to print objects, but can't find a way to expand the records automatically.\n\nOther than that, it is really nice and easy to use, thanks for your work!", "stars": 4}, {"date": "May 12, 2012", "text": "Fantastic. Makes it very easy to see what is going on with my PHP code.", "stars": 5}, {"date": "Sep 27, 2011", "text": "Just installed and works great! Thank you very much!!!", "stars": 5}]